    <f0afa>   DW_AT_name        : (indirect string, offset: 0x93236): TimesRoman10_Character_237
    <f0afe>   DW_AT_decl_file   : 3
    <f0afe>   DW_AT_decl_line   : 1705
    <f0b00>   DW_AT_decl_column : 22
    <f0b01>   DW_AT_type        : <0xe6483>
    <f0b05>   DW_AT_location    : 9 byte block: 3 80 7 a4 0 0 0 0 0 	(DW_OP_addr: a40780)
 <1><f0b0f>: Abbrev Number: 1 (DW_TAG_variable)
    <f0b10>   DW_AT_name        : (indirect string, offset: 0x93251): TimesRoman10_Character_238
    <f0b14>   DW_AT_decl_file   : 3
    <f0b14>   DW_AT_decl_line   : 1706
    <f0b16>   DW_AT_decl_column : 22
    <f0b17>   DW_AT_type        : <0xe6483>
    <f0b1b>   DW_AT_location    : 9 byte block: 3 70 7 a4 0 0 0 0 0 	(DW_OP_addr: a40770)
 <1><f0b25>: Abbrev Number: 1 (DW_TAG_variable)
    <f0b26>   DW_AT_name        : (indirect string, offset: 0x9b97c): TimesRoman10_Character_239
    <f0b2a>   DW_AT_decl_file   : 3
    <f0b2a>   DW_AT_decl_line   : 1707
    <f0b2c>   DW_AT_decl_column : 22
    <f0b2d>   DW_AT_type        : <0xe6483>
    <f0b31>   DW_AT_location    : 9 byte block: 3 60 7 a4 0 0 0 0 0 	(DW_OP_addr: a40760)
 <1><f0b3b>: Abbrev Number: 1 (DW_TAG_variable)
    <f0b3c>   DW_AT_name        : (indirect string, offset: 0x97a25): TimesRoman10_Character_240
    <f0b40>   DW_AT_decl_file   : 3
    <f0b40>   DW_AT_decl_line   : 1708
    <f0b42>   DW_AT_decl_column : 22
    <f0b43>   DW_AT_type        : <0xe6483>

    <f3e61>   DW_AT_producer    : (indirect string, offset: 0x8e3e7): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O2
    <f3e65>   DW_AT_language    : 29	(C11)
    <f3e66>   DW_AT_name        : (indirect line string, offset: 0x1b3b): ../../src/freeglut_gamemode.c
    <f3e6a>   DW_AT_comp_dir    : (indirect line string, offset: 0x18af): /home/main/qb64/internal/c/parts/core/os/lnx
    <f3e6e>   DW_AT_low_pc      : 0x9d9c20
    <f3e76>   DW_AT_high_pc     : 0x3df
    <f3e7e>   DW_AT_stmt_list   : 0x29fce9
 <1><f3e82>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3e83>   DW_AT_name        : (indirect string, offset: 0x642d7): GLenum
    <f3e87>   DW_AT_decl_file   : 2
    <f3e88>   DW_AT_decl_line   : 116
    <f3e89>   DW_AT_decl_column : 22
    <f3e8a>   DW_AT_type        : <0xf3e8e>
 <1><f3e8e>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3e8f>   DW_AT_byte_size   : 4
    <f3e90>   DW_AT_encoding    : 7	(unsigned)
    <f3e91>   DW_AT_name        : (indirect string, offset: 0x21686): unsigned int
 <1><f3e95>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3e96>   DW_AT_name        : (indirect string, offset: 0x7ffc7): GLboolean
    <f3e9a>   DW_AT_decl_file   : 2
    <f3e9b>   DW_AT_decl_line   : 117
    <f3e9c>   DW_AT_decl_column : 23
    <f3e9d>   DW_AT_type        : <0xf3ea1>
 <1><f3ea1>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3ea2>   DW_AT_byte_size   : 1
    <f3ea3>   DW_AT_encoding    : 8	(unsigned char)
    <f3ea4>   DW_AT_name        : (indirect string, offset: 0x26886): unsigned char
 <1><f3ea8>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3ea9>   DW_AT_byte_size   : 1
    <f3eaa>   DW_AT_encoding    : 6	(signed char)
    <f3eab>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><f3eaf>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3eb0>   DW_AT_byte_size   : 2
    <f3eb1>   DW_AT_encoding    : 5	(signed)
    <f3eb2>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><f3eb6>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3eb7>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <f3ebb>   DW_AT_decl_file   : 2
    <f3ebc>   DW_AT_decl_line   : 122
    <f3ebd>   DW_AT_decl_column : 14
    <f3ebe>   DW_AT_type        : <0xf3ec2>
 <1><f3ec2>: Abbrev Number: 33 (DW_TAG_base_type)
    <f3ec3>   DW_AT_byte_size   : 4
    <f3ec4>   DW_AT_encoding    : 5	(signed)
    <f3ec5>   DW_AT_name        : int
 <1><f3ec9>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3eca>   DW_AT_byte_size   : 2
    <f3ecb>   DW_AT_encoding    : 7	(unsigned)
    <f3ecc>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><f3ed0>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3ed1>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <f3ed5>   DW_AT_decl_file   : 2
    <f3ed6>   DW_AT_decl_line   : 125
    <f3ed7>   DW_AT_decl_column : 22
    <f3ed8>   DW_AT_type        : <0xf3e8e>
 <1><f3edc>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3edd>   DW_AT_byte_size   : 4
    <f3ede>   DW_AT_encoding    : 4	(float)
    <f3edf>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><f3ee3>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3ee4>   DW_AT_byte_size   : 8
    <f3ee5>   DW_AT_encoding    : 4	(float)
    <f3ee6>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><f3eea>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3eeb>   DW_AT_byte_size   : 8
    <f3eec>   DW_AT_encoding    : 7	(unsigned)
    <f3eed>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><f3ef1>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3ef2>   DW_AT_byte_size   : 8
    <f3ef3>   DW_AT_encoding    : 5	(signed)
    <f3ef4>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><f3ef8>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3ef9>   DW_AT_name        : (indirect string, offset: 0x9c1ba): __useconds_t
    <f3efd>   DW_AT_decl_file   : 3
    <f3efe>   DW_AT_decl_line   : 161
    <f3eff>   DW_AT_decl_column : 30
    <f3f00>   DW_AT_type        : <0xf3e8e>
 <1><f3f04>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <f3f05>   DW_AT_byte_size   : 8
 <1><f3f06>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3f07>   DW_AT_byte_size   : 8
    <f3f07>   DW_AT_type        : <0xf3f0b>
 <1><f3f0b>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3f0c>   DW_AT_byte_size   : 1
    <f3f0d>   DW_AT_encoding    : 6	(signed char)
    <f3f0e>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><f3f12>: Abbrev Number: 35 (DW_TAG_const_type)
    <f3f13>   DW_AT_type        : <0xf3f0b>
 <1><f3f17>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3f18>   DW_AT_byte_size   : 8
    <f3f18>   DW_AT_type        : <0xf3f1c>
 <1><f3f1c>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <f3f1d>   DW_AT_prototyped  : 1
 <1><f3f1d>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3f1e>   DW_AT_byte_size   : 8
    <f3f1f>   DW_AT_encoding    : 5	(signed)
    <f3f20>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><f3f24>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3f25>   DW_AT_byte_size   : 8
    <f3f26>   DW_AT_encoding    : 7	(unsigned)
    <f3f27>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><f3f2b>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3f2c>   DW_AT_byte_size   : 8
    <f3f2c>   DW_AT_type        : <0xf3f30>
 <1><f3f30>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <f3f31>   DW_AT_sibling     : <0xf3f37>
 <2><f3f35>: Abbrev Number: 13 (DW_TAG_unspecified_parameters)
 <2><f3f36>: Abbrev Number: 0
 <1><f3f37>: Abbrev Number: 38 (DW_TAG_structure_type)
    <f3f38>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <f3f3c>   DW_AT_byte_size   : 24
    <f3f3d>   DW_AT_decl_file   : 4
    <f3f3e>   DW_AT_decl_line   : 0
    <f3f3f>   DW_AT_sibling     : <0xf3f6c>
 <2><f3f43>: Abbrev Number: 14 (DW_TAG_member)
    <f3f44>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <f3f48>   DW_AT_decl_file   : 4
    <f3f48>   DW_AT_decl_line   : 0
    <f3f48>   DW_AT_type        : <0xf3e8e>
    <f3f4c>   DW_AT_data_member_location: 0
 <2><f3f4d>: Abbrev Number: 14 (DW_TAG_member)
    <f3f4e>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <f3f52>   DW_AT_decl_file   : 4
    <f3f52>   DW_AT_decl_line   : 0
    <f3f52>   DW_AT_type        : <0xf3e8e>
    <f3f56>   DW_AT_data_member_location: 4
 <2><f3f57>: Abbrev Number: 14 (DW_TAG_member)
    <f3f58>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <f3f5c>   DW_AT_decl_file   : 4
    <f3f5c>   DW_AT_decl_line   : 0
    <f3f5c>   DW_AT_type        : <0xf3f04>
    <f3f60>   DW_AT_data_member_location: 8
 <2><f3f61>: Abbrev Number: 14 (DW_TAG_member)
    <f3f62>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <f3f66>   DW_AT_decl_file   : 4
    <f3f66>   DW_AT_decl_line   : 0
    <f3f66>   DW_AT_type        : <0xf3f04>
    <f3f6a>   DW_AT_data_member_location: 16
 <2><f3f6b>: Abbrev Number: 0
 <1><f3f6c>: Abbrev Number: 39 (DW_TAG_typedef)
    <f3f6d>   DW_AT_name        : XID
    <f3f71>   DW_AT_decl_file   : 5
    <f3f72>   DW_AT_decl_line   : 66
    <f3f73>   DW_AT_decl_column : 23
    <f3f74>   DW_AT_type        : <0xf3eea>
 <1><f3f78>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3f79>   DW_AT_name        : (indirect string, offset: 0x6eb27): Atom
    <f3f7d>   DW_AT_decl_file   : 5
    <f3f7e>   DW_AT_decl_line   : 74
    <f3f7f>   DW_AT_decl_column : 23
    <f3f80>   DW_AT_type        : <0xf3eea>
 <1><f3f84>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3f85>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <f3f89>   DW_AT_decl_file   : 5
    <f3f8a>   DW_AT_decl_line   : 77
    <f3f8b>   DW_AT_decl_column : 23
    <f3f8c>   DW_AT_type        : <0xf3eea>
 <1><f3f90>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3f91>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <f3f95>   DW_AT_decl_file   : 5
    <f3f96>   DW_AT_decl_line   : 96
    <f3f97>   DW_AT_decl_column : 13
    <f3f98>   DW_AT_type        : <0xf3f6c>
 <1><f3f9c>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3f9d>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <f3fa1>   DW_AT_decl_file   : 5
    <f3fa2>   DW_AT_decl_line   : 103
    <f3fa3>   DW_AT_decl_column : 13
    <f3fa4>   DW_AT_type        : <0xf3f6c>
 <1><f3fa8>: Abbrev Number: 8 (DW_TAG_base_type)
    <f3fa9>   DW_AT_byte_size   : 16
    <f3faa>   DW_AT_encoding    : 4	(float)
    <f3fab>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><f3faf>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f3fb0>   DW_AT_name        : (indirect string, offset: 0x8bb46): _XDisplay
    <f3fb4>   DW_AT_declaration : 1
 <1><f3fb4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3fb5>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <f3fb9>   DW_AT_decl_file   : 6
    <f3fba>   DW_AT_decl_line   : 487
    <f3fbc>   DW_AT_decl_column : 26
    <f3fbd>   DW_AT_type        : <0xf3faf>
 <1><f3fc1>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3fc2>   DW_AT_byte_size   : 8
    <f3fc2>   DW_AT_type        : <0xf3fb4>
 <1><f3fc6>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3fc7>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <f3fcb>   DW_AT_decl_file   : 7
    <f3fcc>   DW_AT_decl_line   : 165
    <f3fcd>   DW_AT_decl_column : 33
    <f3fce>   DW_AT_type        : <0xf3fd2>
 <1><f3fd2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3fd3>   DW_AT_byte_size   : 8
    <f3fd3>   DW_AT_type        : <0xf3fd7>
 <1><f3fd7>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f3fd8>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <f3fdc>   DW_AT_declaration : 1
 <1><f3fdc>: Abbrev Number: 6 (DW_TAG_typedef)
    <f3fdd>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <f3fe1>   DW_AT_decl_file   : 7
    <f3fe2>   DW_AT_decl_line   : 169
    <f3fe3>   DW_AT_decl_column : 34
    <f3fe4>   DW_AT_type        : <0xf3fe8>
 <1><f3fe8>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3fe9>   DW_AT_byte_size   : 8
    <f3fe9>   DW_AT_type        : <0xf3fed>
 <1><f3fed>: Abbrev Number: 19 (DW_TAG_structure_type)
    <f3fee>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <f3ff2>   DW_AT_declaration : 1
 <1><f3ff2>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3ff3>   DW_AT_byte_size   : 8
    <f3ff3>   DW_AT_type        : <0xf3fdc>
 <1><f3ff7>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3ff8>   DW_AT_byte_size   : 8
    <f3ff8>   DW_AT_type        : <0xf3ec2>
 <1><f3ffc>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f3ffd>   DW_AT_byte_size   : 8
    <f3ffd>   DW_AT_type        : <0xf3e8e>
 <1><f4001>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4002>   DW_AT_byte_size   : 8
    <f4002>   DW_AT_type        : <0xf3f12>
 <1><f4006>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4007>   DW_AT_byte_size   : 8
    <f4007>   DW_AT_type        : <0xf400b>
 <1><f400b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <f400c>   DW_AT_prototyped  : 1
    <f400c>   DW_AT_sibling     : <0xf4016>
 <2><f4010>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4011>   DW_AT_type        : <0xf3ec2>
 <2><f4015>: Abbrev Number: 0
 <1><f4016>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4017>   DW_AT_byte_size   : 8
    <f4017>   DW_AT_type        : <0xf401b>
 <1><f401b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <f401c>   DW_AT_prototyped  : 1
    <f401c>   DW_AT_sibling     : <0xf4030>
 <2><f4020>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4021>   DW_AT_type        : <0xf3ec2>
 <2><f4025>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4026>   DW_AT_type        : <0xf3ec2>
 <2><f402a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f402b>   DW_AT_type        : <0xf3ec2>
 <2><f402f>: Abbrev Number: 0
 <1><f4030>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4031>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <f4035>   DW_AT_decl_file   : 8
    <f4036>   DW_AT_decl_line   : 239
    <f4037>   DW_AT_decl_column : 17
    <f4038>   DW_AT_type        : <0xf3f17>
 <1><f403c>: Abbrev Number: 6 (DW_TAG_typedef)
    <f403d>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <f4041>   DW_AT_decl_file   : 8
    <f4042>   DW_AT_decl_line   : 247
    <f4043>   DW_AT_decl_column : 17
    <f4044>   DW_AT_type        : <0xf3f17>
 <1><f4048>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4049>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <f404d>   DW_AT_decl_file   : 8
    <f404e>   DW_AT_decl_line   : 249
    <f404f>   DW_AT_decl_column : 17
    <f4050>   DW_AT_type        : <0xf4006>
 <1><f4054>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4055>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <f4059>   DW_AT_decl_file   : 8
    <f405a>   DW_AT_decl_line   : 250
    <f405b>   DW_AT_decl_column : 17
    <f405c>   DW_AT_type        : <0xf4016>
 <1><f4060>: Abbrev Number: 6 (DW_TAG_typedef)
    <f4061>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <f4065>   DW_AT_decl_file   : 8
    <f4066>   DW_AT_decl_line   : 253
    <f4067>   DW_AT_decl_column : 17
    <f4068>   DW_AT_type        : <0xf4006>
 <1><f406c>: Abbrev Number: 5 (DW_TAG_typedef)
    <f406d>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <f4071>   DW_AT_decl_file   : 8
    <f4072>   DW_AT_decl_line   : 256
    <f4074>   DW_AT_decl_column : 17
    <f4075>   DW_AT_type        : <0xf4079>
 <1><f4079>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f407a>   DW_AT_byte_size   : 8
    <f407a>   DW_AT_type        : <0xf407e>
 <1><f407e>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <f407f>   DW_AT_prototyped  : 1
    <f407f>   DW_AT_sibling     : <0xf408e>
 <2><f4083>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4084>   DW_AT_type        : <0xf4001>
 <2><f4088>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4089>   DW_AT_type        : <0xf408e>
 <2><f408d>: Abbrev Number: 0
 <1><f408e>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f408f>   DW_AT_byte_size   : 8
    <f408f>   DW_AT_type        : <0xf3f37>
 <1><f4093>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4094>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <f4098>   DW_AT_decl_file   : 8
    <f4099>   DW_AT_decl_line   : 257
    <f409b>   DW_AT_decl_column : 17
    <f409c>   DW_AT_type        : <0xf4079>
 <1><f40a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <f40a1>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <f40a5>   DW_AT_decl_file   : 8
    <f40a6>   DW_AT_decl_line   : 261
    <f40a8>   DW_AT_decl_column : 28
    <f40a9>   DW_AT_type        : <0xf40ad>
 <1><f40ad>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f40ae>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <f40b2>   DW_AT_byte_size   : 16
    <f40b3>   DW_AT_decl_file   : 8
    <f40b3>   DW_AT_decl_line   : 262
    <f40b5>   DW_AT_decl_column : 8
    <f40b5>   DW_AT_sibling     : <0xf40d4>
 <2><f40b9>: Abbrev Number: 1 (DW_TAG_member)
    <f40ba>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <f40be>   DW_AT_decl_file   : 8
    <f40be>   DW_AT_decl_line   : 264
    <f40c0>   DW_AT_decl_column : 11
    <f40c1>   DW_AT_type        : <0xf3f04>
    <f40c5>   DW_AT_data_member_location: 0
 <2><f40c6>: Abbrev Number: 1 (DW_TAG_member)
    <f40c7>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <f40cb>   DW_AT_decl_file   : 8
    <f40cb>   DW_AT_decl_line   : 265
    <f40cd>   DW_AT_decl_column : 11
    <f40ce>   DW_AT_type        : <0xf3f04>
    <f40d2>   DW_AT_data_member_location: 8
 <2><f40d3>: Abbrev Number: 0
 <1><f40d4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f40d5>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <f40d9>   DW_AT_decl_file   : 8
    <f40da>   DW_AT_decl_line   : 269
    <f40dc>   DW_AT_decl_column : 28
    <f40dd>   DW_AT_type        : <0xf40e1>
 <1><f40e1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f40e2>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <f40e6>   DW_AT_byte_size   : 16
    <f40e7>   DW_AT_decl_file   : 8
    <f40e7>   DW_AT_decl_line   : 270
    <f40e9>   DW_AT_decl_column : 8
    <f40e9>   DW_AT_sibling     : <0xf4108>
 <2><f40ed>: Abbrev Number: 1 (DW_TAG_member)
    <f40ee>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <f40f2>   DW_AT_decl_file   : 8
    <f40f2>   DW_AT_decl_line   : 272
    <f40f4>   DW_AT_decl_column : 11
    <f40f5>   DW_AT_type        : <0xf3f04>
    <f40f9>   DW_AT_data_member_location: 0
 <2><f40fa>: Abbrev Number: 1 (DW_TAG_member)
    <f40fb>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <f40ff>   DW_AT_decl_file   : 8
    <f40ff>   DW_AT_decl_line   : 273
    <f4101>   DW_AT_decl_column : 11
    <f4102>   DW_AT_type        : <0xf3f04>
    <f4106>   DW_AT_data_member_location: 8
 <2><f4107>: Abbrev Number: 0
 <1><f4108>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4109>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <f410d>   DW_AT_decl_file   : 8
    <f410e>   DW_AT_decl_line   : 277
    <f4110>   DW_AT_decl_column : 29
    <f4111>   DW_AT_type        : <0xf4115>
 <1><f4115>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4116>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <f411a>   DW_AT_byte_size   : 12
    <f411b>   DW_AT_decl_file   : 8
    <f411b>   DW_AT_decl_line   : 278
    <f411d>   DW_AT_decl_column : 8
    <f411d>   DW_AT_sibling     : <0xf4145>
 <2><f4121>: Abbrev Number: 11 (DW_TAG_member)
    <f4122>   DW_AT_name        : X
    <f4124>   DW_AT_decl_file   : 8
    <f4124>   DW_AT_decl_line   : 280
    <f4126>   DW_AT_decl_column : 21
    <f4127>   DW_AT_type        : <0xf3eb6>
    <f412b>   DW_AT_data_member_location: 0
 <2><f412c>: Abbrev Number: 11 (DW_TAG_member)
    <f412d>   DW_AT_name        : Y
    <f412f>   DW_AT_decl_file   : 8
    <f412f>   DW_AT_decl_line   : 280
    <f4131>   DW_AT_decl_column : 24
    <f4132>   DW_AT_type        : <0xf3eb6>
    <f4136>   DW_AT_data_member_location: 4
 <2><f4137>: Abbrev Number: 11 (DW_TAG_member)
    <f4138>   DW_AT_name        : Use
    <f413c>   DW_AT_decl_file   : 8
    <f413c>   DW_AT_decl_line   : 281
    <f413e>   DW_AT_decl_column : 21
    <f413f>   DW_AT_type        : <0xf3e95>
    <f4143>   DW_AT_data_member_location: 8
 <2><f4144>: Abbrev Number: 0
 <1><f4145>: Abbrev Number: 40 (DW_TAG_enumeration_type)
    <f4146>   DW_AT_encoding    : 7	(unsigned)
    <f4147>   DW_AT_byte_size   : 4
    <f4148>   DW_AT_type        : <0xf3e8e>
    <f414c>   DW_AT_decl_file   : 8
    <f414d>   DW_AT_decl_line   : 289
    <f414f>   DW_AT_decl_column : 1
    <f4150>   DW_AT_sibling     : <0xf4167>
 <2><f4154>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f4155>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <f4159>   DW_AT_const_value : 0
 <2><f415a>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f415b>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <f415f>   DW_AT_const_value : 1
 <2><f4160>: Abbrev Number: 21 (DW_TAG_enumerator)
    <f4161>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <f4165>   DW_AT_const_value : 2
 <2><f4166>: Abbrev Number: 0
 <1><f4167>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4168>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <f416c>   DW_AT_decl_file   : 8
    <f416d>   DW_AT_decl_line   : 293
    <f416f>   DW_AT_decl_column : 3
    <f4170>   DW_AT_type        : <0xf4145>
 <1><f4174>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4175>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <f4179>   DW_AT_decl_file   : 8
    <f417a>   DW_AT_decl_line   : 296
    <f417c>   DW_AT_decl_column : 29
    <f417d>   DW_AT_type        : <0xf4181>
 <1><f4181>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4182>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <f4186>   DW_AT_byte_size   : 232
    <f4187>   DW_AT_decl_file   : 8
    <f4187>   DW_AT_decl_line   : 297
    <f4189>   DW_AT_decl_column : 8
    <f4189>   DW_AT_sibling     : <0xf4389>
 <2><f418d>: Abbrev Number: 1 (DW_TAG_member)
    <f418e>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <f4192>   DW_AT_decl_file   : 8
    <f4192>   DW_AT_decl_line   : 299
    <f4194>   DW_AT_decl_column : 22
    <f4195>   DW_AT_type        : <0xf4108>
    <f4199>   DW_AT_data_member_location: 0
 <2><f419a>: Abbrev Number: 1 (DW_TAG_member)
    <f419b>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <f419f>   DW_AT_decl_file   : 8
    <f419f>   DW_AT_decl_line   : 300
    <f41a1>   DW_AT_decl_column : 22
    <f41a2>   DW_AT_type        : <0xf4108>
    <f41a6>   DW_AT_data_member_location: 12
 <2><f41a7>: Abbrev Number: 1 (DW_TAG_member)
    <f41a8>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <f41ac>   DW_AT_decl_file   : 8
    <f41ac>   DW_AT_decl_line   : 301
    <f41ae>   DW_AT_decl_column : 22
    <f41af>   DW_AT_type        : <0xf3e8e>
    <f41b3>   DW_AT_data_member_location: 24
 <2><f41b4>: Abbrev Number: 1 (DW_TAG_member)
    <f41b5>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <f41b9>   DW_AT_decl_file   : 8
    <f41b9>   DW_AT_decl_line   : 303
    <f41bb>   DW_AT_decl_column : 22
    <f41bc>   DW_AT_type        : <0xf3e95>
    <f41c0>   DW_AT_data_member_location: 28
 <2><f41c1>: Abbrev Number: 1 (DW_TAG_member)
    <f41c2>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <f41c6>   DW_AT_decl_file   : 8
    <f41c6>   DW_AT_decl_line   : 305
    <f41c8>   DW_AT_decl_column : 22
    <f41c9>   DW_AT_type        : <0xf3ec2>
    <f41cd>   DW_AT_data_member_location: 32
 <2><f41ce>: Abbrev Number: 1 (DW_TAG_member)
    <f41cf>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <f41d3>   DW_AT_decl_file   : 8
    <f41d3>   DW_AT_decl_line   : 307
    <f41d5>   DW_AT_decl_column : 22
    <f41d6>   DW_AT_type        : <0xf3e95>
    <f41da>   DW_AT_data_member_location: 36
 <2><f41db>: Abbrev Number: 1 (DW_TAG_member)
    <f41dc>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <f41e0>   DW_AT_decl_file   : 8
    <f41e0>   DW_AT_decl_line   : 308
    <f41e2>   DW_AT_decl_column : 22
    <f41e3>   DW_AT_type        : <0xf3e95>
    <f41e7>   DW_AT_data_member_location: 37
 <2><f41e8>: Abbrev Number: 1 (DW_TAG_member)
    <f41e9>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <f41ed>   DW_AT_decl_file   : 8
    <f41ed>   DW_AT_decl_line   : 310
    <f41ef>   DW_AT_decl_column : 22
    <f41f0>   DW_AT_type        : <0xf3e95>
    <f41f4>   DW_AT_data_member_location: 38
 <2><f41f5>: Abbrev Number: 1 (DW_TAG_member)
    <f41f6>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <f41fa>   DW_AT_decl_file   : 8
    <f41fa>   DW_AT_decl_line   : 311
    <f41fc>   DW_AT_decl_column : 22
    <f41fd>   DW_AT_type        : <0xf3e95>
    <f4201>   DW_AT_data_member_location: 39
 <2><f4202>: Abbrev Number: 1 (DW_TAG_member)
    <f4203>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <f4207>   DW_AT_decl_file   : 8
    <f4207>   DW_AT_decl_line   : 313
    <f4209>   DW_AT_decl_column : 22
    <f420a>   DW_AT_type        : <0xf3ec2>
    <f420e>   DW_AT_data_member_location: 40
 <2><f420f>: Abbrev Number: 1 (DW_TAG_member)
    <f4210>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <f4214>   DW_AT_decl_file   : 8
    <f4214>   DW_AT_decl_line   : 314
    <f4216>   DW_AT_decl_column : 22
    <f4217>   DW_AT_type        : <0xf3ec2>
    <f421b>   DW_AT_data_member_location: 44
 <2><f421c>: Abbrev Number: 1 (DW_TAG_member)
    <f421d>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <f4221>   DW_AT_decl_file   : 8
    <f4221>   DW_AT_decl_line   : 316
    <f4223>   DW_AT_decl_column : 22
    <f4224>   DW_AT_type        : <0xf3ed0>
    <f4228>   DW_AT_data_member_location: 48
 <2><f4229>: Abbrev Number: 1 (DW_TAG_member)
    <f422a>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <f422e>   DW_AT_decl_file   : 8
    <f422e>   DW_AT_decl_line   : 317
    <f4230>   DW_AT_decl_column : 22
    <f4231>   DW_AT_type        : <0xf3ed0>
    <f4235>   DW_AT_data_member_location: 52
 <2><f4236>: Abbrev Number: 1 (DW_TAG_member)
    <f4237>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <f423b>   DW_AT_decl_file   : 8
    <f423b>   DW_AT_decl_line   : 318
    <f423d>   DW_AT_decl_column : 22
    <f423e>   DW_AT_type        : <0xf3ed0>
    <f4242>   DW_AT_data_member_location: 56
 <2><f4243>: Abbrev Number: 1 (DW_TAG_member)
    <f4244>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <f4248>   DW_AT_decl_file   : 8
    <f4248>   DW_AT_decl_line   : 320
    <f424a>   DW_AT_decl_column : 22
    <f424b>   DW_AT_type        : <0xf3eea>
    <f424f>   DW_AT_data_member_location: 64
 <2><f4250>: Abbrev Number: 1 (DW_TAG_member)
    <f4251>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <f4255>   DW_AT_decl_file   : 8
    <f4255>   DW_AT_decl_line   : 321
    <f4257>   DW_AT_decl_column : 22
    <f4258>   DW_AT_type        : <0xf40a0>
    <f425c>   DW_AT_data_member_location: 72
 <2><f425d>: Abbrev Number: 1 (DW_TAG_member)
    <f425e>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <f4262>   DW_AT_decl_file   : 8
    <f4262>   DW_AT_decl_line   : 322
    <f4264>   DW_AT_decl_column : 22
    <f4265>   DW_AT_type        : <0xf40a0>
    <f4269>   DW_AT_data_member_location: 88
 <2><f426a>: Abbrev Number: 1 (DW_TAG_member)
    <f426b>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <f426f>   DW_AT_decl_file   : 8
    <f426f>   DW_AT_decl_line   : 324
    <f4271>   DW_AT_decl_column : 22
    <f4272>   DW_AT_type        : <0xf403c>
    <f4276>   DW_AT_data_member_location: 104
 <2><f4277>: Abbrev Number: 1 (DW_TAG_member)
    <f4278>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <f427c>   DW_AT_decl_file   : 8
    <f427c>   DW_AT_decl_line   : 326
    <f427e>   DW_AT_decl_column : 22
    <f427f>   DW_AT_type        : <0xf3ec2>
    <f4283>   DW_AT_data_member_location: 112
 <2><f4284>: Abbrev Number: 1 (DW_TAG_member)
    <f4285>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <f4289>   DW_AT_decl_file   : 8
    <f4289>   DW_AT_decl_line   : 327
    <f428b>   DW_AT_decl_column : 22
    <f428c>   DW_AT_type        : <0xf4048>
    <f4290>   DW_AT_data_member_location: 120
 <2><f4291>: Abbrev Number: 1 (DW_TAG_member)
    <f4292>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <f4296>   DW_AT_decl_file   : 8
    <f4296>   DW_AT_decl_line   : 328
    <f4298>   DW_AT_decl_column : 22
    <f4299>   DW_AT_type        : <0xf4054>
    <f429d>   DW_AT_data_member_location: 128
 <2><f429e>: Abbrev Number: 1 (DW_TAG_member)
    <f429f>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <f42a3>   DW_AT_decl_file   : 8
    <f42a3>   DW_AT_decl_line   : 330
    <f42a5>   DW_AT_decl_column : 22
    <f42a6>   DW_AT_type        : <0xf4108>
    <f42aa>   DW_AT_data_member_location: 136
 <2><f42ab>: Abbrev Number: 1 (DW_TAG_member)
    <f42ac>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <f42b0>   DW_AT_decl_file   : 8
    <f42b0>   DW_AT_decl_line   : 331
    <f42b2>   DW_AT_decl_column : 22
    <f42b3>   DW_AT_type        : <0xf3ec2>
    <f42b7>   DW_AT_data_member_location: 148
 <2><f42b8>: Abbrev Number: 1 (DW_TAG_member)
    <f42b9>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <f42bd>   DW_AT_decl_file   : 8
    <f42bd>   DW_AT_decl_line   : 332
    <f42bf>   DW_AT_decl_column : 22
    <f42c0>   DW_AT_type        : <0xf3ec2>
    <f42c4>   DW_AT_data_member_location: 152
 <2><f42c5>: Abbrev Number: 1 (DW_TAG_member)
    <f42c6>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <f42ca>   DW_AT_decl_file   : 8
    <f42ca>   DW_AT_decl_line   : 334
    <f42cc>   DW_AT_decl_column : 22
    <f42cd>   DW_AT_type        : <0xf3ec2>
    <f42d1>   DW_AT_data_member_location: 156
 <2><f42d2>: Abbrev Number: 1 (DW_TAG_member)
    <f42d3>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <f42d7>   DW_AT_decl_file   : 8
    <f42d7>   DW_AT_decl_line   : 336
    <f42d9>   DW_AT_decl_column : 22
    <f42da>   DW_AT_type        : <0xf4167>
    <f42de>   DW_AT_data_member_location: 160
 <2><f42df>: Abbrev Number: 1 (DW_TAG_member)
    <f42e0>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <f42e4>   DW_AT_decl_file   : 8
    <f42e4>   DW_AT_decl_line   : 337
    <f42e6>   DW_AT_decl_column : 22
    <f42e7>   DW_AT_type        : <0xf3f06>
    <f42eb>   DW_AT_data_member_location: 168
 <2><f42ec>: Abbrev Number: 1 (DW_TAG_member)
    <f42ed>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <f42f1>   DW_AT_decl_file   : 8
    <f42f1>   DW_AT_decl_line   : 338
    <f42f3>   DW_AT_decl_column : 22
    <f42f4>   DW_AT_type        : <0xf3e95>
    <f42f8>   DW_AT_data_member_location: 176
 <2><f42f9>: Abbrev Number: 1 (DW_TAG_member)
    <f42fa>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <f42fe>   DW_AT_decl_file   : 8
    <f42fe>   DW_AT_decl_line   : 339
    <f4300>   DW_AT_decl_column : 22
    <f4301>   DW_AT_type        : <0xf3ec2>
    <f4305>   DW_AT_data_member_location: 180
 <2><f4306>: Abbrev Number: 1 (DW_TAG_member)
    <f4307>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <f430b>   DW_AT_decl_file   : 8
    <f430b>   DW_AT_decl_line   : 340
    <f430d>   DW_AT_decl_column : 22
    <f430e>   DW_AT_type        : <0xf3e95>
    <f4312>   DW_AT_data_member_location: 184
 <2><f4313>: Abbrev Number: 1 (DW_TAG_member)
    <f4314>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <f4318>   DW_AT_decl_file   : 8
    <f4318>   DW_AT_decl_line   : 342
    <f431a>   DW_AT_decl_column : 19
    <f431b>   DW_AT_type        : <0xf3ec2>
    <f431f>   DW_AT_data_member_location: 188
 <2><f4320>: Abbrev Number: 1 (DW_TAG_member)
    <f4321>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <f4325>   DW_AT_decl_file   : 8
    <f4325>   DW_AT_decl_line   : 344
    <f4327>   DW_AT_decl_column : 22
    <f4328>   DW_AT_type        : <0xf3ec2>
    <f432c>   DW_AT_data_member_location: 192
 <2><f432d>: Abbrev Number: 1 (DW_TAG_member)
    <f432e>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <f4332>   DW_AT_decl_file   : 8
    <f4332>   DW_AT_decl_line   : 345
    <f4334>   DW_AT_decl_column : 22
    <f4335>   DW_AT_type        : <0xf3ec2>
    <f4339>   DW_AT_data_member_location: 196
 <2><f433a>: Abbrev Number: 1 (DW_TAG_member)
    <f433b>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <f433f>   DW_AT_decl_file   : 8
    <f433f>   DW_AT_decl_line   : 347
    <f4341>   DW_AT_decl_column : 22
    <f4342>   DW_AT_type        : <0xf3ec2>
    <f4346>   DW_AT_data_member_location: 200
 <2><f4347>: Abbrev Number: 1 (DW_TAG_member)
    <f4348>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <f434c>   DW_AT_decl_file   : 8
    <f434c>   DW_AT_decl_line   : 348
    <f434e>   DW_AT_decl_column : 22
    <f434f>   DW_AT_type        : <0xf3ec2>
    <f4353>   DW_AT_data_member_location: 204
 <2><f4354>: Abbrev Number: 1 (DW_TAG_member)
    <f4355>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <f4359>   DW_AT_decl_file   : 8
    <f4359>   DW_AT_decl_line   : 349
    <f435b>   DW_AT_decl_column : 22
    <f435c>   DW_AT_type        : <0xf3ec2>
    <f4360>   DW_AT_data_member_location: 208
 <2><f4361>: Abbrev Number: 1 (DW_TAG_member)
    <f4362>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <f4366>   DW_AT_decl_file   : 8
    <f4366>   DW_AT_decl_line   : 350
    <f4368>   DW_AT_decl_column : 22
    <f4369>   DW_AT_type        : <0xf3ec2>
    <f436d>   DW_AT_data_member_location: 212
 <2><f436e>: Abbrev Number: 1 (DW_TAG_member)
    <f436f>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <f4373>   DW_AT_decl_file   : 8
    <f4373>   DW_AT_decl_line   : 351
    <f4375>   DW_AT_decl_column : 22
    <f4376>   DW_AT_type        : <0xf406c>
    <f437a>   DW_AT_data_member_location: 216
 <2><f437b>: Abbrev Number: 1 (DW_TAG_member)
    <f437c>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <f4380>   DW_AT_decl_file   : 8
    <f4380>   DW_AT_decl_line   : 352
    <f4382>   DW_AT_decl_column : 22
    <f4383>   DW_AT_type        : <0xf4093>
    <f4387>   DW_AT_data_member_location: 224
 <2><f4388>: Abbrev Number: 0
 <1><f4389>: Abbrev Number: 5 (DW_TAG_typedef)
    <f438a>   DW_AT_name        : (indirect string, offset: 0x8e79c): SFG_Display
    <f438e>   DW_AT_decl_file   : 8
    <f438f>   DW_AT_decl_line   : 356
    <f4391>   DW_AT_decl_column : 31
    <f4392>   DW_AT_type        : <0xf4396>
 <1><f4396>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4397>   DW_AT_name        : (indirect string, offset: 0x8e799): tagSFG_Display
    <f439b>   DW_AT_byte_size   : 80
    <f439c>   DW_AT_decl_file   : 8
    <f439c>   DW_AT_decl_line   : 357
    <f439e>   DW_AT_decl_column : 8
    <f439e>   DW_AT_sibling     : <0xf444c>
 <2><f43a2>: Abbrev Number: 1 (DW_TAG_member)
    <f43a3>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <f43a7>   DW_AT_decl_file   : 8
    <f43a7>   DW_AT_decl_line   : 360
    <f43a9>   DW_AT_decl_column : 21
    <f43aa>   DW_AT_type        : <0xf3fc1>
    <f43ae>   DW_AT_data_member_location: 0
 <2><f43af>: Abbrev Number: 1 (DW_TAG_member)
    <f43b0>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <f43b4>   DW_AT_decl_file   : 8
    <f43b4>   DW_AT_decl_line   : 361
    <f43b6>   DW_AT_decl_column : 21
    <f43b7>   DW_AT_type        : <0xf3ec2>
    <f43bb>   DW_AT_data_member_location: 8
 <2><f43bc>: Abbrev Number: 1 (DW_TAG_member)
    <f43bd>   DW_AT_name        : (indirect string, offset: 0x8e7ee): RootWindow
    <f43c1>   DW_AT_decl_file   : 8
    <f43c1>   DW_AT_decl_line   : 362
    <f43c3>   DW_AT_decl_column : 21
    <f43c4>   DW_AT_type        : <0xf3f90>
    <f43c8>   DW_AT_data_member_location: 16
 <2><f43c9>: Abbrev Number: 1 (DW_TAG_member)
    <f43ca>   DW_AT_name        : (indirect string, offset: 0x8e855): Connection
    <f43ce>   DW_AT_decl_file   : 8
    <f43ce>   DW_AT_decl_line   : 363
    <f43d0>   DW_AT_decl_column : 21
    <f43d1>   DW_AT_type        : <0xf3ec2>
    <f43d5>   DW_AT_data_member_location: 24
 <2><f43d6>: Abbrev Number: 1 (DW_TAG_member)
    <f43d7>   DW_AT_name        : (indirect string, offset: 0x8e8cc): DeleteWindow
    <f43db>   DW_AT_decl_file   : 8
    <f43db>   DW_AT_decl_line   : 364
    <f43dd>   DW_AT_decl_column : 21
    <f43de>   DW_AT_type        : <0xf3f78>
    <f43e2>   DW_AT_data_member_location: 32
 <2><f43e3>: Abbrev Number: 1 (DW_TAG_member)
    <f43e4>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <f43e8>   DW_AT_decl_file   : 8
    <f43e8>   DW_AT_decl_line   : 365
    <f43ea>   DW_AT_decl_column : 21
    <f43eb>   DW_AT_type        : <0xf3f78>
    <f43ef>   DW_AT_data_member_location: 40
 <2><f43f0>: Abbrev Number: 1 (DW_TAG_member)
    <f43f1>   DW_AT_name        : (indirect string, offset: 0x8e8e6): StateFullScreen
    <f43f5>   DW_AT_decl_file   : 8
    <f43f5>   DW_AT_decl_line   : 366
    <f43f7>   DW_AT_decl_column : 21
    <f43f8>   DW_AT_type        : <0xf3f78>
    <f43fc>   DW_AT_data_member_location: 48
 <2><f43fd>: Abbrev Number: 1 (DW_TAG_member)
    <f43fe>   DW_AT_name        : (indirect string, offset: 0x8e7de): DisplayPointerX
    <f4402>   DW_AT_decl_file   : 8
    <f4402>   DW_AT_decl_line   : 386
    <f4404>   DW_AT_decl_column : 21
    <f4405>   DW_AT_type        : <0xf3ec2>
    <f4409>   DW_AT_data_member_location: 56
 <2><f440a>: Abbrev Number: 1 (DW_TAG_member)
    <f440b>   DW_AT_name        : (indirect string, offset: 0x8e938): DisplayPointerY
    <f440f>   DW_AT_decl_file   : 8
    <f440f>   DW_AT_decl_line   : 387
    <f4411>   DW_AT_decl_column : 21
    <f4412>   DW_AT_type        : <0xf3ec2>
    <f4416>   DW_AT_data_member_location: 60
 <2><f4417>: Abbrev Number: 1 (DW_TAG_member)
    <f4418>   DW_AT_name        : (indirect string, offset: 0x8e849): ScreenWidth
    <f441c>   DW_AT_decl_file   : 8
    <f441c>   DW_AT_decl_line   : 396
    <f441e>   DW_AT_decl_column : 21
    <f441f>   DW_AT_type        : <0xf3ec2>
    <f4423>   DW_AT_data_member_location: 64
 <2><f4424>: Abbrev Number: 1 (DW_TAG_member)
    <f4425>   DW_AT_name        : (indirect string, offset: 0x8e7b7): ScreenHeight
    <f4429>   DW_AT_decl_file   : 8
    <f4429>   DW_AT_decl_line   : 397
    <f442b>   DW_AT_decl_column : 21
    <f442c>   DW_AT_type        : <0xf3ec2>
    <f4430>   DW_AT_data_member_location: 68
 <2><f4431>: Abbrev Number: 1 (DW_TAG_member)
    <f4432>   DW_AT_name        : (indirect string, offset: 0x8e8be): ScreenWidthMM
    <f4436>   DW_AT_decl_file   : 8
    <f4436>   DW_AT_decl_line   : 398
    <f4438>   DW_AT_decl_column : 21
    <f4439>   DW_AT_type        : <0xf3ec2>
    <f443d>   DW_AT_data_member_location: 72
 <2><f443e>: Abbrev Number: 1 (DW_TAG_member)
    <f443f>   DW_AT_name        : (indirect string, offset: 0x8e7f9): ScreenHeightMM
    <f4443>   DW_AT_decl_file   : 8
    <f4443>   DW_AT_decl_line   : 399
    <f4445>   DW_AT_decl_column : 21
    <f4446>   DW_AT_type        : <0xf3ec2>
    <f444a>   DW_AT_data_member_location: 76
 <2><f444b>: Abbrev Number: 0
 <1><f444c>: Abbrev Number: 5 (DW_TAG_typedef)
    <f444d>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <f4451>   DW_AT_decl_file   : 8
    <f4452>   DW_AT_decl_line   : 419
    <f4454>   DW_AT_decl_column : 20
    <f4455>   DW_AT_type        : <0xf3f90>
 <1><f4459>: Abbrev Number: 5 (DW_TAG_typedef)
    <f445a>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <f445e>   DW_AT_decl_file   : 8
    <f445f>   DW_AT_decl_line   : 420
    <f4461>   DW_AT_decl_column : 20
    <f4462>   DW_AT_type        : <0xf3fc6>
 <1><f4466>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4467>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <f446b>   DW_AT_decl_file   : 8
    <f446c>   DW_AT_decl_line   : 433
    <f446e>   DW_AT_decl_column : 31
    <f446f>   DW_AT_type        : <0xf4473>
 <1><f4473>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4474>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <f4478>   DW_AT_byte_size   : 32
    <f4479>   DW_AT_decl_file   : 8
    <f4479>   DW_AT_decl_line   : 434
    <f447b>   DW_AT_decl_column : 8
    <f447b>   DW_AT_sibling     : <0xf44b4>
 <2><f447f>: Abbrev Number: 1 (DW_TAG_member)
    <f4480>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <f4484>   DW_AT_decl_file   : 8
    <f4484>   DW_AT_decl_line   : 436
    <f4486>   DW_AT_decl_column : 27
    <f4487>   DW_AT_type        : <0xf444c>
    <f448b>   DW_AT_data_member_location: 0
 <2><f448c>: Abbrev Number: 1 (DW_TAG_member)
    <f448d>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <f4491>   DW_AT_decl_file   : 8
    <f4491>   DW_AT_decl_line   : 437
    <f4493>   DW_AT_decl_column : 27
    <f4494>   DW_AT_type        : <0xf4459>
    <f4498>   DW_AT_data_member_location: 8
 <2><f4499>: Abbrev Number: 1 (DW_TAG_member)
    <f449a>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <f449e>   DW_AT_decl_file   : 8
    <f449e>   DW_AT_decl_line   : 440
    <f44a0>   DW_AT_decl_column : 21
    <f44a1>   DW_AT_type        : <0xf3ff2>
    <f44a5>   DW_AT_data_member_location: 16
 <2><f44a6>: Abbrev Number: 1 (DW_TAG_member)
    <f44a7>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <f44ab>   DW_AT_decl_file   : 8
    <f44ab>   DW_AT_decl_line   : 445
    <f44ad>   DW_AT_decl_column : 21
    <f44ae>   DW_AT_type        : <0xf3ec2>
    <f44b2>   DW_AT_data_member_location: 24
 <2><f44b3>: Abbrev Number: 0
 <1><f44b4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f44b5>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <f44b9>   DW_AT_decl_file   : 8
    <f44ba>   DW_AT_decl_line   : 449
    <f44bc>   DW_AT_decl_column : 35
    <f44bd>   DW_AT_type        : <0xf44c1>
 <1><f44c1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f44c2>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <f44c6>   DW_AT_byte_size   : 56
    <f44c7>   DW_AT_decl_file   : 8
    <f44c7>   DW_AT_decl_line   : 450
    <f44c9>   DW_AT_decl_column : 8
    <f44c9>   DW_AT_sibling     : <0xf4591>
 <2><f44cd>: Abbrev Number: 1 (DW_TAG_member)
    <f44ce>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <f44d2>   DW_AT_decl_file   : 8
    <f44d2>   DW_AT_decl_line   : 453
    <f44d4>   DW_AT_decl_column : 21
    <f44d5>   DW_AT_type        : <0xf3ec2>
    <f44d9>   DW_AT_data_member_location: 0
 <2><f44da>: Abbrev Number: 1 (DW_TAG_member)
    <f44db>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <f44df>   DW_AT_decl_file   : 8
    <f44df>   DW_AT_decl_line   : 454
    <f44e1>   DW_AT_decl_column : 21
    <f44e2>   DW_AT_type        : <0xf3ec2>
    <f44e6>   DW_AT_data_member_location: 4
 <2><f44e7>: Abbrev Number: 1 (DW_TAG_member)
    <f44e8>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <f44ec>   DW_AT_decl_file   : 8
    <f44ec>   DW_AT_decl_line   : 456
    <f44ee>   DW_AT_decl_column : 21
    <f44ef>   DW_AT_type        : <0xf3ec2>
    <f44f3>   DW_AT_data_member_location: 8
 <2><f44f4>: Abbrev Number: 1 (DW_TAG_member)
    <f44f5>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <f44f9>   DW_AT_decl_file   : 8
    <f44f9>   DW_AT_decl_line   : 457
    <f44fb>   DW_AT_decl_column : 21
    <f44fc>   DW_AT_type        : <0xf3ec2>
    <f4500>   DW_AT_data_member_location: 12
 <2><f4501>: Abbrev Number: 1 (DW_TAG_member)
    <f4502>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <f4506>   DW_AT_decl_file   : 8
    <f4506>   DW_AT_decl_line   : 463
    <f4508>   DW_AT_decl_column : 21
    <f4509>   DW_AT_type        : <0xf3e95>
    <f450d>   DW_AT_data_member_location: 16
 <2><f450e>: Abbrev Number: 1 (DW_TAG_member)
    <f450f>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <f4513>   DW_AT_decl_file   : 8
    <f4513>   DW_AT_decl_line   : 464
    <f4515>   DW_AT_decl_column : 21
    <f4516>   DW_AT_type        : <0xf3e95>
    <f451a>   DW_AT_data_member_location: 17
 <2><f451b>: Abbrev Number: 1 (DW_TAG_member)
    <f451c>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <f4520>   DW_AT_decl_file   : 8
    <f4520>   DW_AT_decl_line   : 466
    <f4522>   DW_AT_decl_column : 21
    <f4523>   DW_AT_type        : <0xf3ec2>
    <f4527>   DW_AT_data_member_location: 20
 <2><f4528>: Abbrev Number: 1 (DW_TAG_member)
    <f4529>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <f452d>   DW_AT_decl_file   : 8
    <f452d>   DW_AT_decl_line   : 468
    <f452f>   DW_AT_decl_column : 21
    <f4530>   DW_AT_type        : <0xf3ef1>
    <f4534>   DW_AT_data_member_location: 24
 <2><f4535>: Abbrev Number: 1 (DW_TAG_member)
    <f4536>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <f453a>   DW_AT_decl_file   : 8
    <f453a>   DW_AT_decl_line   : 469
    <f453c>   DW_AT_decl_column : 21
    <f453d>   DW_AT_type        : <0xf3ef1>
    <f4541>   DW_AT_data_member_location: 32
 <2><f4542>: Abbrev Number: 1 (DW_TAG_member)
    <f4543>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <f4547>   DW_AT_decl_file   : 8
    <f4547>   DW_AT_decl_line   : 471
    <f4549>   DW_AT_decl_column : 21
    <f454a>   DW_AT_type        : <0xf3ec2>
    <f454e>   DW_AT_data_member_location: 40
 <2><f454f>: Abbrev Number: 1 (DW_TAG_member)
    <f4550>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <f4554>   DW_AT_decl_file   : 8
    <f4554>   DW_AT_decl_line   : 471
    <f4556>   DW_AT_decl_column : 29
    <f4557>   DW_AT_type        : <0xf3ec2>
    <f455b>   DW_AT_data_member_location: 44
 <2><f455c>: Abbrev Number: 1 (DW_TAG_member)
    <f455d>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <f4561>   DW_AT_decl_file   : 8
    <f4561>   DW_AT_decl_line   : 473
    <f4563>   DW_AT_decl_column : 21
    <f4564>   DW_AT_type        : <0xf3e95>
    <f4568>   DW_AT_data_member_location: 48
 <2><f4569>: Abbrev Number: 1 (DW_TAG_member)
    <f456a>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <f456e>   DW_AT_decl_file   : 8
    <f456e>   DW_AT_decl_line   : 474
    <f4570>   DW_AT_decl_column : 21
    <f4571>   DW_AT_type        : <0xf3e95>
    <f4575>   DW_AT_data_member_location: 49
 <2><f4576>: Abbrev Number: 1 (DW_TAG_member)
    <f4577>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <f457b>   DW_AT_decl_file   : 8
    <f457b>   DW_AT_decl_line   : 476
    <f457d>   DW_AT_decl_column : 21
    <f457e>   DW_AT_type        : <0xf3e95>
    <f4582>   DW_AT_data_member_location: 50
 <2><f4583>: Abbrev Number: 1 (DW_TAG_member)
    <f4584>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <f4588>   DW_AT_decl_file   : 8
    <f4588>   DW_AT_decl_line   : 478
    <f458a>   DW_AT_decl_column : 21
    <f458b>   DW_AT_type        : <0xf3e95>
    <f458f>   DW_AT_data_member_location: 51
 <2><f4590>: Abbrev Number: 0
 <1><f4591>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4592>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <f4596>   DW_AT_decl_file   : 8
    <f4597>   DW_AT_decl_line   : 487
    <f4599>   DW_AT_decl_column : 16
    <f459a>   DW_AT_type        : <0xf3f2b>
 <1><f459e>: Abbrev Number: 5 (DW_TAG_typedef)
    <f459f>   DW_AT_name        : (indirect string, offset: 0x8e56b): SFG_MenuContext
    <f45a3>   DW_AT_decl_file   : 8
    <f45a4>   DW_AT_decl_line   : 627
    <f45a6>   DW_AT_decl_column : 35
    <f45a7>   DW_AT_type        : <0xf45ab>
 <1><f45ab>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f45ac>   DW_AT_name        : (indirect string, offset: 0x8e568): tagSFG_MenuContext
    <f45b0>   DW_AT_byte_size   : 8
    <f45b1>   DW_AT_decl_file   : 8
    <f45b1>   DW_AT_decl_line   : 628
    <f45b3>   DW_AT_decl_column : 8
    <f45b3>   DW_AT_sibling     : <0xf45c5>
 <2><f45b7>: Abbrev Number: 1 (DW_TAG_member)
    <f45b8>   DW_AT_name        : (indirect string, offset: 0x8e24f): MContext
    <f45bc>   DW_AT_decl_file   : 8
    <f45bc>   DW_AT_decl_line   : 630
    <f45be>   DW_AT_decl_column : 27
    <f45bf>   DW_AT_type        : <0xf4459>
    <f45c3>   DW_AT_data_member_location: 0
 <2><f45c4>: Abbrev Number: 0
 <1><f45c5>: Abbrev Number: 5 (DW_TAG_typedef)
    <f45c6>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <f45ca>   DW_AT_decl_file   : 8
    <f45cb>   DW_AT_decl_line   : 634
    <f45cd>   DW_AT_decl_column : 30
    <f45ce>   DW_AT_type        : <0xf45d2>
 <1><f45d2>: Abbrev Number: 41 (DW_TAG_structure_type)
    <f45d3>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <f45d7>   DW_AT_byte_size   : 408
    <f45d9>   DW_AT_decl_file   : 8
    <f45da>   DW_AT_decl_line   : 673
    <f45dc>   DW_AT_decl_column : 8
    <f45dd>   DW_AT_sibling     : <0xf4676>
 <2><f45e1>: Abbrev Number: 1 (DW_TAG_member)
    <f45e2>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <f45e6>   DW_AT_decl_file   : 8
    <f45e6>   DW_AT_decl_line   : 675
    <f45e8>   DW_AT_decl_column : 25
    <f45e9>   DW_AT_type        : <0xf40d4>
    <f45ed>   DW_AT_data_member_location: 0
 <2><f45ee>: Abbrev Number: 11 (DW_TAG_member)
    <f45ef>   DW_AT_name        : ID
    <f45f2>   DW_AT_decl_file   : 8
    <f45f2>   DW_AT_decl_line   : 676
    <f45f4>   DW_AT_decl_column : 25
    <f45f5>   DW_AT_type        : <0xf3ec2>
    <f45f9>   DW_AT_data_member_location: 16
 <2><f45fa>: Abbrev Number: 1 (DW_TAG_member)
    <f45fb>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <f45ff>   DW_AT_decl_file   : 8
    <f45ff>   DW_AT_decl_line   : 678
    <f4601>   DW_AT_decl_column : 25
    <f4602>   DW_AT_type        : <0xf4466>
    <f4606>   DW_AT_data_member_location: 24
 <2><f4607>: Abbrev Number: 1 (DW_TAG_member)
    <f4608>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <f460c>   DW_AT_decl_file   : 8
    <f460c>   DW_AT_decl_line   : 679
    <f460e>   DW_AT_decl_column : 25
    <f460f>   DW_AT_type        : <0xf44b4>
    <f4613>   DW_AT_data_member_location: 56
 <2><f4614>: Abbrev Number: 1 (DW_TAG_member)
    <f4615>   DW_AT_name        : (indirect string, offset: 0x900ce): CallBacks
    <f4619>   DW_AT_decl_file   : 8
    <f4619>   DW_AT_decl_line   : 680
    <f461b>   DW_AT_decl_column : 25
    <f461c>   DW_AT_type        : <0xf47c4>
    <f4620>   DW_AT_data_member_location: 112
 <2><f4621>: Abbrev Number: 12 (DW_TAG_member)
    <f4622>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <f4626>   DW_AT_decl_file   : 8
    <f4626>   DW_AT_decl_line   : 681
    <f4628>   DW_AT_decl_column : 25
    <f4629>   DW_AT_type        : <0xf3f04>
    <f462d>   DW_AT_data_member_location: 336
 <2><f462f>: Abbrev Number: 12 (DW_TAG_member)
    <f4630>   DW_AT_name        : (indirect string, offset: 0x8df1d): Menu
    <f4634>   DW_AT_decl_file   : 8
    <f4634>   DW_AT_decl_line   : 683
    <f4636>   DW_AT_decl_column : 21
    <f4637>   DW_AT_type        : <0xf47d4>
    <f463b>   DW_AT_data_member_location: 344
 <2><f463d>: Abbrev Number: 12 (DW_TAG_member)
    <f463e>   DW_AT_name        : (indirect string, offset: 0x8f46f): ActiveMenu
    <f4642>   DW_AT_decl_file   : 8
    <f4642>   DW_AT_decl_line   : 684
    <f4644>   DW_AT_decl_column : 21
    <f4645>   DW_AT_type        : <0xf47bf>
    <f4649>   DW_AT_data_member_location: 368
 <2><f464b>: Abbrev Number: 12 (DW_TAG_member)
    <f464c>   DW_AT_name        : (indirect string, offset: 0x8e0e5): Parent
    <f4650>   DW_AT_decl_file   : 8
    <f4650>   DW_AT_decl_line   : 686
    <f4652>   DW_AT_decl_column : 25
    <f4653>   DW_AT_type        : <0xf47ba>
    <f4657>   DW_AT_data_member_location: 376
 <2><f4659>: Abbrev Number: 12 (DW_TAG_member)
    <f465a>   DW_AT_name        : (indirect string, offset: 0x8dfdc): Children
    <f465e>   DW_AT_decl_file   : 8
    <f465e>   DW_AT_decl_line   : 687
    <f4660>   DW_AT_decl_column : 25
    <f4661>   DW_AT_type        : <0xf40a0>
    <f4665>   DW_AT_data_member_location: 384
 <2><f4667>: Abbrev Number: 12 (DW_TAG_member)
    <f4668>   DW_AT_name        : (indirect string, offset: 0x8e06d): IsMenu
    <f466c>   DW_AT_decl_file   : 8
    <f466c>   DW_AT_decl_line   : 689
    <f466e>   DW_AT_decl_column : 25
    <f466f>   DW_AT_type        : <0xf3e95>
    <f4673>   DW_AT_data_member_location: 400
 <2><f4675>: Abbrev Number: 0
 <1><f4676>: Abbrev Number: 5 (DW_TAG_typedef)
    <f4677>   DW_AT_name        : (indirect string, offset: 0x8e762): SFG_MenuEntry
    <f467b>   DW_AT_decl_file   : 8
    <f467c>   DW_AT_decl_line   : 635
    <f467e>   DW_AT_decl_column : 33
    <f467f>   DW_AT_type        : <0xf4683>
 <1><f4683>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f4684>   DW_AT_name        : (indirect string, offset: 0x8e75f): tagSFG_MenuEntry
    <f4688>   DW_AT_byte_size   : 48
    <f4689>   DW_AT_decl_file   : 8
    <f4689>   DW_AT_decl_line   : 656
    <f468b>   DW_AT_decl_column : 8
    <f468b>   DW_AT_sibling     : <0xf46ea>
 <2><f468f>: Abbrev Number: 1 (DW_TAG_member)
    <f4690>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <f4694>   DW_AT_decl_file   : 8
    <f4694>   DW_AT_decl_line   : 658
    <f4696>   DW_AT_decl_column : 25
    <f4697>   DW_AT_type        : <0xf40d4>
    <f469b>   DW_AT_data_member_location: 0
 <2><f469c>: Abbrev Number: 11 (DW_TAG_member)
    <f469d>   DW_AT_name        : ID
    <f46a0>   DW_AT_decl_file   : 8
    <f46a0>   DW_AT_decl_line   : 659
    <f46a2>   DW_AT_decl_column : 25
    <f46a3>   DW_AT_type        : <0xf3ec2>
    <f46a7>   DW_AT_data_member_location: 16
 <2><f46a8>: Abbrev Number: 1 (DW_TAG_member)
    <f46a9>   DW_AT_name        : (indirect string, offset: 0x8e00a): Ordinal
    <f46ad>   DW_AT_decl_file   : 8
    <f46ad>   DW_AT_decl_line   : 660
    <f46af>   DW_AT_decl_column : 25
    <f46b0>   DW_AT_type        : <0xf3ec2>
    <f46b4>   DW_AT_data_member_location: 20
 <2><f46b5>: Abbrev Number: 1 (DW_TAG_member)
    <f46b6>   DW_AT_name        : (indirect string, offset: 0x8fc1b): Text
    <f46ba>   DW_AT_decl_file   : 8
    <f46ba>   DW_AT_decl_line   : 661
    <f46bc>   DW_AT_decl_column : 25
    <f46bd>   DW_AT_type        : <0xf3f06>
    <f46c1>   DW_AT_data_member_location: 24
 <2><f46c2>: Abbrev Number: 1 (DW_TAG_member)
    <f46c3>   DW_AT_name        : (indirect string, offset: 0x8f9db): SubMenu
    <f46c7>   DW_AT_decl_file   : 8
    <f46c7>   DW_AT_decl_line   : 662
    <f46c9>   DW_AT_decl_column : 25
    <f46ca>   DW_AT_type        : <0xf47bf>
    <f46ce>   DW_AT_data_member_location: 32
 <2><f46cf>: Abbrev Number: 1 (DW_TAG_member)
    <f46d0>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <f46d4>   DW_AT_decl_file   : 8
    <f46d4>   DW_AT_decl_line   : 663
    <f46d6>   DW_AT_decl_column : 25
    <f46d7>   DW_AT_type        : <0xf3e95>
    <f46db>   DW_AT_data_member_location: 40
 <2><f46dc>: Abbrev Number: 1 (DW_TAG_member)
    <f46dd>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <f46e1>   DW_AT_decl_file   : 8
    <f46e1>   DW_AT_decl_line   : 664
    <f46e3>   DW_AT_decl_column : 25
    <f46e4>   DW_AT_type        : <0xf3ec2>
    <f46e8>   DW_AT_data_member_location: 44
 <2><f46e9>: Abbrev Number: 0
 <1><f46ea>: Abbrev Number: 5 (DW_TAG_typedef)
    <f46eb>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <f46ef>   DW_AT_decl_file   : 8
    <f46f0>   DW_AT_decl_line   : 636
    <f46f2>   DW_AT_decl_column : 28
    <f46f3>   DW_AT_type        : <0xf46f7>
 <1><f46f7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f46f8>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <f46fc>   DW_AT_byte_size   : 112
    <f46fd>   DW_AT_decl_file   : 8
    <f46fd>   DW_AT_decl_line   : 637
    <f46ff>   DW_AT_decl_column : 8
    <f46ff>   DW_AT_sibling     : <0xf47b5>
 <2><f4703>: Abbrev Number: 1 (DW_TAG_member)
    <f4704>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <f4708>   DW_AT_decl_file   : 8
    <f4708>   DW_AT_decl_line   : 639
    <f470a>   DW_AT_decl_column : 25
    <f470b>   DW_AT_type        : <0xf40d4>
    <f470f>   DW_AT_data_member_location: 0
 <2><f4710>: Abbrev Number: 1 (DW_TAG_member)
    <f4711>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <f4715>   DW_AT_decl_file   : 8
    <f4715>   DW_AT_decl_line   : 640
    <f4717>   DW_AT_decl_column : 25
    <f4718>   DW_AT_type        : <0xf3f04>
    <f471c>   DW_AT_data_member_location: 16
 <2><f471d>: Abbrev Number: 11 (DW_TAG_member)
    <f471e>   DW_AT_name        : ID
    <f4721>   DW_AT_decl_file   : 8
    <f4721>   DW_AT_decl_line   : 641
    <f4723>   DW_AT_decl_column : 25
    <f4724>   DW_AT_type        : <0xf3ec2>
    <f4728>   DW_AT_data_member_location: 24
 <2><f4729>: Abbrev Number: 1 (DW_TAG_member)
    <f472a>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <f472e>   DW_AT_decl_file   : 8
    <f472e>   DW_AT_decl_line   : 642
    <f4730>   DW_AT_decl_column : 25
    <f4731>   DW_AT_type        : <0xf40a0>
    <f4735>   DW_AT_data_member_location: 32
 <2><f4736>: Abbrev Number: 1 (DW_TAG_member)
    <f4737>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <f473b>   DW_AT_decl_file   : 8
    <f473b>   DW_AT_decl_line   : 643
    <f473d>   DW_AT_decl_column : 25
    <f473e>   DW_AT_type        : <0xf4060>
    <f4742>   DW_AT_data_member_location: 48
 <2><f4743>: Abbrev Number: 1 (DW_TAG_member)
    <f4744>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <f4748>   DW_AT_decl_file   : 8
    <f4748>   DW_AT_decl_line   : 644
    <f474a>   DW_AT_decl_column : 25
    <f474b>   DW_AT_type        : <0xf4030>
    <f474f>   DW_AT_data_member_location: 56
 <2><f4750>: Abbrev Number: 1 (DW_TAG_member)
    <f4751>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <f4755>   DW_AT_decl_file   : 8
    <f4755>   DW_AT_decl_line   : 645
    <f4757>   DW_AT_decl_column : 25
    <f4758>   DW_AT_type        : <0xf3e95>
    <f475c>   DW_AT_data_member_location: 64
 <2><f475d>: Abbrev Number: 1 (DW_TAG_member)
    <f475e>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <f4762>   DW_AT_decl_file   : 8
    <f4762>   DW_AT_decl_line   : 646
    <f4764>   DW_AT_decl_column : 25
    <f4765>   DW_AT_type        : <0xf3ec2>
    <f4769>   DW_AT_data_member_location: 68
 <2><f476a>: Abbrev Number: 1 (DW_TAG_member)
    <f476b>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <f476f>   DW_AT_decl_file   : 8
    <f476f>   DW_AT_decl_line   : 647
    <f4771>   DW_AT_decl_column : 25
    <f4772>   DW_AT_type        : <0xf3ec2>
    <f4776>   DW_AT_data_member_location: 72
 <2><f4777>: Abbrev Number: 11 (DW_TAG_member)
    <f4778>   DW_AT_name        : X
    <f477a>   DW_AT_decl_file   : 8
    <f477a>   DW_AT_decl_line   : 648
    <f477c>   DW_AT_decl_column : 25
    <f477d>   DW_AT_type        : <0xf3ec2>
    <f4781>   DW_AT_data_member_location: 76
 <2><f4782>: Abbrev Number: 11 (DW_TAG_member)
    <f4783>   DW_AT_name        : Y
    <f4785>   DW_AT_decl_file   : 8
    <f4785>   DW_AT_decl_line   : 648
    <f4787>   DW_AT_decl_column : 28
    <f4788>   DW_AT_type        : <0xf3ec2>
    <f478c>   DW_AT_data_member_location: 80
 <2><f478d>: Abbrev Number: 1 (DW_TAG_member)
    <f478e>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <f4792>   DW_AT_decl_file   : 8
    <f4792>   DW_AT_decl_line   : 650
    <f4794>   DW_AT_decl_column : 25
    <f4795>   DW_AT_type        : <0xf47b5>
    <f4799>   DW_AT_data_member_location: 88
 <2><f479a>: Abbrev Number: 1 (DW_TAG_member)
    <f479b>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <f479f>   DW_AT_decl_file   : 8
    <f479f>   DW_AT_decl_line   : 651
    <f47a1>   DW_AT_decl_column : 25
    <f47a2>   DW_AT_type        : <0xf47ba>
    <f47a6>   DW_AT_data_member_location: 96
 <2><f47a7>: Abbrev Number: 1 (DW_TAG_member)
    <f47a8>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <f47ac>   DW_AT_decl_file   : 8
    <f47ac>   DW_AT_decl_line   : 652
    <f47ae>   DW_AT_decl_column : 25
    <f47af>   DW_AT_type        : <0xf47ba>
    <f47b3>   DW_AT_data_member_location: 104
 <2><f47b4>: Abbrev Number: 0
 <1><f47b5>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f47b6>   DW_AT_byte_size   : 8
    <f47b6>   DW_AT_type        : <0xf4676>
 <1><f47ba>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f47bb>   DW_AT_byte_size   : 8
    <f47bb>   DW_AT_type        : <0xf45c5>
 <1><f47bf>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f47c0>   DW_AT_byte_size   : 8
    <f47c0>   DW_AT_type        : <0xf46ea>
 <1><f47c4>: Abbrev Number: 24 (DW_TAG_array_type)
    <f47c5>   DW_AT_type        : <0xf4591>
    <f47c9>   DW_AT_sibling     : <0xf47d4>
 <2><f47cd>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <f47ce>   DW_AT_type        : <0xf3eea>
    <f47d2>   DW_AT_upper_bound : 27
 <2><f47d3>: Abbrev Number: 0
 <1><f47d4>: Abbrev Number: 24 (DW_TAG_array_type)
    <f47d5>   DW_AT_type        : <0xf47bf>
    <f47d9>   DW_AT_sibling     : <0xf47e4>
 <2><f47dd>: Abbrev Number: 25 (DW_TAG_subrange_type)
    <f47de>   DW_AT_type        : <0xf3eea>
    <f47e2>   DW_AT_upper_bound : 2
 <2><f47e3>: Abbrev Number: 0
 <1><f47e4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f47e5>   DW_AT_name        : (indirect string, offset: 0x8e11b): SFG_Structure
    <f47e9>   DW_AT_decl_file   : 8
    <f47ea>   DW_AT_decl_line   : 702
    <f47ec>   DW_AT_decl_column : 33
    <f47ed>   DW_AT_type        : <0xf47f1>
 <1><f47f1>: Abbrev Number: 9 (DW_TAG_structure_type)
    <f47f2>   DW_AT_name        : (indirect string, offset: 0x8e118): tagSFG_Structure
    <f47f6>   DW_AT_byte_size   : 88
    <f47f7>   DW_AT_decl_file   : 8
    <f47f7>   DW_AT_decl_line   : 703
    <f47f9>   DW_AT_decl_column : 8
    <f47f9>   DW_AT_sibling     : <0xf4873>
 <2><f47fd>: Abbrev Number: 1 (DW_TAG_member)
    <f47fe>   DW_AT_name        : (indirect string, offset: 0x8f090): Windows
    <f4802>   DW_AT_decl_file   : 8
    <f4802>   DW_AT_decl_line   : 705
    <f4804>   DW_AT_decl_column : 21
    <f4805>   DW_AT_type        : <0xf40a0>
    <f4809>   DW_AT_data_member_location: 0
 <2><f480a>: Abbrev Number: 1 (DW_TAG_member)
    <f480b>   DW_AT_name        : (indirect string, offset: 0x8e25e): Menus
    <f480f>   DW_AT_decl_file   : 8
    <f480f>   DW_AT_decl_line   : 706
    <f4811>   DW_AT_decl_column : 21
    <f4812>   DW_AT_type        : <0xf40a0>
    <f4816>   DW_AT_data_member_location: 16
 <2><f4817>: Abbrev Number: 1 (DW_TAG_member)
    <f4818>   DW_AT_name        : (indirect string, offset: 0x8e65c): WindowsToDestroy
    <f481c>   DW_AT_decl_file   : 8
    <f481c>   DW_AT_decl_line   : 707
    <f481e>   DW_AT_decl_column : 21
    <f481f>   DW_AT_type        : <0xf40a0>
    <f4823>   DW_AT_data_member_location: 32
 <2><f4824>: Abbrev Number: 1 (DW_TAG_member)
    <f4825>   DW_AT_name        : (indirect string, offset: 0x8e343): CurrentWindow
    <f4829>   DW_AT_decl_file   : 8
    <f4829>   DW_AT_decl_line   : 709
    <f482b>   DW_AT_decl_column : 21
    <f482c>   DW_AT_type        : <0xf47ba>
    <f4830>   DW_AT_data_member_location: 48
 <2><f4831>: Abbrev Number: 1 (DW_TAG_member)
    <f4832>   DW_AT_name        : (indirect string, offset: 0x8e07f): CurrentMenu
    <f4836>   DW_AT_decl_file   : 8
    <f4836>   DW_AT_decl_line   : 710
    <f4838>   DW_AT_decl_column : 21
    <f4839>   DW_AT_type        : <0xf47bf>
    <f483d>   DW_AT_data_member_location: 56
 <2><f483e>: Abbrev Number: 1 (DW_TAG_member)
    <f483f>   DW_AT_name        : (indirect string, offset: 0x8e56f): MenuContext
    <f4843>   DW_AT_decl_file   : 8
    <f4843>   DW_AT_decl_line   : 712
    <f4845>   DW_AT_decl_column : 22
    <f4846>   DW_AT_type        : <0xf4873>
    <f484a>   DW_AT_data_member_location: 64
 <2><f484b>: Abbrev Number: 1 (DW_TAG_member)
    <f484c>   DW_AT_name        : (indirect string, offset: 0x8e5bb): GameModeWindow
    <f4850>   DW_AT_decl_file   : 8
    <f4850>   DW_AT_decl_line   : 714
    <f4852>   DW_AT_decl_column : 22
    <f4853>   DW_AT_type        : <0xf47ba>
    <f4857>   DW_AT_data_member_location: 72
 <2><f4858>: Abbrev Number: 1 (DW_TAG_member)
    <f4859>   DW_AT_name        : (indirect string, offset: 0x8e2ad): WindowID
    <f485d>   DW_AT_decl_file   : 8
    <f485d>   DW_AT_decl_line   : 716
    <f485f>   DW_AT_decl_column : 22
    <f4860>   DW_AT_type        : <0xf3ec2>
    <f4864>   DW_AT_data_member_location: 80
 <2><f4865>: Abbrev Number: 1 (DW_TAG_member)
    <f4866>   DW_AT_name        : (indirect string, offset: 0x8f878): MenuID
    <f486a>   DW_AT_decl_file   : 8
    <f486a>   DW_AT_decl_line   : 717
    <f486c>   DW_AT_decl_column : 22
    <f486d>   DW_AT_type        : <0xf3ec2>
    <f4871>   DW_AT_data_member_location: 84
 <2><f4872>: Abbrev Number: 0
 <1><f4873>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4874>   DW_AT_byte_size   : 8
    <f4874>   DW_AT_type        : <0xf459e>
 <1><f4878>: Abbrev Number: 22 (DW_TAG_variable)
    <f4879>   DW_AT_name        : (indirect string, offset: 0x8e82f): fgDisplay
    <f487d>   DW_AT_decl_file   : 8
    <f487d>   DW_AT_decl_line   : 781
    <f487f>   DW_AT_decl_column : 20
    <f4880>   DW_AT_type        : <0xf4389>
    <f4884>   DW_AT_external    : 1
    <f4884>   DW_AT_declaration : 1
 <1><f4884>: Abbrev Number: 22 (DW_TAG_variable)
    <f4885>   DW_AT_name        : (indirect string, offset: 0x8e3ad): fgStructure
    <f4889>   DW_AT_decl_file   : 8
    <f4889>   DW_AT_decl_line   : 784
    <f488b>   DW_AT_decl_column : 22
    <f488c>   DW_AT_type        : <0xf47e4>
    <f4890>   DW_AT_external    : 1
    <f4890>   DW_AT_declaration : 1
 <1><f4890>: Abbrev Number: 22 (DW_TAG_variable)
    <f4891>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <f4895>   DW_AT_decl_file   : 8
    <f4895>   DW_AT_decl_line   : 787
    <f4897>   DW_AT_decl_column : 18
    <f4898>   DW_AT_type        : <0xf4174>
    <f489c>   DW_AT_external    : 1
    <f489c>   DW_AT_declaration : 1
 <1><f489c>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f489d>   DW_AT_external    : 1
    <f489d>   DW_AT_name        : (indirect string, offset: 0x9c18d): XUngrabKeyboard
    <f48a1>   DW_AT_decl_file   : 6
    <f48a2>   DW_AT_decl_line   : 3486
    <f48a4>   DW_AT_decl_column : 12
    <f48a5>   DW_AT_prototyped  : 1
    <f48a5>   DW_AT_type        : <0xf3ec2>
    <f48a9>   DW_AT_declaration : 1
    <f48a9>   DW_AT_sibling     : <0xf48b8>
 <2><f48ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48ae>   DW_AT_type        : <0xf3fc1>
 <2><f48b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48b3>   DW_AT_type        : <0xf3f84>
 <2><f48b7>: Abbrev Number: 0
 <1><f48b8>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f48b9>   DW_AT_external    : 1
    <f48b9>   DW_AT_name        : (indirect string, offset: 0x9c203): XUngrabPointer
    <f48bd>   DW_AT_decl_file   : 6
    <f48be>   DW_AT_decl_line   : 3491
    <f48c0>   DW_AT_decl_column : 12
    <f48c1>   DW_AT_prototyped  : 1
    <f48c1>   DW_AT_type        : <0xf3ec2>
    <f48c5>   DW_AT_declaration : 1
    <f48c5>   DW_AT_sibling     : <0xf48d4>
 <2><f48c9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48ca>   DW_AT_type        : <0xf3fc1>
 <2><f48ce>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48cf>   DW_AT_type        : <0xf3f84>
 <2><f48d3>: Abbrev Number: 0
 <1><f48d4>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f48d5>   DW_AT_external    : 1
    <f48d5>   DW_AT_name        : (indirect string, offset: 0x9c1ac): XQueryPointer
    <f48d9>   DW_AT_decl_file   : 6
    <f48da>   DW_AT_decl_line   : 2993
    <f48dc>   DW_AT_decl_column : 13
    <f48dd>   DW_AT_prototyped  : 1
    <f48dd>   DW_AT_type        : <0xf3ec2>
    <f48e1>   DW_AT_declaration : 1
    <f48e1>   DW_AT_sibling     : <0xf4913>
 <2><f48e5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48e6>   DW_AT_type        : <0xf3fc1>
 <2><f48ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48eb>   DW_AT_type        : <0xf3f90>
 <2><f48ef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48f0>   DW_AT_type        : <0xf4913>
 <2><f48f4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48f5>   DW_AT_type        : <0xf4913>
 <2><f48f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48fa>   DW_AT_type        : <0xf3ff7>
 <2><f48fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f48ff>   DW_AT_type        : <0xf3ff7>
 <2><f4903>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4904>   DW_AT_type        : <0xf3ff7>
 <2><f4908>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4909>   DW_AT_type        : <0xf3ff7>
 <2><f490d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f490e>   DW_AT_type        : <0xf3ffc>
 <2><f4912>: Abbrev Number: 0
 <1><f4913>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <f4914>   DW_AT_byte_size   : 8
    <f4914>   DW_AT_type        : <0xf3f90>
 <1><f4918>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f4919>   DW_AT_external    : 1
    <f4919>   DW_AT_name        : (indirect string, offset: 0x9c212): XGrabKeyboard
    <f491d>   DW_AT_decl_file   : 6
    <f491e>   DW_AT_decl_line   : 2730
    <f4920>   DW_AT_decl_column : 12
    <f4921>   DW_AT_prototyped  : 1
    <f4921>   DW_AT_type        : <0xf3ec2>
    <f4925>   DW_AT_declaration : 1
    <f4925>   DW_AT_sibling     : <0xf4948>
 <2><f4929>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f492a>   DW_AT_type        : <0xf3fc1>
 <2><f492e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f492f>   DW_AT_type        : <0xf3f90>
 <2><f4933>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4934>   DW_AT_type        : <0xf3ec2>
 <2><f4938>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4939>   DW_AT_type        : <0xf3ec2>
 <2><f493d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f493e>   DW_AT_type        : <0xf3ec2>
 <2><f4942>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4943>   DW_AT_type        : <0xf3f84>
 <2><f4947>: Abbrev Number: 0
 <1><f4948>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f4949>   DW_AT_external    : 1
    <f4949>   DW_AT_name        : (indirect string, offset: 0x8e8d9): XWarpPointer
    <f494d>   DW_AT_decl_file   : 6
    <f494e>   DW_AT_decl_line   : 3524
    <f4950>   DW_AT_decl_column : 12
    <f4951>   DW_AT_prototyped  : 1
    <f4951>   DW_AT_type        : <0xf3ec2>
    <f4955>   DW_AT_declaration : 1
    <f4955>   DW_AT_sibling     : <0xf4987>
 <2><f4959>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f495a>   DW_AT_type        : <0xf3fc1>
 <2><f495e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f495f>   DW_AT_type        : <0xf3f90>
 <2><f4963>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4964>   DW_AT_type        : <0xf3f90>
 <2><f4968>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4969>   DW_AT_type        : <0xf3ec2>
 <2><f496d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f496e>   DW_AT_type        : <0xf3ec2>
 <2><f4972>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4973>   DW_AT_type        : <0xf3e8e>
 <2><f4977>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4978>   DW_AT_type        : <0xf3e8e>
 <2><f497c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f497d>   DW_AT_type        : <0xf3ec2>
 <2><f4981>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4982>   DW_AT_type        : <0xf3ec2>
 <2><f4986>: Abbrev Number: 0
 <1><f4987>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f4988>   DW_AT_external    : 1
    <f4988>   DW_AT_name        : (indirect string, offset: 0x9c19d): XSetInputFocus
    <f498c>   DW_AT_decl_file   : 6
    <f498d>   DW_AT_decl_line   : 3261
    <f498f>   DW_AT_decl_column : 12
    <f4990>   DW_AT_prototyped  : 1
    <f4990>   DW_AT_type        : <0xf3ec2>
    <f4994>   DW_AT_declaration : 1
    <f4994>   DW_AT_sibling     : <0xf49ad>
 <2><f4998>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4999>   DW_AT_type        : <0xf3fc1>
 <2><f499d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f499e>   DW_AT_type        : <0xf3f90>
 <2><f49a2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49a3>   DW_AT_type        : <0xf3ec2>
 <2><f49a7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49a8>   DW_AT_type        : <0xf3f84>
 <2><f49ac>: Abbrev Number: 0
 <1><f49ad>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f49ae>   DW_AT_external    : 1
    <f49ae>   DW_AT_name        : (indirect string, offset: 0x9c180): XGrabPointer
    <f49b2>   DW_AT_decl_file   : 6
    <f49b3>   DW_AT_decl_line   : 2739
    <f49b5>   DW_AT_decl_column : 12
    <f49b6>   DW_AT_prototyped  : 1
    <f49b6>   DW_AT_type        : <0xf3ec2>
    <f49ba>   DW_AT_declaration : 1
    <f49ba>   DW_AT_sibling     : <0xf49ec>
 <2><f49be>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49bf>   DW_AT_type        : <0xf3fc1>
 <2><f49c3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49c4>   DW_AT_type        : <0xf3f90>
 <2><f49c8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49c9>   DW_AT_type        : <0xf3ec2>
 <2><f49cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49ce>   DW_AT_type        : <0xf3e8e>
 <2><f49d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49d3>   DW_AT_type        : <0xf3ec2>
 <2><f49d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49d8>   DW_AT_type        : <0xf3ec2>
 <2><f49dc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49dd>   DW_AT_type        : <0xf3f90>
 <2><f49e1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49e2>   DW_AT_type        : <0xf3f9c>
 <2><f49e6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49e7>   DW_AT_type        : <0xf3f84>
 <2><f49eb>: Abbrev Number: 0
 <1><f49ec>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f49ed>   DW_AT_external    : 1
    <f49ed>   DW_AT_name        : (indirect string, offset: 0x9c16d): usleep
    <f49f1>   DW_AT_decl_file   : 9
    <f49f2>   DW_AT_decl_line   : 469
    <f49f4>   DW_AT_decl_column : 12
    <f49f5>   DW_AT_prototyped  : 1
    <f49f5>   DW_AT_type        : <0xf3ec2>
    <f49f9>   DW_AT_declaration : 1
    <f49f9>   DW_AT_sibling     : <0xf4a03>
 <2><f49fd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f49fe>   DW_AT_type        : <0xf3ef8>
 <2><f4a02>: Abbrev Number: 0
 <1><f4a03>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f4a04>   DW_AT_external    : 1
    <f4a04>   DW_AT_name        : (indirect string, offset: 0x7b138): XSync
    <f4a08>   DW_AT_decl_file   : 6
    <f4a09>   DW_AT_decl_line   : 3419
    <f4a0b>   DW_AT_decl_column : 12
    <f4a0c>   DW_AT_prototyped  : 1
    <f4a0c>   DW_AT_type        : <0xf3ec2>
    <f4a10>   DW_AT_declaration : 1
    <f4a10>   DW_AT_sibling     : <0xf4a1f>
 <2><f4a14>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a15>   DW_AT_type        : <0xf3fc1>
 <2><f4a19>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a1a>   DW_AT_type        : <0xf3ec2>
 <2><f4a1e>: Abbrev Number: 0
 <1><f4a1f>: Abbrev Number: 10 (DW_TAG_subprogram)
    <f4a20>   DW_AT_external    : 1
    <f4a20>   DW_AT_name        : (indirect string, offset: 0x8ffa0): fgCreateWindow
    <f4a24>   DW_AT_decl_file   : 8
    <f4a25>   DW_AT_decl_line   : 874
    <f4a27>   DW_AT_decl_column : 13
    <f4a28>   DW_AT_prototyped  : 1
    <f4a28>   DW_AT_type        : <0xf47ba>
    <f4a2c>   DW_AT_declaration : 1
    <f4a2c>   DW_AT_sibling     : <0xf4a63>
 <2><f4a30>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a31>   DW_AT_type        : <0xf47ba>
 <2><f4a35>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a36>   DW_AT_type        : <0xf4001>
 <2><f4a3a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a3b>   DW_AT_type        : <0xf3e95>
 <2><f4a3f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a40>   DW_AT_type        : <0xf3ec2>
 <2><f4a44>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a45>   DW_AT_type        : <0xf3ec2>
 <2><f4a49>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a4a>   DW_AT_type        : <0xf3e95>
 <2><f4a4e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a4f>   DW_AT_type        : <0xf3ec2>
 <2><f4a53>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a54>   DW_AT_type        : <0xf3ec2>
 <2><f4a58>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a59>   DW_AT_type        : <0xf3e95>
 <2><f4a5d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a5e>   DW_AT_type        : <0xf3e95>
 <2><f4a62>: Abbrev Number: 0
 <1><f4a63>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f4a64>   DW_AT_external    : 1
    <f4a64>   DW_AT_name        : (indirect string, offset: 0x8ffaf): fgAddToWindowDestroyList
    <f4a68>   DW_AT_decl_file   : 8
    <f4a68>   DW_AT_decl_line   : 884
    <f4a6a>   DW_AT_decl_column : 13
    <f4a6b>   DW_AT_prototyped  : 1
    <f4a6b>   DW_AT_declaration : 1
    <f4a6b>   DW_AT_sibling     : <0xf4a75>
 <2><f4a6f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a70>   DW_AT_type        : <0xf47ba>
 <2><f4a74>: Abbrev Number: 0
 <1><f4a75>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f4a76>   DW_AT_external    : 1
    <f4a76>   DW_AT_name        : (indirect string, offset: 0x8ee0b): fgWarning
    <f4a7a>   DW_AT_decl_file   : 8
    <f4a7a>   DW_AT_decl_line   : 999
    <f4a7c>   DW_AT_decl_column : 6
    <f4a7d>   DW_AT_prototyped  : 1
    <f4a7d>   DW_AT_declaration : 1
    <f4a7d>   DW_AT_sibling     : <0xf4a88>
 <2><f4a81>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a82>   DW_AT_type        : <0xf4001>
 <2><f4a86>: Abbrev Number: 13 (DW_TAG_unspecified_parameters)
 <2><f4a87>: Abbrev Number: 0
 <1><f4a88>: Abbrev Number: 42 (DW_TAG_subprogram)
    <f4a89>   DW_AT_external    : 1
    <f4a89>   DW_AT_name        : (indirect string, offset: 0x6dc06): sscanf
    <f4a8d>   DW_AT_decl_file   : 10
    <f4a8e>   DW_AT_decl_line   : 415
    <f4a90>   DW_AT_decl_column : 12
    <f4a91>   DW_AT_linkage_name: (indirect string, offset: 0x6dbfd): __isoc99_sscanf
    <f4a95>   DW_AT_prototyped  : 1
    <f4a95>   DW_AT_type        : <0xf3ec2>
    <f4a99>   DW_AT_declaration : 1
    <f4a99>   DW_AT_sibling     : <0xf4aa9>
 <2><f4a9d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4a9e>   DW_AT_type        : <0xf4001>
 <2><f4aa2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4aa3>   DW_AT_type        : <0xf4001>
 <2><f4aa7>: Abbrev Number: 13 (DW_TAG_unspecified_parameters)
 <2><f4aa8>: Abbrev Number: 0
 <1><f4aa9>: Abbrev Number: 23 (DW_TAG_subprogram)
    <f4aaa>   DW_AT_external    : 1
    <f4aaa>   DW_AT_name        : (indirect string, offset: 0x8e9c9): fgError
    <f4aae>   DW_AT_decl_file   : 8
    <f4aae>   DW_AT_decl_line   : 998
    <f4ab0>   DW_AT_decl_column : 6
    <f4ab1>   DW_AT_prototyped  : 1
    <f4ab1>   DW_AT_declaration : 1
    <f4ab1>   DW_AT_sibling     : <0xf4abc>
 <2><f4ab5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <f4ab6>   DW_AT_type        : <0xf4001>
 <2><f4aba>: Abbrev Number: 13 (DW_TAG_unspecified_parameters)
 <2><f4abb>: Abbrev Number: 0
 <1><f4abc>: Abbrev Number: 26 (DW_TAG_subprogram)
    <f4abd>   DW_AT_external    : 1
    <f4abd>   DW_AT_name        : (indirect string, offset: 0x908fa): glutGameModeGet
    <f4ac1>   DW_AT_decl_file   : 1
    <f4ac1>   DW_AT_decl_line   : 787
    <f4ac3>   DW_AT_decl_column : 16
    <f4ac3>   DW_AT_prototyped  : 1
    <f4ac3>   DW_AT_type        : <0xf3ec2>
    <f4ac7>   DW_AT_low_pc      : 0x9d9f50
    <f4acf>   DW_AT_high_pc     : 0xaf
    <f4ad7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4ad9>   DW_AT_call_all_calls: 1
    <f4ad9>   DW_AT_sibling     : <0xf4b3f>
 <2><f4add>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <f4ade>   DW_AT_name        : (indirect string, offset: 0x8fedf): eWhat
    <f4ae2>   DW_AT_decl_file   : 1
    <f4ae2>   DW_AT_decl_line   : 787
    <f4ae4>   DW_AT_decl_column : 40
    <f4ae5>   DW_AT_type        : <0xf3e82>
    <f4ae9>   DW_AT_location    : 0x7a76 (location list)
    <f4aed>   DW_AT_GNU_locviews: 0x7a6a
 <2><f4af1>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4af2>   DW_AT_call_return_pc: 0x9d9fa5
    <f4afa>   DW_AT_call_origin : <0xf4aa9>
    <f4afe>   DW_AT_sibling     : <0xf4b1d>
 <3><f4b02>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b03>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4b05>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><f4b0f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b10>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4b12>   DW_AT_call_value  : 9 byte block: 3 50 d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d350)
 <3><f4b1c>: Abbrev Number: 0
 <2><f4b1d>: Abbrev Number: 15 (DW_TAG_call_site)
    <f4b1e>   DW_AT_call_return_pc: 0x9d9ff8
    <f4b26>   DW_AT_call_origin : <0xf4a75>
 <3><f4b2a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b2b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4b2d>   DW_AT_call_value  : 9 byte block: 3 1b ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac1b)
 <3><f4b37>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b38>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4b3a>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4b3d>: Abbrev Number: 0
 <2><f4b3e>: Abbrev Number: 0
 <1><f4b3f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <f4b40>   DW_AT_external    : 1
    <f4b40>   DW_AT_name        : (indirect string, offset: 0x8eb8d): glutLeaveGameMode
    <f4b44>   DW_AT_decl_file   : 1
    <f4b44>   DW_AT_decl_line   : 765
    <f4b46>   DW_AT_decl_column : 17
    <f4b46>   DW_AT_prototyped  : 1
    <f4b46>   DW_AT_low_pc      : 0x9d9eb0
    <f4b4e>   DW_AT_high_pc     : 0x9a
    <f4b56>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4b58>   DW_AT_call_all_calls: 1
    <f4b58>   DW_AT_sibling     : <0xf4c08>
 <2><f4b5c>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <f4b5d>   DW_AT_abstract_origin: <0xf4f41>
    <f4b61>   DW_AT_entry_pc    : 0x9d9ef5
    <f4b69>   DW_AT_GNU_entry_view: 1
    <f4b6a>   DW_AT_low_pc      : 0x9d9ef5
    <f4b72>   DW_AT_high_pc     : 0x35
    <f4b7a>   DW_AT_call_file   : 1
    <f4b7a>   DW_AT_call_line   : 781
    <f4b7c>   DW_AT_call_column : 5
    <f4b7d>   DW_AT_sibling     : <0xf4ba4>
 <3><f4b81>: Abbrev Number: 15 (DW_TAG_call_site)
    <f4b82>   DW_AT_call_return_pc: 0x9d9f26
    <f4b8a>   DW_AT_call_origin : <0xf4948>
 <4><f4b8e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b8f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4b91>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><f4b93>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b94>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4b96>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><f4b98>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b99>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <f4b9b>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><f4b9d>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4b9e>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <f4ba0>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><f4ba2>: Abbrev Number: 0
 <3><f4ba3>: Abbrev Number: 0
 <2><f4ba4>: Abbrev Number: 16 (DW_TAG_call_site)
    <f4ba5>   DW_AT_call_return_pc: 0x9d9ece
    <f4bad>   DW_AT_call_origin : <0xf4a63>
 <2><f4bb1>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4bb2>   DW_AT_call_return_pc: 0x9d9ee7
    <f4bba>   DW_AT_call_origin : <0xf48b8>
    <f4bbe>   DW_AT_sibling     : <0xf4bc8>
 <3><f4bc2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4bc3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4bc5>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><f4bc7>: Abbrev Number: 0
 <2><f4bc8>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4bc9>   DW_AT_call_return_pc: 0x9d9ef5
    <f4bd1>   DW_AT_call_origin : <0xf489c>
    <f4bd5>   DW_AT_sibling     : <0xf4bdf>
 <3><f4bd9>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4bda>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4bdc>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><f4bde>: Abbrev Number: 0
 <2><f4bdf>: Abbrev Number: 15 (DW_TAG_call_site)
    <f4be0>   DW_AT_call_return_pc: 0x9d9f45
    <f4be8>   DW_AT_call_origin : <0xf4aa9>
 <3><f4bec>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4bed>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4bef>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><f4bf9>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4bfa>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4bfc>   DW_AT_call_value  : 9 byte block: 3 3e d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d33e)
 <3><f4c06>: Abbrev Number: 0
 <2><f4c07>: Abbrev Number: 0
 <1><f4c08>: Abbrev Number: 26 (DW_TAG_subprogram)
    <f4c09>   DW_AT_external    : 1
    <f4c09>   DW_AT_name        : (indirect string, offset: 0x907ee): glutEnterGameMode
    <f4c0d>   DW_AT_decl_file   : 1
    <f4c0d>   DW_AT_decl_line   : 646
    <f4c0f>   DW_AT_decl_column : 16
    <f4c0f>   DW_AT_prototyped  : 1
    <f4c0f>   DW_AT_type        : <0xf3ec2>
    <f4c13>   DW_AT_low_pc      : 0x9d9df0
    <f4c1b>   DW_AT_high_pc     : 0xb9
    <f4c23>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4c25>   DW_AT_call_all_calls: 1
    <f4c25>   DW_AT_sibling     : <0xf4ce9>
 <2><f4c29>: Abbrev Number: 29 (DW_TAG_inlined_subroutine)
    <f4c2a>   DW_AT_abstract_origin: <0xf4f4b>
    <f4c2e>   DW_AT_entry_pc    : 0x9d9e67
    <f4c36>   DW_AT_GNU_entry_view: 1
    <f4c37>   DW_AT_low_pc      : 0x9d9e67
    <f4c3f>   DW_AT_high_pc     : 0x3d
    <f4c47>   DW_AT_call_file   : 1
    <f4c47>   DW_AT_call_line   : 653
    <f4c49>   DW_AT_call_column : 9
    <f4c4a>   DW_AT_sibling     : <0xf4c83>
 <3><f4c4e>: Abbrev Number: 30 (DW_TAG_variable)
    <f4c4f>   DW_AT_abstract_origin: <0xf4f58>
 <3><f4c53>: Abbrev Number: 30 (DW_TAG_variable)
    <f4c54>   DW_AT_abstract_origin: <0xf4f63>
 <3><f4c58>: Abbrev Number: 31 (DW_TAG_variable)
    <f4c59>   DW_AT_abstract_origin: <0xf4f6e>
    <f4c5d>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><f4c60>: Abbrev Number: 31 (DW_TAG_variable)
    <f4c61>   DW_AT_abstract_origin: <0xf4f79>
    <f4c65>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><f4c68>: Abbrev Number: 15 (DW_TAG_call_site)
    <f4c69>   DW_AT_call_return_pc: 0x9d9e9b
    <f4c71>   DW_AT_call_origin : <0xf48d4>
 <4><f4c75>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4c76>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4c78>   DW_AT_call_value  : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><f4c7b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4c7c>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4c7e>   DW_AT_call_value  : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <4><f4c81>: Abbrev Number: 0
 <3><f4c82>: Abbrev Number: 0
 <2><f4c83>: Abbrev Number: 16 (DW_TAG_call_site)
    <f4c84>   DW_AT_call_return_pc: 0x9d9e1e
    <f4c8c>   DW_AT_call_origin : <0xf4a63>
 <2><f4c90>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4c91>   DW_AT_call_return_pc: 0x9d9e2c
    <f4c99>   DW_AT_call_origin : <0xf4a75>
    <f4c9d>   DW_AT_sibling     : <0xf4caf>
 <3><f4ca1>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4ca2>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4ca4>   DW_AT_call_value  : 9 byte block: 3 60 ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac60)
 <3><f4cae>: Abbrev Number: 0
 <2><f4caf>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4cb0>   DW_AT_call_return_pc: 0x9d9e5b
    <f4cb8>   DW_AT_call_origin : <0xf4aa9>
    <f4cbc>   DW_AT_sibling     : <0xf4cdb>
 <3><f4cc0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4cc1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4cc3>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><f4ccd>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4cce>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4cd0>   DW_AT_call_value  : 9 byte block: 3 2c d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d32c)
 <3><f4cda>: Abbrev Number: 0
 <2><f4cdb>: Abbrev Number: 16 (DW_TAG_call_site)
    <f4cdc>   DW_AT_call_return_pc: 0x9d9ea9
    <f4ce4>   DW_AT_call_origin : <0xf4f85>
 <2><f4ce8>: Abbrev Number: 0
 <1><f4ce9>: Abbrev Number: 28 (DW_TAG_subprogram)
    <f4cea>   DW_AT_external    : 1
    <f4cea>   DW_AT_name        : (indirect string, offset: 0x90821): glutGameModeString
    <f4cee>   DW_AT_decl_file   : 1
    <f4cee>   DW_AT_decl_line   : 606
    <f4cf0>   DW_AT_decl_column : 17
    <f4cf0>   DW_AT_prototyped  : 1
    <f4cf0>   DW_AT_low_pc      : 0x9d9c20
    <f4cf8>   DW_AT_high_pc     : 0x1c5
    <f4d00>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f4d02>   DW_AT_call_all_calls: 1
    <f4d02>   DW_AT_sibling     : <0xf4f14>
 <2><f4d06>: Abbrev Number: 27 (DW_TAG_formal_parameter)
    <f4d07>   DW_AT_name        : (indirect string, offset: 0x8bc8d): string
    <f4d0b>   DW_AT_decl_file   : 1
    <f4d0b>   DW_AT_decl_line   : 606
    <f4d0d>   DW_AT_decl_column : 49
    <f4d0e>   DW_AT_type        : <0xf4001>
    <f4d12>   DW_AT_location    : 0x7ab3 (location list)
    <f4d16>   DW_AT_GNU_locviews: 0x7aa7
 <2><f4d1a>: Abbrev Number: 17 (DW_TAG_variable)
    <f4d1b>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <f4d1f>   DW_AT_decl_file   : 1
    <f4d1f>   DW_AT_decl_line   : 608
    <f4d1f>   DW_AT_decl_column : 9
    <f4d20>   DW_AT_type        : <0xf3ec2>
    <f4d24>   DW_AT_location    : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <2><f4d28>: Abbrev Number: 17 (DW_TAG_variable)
    <f4d29>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <f4d2d>   DW_AT_decl_file   : 1
    <f4d2d>   DW_AT_decl_line   : 608
    <f4d2d>   DW_AT_decl_column : 21
    <f4d2e>   DW_AT_type        : <0xf3ec2>
    <f4d32>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><f4d36>: Abbrev Number: 17 (DW_TAG_variable)
    <f4d37>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <f4d3b>   DW_AT_decl_file   : 1
    <f4d3b>   DW_AT_decl_line   : 608
    <f4d3b>   DW_AT_decl_column : 34
    <f4d3c>   DW_AT_type        : <0xf3ec2>
    <f4d40>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <2><f4d43>: Abbrev Number: 17 (DW_TAG_variable)
    <f4d44>   DW_AT_name        : (indirect string, offset: 0x66434): refresh
    <f4d48>   DW_AT_decl_file   : 1
    <f4d48>   DW_AT_decl_line   : 608
    <f4d48>   DW_AT_decl_column : 46
    <f4d49>   DW_AT_type        : <0xf3ec2>
    <f4d4d>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><f4d50>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4d51>   DW_AT_call_return_pc: 0x9d9c9e
    <f4d59>   DW_AT_call_origin : <0xf4a88>
    <f4d5d>   DW_AT_sibling     : <0xf4d8f>
 <3><f4d61>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d62>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4d64>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4d67>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d68>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4d6a>   DW_AT_call_value  : 9 byte block: 3 f7 ab a4 0 0 0 0 0 	(DW_OP_addr: a4abf7)
 <3><f4d74>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d75>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4d77>   DW_AT_call_value  : 3 byte block: 91 b8 7f 	(DW_OP_fbreg: -72)
 <3><f4d7b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d7c>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4d7e>   DW_AT_call_value  : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <3><f4d82>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d83>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <f4d85>   DW_AT_call_value  : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <3><f4d88>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4d89>   DW_AT_location    : 1 byte block: 59 	(DW_OP_reg9 (r9))
    <f4d8b>   DW_AT_call_value  : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <3><f4d8e>: Abbrev Number: 0
 <2><f4d8f>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4d90>   DW_AT_call_return_pc: 0x9d9d0a
    <f4d98>   DW_AT_call_origin : <0xf4a88>
    <f4d9c>   DW_AT_sibling     : <0xf4dc6>
 <3><f4da0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4da1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4da3>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4da6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4da7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4da9>   DW_AT_call_value  : 9 byte block: 3 3 ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac03)
 <3><f4db3>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4db4>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4db6>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><f4db9>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4dba>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4dbc>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><f4dbf>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4dc0>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <f4dc2>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><f4dc5>: Abbrev Number: 0
 <2><f4dc6>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4dc7>   DW_AT_call_return_pc: 0x9d9d29
    <f4dcf>   DW_AT_call_origin : <0xf4a88>
    <f4dd3>   DW_AT_sibling     : <0xf4dfd>
 <3><f4dd7>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4dd8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4dda>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4ddd>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4dde>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4de0>   DW_AT_call_value  : 9 byte block: 3 c ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac0c)
 <3><f4dea>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4deb>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4ded>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><f4df0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4df1>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4df3>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><f4df6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4df7>   DW_AT_location    : 1 byte block: 58 	(DW_OP_reg8 (r8))
    <f4df9>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><f4dfc>: Abbrev Number: 0
 <2><f4dfd>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4dfe>   DW_AT_call_return_pc: 0x9d9d49
    <f4e06>   DW_AT_call_origin : <0xf4a88>
    <f4e0a>   DW_AT_sibling     : <0xf4e2e>
 <3><f4e0e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e0f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4e11>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4e14>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e15>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4e17>   DW_AT_call_value  : 9 byte block: 3 15 ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac15)
 <3><f4e21>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e22>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4e24>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <3><f4e27>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e28>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4e2a>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <3><f4e2d>: Abbrev Number: 0
 <2><f4e2e>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4e2f>   DW_AT_call_return_pc: 0x9d9d69
    <f4e37>   DW_AT_call_origin : <0xf4a88>
    <f4e3b>   DW_AT_sibling     : <0xf4e5f>
 <3><f4e3f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e40>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4e42>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4e45>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e46>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4e48>   DW_AT_call_value  : 9 byte block: 3 fc ab a4 0 0 0 0 0 	(DW_OP_addr: a4abfc)
 <3><f4e52>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e53>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4e55>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><f4e58>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e59>   DW_AT_location    : 1 byte block: 52 	(DW_OP_reg2 (rcx))
    <f4e5b>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><f4e5e>: Abbrev Number: 0
 <2><f4e5f>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4e60>   DW_AT_call_return_pc: 0x9d9d86
    <f4e68>   DW_AT_call_origin : <0xf4a88>
    <f4e6c>   DW_AT_sibling     : <0xf4e8a>
 <3><f4e70>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e71>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4e73>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4e76>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e77>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4e79>   DW_AT_call_value  : 9 byte block: 3 8 ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac08)
 <3><f4e83>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e84>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4e86>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <3><f4e89>: Abbrev Number: 0
 <2><f4e8a>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4e8b>   DW_AT_call_return_pc: 0x9d9da3
    <f4e93>   DW_AT_call_origin : <0xf4a88>
    <f4e97>   DW_AT_sibling     : <0xf4eb5>
 <3><f4e9b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4e9c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4e9e>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4ea1>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4ea2>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4ea4>   DW_AT_call_value  : 9 byte block: 3 ff ab a4 0 0 0 0 0 	(DW_OP_addr: a4abff)
 <3><f4eae>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4eaf>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <f4eb1>   DW_AT_call_value  : 2 byte block: 7f 0 	(DW_OP_breg15 (r15): 0)
 <3><f4eb4>: Abbrev Number: 0
 <2><f4eb5>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4eb6>   DW_AT_call_return_pc: 0x9d9dbd
    <f4ebe>   DW_AT_call_origin : <0xf4a75>
    <f4ec2>   DW_AT_sibling     : <0xf4eda>
 <3><f4ec6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4ec7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <f4ec9>   DW_AT_call_value  : 9 byte block: 3 38 ac a4 0 0 0 0 0 	(DW_OP_addr: a4ac38)
 <3><f4ed3>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <f4ed4>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <f4ed6>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><f4ed9>: Abbrev Number: 0
 <2><f4eda>: Abbrev Number: 7 (DW_TAG_call_site)
    <f4edb>   DW_AT_call_return_pc: 0x9d9ddb
    <f4ee3>   DW_AT_call_origin : <0xf4aa9>
    <f4ee7>   DW_AT_sibling     : <0xf4f06>
 <3><f4eeb>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
