    <ccf97>   DW_AT_sibling     : <0xccfb6>
 <2><ccf9b>: Abbrev Number: 1 (DW_TAG_member)
    <ccf9c>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <ccfa0>   DW_AT_decl_file   : 9
    <ccfa0>   DW_AT_decl_line   : 272
    <ccfa2>   DW_AT_decl_column : 11
    <ccfa3>   DW_AT_type        : <0xccdb0>
    <ccfa7>   DW_AT_data_member_location: 0
 <2><ccfa8>: Abbrev Number: 1 (DW_TAG_member)
    <ccfa9>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <ccfad>   DW_AT_decl_file   : 9
    <ccfad>   DW_AT_decl_line   : 273
    <ccfaf>   DW_AT_decl_column : 11
    <ccfb0>   DW_AT_type        : <0xccdb0>
    <ccfb4>   DW_AT_data_member_location: 8
 <2><ccfb5>: Abbrev Number: 0
 <1><ccfb6>: Abbrev Number: 7 (DW_TAG_typedef)
    <ccfb7>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <ccfbb>   DW_AT_decl_file   : 9
    <ccfbb>   DW_AT_decl_line   : 277
    <ccfbd>   DW_AT_decl_column : 29
    <ccfbe>   DW_AT_type        : <0xccfc2>
 <1><ccfc2>: Abbrev Number: 12 (DW_TAG_structure_type)
    <ccfc3>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <ccfc7>   DW_AT_byte_size   : 12
    <ccfc8>   DW_AT_decl_file   : 9
    <ccfc8>   DW_AT_decl_line   : 278
    <ccfca>   DW_AT_decl_column : 8
    <ccfca>   DW_AT_sibling     : <0xccff2>
 <2><ccfce>: Abbrev Number: 14 (DW_TAG_member)
    <ccfcf>   DW_AT_name        : X
    <ccfd1>   DW_AT_decl_file   : 9
    <ccfd1>   DW_AT_decl_line   : 280
    <ccfd3>   DW_AT_decl_column : 21
    <ccfd4>   DW_AT_type        : <0xccd5e>
    <ccfd8>   DW_AT_data_member_location: 0
 <2><ccfd9>: Abbrev Number: 14 (DW_TAG_member)
    <ccfda>   DW_AT_name        : Y
    <ccfdc>   DW_AT_decl_file   : 9
    <ccfdc>   DW_AT_decl_line   : 280
    <ccfde>   DW_AT_decl_column : 24
    <ccfdf>   DW_AT_type        : <0xccd5e>
    <ccfe3>   DW_AT_data_member_location: 4
 <2><ccfe4>: Abbrev Number: 14 (DW_TAG_member)
    <ccfe5>   DW_AT_name        : Use
    <ccfe9>   DW_AT_decl_file   : 9
    <ccfe9>   DW_AT_decl_line   : 281
    <ccfeb>   DW_AT_decl_column : 21
    <ccfec>   DW_AT_type        : <0xccd3d>
    <ccff0>   DW_AT_data_member_location: 8
 <2><ccff1>: Abbrev Number: 0
 <1><ccff2>: Abbrev Number: 36 (DW_TAG_enumeration_type)
    <ccff3>   DW_AT_encoding    : 7	(void)
    <ccff3>   DW_AT_byte_size   : 4
    <ccff3>   DW_AT_type        : <0xccd36>
    <ccff7>   DW_AT_decl_file   : 9
    <ccff7>   DW_AT_decl_line   : 289
    <ccff9>   DW_AT_decl_column : 1
    <ccff9>   DW_AT_sibling     : <0xcd010>
 <2><ccffd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ccffe>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <cd002>   DW_AT_const_value : 0
 <2><cd003>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd004>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <cd008>   DW_AT_const_value : 1
 <2><cd009>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd00a>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <cd00e>   DW_AT_const_value : 2
 <2><cd00f>: Abbrev Number: 0
 <1><cd010>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd011>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <cd015>   DW_AT_decl_file   : 9
    <cd015>   DW_AT_decl_line   : 293
    <cd017>   DW_AT_decl_column : 3
    <cd018>   DW_AT_type        : <0xccff2>
 <1><cd01c>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd01d>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <cd021>   DW_AT_decl_file   : 9
    <cd021>   DW_AT_decl_line   : 296
    <cd023>   DW_AT_decl_column : 29
    <cd024>   DW_AT_type        : <0xcd028>
 <1><cd028>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd029>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <cd02d>   DW_AT_byte_size   : 232
    <cd02e>   DW_AT_decl_file   : 9
    <cd02e>   DW_AT_decl_line   : 297
    <cd030>   DW_AT_decl_column : 8
    <cd030>   DW_AT_sibling     : <0xcd230>
 <2><cd034>: Abbrev Number: 1 (DW_TAG_member)
    <cd035>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <cd039>   DW_AT_decl_file   : 9
    <cd039>   DW_AT_decl_line   : 299
    <cd03b>   DW_AT_decl_column : 22
    <cd03c>   DW_AT_type        : <0xccfb6>
    <cd040>   DW_AT_data_member_location: 0
 <2><cd041>: Abbrev Number: 1 (DW_TAG_member)
    <cd042>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <cd046>   DW_AT_decl_file   : 9
    <cd046>   DW_AT_decl_line   : 300
    <cd048>   DW_AT_decl_column : 22
    <cd049>   DW_AT_type        : <0xccfb6>
    <cd04d>   DW_AT_data_member_location: 12
 <2><cd04e>: Abbrev Number: 1 (DW_TAG_member)
    <cd04f>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <cd053>   DW_AT_decl_file   : 9
    <cd053>   DW_AT_decl_line   : 301
    <cd055>   DW_AT_decl_column : 22
    <cd056>   DW_AT_type        : <0xccd36>
    <cd05a>   DW_AT_data_member_location: 24
 <2><cd05b>: Abbrev Number: 1 (DW_TAG_member)
    <cd05c>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <cd060>   DW_AT_decl_file   : 9
    <cd060>   DW_AT_decl_line   : 303
    <cd062>   DW_AT_decl_column : 22
    <cd063>   DW_AT_type        : <0xccd3d>
    <cd067>   DW_AT_data_member_location: 28
 <2><cd068>: Abbrev Number: 1 (DW_TAG_member)
    <cd069>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <cd06d>   DW_AT_decl_file   : 9
    <cd06d>   DW_AT_decl_line   : 305
    <cd06f>   DW_AT_decl_column : 22
    <cd070>   DW_AT_type        : <0xccd6a>
    <cd074>   DW_AT_data_member_location: 32
 <2><cd075>: Abbrev Number: 1 (DW_TAG_member)
    <cd076>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <cd07a>   DW_AT_decl_file   : 9
    <cd07a>   DW_AT_decl_line   : 307
    <cd07c>   DW_AT_decl_column : 22
    <cd07d>   DW_AT_type        : <0xccd3d>
    <cd081>   DW_AT_data_member_location: 36
 <2><cd082>: Abbrev Number: 1 (DW_TAG_member)
    <cd083>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <cd087>   DW_AT_decl_file   : 9
    <cd087>   DW_AT_decl_line   : 308
    <cd089>   DW_AT_decl_column : 22
    <cd08a>   DW_AT_type        : <0xccd3d>
    <cd08e>   DW_AT_data_member_location: 37
 <2><cd08f>: Abbrev Number: 1 (DW_TAG_member)
    <cd090>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <cd094>   DW_AT_decl_file   : 9
    <cd094>   DW_AT_decl_line   : 310
    <cd096>   DW_AT_decl_column : 22
    <cd097>   DW_AT_type        : <0xccd3d>
    <cd09b>   DW_AT_data_member_location: 38
 <2><cd09c>: Abbrev Number: 1 (DW_TAG_member)
    <cd09d>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <cd0a1>   DW_AT_decl_file   : 9
    <cd0a1>   DW_AT_decl_line   : 311
    <cd0a3>   DW_AT_decl_column : 22
    <cd0a4>   DW_AT_type        : <0xccd3d>
    <cd0a8>   DW_AT_data_member_location: 39
 <2><cd0a9>: Abbrev Number: 1 (DW_TAG_member)
    <cd0aa>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <cd0ae>   DW_AT_decl_file   : 9
    <cd0ae>   DW_AT_decl_line   : 313
    <cd0b0>   DW_AT_decl_column : 22
    <cd0b1>   DW_AT_type        : <0xccd6a>
    <cd0b5>   DW_AT_data_member_location: 40
 <2><cd0b6>: Abbrev Number: 1 (DW_TAG_member)
    <cd0b7>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <cd0bb>   DW_AT_decl_file   : 9
    <cd0bb>   DW_AT_decl_line   : 314
    <cd0bd>   DW_AT_decl_column : 22
    <cd0be>   DW_AT_type        : <0xccd6a>
    <cd0c2>   DW_AT_data_member_location: 44
 <2><cd0c3>: Abbrev Number: 1 (DW_TAG_member)
    <cd0c4>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <cd0c8>   DW_AT_decl_file   : 9
    <cd0c8>   DW_AT_decl_line   : 316
    <cd0ca>   DW_AT_decl_column : 22
    <cd0cb>   DW_AT_type        : <0xccd78>
    <cd0cf>   DW_AT_data_member_location: 48
 <2><cd0d0>: Abbrev Number: 1 (DW_TAG_member)
    <cd0d1>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <cd0d5>   DW_AT_decl_file   : 9
    <cd0d5>   DW_AT_decl_line   : 317
    <cd0d7>   DW_AT_decl_column : 22
    <cd0d8>   DW_AT_type        : <0xccd78>
    <cd0dc>   DW_AT_data_member_location: 52
 <2><cd0dd>: Abbrev Number: 1 (DW_TAG_member)
    <cd0de>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <cd0e2>   DW_AT_decl_file   : 9
    <cd0e2>   DW_AT_decl_line   : 318
    <cd0e4>   DW_AT_decl_column : 22
    <cd0e5>   DW_AT_type        : <0xccd78>
    <cd0e9>   DW_AT_data_member_location: 56
 <2><cd0ea>: Abbrev Number: 1 (DW_TAG_member)
    <cd0eb>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <cd0ef>   DW_AT_decl_file   : 9
    <cd0ef>   DW_AT_decl_line   : 320
    <cd0f1>   DW_AT_decl_column : 22
    <cd0f2>   DW_AT_type        : <0xccd92>
    <cd0f6>   DW_AT_data_member_location: 64
 <2><cd0f7>: Abbrev Number: 1 (DW_TAG_member)
    <cd0f8>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <cd0fc>   DW_AT_decl_file   : 9
    <cd0fc>   DW_AT_decl_line   : 321
    <cd0fe>   DW_AT_decl_column : 22
    <cd0ff>   DW_AT_type        : <0xccf50>
    <cd103>   DW_AT_data_member_location: 72
 <2><cd104>: Abbrev Number: 1 (DW_TAG_member)
    <cd105>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <cd109>   DW_AT_decl_file   : 9
    <cd109>   DW_AT_decl_line   : 322
    <cd10b>   DW_AT_decl_column : 22
    <cd10c>   DW_AT_type        : <0xccf50>
    <cd110>   DW_AT_data_member_location: 88
 <2><cd111>: Abbrev Number: 1 (DW_TAG_member)
    <cd112>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <cd116>   DW_AT_decl_file   : 9
    <cd116>   DW_AT_decl_line   : 324
    <cd118>   DW_AT_decl_column : 22
    <cd119>   DW_AT_type        : <0xcceee>
    <cd11d>   DW_AT_data_member_location: 104
 <2><cd11e>: Abbrev Number: 1 (DW_TAG_member)
    <cd11f>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <cd123>   DW_AT_decl_file   : 9
    <cd123>   DW_AT_decl_line   : 326
    <cd125>   DW_AT_decl_column : 22
    <cd126>   DW_AT_type        : <0xccd6a>
    <cd12a>   DW_AT_data_member_location: 112
 <2><cd12b>: Abbrev Number: 1 (DW_TAG_member)
    <cd12c>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <cd130>   DW_AT_decl_file   : 9
    <cd130>   DW_AT_decl_line   : 327
    <cd132>   DW_AT_decl_column : 22
    <cd133>   DW_AT_type        : <0xccefa>
    <cd137>   DW_AT_data_member_location: 120
 <2><cd138>: Abbrev Number: 1 (DW_TAG_member)
    <cd139>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <cd13d>   DW_AT_decl_file   : 9
    <cd13d>   DW_AT_decl_line   : 328
    <cd13f>   DW_AT_decl_column : 22
    <cd140>   DW_AT_type        : <0xccf06>
    <cd144>   DW_AT_data_member_location: 128
 <2><cd145>: Abbrev Number: 1 (DW_TAG_member)
    <cd146>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <cd14a>   DW_AT_decl_file   : 9
    <cd14a>   DW_AT_decl_line   : 330
    <cd14c>   DW_AT_decl_column : 22
    <cd14d>   DW_AT_type        : <0xccfb6>
    <cd151>   DW_AT_data_member_location: 136
 <2><cd152>: Abbrev Number: 1 (DW_TAG_member)
    <cd153>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <cd157>   DW_AT_decl_file   : 9
    <cd157>   DW_AT_decl_line   : 331
    <cd159>   DW_AT_decl_column : 22
    <cd15a>   DW_AT_type        : <0xccd6a>
    <cd15e>   DW_AT_data_member_location: 148
 <2><cd15f>: Abbrev Number: 1 (DW_TAG_member)
    <cd160>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <cd164>   DW_AT_decl_file   : 9
    <cd164>   DW_AT_decl_line   : 332
    <cd166>   DW_AT_decl_column : 22
    <cd167>   DW_AT_type        : <0xccd6a>
    <cd16b>   DW_AT_data_member_location: 152
 <2><cd16c>: Abbrev Number: 1 (DW_TAG_member)
    <cd16d>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <cd171>   DW_AT_decl_file   : 9
    <cd171>   DW_AT_decl_line   : 334
    <cd173>   DW_AT_decl_column : 22
    <cd174>   DW_AT_type        : <0xccd6a>
    <cd178>   DW_AT_data_member_location: 156
 <2><cd179>: Abbrev Number: 1 (DW_TAG_member)
    <cd17a>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <cd17e>   DW_AT_decl_file   : 9
    <cd17e>   DW_AT_decl_line   : 336
    <cd180>   DW_AT_decl_column : 22
    <cd181>   DW_AT_type        : <0xcd010>
    <cd185>   DW_AT_data_member_location: 160
 <2><cd186>: Abbrev Number: 1 (DW_TAG_member)
    <cd187>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <cd18b>   DW_AT_decl_file   : 9
    <cd18b>   DW_AT_decl_line   : 337
    <cd18d>   DW_AT_decl_column : 22
    <cd18e>   DW_AT_type        : <0xccdbe>
    <cd192>   DW_AT_data_member_location: 168
 <2><cd193>: Abbrev Number: 1 (DW_TAG_member)
    <cd194>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <cd198>   DW_AT_decl_file   : 9
    <cd198>   DW_AT_decl_line   : 338
    <cd19a>   DW_AT_decl_column : 22
    <cd19b>   DW_AT_type        : <0xccd3d>
    <cd19f>   DW_AT_data_member_location: 176
 <2><cd1a0>: Abbrev Number: 1 (DW_TAG_member)
    <cd1a1>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <cd1a5>   DW_AT_decl_file   : 9
    <cd1a5>   DW_AT_decl_line   : 339
    <cd1a7>   DW_AT_decl_column : 22
    <cd1a8>   DW_AT_type        : <0xccd6a>
    <cd1ac>   DW_AT_data_member_location: 180
 <2><cd1ad>: Abbrev Number: 1 (DW_TAG_member)
    <cd1ae>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <cd1b2>   DW_AT_decl_file   : 9
    <cd1b2>   DW_AT_decl_line   : 340
    <cd1b4>   DW_AT_decl_column : 22
    <cd1b5>   DW_AT_type        : <0xccd3d>
    <cd1b9>   DW_AT_data_member_location: 184
 <2><cd1ba>: Abbrev Number: 1 (DW_TAG_member)
    <cd1bb>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <cd1bf>   DW_AT_decl_file   : 9
    <cd1bf>   DW_AT_decl_line   : 342
    <cd1c1>   DW_AT_decl_column : 19
    <cd1c2>   DW_AT_type        : <0xccd6a>
    <cd1c6>   DW_AT_data_member_location: 188
 <2><cd1c7>: Abbrev Number: 1 (DW_TAG_member)
    <cd1c8>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <cd1cc>   DW_AT_decl_file   : 9
    <cd1cc>   DW_AT_decl_line   : 344
    <cd1ce>   DW_AT_decl_column : 22
    <cd1cf>   DW_AT_type        : <0xccd6a>
    <cd1d3>   DW_AT_data_member_location: 192
 <2><cd1d4>: Abbrev Number: 1 (DW_TAG_member)
    <cd1d5>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <cd1d9>   DW_AT_decl_file   : 9
    <cd1d9>   DW_AT_decl_line   : 345
    <cd1db>   DW_AT_decl_column : 22
    <cd1dc>   DW_AT_type        : <0xccd6a>
    <cd1e0>   DW_AT_data_member_location: 196
 <2><cd1e1>: Abbrev Number: 1 (DW_TAG_member)
    <cd1e2>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <cd1e6>   DW_AT_decl_file   : 9
    <cd1e6>   DW_AT_decl_line   : 347
    <cd1e8>   DW_AT_decl_column : 22
    <cd1e9>   DW_AT_type        : <0xccd6a>
    <cd1ed>   DW_AT_data_member_location: 200
 <2><cd1ee>: Abbrev Number: 1 (DW_TAG_member)
    <cd1ef>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <cd1f3>   DW_AT_decl_file   : 9
    <cd1f3>   DW_AT_decl_line   : 348
    <cd1f5>   DW_AT_decl_column : 22
    <cd1f6>   DW_AT_type        : <0xccd6a>
    <cd1fa>   DW_AT_data_member_location: 204
 <2><cd1fb>: Abbrev Number: 1 (DW_TAG_member)
    <cd1fc>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <cd200>   DW_AT_decl_file   : 9
    <cd200>   DW_AT_decl_line   : 349
    <cd202>   DW_AT_decl_column : 22
    <cd203>   DW_AT_type        : <0xccd6a>
    <cd207>   DW_AT_data_member_location: 208
 <2><cd208>: Abbrev Number: 1 (DW_TAG_member)
    <cd209>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <cd20d>   DW_AT_decl_file   : 9
    <cd20d>   DW_AT_decl_line   : 350
    <cd20f>   DW_AT_decl_column : 22
    <cd210>   DW_AT_type        : <0xccd6a>
    <cd214>   DW_AT_data_member_location: 212
 <2><cd215>: Abbrev Number: 1 (DW_TAG_member)
    <cd216>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <cd21a>   DW_AT_decl_file   : 9
    <cd21a>   DW_AT_decl_line   : 351
    <cd21c>   DW_AT_decl_column : 22
    <cd21d>   DW_AT_type        : <0xccf1e>
    <cd221>   DW_AT_data_member_location: 216
 <2><cd222>: Abbrev Number: 1 (DW_TAG_member)
    <cd223>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <cd227>   DW_AT_decl_file   : 9
    <cd227>   DW_AT_decl_line   : 352
    <cd229>   DW_AT_decl_column : 22
    <cd22a>   DW_AT_type        : <0xccf44>
    <cd22e>   DW_AT_data_member_location: 224
 <2><cd22f>: Abbrev Number: 0
 <1><cd230>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd231>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <cd235>   DW_AT_decl_file   : 9
    <cd235>   DW_AT_decl_line   : 419
    <cd237>   DW_AT_decl_column : 20
    <cd238>   DW_AT_type        : <0xcce4e>
 <1><cd23c>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd23d>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <cd241>   DW_AT_decl_file   : 9
    <cd241>   DW_AT_decl_line   : 420
    <cd243>   DW_AT_decl_column : 20
    <cd244>   DW_AT_type        : <0xcce61>
 <1><cd248>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd249>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <cd24d>   DW_AT_decl_file   : 9
    <cd24d>   DW_AT_decl_line   : 433
    <cd24f>   DW_AT_decl_column : 31
    <cd250>   DW_AT_type        : <0xcd254>
 <1><cd254>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd255>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <cd259>   DW_AT_byte_size   : 32
    <cd25a>   DW_AT_decl_file   : 9
    <cd25a>   DW_AT_decl_line   : 434
    <cd25c>   DW_AT_decl_column : 8
    <cd25c>   DW_AT_sibling     : <0xcd295>
 <2><cd260>: Abbrev Number: 1 (DW_TAG_member)
    <cd261>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <cd265>   DW_AT_decl_file   : 9
    <cd265>   DW_AT_decl_line   : 436
    <cd267>   DW_AT_decl_column : 27
    <cd268>   DW_AT_type        : <0xcd230>
    <cd26c>   DW_AT_data_member_location: 0
 <2><cd26d>: Abbrev Number: 1 (DW_TAG_member)
    <cd26e>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <cd272>   DW_AT_decl_file   : 9
    <cd272>   DW_AT_decl_line   : 437
    <cd274>   DW_AT_decl_column : 27
    <cd275>   DW_AT_type        : <0xcd23c>
    <cd279>   DW_AT_data_member_location: 8
 <2><cd27a>: Abbrev Number: 1 (DW_TAG_member)
    <cd27b>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <cd27f>   DW_AT_decl_file   : 9
    <cd27f>   DW_AT_decl_line   : 440
    <cd281>   DW_AT_decl_column : 21
    <cd282>   DW_AT_type        : <0xcce8d>
    <cd286>   DW_AT_data_member_location: 16
 <2><cd287>: Abbrev Number: 1 (DW_TAG_member)
    <cd288>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <cd28c>   DW_AT_decl_file   : 9
    <cd28c>   DW_AT_decl_line   : 445
    <cd28e>   DW_AT_decl_column : 21
    <cd28f>   DW_AT_type        : <0xccd6a>
    <cd293>   DW_AT_data_member_location: 24
 <2><cd294>: Abbrev Number: 0
 <1><cd295>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd296>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <cd29a>   DW_AT_decl_file   : 9
    <cd29a>   DW_AT_decl_line   : 449
    <cd29c>   DW_AT_decl_column : 35
    <cd29d>   DW_AT_type        : <0xcd2a1>
 <1><cd2a1>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd2a2>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <cd2a6>   DW_AT_byte_size   : 56
    <cd2a7>   DW_AT_decl_file   : 9
    <cd2a7>   DW_AT_decl_line   : 450
    <cd2a9>   DW_AT_decl_column : 8
    <cd2a9>   DW_AT_sibling     : <0xcd371>
 <2><cd2ad>: Abbrev Number: 1 (DW_TAG_member)
    <cd2ae>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <cd2b2>   DW_AT_decl_file   : 9
    <cd2b2>   DW_AT_decl_line   : 453
    <cd2b4>   DW_AT_decl_column : 21
    <cd2b5>   DW_AT_type        : <0xccd6a>
    <cd2b9>   DW_AT_data_member_location: 0
 <2><cd2ba>: Abbrev Number: 1 (DW_TAG_member)
    <cd2bb>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <cd2bf>   DW_AT_decl_file   : 9
    <cd2bf>   DW_AT_decl_line   : 454
    <cd2c1>   DW_AT_decl_column : 21
    <cd2c2>   DW_AT_type        : <0xccd6a>
    <cd2c6>   DW_AT_data_member_location: 4
 <2><cd2c7>: Abbrev Number: 1 (DW_TAG_member)
    <cd2c8>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <cd2cc>   DW_AT_decl_file   : 9
    <cd2cc>   DW_AT_decl_line   : 456
    <cd2ce>   DW_AT_decl_column : 21
    <cd2cf>   DW_AT_type        : <0xccd6a>
    <cd2d3>   DW_AT_data_member_location: 8
 <2><cd2d4>: Abbrev Number: 1 (DW_TAG_member)
    <cd2d5>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <cd2d9>   DW_AT_decl_file   : 9
    <cd2d9>   DW_AT_decl_line   : 457
    <cd2db>   DW_AT_decl_column : 21
    <cd2dc>   DW_AT_type        : <0xccd6a>
    <cd2e0>   DW_AT_data_member_location: 12
 <2><cd2e1>: Abbrev Number: 1 (DW_TAG_member)
    <cd2e2>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <cd2e6>   DW_AT_decl_file   : 9
    <cd2e6>   DW_AT_decl_line   : 463
    <cd2e8>   DW_AT_decl_column : 21
    <cd2e9>   DW_AT_type        : <0xccd3d>
    <cd2ed>   DW_AT_data_member_location: 16
 <2><cd2ee>: Abbrev Number: 1 (DW_TAG_member)
    <cd2ef>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <cd2f3>   DW_AT_decl_file   : 9
    <cd2f3>   DW_AT_decl_line   : 464
    <cd2f5>   DW_AT_decl_column : 21
    <cd2f6>   DW_AT_type        : <0xccd3d>
    <cd2fa>   DW_AT_data_member_location: 17
 <2><cd2fb>: Abbrev Number: 1 (DW_TAG_member)
    <cd2fc>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <cd300>   DW_AT_decl_file   : 9
    <cd300>   DW_AT_decl_line   : 466
    <cd302>   DW_AT_decl_column : 21
    <cd303>   DW_AT_type        : <0xccd6a>
    <cd307>   DW_AT_data_member_location: 20
 <2><cd308>: Abbrev Number: 1 (DW_TAG_member)
    <cd309>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <cd30d>   DW_AT_decl_file   : 9
    <cd30d>   DW_AT_decl_line   : 468
    <cd30f>   DW_AT_decl_column : 21
    <cd310>   DW_AT_type        : <0xccd99>
    <cd314>   DW_AT_data_member_location: 24
 <2><cd315>: Abbrev Number: 1 (DW_TAG_member)
    <cd316>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <cd31a>   DW_AT_decl_file   : 9
    <cd31a>   DW_AT_decl_line   : 469
    <cd31c>   DW_AT_decl_column : 21
    <cd31d>   DW_AT_type        : <0xccd99>
    <cd321>   DW_AT_data_member_location: 32
 <2><cd322>: Abbrev Number: 1 (DW_TAG_member)
    <cd323>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <cd327>   DW_AT_decl_file   : 9
    <cd327>   DW_AT_decl_line   : 471
    <cd329>   DW_AT_decl_column : 21
    <cd32a>   DW_AT_type        : <0xccd6a>
    <cd32e>   DW_AT_data_member_location: 40
 <2><cd32f>: Abbrev Number: 1 (DW_TAG_member)
    <cd330>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <cd334>   DW_AT_decl_file   : 9
    <cd334>   DW_AT_decl_line   : 471
    <cd336>   DW_AT_decl_column : 29
    <cd337>   DW_AT_type        : <0xccd6a>
    <cd33b>   DW_AT_data_member_location: 44
 <2><cd33c>: Abbrev Number: 1 (DW_TAG_member)
    <cd33d>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <cd341>   DW_AT_decl_file   : 9
    <cd341>   DW_AT_decl_line   : 473
    <cd343>   DW_AT_decl_column : 21
    <cd344>   DW_AT_type        : <0xccd3d>
    <cd348>   DW_AT_data_member_location: 48
 <2><cd349>: Abbrev Number: 1 (DW_TAG_member)
    <cd34a>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <cd34e>   DW_AT_decl_file   : 9
    <cd34e>   DW_AT_decl_line   : 474
    <cd350>   DW_AT_decl_column : 21
    <cd351>   DW_AT_type        : <0xccd3d>
    <cd355>   DW_AT_data_member_location: 49
 <2><cd356>: Abbrev Number: 1 (DW_TAG_member)
    <cd357>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <cd35b>   DW_AT_decl_file   : 9
    <cd35b>   DW_AT_decl_line   : 476
    <cd35d>   DW_AT_decl_column : 21
    <cd35e>   DW_AT_type        : <0xccd3d>
    <cd362>   DW_AT_data_member_location: 50
 <2><cd363>: Abbrev Number: 1 (DW_TAG_member)
    <cd364>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <cd368>   DW_AT_decl_file   : 9
    <cd368>   DW_AT_decl_line   : 478
    <cd36a>   DW_AT_decl_column : 21
    <cd36b>   DW_AT_type        : <0xccd3d>
    <cd36f>   DW_AT_data_member_location: 51
 <2><cd370>: Abbrev Number: 0
 <1><cd371>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd372>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <cd376>   DW_AT_decl_file   : 9
    <cd376>   DW_AT_decl_line   : 487
    <cd378>   DW_AT_decl_column : 16
    <cd379>   DW_AT_type        : <0xcce01>
 <1><cd37d>: Abbrev Number: 36 (DW_TAG_enumeration_type)
    <cd37e>   DW_AT_encoding    : 7	(void)
    <cd37e>   DW_AT_byte_size   : 4
    <cd37e>   DW_AT_type        : <0xccd36>
    <cd382>   DW_AT_decl_file   : 9
    <cd382>   DW_AT_decl_line   : 587
    <cd384>   DW_AT_decl_column : 1
    <cd384>   DW_AT_sibling     : <0xcd437>
 <2><cd388>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd389>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <cd38d>   DW_AT_const_value : 0
 <2><cd38e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd38f>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <cd393>   DW_AT_const_value : 1
 <2><cd394>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd395>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <cd399>   DW_AT_const_value : 2
 <2><cd39a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd39b>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <cd39f>   DW_AT_const_value : 3
 <2><cd3a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3a1>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <cd3a5>   DW_AT_const_value : 4
 <2><cd3a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3a7>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <cd3ab>   DW_AT_const_value : 5
 <2><cd3ac>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3ad>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <cd3b1>   DW_AT_const_value : 6
 <2><cd3b2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3b3>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <cd3b7>   DW_AT_const_value : 7
 <2><cd3b8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3b9>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <cd3bd>   DW_AT_const_value : 8
 <2><cd3be>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3bf>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <cd3c3>   DW_AT_const_value : 9
 <2><cd3c4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3c5>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <cd3c9>   DW_AT_const_value : 10
 <2><cd3ca>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3cb>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <cd3cf>   DW_AT_const_value : 11
 <2><cd3d0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3d1>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <cd3d5>   DW_AT_const_value : 12
 <2><cd3d6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3d7>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <cd3db>   DW_AT_const_value : 13
 <2><cd3dc>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3dd>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <cd3e1>   DW_AT_const_value : 14
 <2><cd3e2>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3e3>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <cd3e7>   DW_AT_const_value : 15
 <2><cd3e8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3e9>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <cd3ed>   DW_AT_const_value : 16
 <2><cd3ee>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3ef>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <cd3f3>   DW_AT_const_value : 17
 <2><cd3f4>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3f5>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <cd3f9>   DW_AT_const_value : 18
 <2><cd3fa>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd3fb>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <cd3ff>   DW_AT_const_value : 19
 <2><cd400>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd401>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <cd405>   DW_AT_const_value : 20
 <2><cd406>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd407>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <cd40b>   DW_AT_const_value : 21
 <2><cd40c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd40d>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <cd411>   DW_AT_const_value : 22
 <2><cd412>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd413>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <cd417>   DW_AT_const_value : 23
 <2><cd418>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd419>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <cd41d>   DW_AT_const_value : 24
 <2><cd41e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd41f>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <cd423>   DW_AT_const_value : 25
 <2><cd424>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd425>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <cd429>   DW_AT_const_value : 26
 <2><cd42a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd42b>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <cd42f>   DW_AT_const_value : 27
 <2><cd430>: Abbrev Number: 4 (DW_TAG_enumerator)
    <cd431>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <cd435>   DW_AT_const_value : 28
 <2><cd436>: Abbrev Number: 0
 <1><cd437>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd438>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <cd43c>   DW_AT_decl_file   : 9
    <cd43c>   DW_AT_decl_line   : 634
    <cd43e>   DW_AT_decl_column : 30
    <cd43f>   DW_AT_type        : <0xcd443>
 <1><cd443>: Abbrev Number: 54 (DW_TAG_structure_type)
    <cd444>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <cd448>   DW_AT_byte_size   : 408
    <cd44a>   DW_AT_decl_file   : 9
    <cd44b>   DW_AT_decl_line   : 673
    <cd44d>   DW_AT_decl_column : 8
    <cd44e>   DW_AT_sibling     : <0xcd4e7>
 <2><cd452>: Abbrev Number: 1 (DW_TAG_member)
    <cd453>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <cd457>   DW_AT_decl_file   : 9
    <cd457>   DW_AT_decl_line   : 675
    <cd459>   DW_AT_decl_column : 25
    <cd45a>   DW_AT_type        : <0xccf83>
    <cd45e>   DW_AT_data_member_location: 0
 <2><cd45f>: Abbrev Number: 14 (DW_TAG_member)
    <cd460>   DW_AT_name        : ID
    <cd463>   DW_AT_decl_file   : 9
    <cd463>   DW_AT_decl_line   : 676
    <cd465>   DW_AT_decl_column : 25
    <cd466>   DW_AT_type        : <0xccd6a>
    <cd46a>   DW_AT_data_member_location: 16
 <2><cd46b>: Abbrev Number: 1 (DW_TAG_member)
    <cd46c>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <cd470>   DW_AT_decl_file   : 9
    <cd470>   DW_AT_decl_line   : 678
    <cd472>   DW_AT_decl_column : 25
    <cd473>   DW_AT_type        : <0xcd248>
    <cd477>   DW_AT_data_member_location: 24
 <2><cd478>: Abbrev Number: 1 (DW_TAG_member)
    <cd479>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <cd47d>   DW_AT_decl_file   : 9
    <cd47d>   DW_AT_decl_line   : 679
    <cd47f>   DW_AT_decl_column : 25
    <cd480>   DW_AT_type        : <0xcd295>
    <cd484>   DW_AT_data_member_location: 56
 <2><cd485>: Abbrev Number: 1 (DW_TAG_member)
    <cd486>   DW_AT_name        : (indirect string, offset: 0x900ce): CallBacks
    <cd48a>   DW_AT_decl_file   : 9
    <cd48a>   DW_AT_decl_line   : 680
    <cd48c>   DW_AT_decl_column : 25
    <cd48d>   DW_AT_type        : <0xcd633>
    <cd491>   DW_AT_data_member_location: 112
 <2><cd492>: Abbrev Number: 16 (DW_TAG_member)
    <cd493>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <cd497>   DW_AT_decl_file   : 9
    <cd497>   DW_AT_decl_line   : 681
    <cd499>   DW_AT_decl_column : 25
    <cd49a>   DW_AT_type        : <0xccdb0>
    <cd49e>   DW_AT_data_member_location: 336
 <2><cd4a0>: Abbrev Number: 16 (DW_TAG_member)
    <cd4a1>   DW_AT_name        : (indirect string, offset: 0x8df1d): Menu
    <cd4a5>   DW_AT_decl_file   : 9
    <cd4a5>   DW_AT_decl_line   : 683
    <cd4a7>   DW_AT_decl_column : 21
    <cd4a8>   DW_AT_type        : <0xcd643>
    <cd4ac>   DW_AT_data_member_location: 344
 <2><cd4ae>: Abbrev Number: 16 (DW_TAG_member)
    <cd4af>   DW_AT_name        : (indirect string, offset: 0x8f46f): ActiveMenu
    <cd4b3>   DW_AT_decl_file   : 9
    <cd4b3>   DW_AT_decl_line   : 684
    <cd4b5>   DW_AT_decl_column : 21
    <cd4b6>   DW_AT_type        : <0xcd62e>
    <cd4ba>   DW_AT_data_member_location: 368
 <2><cd4bc>: Abbrev Number: 16 (DW_TAG_member)
    <cd4bd>   DW_AT_name        : (indirect string, offset: 0x8e0e5): Parent
    <cd4c1>   DW_AT_decl_file   : 9
    <cd4c1>   DW_AT_decl_line   : 686
    <cd4c3>   DW_AT_decl_column : 25
    <cd4c4>   DW_AT_type        : <0xcd629>
    <cd4c8>   DW_AT_data_member_location: 376
 <2><cd4ca>: Abbrev Number: 16 (DW_TAG_member)
    <cd4cb>   DW_AT_name        : (indirect string, offset: 0x8dfdc): Children
    <cd4cf>   DW_AT_decl_file   : 9
    <cd4cf>   DW_AT_decl_line   : 687
    <cd4d1>   DW_AT_decl_column : 25
    <cd4d2>   DW_AT_type        : <0xccf50>
    <cd4d6>   DW_AT_data_member_location: 384
 <2><cd4d8>: Abbrev Number: 16 (DW_TAG_member)
    <cd4d9>   DW_AT_name        : (indirect string, offset: 0x8e06d): IsMenu
    <cd4dd>   DW_AT_decl_file   : 9
    <cd4dd>   DW_AT_decl_line   : 689
    <cd4df>   DW_AT_decl_column : 25
    <cd4e0>   DW_AT_type        : <0xccd3d>
    <cd4e4>   DW_AT_data_member_location: 400
 <2><cd4e6>: Abbrev Number: 0
 <1><cd4e7>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd4e8>   DW_AT_name        : (indirect string, offset: 0x8e762): SFG_MenuEntry
    <cd4ec>   DW_AT_decl_file   : 9
    <cd4ec>   DW_AT_decl_line   : 635
    <cd4ee>   DW_AT_decl_column : 33
    <cd4ef>   DW_AT_type        : <0xcd4f3>
 <1><cd4f3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd4f4>   DW_AT_name        : (indirect string, offset: 0x8e75f): tagSFG_MenuEntry
    <cd4f8>   DW_AT_byte_size   : 48
    <cd4f9>   DW_AT_decl_file   : 9
    <cd4f9>   DW_AT_decl_line   : 656
    <cd4fb>   DW_AT_decl_column : 8
    <cd4fb>   DW_AT_sibling     : <0xcd55a>
 <2><cd4ff>: Abbrev Number: 1 (DW_TAG_member)
    <cd500>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <cd504>   DW_AT_decl_file   : 9
    <cd504>   DW_AT_decl_line   : 658
    <cd506>   DW_AT_decl_column : 25
    <cd507>   DW_AT_type        : <0xccf83>
    <cd50b>   DW_AT_data_member_location: 0
 <2><cd50c>: Abbrev Number: 14 (DW_TAG_member)
    <cd50d>   DW_AT_name        : ID
    <cd510>   DW_AT_decl_file   : 9
    <cd510>   DW_AT_decl_line   : 659
    <cd512>   DW_AT_decl_column : 25
    <cd513>   DW_AT_type        : <0xccd6a>
    <cd517>   DW_AT_data_member_location: 16
 <2><cd518>: Abbrev Number: 1 (DW_TAG_member)
    <cd519>   DW_AT_name        : (indirect string, offset: 0x8e00a): Ordinal
    <cd51d>   DW_AT_decl_file   : 9
    <cd51d>   DW_AT_decl_line   : 660
    <cd51f>   DW_AT_decl_column : 25
    <cd520>   DW_AT_type        : <0xccd6a>
    <cd524>   DW_AT_data_member_location: 20
 <2><cd525>: Abbrev Number: 1 (DW_TAG_member)
    <cd526>   DW_AT_name        : (indirect string, offset: 0x8fc1b): Text
    <cd52a>   DW_AT_decl_file   : 9
    <cd52a>   DW_AT_decl_line   : 661
    <cd52c>   DW_AT_decl_column : 25
    <cd52d>   DW_AT_type        : <0xccdbe>
    <cd531>   DW_AT_data_member_location: 24
 <2><cd532>: Abbrev Number: 1 (DW_TAG_member)
    <cd533>   DW_AT_name        : (indirect string, offset: 0x8f9db): SubMenu
    <cd537>   DW_AT_decl_file   : 9
    <cd537>   DW_AT_decl_line   : 662
    <cd539>   DW_AT_decl_column : 25
    <cd53a>   DW_AT_type        : <0xcd62e>
    <cd53e>   DW_AT_data_member_location: 32
 <2><cd53f>: Abbrev Number: 1 (DW_TAG_member)
    <cd540>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <cd544>   DW_AT_decl_file   : 9
    <cd544>   DW_AT_decl_line   : 663
    <cd546>   DW_AT_decl_column : 25
    <cd547>   DW_AT_type        : <0xccd3d>
    <cd54b>   DW_AT_data_member_location: 40
 <2><cd54c>: Abbrev Number: 1 (DW_TAG_member)
    <cd54d>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <cd551>   DW_AT_decl_file   : 9
    <cd551>   DW_AT_decl_line   : 664
    <cd553>   DW_AT_decl_column : 25
    <cd554>   DW_AT_type        : <0xccd6a>
    <cd558>   DW_AT_data_member_location: 44
 <2><cd559>: Abbrev Number: 0
 <1><cd55a>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd55b>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <cd55f>   DW_AT_decl_file   : 9
    <cd55f>   DW_AT_decl_line   : 636
    <cd561>   DW_AT_decl_column : 28
    <cd562>   DW_AT_type        : <0xcd566>
 <1><cd566>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd567>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <cd56b>   DW_AT_byte_size   : 112
    <cd56c>   DW_AT_decl_file   : 9
    <cd56c>   DW_AT_decl_line   : 637
    <cd56e>   DW_AT_decl_column : 8
    <cd56e>   DW_AT_sibling     : <0xcd624>
 <2><cd572>: Abbrev Number: 1 (DW_TAG_member)
    <cd573>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <cd577>   DW_AT_decl_file   : 9
    <cd577>   DW_AT_decl_line   : 639
    <cd579>   DW_AT_decl_column : 25
    <cd57a>   DW_AT_type        : <0xccf83>
    <cd57e>   DW_AT_data_member_location: 0
 <2><cd57f>: Abbrev Number: 1 (DW_TAG_member)
    <cd580>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <cd584>   DW_AT_decl_file   : 9
    <cd584>   DW_AT_decl_line   : 640
    <cd586>   DW_AT_decl_column : 25
    <cd587>   DW_AT_type        : <0xccdb0>
    <cd58b>   DW_AT_data_member_location: 16
 <2><cd58c>: Abbrev Number: 14 (DW_TAG_member)
    <cd58d>   DW_AT_name        : ID
    <cd590>   DW_AT_decl_file   : 9
    <cd590>   DW_AT_decl_line   : 641
    <cd592>   DW_AT_decl_column : 25
    <cd593>   DW_AT_type        : <0xccd6a>
    <cd597>   DW_AT_data_member_location: 24
 <2><cd598>: Abbrev Number: 1 (DW_TAG_member)
    <cd599>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <cd59d>   DW_AT_decl_file   : 9
    <cd59d>   DW_AT_decl_line   : 642
    <cd59f>   DW_AT_decl_column : 25
    <cd5a0>   DW_AT_type        : <0xccf50>
    <cd5a4>   DW_AT_data_member_location: 32
 <2><cd5a5>: Abbrev Number: 1 (DW_TAG_member)
    <cd5a6>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <cd5aa>   DW_AT_decl_file   : 9
    <cd5aa>   DW_AT_decl_line   : 643
    <cd5ac>   DW_AT_decl_column : 25
    <cd5ad>   DW_AT_type        : <0xccf12>
    <cd5b1>   DW_AT_data_member_location: 48
 <2><cd5b2>: Abbrev Number: 1 (DW_TAG_member)
    <cd5b3>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <cd5b7>   DW_AT_decl_file   : 9
    <cd5b7>   DW_AT_decl_line   : 644
    <cd5b9>   DW_AT_decl_column : 25
    <cd5ba>   DW_AT_type        : <0xccee2>
    <cd5be>   DW_AT_data_member_location: 56
 <2><cd5bf>: Abbrev Number: 1 (DW_TAG_member)
    <cd5c0>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <cd5c4>   DW_AT_decl_file   : 9
    <cd5c4>   DW_AT_decl_line   : 645
    <cd5c6>   DW_AT_decl_column : 25
    <cd5c7>   DW_AT_type        : <0xccd3d>
    <cd5cb>   DW_AT_data_member_location: 64
 <2><cd5cc>: Abbrev Number: 1 (DW_TAG_member)
    <cd5cd>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <cd5d1>   DW_AT_decl_file   : 9
    <cd5d1>   DW_AT_decl_line   : 646
    <cd5d3>   DW_AT_decl_column : 25
    <cd5d4>   DW_AT_type        : <0xccd6a>
    <cd5d8>   DW_AT_data_member_location: 68
 <2><cd5d9>: Abbrev Number: 1 (DW_TAG_member)
    <cd5da>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <cd5de>   DW_AT_decl_file   : 9
    <cd5de>   DW_AT_decl_line   : 647
    <cd5e0>   DW_AT_decl_column : 25
    <cd5e1>   DW_AT_type        : <0xccd6a>
    <cd5e5>   DW_AT_data_member_location: 72
 <2><cd5e6>: Abbrev Number: 14 (DW_TAG_member)
    <cd5e7>   DW_AT_name        : X
    <cd5e9>   DW_AT_decl_file   : 9
    <cd5e9>   DW_AT_decl_line   : 648
    <cd5eb>   DW_AT_decl_column : 25
    <cd5ec>   DW_AT_type        : <0xccd6a>
    <cd5f0>   DW_AT_data_member_location: 76
 <2><cd5f1>: Abbrev Number: 14 (DW_TAG_member)
    <cd5f2>   DW_AT_name        : Y
    <cd5f4>   DW_AT_decl_file   : 9
    <cd5f4>   DW_AT_decl_line   : 648
    <cd5f6>   DW_AT_decl_column : 28
    <cd5f7>   DW_AT_type        : <0xccd6a>
    <cd5fb>   DW_AT_data_member_location: 80
 <2><cd5fc>: Abbrev Number: 1 (DW_TAG_member)
    <cd5fd>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <cd601>   DW_AT_decl_file   : 9
    <cd601>   DW_AT_decl_line   : 650
    <cd603>   DW_AT_decl_column : 25
    <cd604>   DW_AT_type        : <0xcd624>
    <cd608>   DW_AT_data_member_location: 88
 <2><cd609>: Abbrev Number: 1 (DW_TAG_member)
    <cd60a>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <cd60e>   DW_AT_decl_file   : 9
    <cd60e>   DW_AT_decl_line   : 651
    <cd610>   DW_AT_decl_column : 25
    <cd611>   DW_AT_type        : <0xcd629>
    <cd615>   DW_AT_data_member_location: 96
 <2><cd616>: Abbrev Number: 1 (DW_TAG_member)
    <cd617>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <cd61b>   DW_AT_decl_file   : 9
    <cd61b>   DW_AT_decl_line   : 652
    <cd61d>   DW_AT_decl_column : 25
    <cd61e>   DW_AT_type        : <0xcd629>
    <cd622>   DW_AT_data_member_location: 104
 <2><cd623>: Abbrev Number: 0
 <1><cd624>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd625>   DW_AT_byte_size   : 8
    <cd625>   DW_AT_type        : <0xcd4e7>
 <1><cd629>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd62a>   DW_AT_byte_size   : 8
    <cd62a>   DW_AT_type        : <0xcd437>
 <1><cd62e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd62f>   DW_AT_byte_size   : 8
    <cd62f>   DW_AT_type        : <0xcd55a>
 <1><cd633>: Abbrev Number: 18 (DW_TAG_array_type)
    <cd634>   DW_AT_type        : <0xcd371>
    <cd638>   DW_AT_sibling     : <0xcd643>
 <2><cd63c>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <cd63d>   DW_AT_type        : <0xccd92>
    <cd641>   DW_AT_upper_bound : 27
 <2><cd642>: Abbrev Number: 0
 <1><cd643>: Abbrev Number: 18 (DW_TAG_array_type)
    <cd644>   DW_AT_type        : <0xcd62e>
    <cd648>   DW_AT_sibling     : <0xcd653>
 <2><cd64c>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <cd64d>   DW_AT_type        : <0xccd92>
    <cd651>   DW_AT_upper_bound : 2
 <2><cd652>: Abbrev Number: 0
 <1><cd653>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd654>   DW_AT_name        : (indirect string, offset: 0x8f042): SFG_Enumerator
    <cd658>   DW_AT_decl_file   : 9
    <cd658>   DW_AT_decl_line   : 726
    <cd65a>   DW_AT_decl_column : 34
    <cd65b>   DW_AT_type        : <0xcd65f>
 <1><cd65f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <cd660>   DW_AT_name        : (indirect string, offset: 0x8f03f): tagSFG_Enumerator
    <cd664>   DW_AT_byte_size   : 16
    <cd665>   DW_AT_decl_file   : 9
    <cd665>   DW_AT_decl_line   : 727
    <cd667>   DW_AT_decl_column : 8
    <cd667>   DW_AT_sibling     : <0xcd686>
 <2><cd66b>: Abbrev Number: 1 (DW_TAG_member)
    <cd66c>   DW_AT_name        : (indirect string, offset: 0x8f108): found
    <cd670>   DW_AT_decl_file   : 9
    <cd670>   DW_AT_decl_line   : 729
    <cd672>   DW_AT_decl_column : 17
    <cd673>   DW_AT_type        : <0xccd3d>
    <cd677>   DW_AT_data_member_location: 0
 <2><cd678>: Abbrev Number: 1 (DW_TAG_member)
    <cd679>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <cd67d>   DW_AT_decl_file   : 9
    <cd67d>   DW_AT_decl_line   : 730
    <cd67f>   DW_AT_decl_column : 17
    <cd680>   DW_AT_type        : <0xccdb0>
    <cd684>   DW_AT_data_member_location: 8
 <2><cd685>: Abbrev Number: 0
 <1><cd686>: Abbrev Number: 7 (DW_TAG_typedef)
    <cd687>   DW_AT_name        : (indirect string, offset: 0x8f059): FGCBenumerator
    <cd68b>   DW_AT_decl_file   : 9
    <cd68b>   DW_AT_decl_line   : 732
    <cd68d>   DW_AT_decl_column : 17
    <cd68e>   DW_AT_type        : <0xcd692>
 <1><cd692>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd693>   DW_AT_byte_size   : 8
    <cd693>   DW_AT_type        : <0xcd697>
 <1><cd697>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <cd698>   DW_AT_prototyped  : 1
    <cd698>   DW_AT_sibling     : <0xcd6a7>
 <2><cd69c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd69d>   DW_AT_type        : <0xcd629>
 <2><cd6a1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd6a2>   DW_AT_type        : <0xcd6a7>
 <2><cd6a6>: Abbrev Number: 0
 <1><cd6a7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd6a8>   DW_AT_byte_size   : 8
    <cd6a8>   DW_AT_type        : <0xcd653>
 <1><cd6ac>: Abbrev Number: 55 (DW_TAG_variable)
    <cd6ad>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <cd6b1>   DW_AT_decl_file   : 9
    <cd6b2>   DW_AT_decl_line   : 787
    <cd6b4>   DW_AT_decl_column : 18
    <cd6b5>   DW_AT_type        : <0xcd01c>
    <cd6b9>   DW_AT_external    : 1
    <cd6b9>   DW_AT_declaration : 1
 <1><cd6b9>: Abbrev Number: 6 (DW_TAG_typedef)
    <cd6ba>   DW_AT_name        : (indirect string, offset: 0x8f03a): cc_t
    <cd6be>   DW_AT_decl_file   : 10
    <cd6bf>   DW_AT_decl_line   : 23
    <cd6c0>   DW_AT_decl_column : 23
    <cd6c1>   DW_AT_type        : <0xccd49>
 <1><cd6c5>: Abbrev Number: 6 (DW_TAG_typedef)
    <cd6c6>   DW_AT_name        : (indirect string, offset: 0x8f0c4): speed_t
    <cd6ca>   DW_AT_decl_file   : 10
    <cd6cb>   DW_AT_decl_line   : 24
    <cd6cc>   DW_AT_decl_column : 22
    <cd6cd>   DW_AT_type        : <0xccd36>
 <1><cd6d1>: Abbrev Number: 6 (DW_TAG_typedef)
    <cd6d2>   DW_AT_name        : (indirect string, offset: 0x8efbd): tcflag_t
    <cd6d6>   DW_AT_decl_file   : 10
    <cd6d7>   DW_AT_decl_line   : 25
    <cd6d8>   DW_AT_decl_column : 22
    <cd6d9>   DW_AT_type        : <0xccd36>
 <1><cd6dd>: Abbrev Number: 56 (DW_TAG_structure_type)
    <cd6de>   DW_AT_name        : (indirect string, offset: 0x8efe0): termios
    <cd6e2>   DW_AT_byte_size   : 60
    <cd6e3>   DW_AT_decl_file   : 11
    <cd6e4>   DW_AT_decl_line   : 24
    <cd6e5>   DW_AT_decl_column : 8
    <cd6e6>   DW_AT_sibling     : <0xcd753>
 <2><cd6ea>: Abbrev Number: 11 (DW_TAG_member)
    <cd6eb>   DW_AT_name        : (indirect string, offset: 0x8f051): c_iflag
    <cd6ef>   DW_AT_decl_file   : 11
    <cd6f0>   DW_AT_decl_line   : 26
    <cd6f1>   DW_AT_decl_column : 14
    <cd6f2>   DW_AT_type        : <0xcd6d1>
    <cd6f6>   DW_AT_data_member_location: 0
 <2><cd6f7>: Abbrev Number: 11 (DW_TAG_member)
    <cd6f8>   DW_AT_name        : (indirect string, offset: 0x8effc): c_oflag
    <cd6fc>   DW_AT_decl_file   : 11
    <cd6fd>   DW_AT_decl_line   : 27
    <cd6fe>   DW_AT_decl_column : 14
    <cd6ff>   DW_AT_type        : <0xcd6d1>
    <cd703>   DW_AT_data_member_location: 4
 <2><cd704>: Abbrev Number: 11 (DW_TAG_member)
    <cd705>   DW_AT_name        : (indirect string, offset: 0x8f0de): c_cflag
    <cd709>   DW_AT_decl_file   : 11
    <cd70a>   DW_AT_decl_line   : 28
    <cd70b>   DW_AT_decl_column : 14
    <cd70c>   DW_AT_type        : <0xcd6d1>
    <cd710>   DW_AT_data_member_location: 8
 <2><cd711>: Abbrev Number: 11 (DW_TAG_member)
    <cd712>   DW_AT_name        : (indirect string, offset: 0x8f01b): c_lflag
    <cd716>   DW_AT_decl_file   : 11
    <cd717>   DW_AT_decl_line   : 29
    <cd718>   DW_AT_decl_column : 14
    <cd719>   DW_AT_type        : <0xcd6d1>
    <cd71d>   DW_AT_data_member_location: 12
 <2><cd71e>: Abbrev Number: 11 (DW_TAG_member)
    <cd71f>   DW_AT_name        : (indirect string, offset: 0x8f0a7): c_line
    <cd723>   DW_AT_decl_file   : 11
    <cd724>   DW_AT_decl_line   : 30
    <cd725>   DW_AT_decl_column : 10
    <cd726>   DW_AT_type        : <0xcd6b9>
    <cd72a>   DW_AT_data_member_location: 16
 <2><cd72b>: Abbrev Number: 11 (DW_TAG_member)
    <cd72c>   DW_AT_name        : (indirect string, offset: 0x8f0cc): c_cc
    <cd730>   DW_AT_decl_file   : 11
    <cd731>   DW_AT_decl_line   : 31
    <cd732>   DW_AT_decl_column : 10
    <cd733>   DW_AT_type        : <0xcd758>
    <cd737>   DW_AT_data_member_location: 17
 <2><cd738>: Abbrev Number: 11 (DW_TAG_member)
    <cd739>   DW_AT_name        : (indirect string, offset: 0x8efd7): c_ispeed
    <cd73d>   DW_AT_decl_file   : 11
    <cd73e>   DW_AT_decl_line   : 32
    <cd73f>   DW_AT_decl_column : 13
    <cd740>   DW_AT_type        : <0xcd6c5>
    <cd744>   DW_AT_data_member_location: 52
 <2><cd745>: Abbrev Number: 11 (DW_TAG_member)
    <cd746>   DW_AT_name        : (indirect string, offset: 0x8f0f2): c_ospeed
    <cd74a>   DW_AT_decl_file   : 11
    <cd74b>   DW_AT_decl_line   : 33
    <cd74c>   DW_AT_decl_column : 13
    <cd74d>   DW_AT_type        : <0xcd6c5>
    <cd751>   DW_AT_data_member_location: 56
 <2><cd752>: Abbrev Number: 0
 <1><cd753>: Abbrev Number: 33 (DW_TAG_const_type)
    <cd754>   DW_AT_type        : <0xcd6dd>
 <1><cd758>: Abbrev Number: 18 (DW_TAG_array_type)
    <cd759>   DW_AT_type        : <0xcd6b9>
    <cd75d>   DW_AT_sibling     : <0xcd768>
 <2><cd761>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <cd762>   DW_AT_type        : <0xccd92>
    <cd766>   DW_AT_upper_bound : 31
 <2><cd767>: Abbrev Number: 0
 <1><cd768>: Abbrev Number: 57 (DW_TAG_structure_type)
    <cd769>   DW_AT_byte_size   : 124
    <cd76a>   DW_AT_decl_file   : 1
    <cd76b>   DW_AT_decl_line   : 52
    <cd76c>   DW_AT_decl_column : 9
    <cd76d>   DW_AT_sibling     : <0xcd798>
 <2><cd771>: Abbrev Number: 58 (DW_TAG_member)
    <cd772>   DW_AT_name        : fd
    <cd775>   DW_AT_decl_file   : 1
    <cd776>   DW_AT_decl_line   : 53
    <cd777>   DW_AT_decl_column : 8
    <cd778>   DW_AT_type        : <0xccd6a>
    <cd77c>   DW_AT_data_member_location: 0
 <2><cd77d>: Abbrev Number: 11 (DW_TAG_member)
    <cd77e>   DW_AT_name        : (indirect string, offset: 0x8f033): termio
    <cd782>   DW_AT_decl_file   : 1
    <cd783>   DW_AT_decl_line   : 54
    <cd784>   DW_AT_decl_column : 19
    <cd785>   DW_AT_type        : <0xcd6dd>
    <cd789>   DW_AT_data_member_location: 4
 <2><cd78a>: Abbrev Number: 11 (DW_TAG_member)
    <cd78b>   DW_AT_name        : (indirect string, offset: 0x8f00f): termio_save
    <cd78f>   DW_AT_decl_file   : 1
    <cd790>   DW_AT_decl_line   : 54
    <cd791>   DW_AT_decl_column : 27
    <cd792>   DW_AT_type        : <0xcd6dd>
    <cd796>   DW_AT_data_member_location: 64
 <2><cd797>: Abbrev Number: 0
 <1><cd798>: Abbrev Number: 6 (DW_TAG_typedef)
    <cd799>   DW_AT_name        : (indirect string, offset: 0x8f11a): SERIALPORT
    <cd79d>   DW_AT_decl_file   : 1
    <cd79e>   DW_AT_decl_line   : 55
    <cd79f>   DW_AT_decl_column : 3
    <cd7a0>   DW_AT_type        : <0xcd768>
 <1><cd7a4>: Abbrev Number: 24 (DW_TAG_variable)
    <cd7a5>   DW_AT_name        : (indirect string, offset: 0x8f0fb): dialbox_port
    <cd7a9>   DW_AT_decl_file   : 1
    <cd7a9>   DW_AT_decl_line   : 115
    <cd7aa>   DW_AT_decl_column : 20
    <cd7ab>   DW_AT_type        : <0xcd7b9>
    <cd7af>   DW_AT_location    : 9 byte block: 3 d8 99 10 1 0 0 0 0 	(DW_OP_addr: 11099d8)
 <1><cd7b9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd7ba>   DW_AT_byte_size   : 8
    <cd7ba>   DW_AT_type        : <0xcd798>
 <1><cd7be>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd7bf>   DW_AT_external    : 1
    <cd7bf>   DW_AT_name        : (indirect string, offset: 0x4ca28): free
    <cd7c3>   DW_AT_decl_file   : 15
    <cd7c4>   DW_AT_decl_line   : 565
    <cd7c6>   DW_AT_decl_column : 13
    <cd7c7>   DW_AT_prototyped  : 1
    <cd7c7>   DW_AT_declaration : 1
    <cd7c7>   DW_AT_sibling     : <0xcd7d1>
 <2><cd7cb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd7cc>   DW_AT_type        : <0xccdb0>
 <2><cd7d0>: Abbrev Number: 0
 <1><cd7d1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd7d2>   DW_AT_external    : 1
    <cd7d2>   DW_AT_name        : (indirect string, offset: 0x489ae): close
    <cd7d6>   DW_AT_decl_file   : 12
    <cd7d7>   DW_AT_decl_line   : 353
    <cd7d9>   DW_AT_decl_column : 12
    <cd7da>   DW_AT_prototyped  : 1
    <cd7da>   DW_AT_type        : <0xccd6a>
    <cd7de>   DW_AT_declaration : 1
    <cd7de>   DW_AT_sibling     : <0xcd7e8>
 <2><cd7e2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd7e3>   DW_AT_type        : <0xccd6a>
 <2><cd7e7>: Abbrev Number: 0
 <1><cd7e8>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd7e9>   DW_AT_external    : 1
    <cd7e9>   DW_AT_name        : (indirect string, offset: 0x73d03): write
    <cd7ed>   DW_AT_decl_file   : 12
    <cd7ee>   DW_AT_decl_line   : 367
    <cd7f0>   DW_AT_decl_column : 16
    <cd7f1>   DW_AT_prototyped  : 1
    <cd7f1>   DW_AT_type        : <0xccdee>
    <cd7f5>   DW_AT_declaration : 1
    <cd7f5>   DW_AT_sibling     : <0xcd809>
 <2><cd7f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd7fa>   DW_AT_type        : <0xccd6a>
 <2><cd7fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd7ff>   DW_AT_type        : <0xccdcf>
 <2><cd803>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd804>   DW_AT_type        : <0xccddb>
 <2><cd808>: Abbrev Number: 0
 <1><cd809>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd80a>   DW_AT_external    : 1
    <cd80a>   DW_AT_name        : (indirect string, offset: 0x8f130): tcsetattr
    <cd80e>   DW_AT_decl_file   : 13
    <cd80f>   DW_AT_decl_line   : 70
    <cd810>   DW_AT_decl_column : 12
    <cd811>   DW_AT_prototyped  : 1
    <cd811>   DW_AT_type        : <0xccd6a>
    <cd815>   DW_AT_declaration : 1
    <cd815>   DW_AT_sibling     : <0xcd829>
 <2><cd819>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd81a>   DW_AT_type        : <0xccd6a>
 <2><cd81e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd81f>   DW_AT_type        : <0xccd6a>
 <2><cd823>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd824>   DW_AT_type        : <0xcd829>
 <2><cd828>: Abbrev Number: 0
 <1><cd829>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd82a>   DW_AT_byte_size   : 8
    <cd82a>   DW_AT_type        : <0xcd753>
 <1><cd82e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd82f>   DW_AT_external    : 1
    <cd82f>   DW_AT_name        : (indirect string, offset: 0x8efa6): cfsetospeed
    <cd833>   DW_AT_decl_file   : 13
    <cd834>   DW_AT_decl_line   : 54
    <cd835>   DW_AT_decl_column : 12
    <cd836>   DW_AT_prototyped  : 1
    <cd836>   DW_AT_type        : <0xccd6a>
    <cd83a>   DW_AT_declaration : 1
    <cd83a>   DW_AT_sibling     : <0xcd849>
 <2><cd83e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd83f>   DW_AT_type        : <0xcd849>
 <2><cd843>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd844>   DW_AT_type        : <0xcd6c5>
 <2><cd848>: Abbrev Number: 0
 <1><cd849>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cd84a>   DW_AT_byte_size   : 8
    <cd84a>   DW_AT_type        : <0xcd6dd>
 <1><cd84e>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd84f>   DW_AT_external    : 1
    <cd84f>   DW_AT_name        : (indirect string, offset: 0x8f0e6): cfsetispeed
    <cd853>   DW_AT_decl_file   : 13
    <cd854>   DW_AT_decl_line   : 57
    <cd855>   DW_AT_decl_column : 12
    <cd856>   DW_AT_prototyped  : 1
    <cd856>   DW_AT_type        : <0xccd6a>
    <cd85a>   DW_AT_declaration : 1
    <cd85a>   DW_AT_sibling     : <0xcd869>
 <2><cd85e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd85f>   DW_AT_type        : <0xcd849>
 <2><cd863>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd864>   DW_AT_type        : <0xcd6c5>
 <2><cd868>: Abbrev Number: 0
 <1><cd869>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd86a>   DW_AT_external    : 1
    <cd86a>   DW_AT_name        : (indirect string, offset: 0x8f068): tcgetattr
    <cd86e>   DW_AT_decl_file   : 13
    <cd86f>   DW_AT_decl_line   : 66
    <cd870>   DW_AT_decl_column : 12
    <cd871>   DW_AT_prototyped  : 1
    <cd871>   DW_AT_type        : <0xccd6a>
    <cd875>   DW_AT_declaration : 1
    <cd875>   DW_AT_sibling     : <0xcd884>
 <2><cd879>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd87a>   DW_AT_type        : <0xccd6a>
 <2><cd87e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd87f>   DW_AT_type        : <0xcd849>
 <2><cd883>: Abbrev Number: 0
 <1><cd884>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd885>   DW_AT_external    : 1
    <cd885>   DW_AT_name        : (indirect string, offset: 0x8f358): memset
    <cd889>   DW_AT_decl_file   : 14
    <cd88a>   DW_AT_decl_line   : 61
    <cd88b>   DW_AT_decl_column : 14
    <cd88c>   DW_AT_prototyped  : 1
    <cd88c>   DW_AT_type        : <0xccdb0>
    <cd890>   DW_AT_declaration : 1
    <cd890>   DW_AT_sibling     : <0xcd8a4>
 <2><cd894>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd895>   DW_AT_type        : <0xccdb0>
 <2><cd899>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd89a>   DW_AT_type        : <0xccd6a>
 <2><cd89e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd89f>   DW_AT_type        : <0xccddb>
 <2><cd8a3>: Abbrev Number: 0
 <1><cd8a4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd8a5>   DW_AT_external    : 1
    <cd8a5>   DW_AT_name        : (indirect string, offset: 0x136e1): malloc
    <cd8a9>   DW_AT_decl_file   : 15
    <cd8aa>   DW_AT_decl_line   : 539
    <cd8ac>   DW_AT_decl_column : 14
    <cd8ad>   DW_AT_prototyped  : 1
    <cd8ad>   DW_AT_type        : <0xccdb0>
    <cd8b1>   DW_AT_declaration : 1
    <cd8b1>   DW_AT_sibling     : <0xcd8bb>
 <2><cd8b5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd8b6>   DW_AT_type        : <0xccddb>
 <2><cd8ba>: Abbrev Number: 0
 <1><cd8bb>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd8bc>   DW_AT_external    : 1
    <cd8bc>   DW_AT_name        : (indirect string, offset: 0x416f): perror
    <cd8c0>   DW_AT_decl_file   : 16
    <cd8c1>   DW_AT_decl_line   : 780
    <cd8c3>   DW_AT_decl_column : 13
    <cd8c4>   DW_AT_prototyped  : 1
    <cd8c4>   DW_AT_declaration : 1
    <cd8c4>   DW_AT_sibling     : <0xcd8ce>
 <2><cd8c8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd8c9>   DW_AT_type        : <0xcce92>
 <2><cd8cd>: Abbrev Number: 0
 <1><cd8ce>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd8cf>   DW_AT_external    : 1
    <cd8cf>   DW_AT_name        : (indirect string, offset: 0x8fb98): open
    <cd8d3>   DW_AT_decl_file   : 17
    <cd8d4>   DW_AT_decl_line   : 196
    <cd8d5>   DW_AT_decl_column : 12
    <cd8d6>   DW_AT_prototyped  : 1
    <cd8d6>   DW_AT_type        : <0xccd6a>
    <cd8da>   DW_AT_declaration : 1
    <cd8da>   DW_AT_sibling     : <0xcd8ea>
 <2><cd8de>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd8df>   DW_AT_type        : <0xcce92>
 <2><cd8e3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd8e4>   DW_AT_type        : <0xccd6a>
 <2><cd8e8>: Abbrev Number: 34 (DW_TAG_unspecified_parameters)
 <2><cd8e9>: Abbrev Number: 0
 <1><cd8ea>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd8eb>   DW_AT_external    : 1
    <cd8eb>   DW_AT_name        : (indirect string, offset: 0x67895): read
    <cd8ef>   DW_AT_decl_file   : 12
    <cd8f0>   DW_AT_decl_line   : 360
    <cd8f2>   DW_AT_decl_column : 16
    <cd8f3>   DW_AT_prototyped  : 1
    <cd8f3>   DW_AT_type        : <0xccdee>
    <cd8f7>   DW_AT_declaration : 1
    <cd8f7>   DW_AT_sibling     : <0xcd90b>
 <2><cd8fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd8fc>   DW_AT_type        : <0xccd6a>
 <2><cd900>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd901>   DW_AT_type        : <0xccdb0>
 <2><cd905>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd906>   DW_AT_type        : <0xccddb>
 <2><cd90a>: Abbrev Number: 0
 <1><cd90b>: Abbrev Number: 15 (DW_TAG_subprogram)
    <cd90c>   DW_AT_external    : 1
    <cd90c>   DW_AT_name        : (indirect string, offset: 0x8f07f): tcflush
    <cd910>   DW_AT_decl_file   : 13
    <cd911>   DW_AT_decl_line   : 90
    <cd912>   DW_AT_decl_column : 12
    <cd913>   DW_AT_prototyped  : 1
    <cd913>   DW_AT_type        : <0xccd6a>
    <cd917>   DW_AT_declaration : 1
    <cd917>   DW_AT_sibling     : <0xcd926>
 <2><cd91b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd91c>   DW_AT_type        : <0xccd6a>
 <2><cd920>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd921>   DW_AT_type        : <0xccd6a>
 <2><cd925>: Abbrev Number: 0
 <1><cd926>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd927>   DW_AT_external    : 1
    <cd927>   DW_AT_name        : (indirect string, offset: 0x8f087): fgEnumSubWindows
    <cd92b>   DW_AT_decl_file   : 9
    <cd92c>   DW_AT_decl_line   : 932
    <cd92e>   DW_AT_decl_column : 6
    <cd92f>   DW_AT_prototyped  : 1
    <cd92f>   DW_AT_declaration : 1
    <cd92f>   DW_AT_sibling     : <0xcd943>
 <2><cd933>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd934>   DW_AT_type        : <0xcd629>
 <2><cd938>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd939>   DW_AT_type        : <0xcd686>
 <2><cd93d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd93e>   DW_AT_type        : <0xcd6a7>
 <2><cd942>: Abbrev Number: 0
 <1><cd943>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd944>   DW_AT_external    : 1
    <cd944>   DW_AT_name        : (indirect string, offset: 0x8dfe5): fgSetWindow
    <cd948>   DW_AT_decl_file   : 9
    <cd949>   DW_AT_decl_line   : 878
    <cd94b>   DW_AT_decl_column : 13
    <cd94c>   DW_AT_prototyped  : 1
    <cd94c>   DW_AT_declaration : 1
    <cd94c>   DW_AT_sibling     : <0xcd956>
 <2><cd950>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd951>   DW_AT_type        : <0xcd629>
 <2><cd955>: Abbrev Number: 0
 <1><cd956>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd957>   DW_AT_external    : 1
    <cd957>   DW_AT_name        : (indirect string, offset: 0x8ef8d): fgEnumWindows
    <cd95b>   DW_AT_decl_file   : 9
    <cd95c>   DW_AT_decl_line   : 931
    <cd95e>   DW_AT_decl_column : 6
    <cd95f>   DW_AT_prototyped  : 1
    <cd95f>   DW_AT_declaration : 1
    <cd95f>   DW_AT_sibling     : <0xcd96e>
 <2><cd963>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd964>   DW_AT_type        : <0xcd686>
 <2><cd968>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd969>   DW_AT_type        : <0xcd6a7>
 <2><cd96d>: Abbrev Number: 0
 <1><cd96e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <cd96f>   DW_AT_external    : 1
    <cd96f>   DW_AT_name        : (indirect string, offset: 0x73b25): glutTimerFunc
    <cd973>   DW_AT_decl_file   : 18
    <cd974>   DW_AT_decl_line   : 463
    <cd976>   DW_AT_decl_column : 26
    <cd977>   DW_AT_prototyped  : 1
    <cd977>   DW_AT_declaration : 1
    <cd977>   DW_AT_sibling     : <0xcd98b>
 <2><cd97b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd97c>   DW_AT_type        : <0xccd36>
 <2><cd980>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd981>   DW_AT_type        : <0xcceac>
 <2><cd985>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd986>   DW_AT_type        : <0xccd6a>
 <2><cd98a>: Abbrev Number: 0
 <1><cd98b>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd98c>   DW_AT_external    : 1
    <cd98c>   DW_AT_name        : (indirect string, offset: 0x28b7b): getenv
    <cd990>   DW_AT_decl_file   : 15
    <cd991>   DW_AT_decl_line   : 634
    <cd993>   DW_AT_decl_column : 14
    <cd994>   DW_AT_prototyped  : 1
    <cd994>   DW_AT_type        : <0xccdbe>
    <cd998>   DW_AT_declaration : 1
    <cd998>   DW_AT_sibling     : <0xcd9a2>
 <2><cd99c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cd99d>   DW_AT_type        : <0xcce92>
 <2><cd9a1>: Abbrev Number: 0
 <1><cd9a2>: Abbrev Number: 37 (DW_TAG_subprogram)
    <cd9a3>   DW_AT_name        : (indirect string, offset: 0x8f072): serial_flush
    <cd9a7>   DW_AT_decl_file   : 1
    <cd9a7>   DW_AT_decl_line   : 312
    <cd9a9>   DW_AT_decl_column : 13
    <cd9a9>   DW_AT_prototyped  : 1
    <cd9a9>   DW_AT_inline      : 1	(not inlined)
    <cd9a9>   DW_AT_sibling     : <0xcd9ba>
 <2><cd9ad>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <cd9ae>   DW_AT_name        : (indirect string, offset: 0x75118): port
    <cd9b2>   DW_AT_decl_file   : 1
    <cd9b2>   DW_AT_decl_line   : 312
    <cd9b4>   DW_AT_decl_column : 40
    <cd9b5>   DW_AT_type        : <0xcd7b9>
 <2><cd9b9>: Abbrev Number: 0
 <1><cd9ba>: Abbrev Number: 38 (DW_TAG_subprogram)
    <cd9bb>   DW_AT_name        : (indirect string, offset: 0x8f13a): serial_putchar
    <cd9bf>   DW_AT_decl_file   : 1
    <cd9bf>   DW_AT_decl_line   : 307
    <cd9c1>   DW_AT_decl_column : 12
    <cd9c1>   DW_AT_prototyped  : 1
    <cd9c1>   DW_AT_type        : <0xccd6a>
    <cd9c5>   DW_AT_inline      : 1	(not inlined)
    <cd9c5>   DW_AT_sibling     : <0xcd9e2>
 <2><cd9c9>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <cd9ca>   DW_AT_name        : (indirect string, offset: 0x75118): port
    <cd9ce>   DW_AT_decl_file   : 1
    <cd9ce>   DW_AT_decl_line   : 307
    <cd9d0>   DW_AT_decl_column : 39
    <cd9d1>   DW_AT_type        : <0xcd7b9>
 <2><cd9d5>: Abbrev Number: 59 (DW_TAG_formal_parameter)
    <cd9d6>   DW_AT_name        : ch
    <cd9d9>   DW_AT_decl_file   : 1
    <cd9da>   DW_AT_decl_line   : 307
    <cd9dc>   DW_AT_decl_column : 59
    <cd9dd>   DW_AT_type        : <0xccd49>
 <2><cd9e1>: Abbrev Number: 0
 <1><cd9e2>: Abbrev Number: 38 (DW_TAG_subprogram)
    <cd9e3>   DW_AT_name        : (indirect string, offset: 0x8f098): serial_getchar
    <cd9e7>   DW_AT_decl_file   : 1
    <cd9e7>   DW_AT_decl_line   : 299
    <cd9e9>   DW_AT_decl_column : 12
    <cd9e9>   DW_AT_prototyped  : 1
    <cd9e9>   DW_AT_type        : <0xccd6a>
    <cd9ed>   DW_AT_inline      : 1	(not inlined)
    <cd9ed>   DW_AT_sibling     : <0xcda09>
 <2><cd9f1>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <cd9f2>   DW_AT_name        : (indirect string, offset: 0x75118): port
    <cd9f6>   DW_AT_decl_file   : 1
    <cd9f6>   DW_AT_decl_line   : 299
    <cd9f8>   DW_AT_decl_column : 39
    <cd9f9>   DW_AT_type        : <0xcd7b9>
 <2><cd9fd>: Abbrev Number: 39 (DW_TAG_variable)
    <cd9fe>   DW_AT_name        : ch
    <cda01>   DW_AT_decl_file   : 1
    <cda01>   DW_AT_decl_line   : 301
    <cda03>   DW_AT_decl_column : 19
    <cda04>   DW_AT_type        : <0xccd49>
 <2><cda08>: Abbrev Number: 0
 <1><cda09>: Abbrev Number: 37 (DW_TAG_subprogram)
    <cda0a>   DW_AT_name        : (indirect string, offset: 0x8f0d1): serial_close
    <cda0e>   DW_AT_decl_file   : 1
    <cda0e>   DW_AT_decl_line   : 288
    <cda10>   DW_AT_decl_column : 13
    <cda10>   DW_AT_prototyped  : 1
    <cda10>   DW_AT_inline      : 1	(not inlined)
    <cda10>   DW_AT_sibling     : <0xcda21>
 <2><cda14>: Abbrev Number: 25 (DW_TAG_formal_parameter)
    <cda15>   DW_AT_name        : (indirect string, offset: 0x75118): port
    <cda19>   DW_AT_decl_file   : 1
    <cda19>   DW_AT_decl_line   : 288
    <cda1b>   DW_AT_decl_column : 38
    <cda1c>   DW_AT_type        : <0xcd7b9>
 <2><cda20>: Abbrev Number: 0
 <1><cda21>: Abbrev Number: 60 (DW_TAG_subprogram)
    <cda22>   DW_AT_name        : (indirect string, offset: 0x8f0ae): serial_open
    <cda26>   DW_AT_decl_file   : 1
    <cda27>   DW_AT_decl_line   : 255
    <cda28>   DW_AT_decl_column : 20
    <cda29>   DW_AT_prototyped  : 1
    <cda29>   DW_AT_type        : <0xcd7b9>
    <cda2d>   DW_AT_inline      : 1	(inlined)
    <cda2e>   DW_AT_sibling     : <0xcda61>
 <2><cda32>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <cda33>   DW_AT_name        : (indirect string, offset: 0x1f6b9): device
    <cda37>   DW_AT_decl_file   : 1
    <cda37>   DW_AT_decl_line   : 255
    <cda38>   DW_AT_decl_column : 46
    <cda39>   DW_AT_type        : <0xcce92>
 <2><cda3d>: Abbrev Number: 39 (DW_TAG_variable)
    <cda3e>   DW_AT_name        : fd
    <cda41>   DW_AT_decl_file   : 1
    <cda41>   DW_AT_decl_line   : 257
    <cda43>   DW_AT_decl_column : 9
    <cda44>   DW_AT_type        : <0xccd6a>
 <2><cda48>: Abbrev Number: 41 (DW_TAG_variable)
    <cda49>   DW_AT_name        : (indirect string, offset: 0x8f033): termio
    <cda4d>   DW_AT_decl_file   : 1
    <cda4d>   DW_AT_decl_line   : 258
    <cda4f>   DW_AT_decl_column : 20
    <cda50>   DW_AT_type        : <0xcd6dd>
 <2><cda54>: Abbrev Number: 41 (DW_TAG_variable)
    <cda55>   DW_AT_name        : (indirect string, offset: 0x75118): port
    <cda59>   DW_AT_decl_file   : 1
    <cda59>   DW_AT_decl_line   : 259
    <cda5b>   DW_AT_decl_column : 17
    <cda5c>   DW_AT_type        : <0xcd7b9>
 <2><cda60>: Abbrev Number: 0
 <1><cda61>: Abbrev Number: 42 (DW_TAG_subprogram)
    <cda62>   DW_AT_name        : (indirect string, offset: 0x8f004): poll_dials
    <cda66>   DW_AT_decl_file   : 1
    <cda66>   DW_AT_decl_line   : 201
    <cda67>   DW_AT_decl_column : 13
    <cda67>   DW_AT_prototyped  : 1
    <cda67>   DW_AT_inline      : 1	(not inlined)
    <cda67>   DW_AT_sibling     : <0xcdacb>
 <2><cda6b>: Abbrev Number: 43 (DW_TAG_formal_parameter)
    <cda6c>   DW_AT_name        : id
    <cda6f>   DW_AT_decl_file   : 1
    <cda6f>   DW_AT_decl_line   : 201
    <cda70>   DW_AT_decl_column : 30
    <cda71>   DW_AT_type        : <0xccd6a>
 <2><cda75>: Abbrev Number: 22 (DW_TAG_variable)
    <cda76>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <cda7a>   DW_AT_decl_file   : 1
    <cda7a>   DW_AT_decl_line   : 203
    <cda7b>   DW_AT_decl_column : 9
    <cda7c>   DW_AT_type        : <0xccd6a>
 <2><cda80>: Abbrev Number: 24 (DW_TAG_variable)
    <cda81>   DW_AT_name        : (indirect string, offset: 0x8f125): dial_state
    <cda85>   DW_AT_decl_file   : 1
    <cda85>   DW_AT_decl_line   : 204
    <cda86>   DW_AT_decl_column : 16
    <cda87>   DW_AT_type        : <0xccd6a>
    <cda8b>   DW_AT_location    : 9 byte block: 3 e8 94 a7 0 0 0 0 0 	(DW_OP_addr: a794e8)
 <2><cda95>: Abbrev Number: 24 (DW_TAG_variable)
    <cda96>   DW_AT_name        : (indirect string, offset: 0x8efb2): dial_which
    <cda9a>   DW_AT_decl_file   : 1
    <cda9a>   DW_AT_decl_line   : 205
    <cda9b>   DW_AT_decl_column : 16
    <cda9c>   DW_AT_type        : <0xccd6a>
    <cdaa0>   DW_AT_location    : 9 byte block: 3 d4 99 10 1 0 0 0 0 	(DW_OP_addr: 11099d4)
 <2><cdaaa>: Abbrev Number: 24 (DW_TAG_variable)
    <cdaab>   DW_AT_name        : (indirect string, offset: 0x8ef9b): dial_value
    <cdaaf>   DW_AT_decl_file   : 1
    <cdaaf>   DW_AT_decl_line   : 206
    <cdab0>   DW_AT_decl_column : 16
    <cdab1>   DW_AT_type        : <0xccd6a>
    <cdab5>   DW_AT_location    : 9 byte block: 3 d0 99 10 1 0 0 0 0 	(DW_OP_addr: 11099d0)
 <2><cdabf>: Abbrev Number: 22 (DW_TAG_variable)
    <cdac0>   DW_AT_name        : (indirect string, offset: 0x8f009): dials
    <cdac4>   DW_AT_decl_file   : 1
    <cdac4>   DW_AT_decl_line   : 207
    <cdac5>   DW_AT_decl_column : 16
    <cdac6>   DW_AT_type        : <0xcdacb>
 <2><cdaca>: Abbrev Number: 0
 <1><cdacb>: Abbrev Number: 18 (DW_TAG_array_type)
    <cdacc>   DW_AT_type        : <0xccd6a>
    <cdad0>   DW_AT_sibling     : <0xcdadb>
 <2><cdad4>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <cdad5>   DW_AT_type        : <0xccd92>
    <cdad9>   DW_AT_upper_bound : 7
 <2><cdada>: Abbrev Number: 0
 <1><cdadb>: Abbrev Number: 42 (DW_TAG_subprogram)
    <cdadc>   DW_AT_name        : (indirect string, offset: 0x8f023): send_dial_event
    <cdae0>   DW_AT_decl_file   : 1
    <cdae0>   DW_AT_decl_line   : 189
    <cdae1>   DW_AT_decl_column : 13
    <cdae1>   DW_AT_prototyped  : 1
    <cdae1>   DW_AT_inline      : 1	(not inlined)
    <cdae1>   DW_AT_sibling     : <0xcdb12>
 <2><cdae5>: Abbrev Number: 43 (DW_TAG_formal_parameter)
    <cdae6>   DW_AT_name        : num
    <cdaea>   DW_AT_decl_file   : 1
    <cdaea>   DW_AT_decl_line   : 189
    <cdaeb>   DW_AT_decl_column : 35
    <cdaec>   DW_AT_type        : <0xccd6a>
 <2><cdaf0>: Abbrev Number: 40 (DW_TAG_formal_parameter)
    <cdaf1>   DW_AT_name        : (indirect string, offset: 0x655de): value
    <cdaf5>   DW_AT_decl_file   : 1
    <cdaf5>   DW_AT_decl_line   : 189
    <cdaf6>   DW_AT_decl_column : 44
    <cdaf7>   DW_AT_type        : <0xccd6a>
 <2><cdafb>: Abbrev Number: 22 (DW_TAG_variable)
    <cdafc>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <cdb00>   DW_AT_decl_file   : 1
    <cdb00>   DW_AT_decl_line   : 191
    <cdb01>   DW_AT_decl_column : 20
    <cdb02>   DW_AT_type        : <0xcd653>
 <2><cdb06>: Abbrev Number: 22 (DW_TAG_variable)
    <cdb07>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <cdb0b>   DW_AT_decl_file   : 1
    <cdb0b>   DW_AT_decl_line   : 192
    <cdb0c>   DW_AT_decl_column : 9
    <cdb0d>   DW_AT_type        : <0xccda0>
 <2><cdb11>: Abbrev Number: 0
 <1><cdb12>: Abbrev Number: 61 (DW_TAG_subprogram)
    <cdb13>   DW_AT_name        : (indirect string, offset: 0x8f149): fghcbEnumDialCallbacks
    <cdb17>   DW_AT_decl_file   : 1
    <cdb18>   DW_AT_decl_line   : 182
    <cdb19>   DW_AT_decl_column : 13
    <cdb1a>   DW_AT_prototyped  : 1
    <cdb1a>   DW_AT_low_pc      : 0x9d0370
    <cdb22>   DW_AT_high_pc     : 0x45
    <cdb2a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cdb2c>   DW_AT_call_all_tail_calls: 1
    <cdb2c>   DW_AT_sibling     : <0xcdb98>
 <2><cdb30>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <cdb31>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <cdb35>   DW_AT_decl_file   : 1
    <cdb35>   DW_AT_decl_line   : 182
    <cdb36>   DW_AT_decl_column : 50
    <cdb37>   DW_AT_type        : <0xcd629>
    <cdb3b>   DW_AT_location    : 0x114c (location list)
    <cdb3f>   DW_AT_GNU_locviews: 0x1144
 <2><cdb43>: Abbrev Number: 44 (DW_TAG_formal_parameter)
    <cdb44>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <cdb48>   DW_AT_decl_file   : 1
    <cdb48>   DW_AT_decl_line   : 182
    <cdb49>   DW_AT_decl_column : 74
    <cdb4a>   DW_AT_type        : <0xcd6a7>
    <cdb4e>   DW_AT_location    : 0x116c (location list)
    <cdb52>   DW_AT_GNU_locviews: 0x1164
 <2><cdb56>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdb57>   DW_AT_call_return_pc: 0x9d038c
    <cdb5f>   DW_AT_call_origin : <0xcd943>
    <cdb63>   DW_AT_sibling     : <0xcdb6e>
 <3><cdb67>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdb68>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdb6a>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><cdb6d>: Abbrev Number: 0
 <2><cdb6e>: Abbrev Number: 45 (DW_TAG_call_site)
    <cdb6f>   DW_AT_call_return_pc: 0x9d03b5
    <cdb77>   DW_AT_call_tail_call: 1
    <cdb77>   DW_AT_call_origin : <0xcd926>
 <3><cdb7b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdb7c>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdb7e>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><cdb82>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdb83>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdb85>   DW_AT_call_value  : 9 byte block: 3 70 3 9d 0 0 0 0 0 	(DW_OP_addr: 9d0370)
 <3><cdb8f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdb90>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cdb92>   DW_AT_call_value  : 3 byte block: a3 1 54 	(DW_OP_entry_value: (DW_OP_reg4 (rsi)))
 <3><cdb96>: Abbrev Number: 0
 <2><cdb97>: Abbrev Number: 0
 <1><cdb98>: Abbrev Number: 62 (DW_TAG_subprogram)
    <cdb99>   DW_AT_external    : 1
    <cdb99>   DW_AT_name        : (indirect string, offset: 0x8eaeb): fgInputDeviceClose
    <cdb9d>   DW_AT_decl_file   : 1
    <cdb9e>   DW_AT_decl_line   : 169
    <cdb9f>   DW_AT_decl_column : 6
    <cdba0>   DW_AT_prototyped  : 1
    <cdba0>   DW_AT_low_pc      : 0x9d07d0
    <cdba8>   DW_AT_high_pc     : 0x4f
    <cdbb0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cdbb2>   DW_AT_call_all_calls: 1
    <cdbb2>   DW_AT_sibling     : <0xcdc25>
 <2><cdbb6>: Abbrev Number: 63 (DW_TAG_inlined_subroutine)
    <cdbb7>   DW_AT_abstract_origin: <0xcda09>
    <cdbbb>   DW_AT_entry_pc    : 0x9d07e8
    <cdbc3>   DW_AT_GNU_entry_view: 0
    <cdbc4>   DW_AT_low_pc      : 0x9d07e8
    <cdbcc>   DW_AT_high_pc     : 0x23
    <cdbd4>   DW_AT_call_file   : 1
    <cdbd5>   DW_AT_call_line   : 173
    <cdbd6>   DW_AT_call_column : 9
 <3><cdbd7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdbd8>   DW_AT_abstract_origin: <0xcda14>
    <cdbdc>   DW_AT_location    : 0x1186 (location list)
    <cdbe0>   DW_AT_GNU_locviews: 0x1184
 <3><cdbe4>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdbe5>   DW_AT_call_return_pc: 0x9d07fb
    <cdbed>   DW_AT_call_origin : <0xcd809>
    <cdbf1>   DW_AT_sibling     : <0xcdc02>
 <4><cdbf5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdbf6>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdbf8>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><cdbfa>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdbfb>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cdbfd>   DW_AT_call_value  : 3 byte block: 76 c0 0 	(DW_OP_breg6 (rbp): 64)
 <4><cdc01>: Abbrev Number: 0
 <3><cdc02>: Abbrev Number: 26 (DW_TAG_call_site)
    <cdc03>   DW_AT_call_return_pc: 0x9d0803
    <cdc0b>   DW_AT_call_origin : <0xcd7d1>
 <3><cdc0f>: Abbrev Number: 10 (DW_TAG_call_site)
    <cdc10>   DW_AT_call_return_pc: 0x9d080b
    <cdc18>   DW_AT_call_origin : <0xcd7be>
 <4><cdc1c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdc1d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdc1f>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><cdc22>: Abbrev Number: 0
 <3><cdc23>: Abbrev Number: 0
 <2><cdc24>: Abbrev Number: 0
 <1><cdc25>: Abbrev Number: 64 (DW_TAG_subprogram)
    <cdc26>   DW_AT_external    : 1
    <cdc26>   DW_AT_name        : (indirect string, offset: 0x8eced): fgInitialiseInputDevices
    <cdc2a>   DW_AT_decl_file   : 1
    <cdc2b>   DW_AT_decl_line   : 138
    <cdc2c>   DW_AT_decl_column : 6
    <cdc2d>   DW_AT_prototyped  : 1
    <cdc2d>   DW_AT_inline      : 1	(inlined)
    <cdc2e>   DW_AT_sibling     : <0xcdc40>
 <2><cdc32>: Abbrev Number: 65 (DW_TAG_lexical_block)
 <3><cdc33>: Abbrev Number: 22 (DW_TAG_variable)
    <cdc34>   DW_AT_name        : (indirect string, offset: 0x8f10e): dial_device
    <cdc38>   DW_AT_decl_file   : 1
    <cdc38>   DW_AT_decl_line   : 142
    <cdc39>   DW_AT_decl_column : 21
    <cdc3a>   DW_AT_type        : <0xcce92>
 <3><cdc3e>: Abbrev Number: 0
 <2><cdc3f>: Abbrev Number: 0
 <1><cdc40>: Abbrev Number: 66 (DW_TAG_subprogram)
    <cdc41>   DW_AT_external    : 1
    <cdc41>   DW_AT_name        : (indirect string, offset: 0x8efe8): fgInputDeviceDetect
    <cdc45>   DW_AT_decl_file   : 1
    <cdc46>   DW_AT_decl_line   : 122
    <cdc47>   DW_AT_decl_column : 5
    <cdc48>   DW_AT_prototyped  : 1
    <cdc48>   DW_AT_type        : <0xccd6a>
    <cdc4c>   DW_AT_low_pc      : 0x9d0750
    <cdc54>   DW_AT_high_pc     : 0x54
    <cdc5c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cdc5e>   DW_AT_call_all_calls: 1
    <cdc5e>   DW_AT_sibling     : <0xcdc86>
 <2><cdc62>: Abbrev Number: 67 (DW_TAG_inlined_subroutine)
    <cdc63>   DW_AT_abstract_origin: <0xcdc25>
    <cdc67>   DW_AT_entry_pc    : 0x9d0750
    <cdc6f>   DW_AT_GNU_entry_view: 2
    <cdc70>   DW_AT_ranges      : 0x66a
    <cdc74>   DW_AT_call_file   : 1
    <cdc75>   DW_AT_call_line   : 124
    <cdc76>   DW_AT_call_column : 5
 <3><cdc77>: Abbrev Number: 26 (DW_TAG_call_site)
    <cdc78>   DW_AT_call_return_pc: 0x9d0779
    <cdc80>   DW_AT_call_origin : <0xcdc86>
 <3><cdc84>: Abbrev Number: 0
 <2><cdc85>: Abbrev Number: 0
 <1><cdc86>: Abbrev Number: 32 (DW_TAG_subprogram)
    <cdc87>   DW_AT_abstract_origin: <0xcdc25>
    <cdc8b>   DW_AT_low_pc      : 0x9d03c0
    <cdc93>   DW_AT_high_pc     : 0x14a
    <cdc9b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cdc9d>   DW_AT_call_all_calls: 1
    <cdc9d>   DW_AT_sibling     : <0xcdec0>
 <2><cdca1>: Abbrev Number: 68 (DW_TAG_lexical_block)
    <cdca2>   DW_AT_abstract_origin: <0xcdc32>
    <cdca6>   DW_AT_ranges      : 0x5ff
    <cdcaa>   DW_AT_sibling     : <0xcdeb2>
 <3><cdcae>: Abbrev Number: 27 (DW_TAG_variable)
    <cdcaf>   DW_AT_abstract_origin: <0xcdc33>
    <cdcb3>   DW_AT_location    : 0x1198 (location list)
    <cdcb7>   DW_AT_GNU_locviews: 0x118e
 <3><cdcbb>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <cdcbc>   DW_AT_abstract_origin: <0xcda21>
    <cdcc0>   DW_AT_entry_pc    : 0x9d03f5
    <cdcc8>   DW_AT_GNU_entry_view: 1
    <cdcc9>   DW_AT_ranges      : 0x60c
    <cdccd>   DW_AT_call_file   : 1
    <cdccd>   DW_AT_call_line   : 159
    <cdcce>   DW_AT_call_column : 32
    <cdccf>   DW_AT_sibling     : <0xcde20>
 <4><cdcd3>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdcd4>   DW_AT_abstract_origin: <0xcda32>
    <cdcd8>   DW_AT_location    : 0x11c2 (location list)
    <cdcdc>   DW_AT_GNU_locviews: 0x11ba
 <4><cdce0>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <cdce1>   DW_AT_ranges      : 0x60c
 <5><cdce5>: Abbrev Number: 27 (DW_TAG_variable)
    <cdce6>   DW_AT_abstract_origin: <0xcda3d>
    <cdcea>   DW_AT_location    : 0x11e7 (location list)
    <cdcee>   DW_AT_GNU_locviews: 0x11df
 <5><cdcf2>: Abbrev Number: 30 (DW_TAG_variable)
    <cdcf3>   DW_AT_abstract_origin: <0xcda48>
    <cdcf7>   DW_AT_location    : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <5><cdcfb>: Abbrev Number: 27 (DW_TAG_variable)
    <cdcfc>   DW_AT_abstract_origin: <0xcda54>
    <cdd00>   DW_AT_location    : 0x1208 (location list)
    <cdd04>   DW_AT_GNU_locviews: 0x1204
 <5><cdd08>: Abbrev Number: 69 (DW_TAG_inlined_subroutine)
    <cdd09>   DW_AT_abstract_origin: <0xcd9a2>
    <cdd0d>   DW_AT_entry_pc    : 0x9d0492
    <cdd15>   DW_AT_GNU_entry_view: 1
    <cdd16>   DW_AT_low_pc      : 0x9d0492
    <cdd1e>   DW_AT_high_pc     : 0xc
    <cdd26>   DW_AT_call_file   : 1
    <cdd27>   DW_AT_call_line   : 284
    <cdd29>   DW_AT_call_column : 5
    <cdd2a>   DW_AT_sibling     : <0xcdd4f>
 <6><cdd2e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdd2f>   DW_AT_abstract_origin: <0xcd9ad>
    <cdd33>   DW_AT_location    : 0x1219 (location list)
    <cdd37>   DW_AT_GNU_locviews: 0x1217
 <6><cdd3b>: Abbrev Number: 10 (DW_TAG_call_site)
    <cdd3c>   DW_AT_call_return_pc: 0x9d049e
    <cdd44>   DW_AT_call_origin : <0xcd90b>
 <7><cdd48>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd49>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdd4b>   DW_AT_call_value  : 1 byte block: 32 	(DW_OP_lit2)
 <7><cdd4d>: Abbrev Number: 0
 <6><cdd4e>: Abbrev Number: 0
 <5><cdd4f>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdd50>   DW_AT_call_return_pc: 0x9d0401
    <cdd58>   DW_AT_call_origin : <0xcd8ce>
    <cdd5c>   DW_AT_sibling     : <0xcdd6e>
 <6><cdd60>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd61>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdd63>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <6><cdd66>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd67>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdd69>   DW_AT_call_value  : 3 byte block: a 2 8 	(DW_OP_const2u: 2050)
 <6><cdd6d>: Abbrev Number: 0
 <5><cdd6e>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdd6f>   DW_AT_call_return_pc: 0x9d0420
    <cdd77>   DW_AT_call_origin : <0xce16b>
    <cdd7b>   DW_AT_sibling     : <0xcdd8b>
 <6><cdd7f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd80>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdd82>   DW_AT_call_value  : 2 byte block: 8 7c 	(DW_OP_const1u: 124)
 <6><cdd85>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd86>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdd88>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <6><cdd8a>: Abbrev Number: 0
 <5><cdd8b>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdd8c>   DW_AT_call_return_pc: 0x9d0432
    <cdd94>   DW_AT_call_origin : <0xcd869>
    <cdd98>   DW_AT_sibling     : <0xcddaa>
 <6><cdd9c>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdd9d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdd9f>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><cdda2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdda3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdda5>   DW_AT_call_value  : 3 byte block: 73 c0 0 	(DW_OP_breg3 (rbx): 64)
 <6><cdda9>: Abbrev Number: 0
 <5><cddaa>: Abbrev Number: 13 (DW_TAG_call_site)
    <cddab>   DW_AT_call_return_pc: 0x9d0478
    <cddb3>   DW_AT_call_origin : <0xcd84e>
    <cddb7>   DW_AT_sibling     : <0xcddc8>
 <6><cddbb>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cddbc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cddbe>   DW_AT_call_value  : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <6><cddc2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cddc3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cddc5>   DW_AT_call_value  : 1 byte block: 3d 	(DW_OP_lit13)
 <6><cddc7>: Abbrev Number: 0
 <5><cddc8>: Abbrev Number: 13 (DW_TAG_call_site)
    <cddc9>   DW_AT_call_return_pc: 0x9d0485
    <cddd1>   DW_AT_call_origin : <0xcd82e>
    <cddd5>   DW_AT_sibling     : <0xcdde6>
 <6><cddd9>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cddda>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdddc>   DW_AT_call_value  : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <6><cdde0>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdde1>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdde3>   DW_AT_call_value  : 1 byte block: 3d 	(DW_OP_lit13)
 <6><cdde5>: Abbrev Number: 0
 <5><cdde6>: Abbrev Number: 13 (DW_TAG_call_site)
    <cdde7>   DW_AT_call_return_pc: 0x9d0492
    <cddef>   DW_AT_call_origin : <0xcd809>
    <cddf3>   DW_AT_sibling     : <0xcde0a>
 <6><cddf7>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cddf8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cddfa>   DW_AT_call_value  : 2 byte block: 7c 0 	(DW_OP_breg12 (r12): 0)
 <6><cddfd>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cddfe>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cde00>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <6><cde02>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde03>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cde05>   DW_AT_call_value  : 3 byte block: 91 80 7f 	(DW_OP_fbreg: -128)
 <6><cde09>: Abbrev Number: 0
 <5><cde0a>: Abbrev Number: 10 (DW_TAG_call_site)
    <cde0b>   DW_AT_call_return_pc: 0x9d04f8
    <cde13>   DW_AT_call_origin : <0xcd8bb>
 <6><cde17>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde18>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cde1a>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <6><cde1d>: Abbrev Number: 0
 <5><cde1e>: Abbrev Number: 0
 <4><cde1f>: Abbrev Number: 0
 <3><cde20>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <cde21>   DW_AT_abstract_origin: <0xcd9ba>
    <cde25>   DW_AT_entry_pc    : 0x9d04b6
    <cde2d>   DW_AT_GNU_entry_view: 0
    <cde2e>   DW_AT_ranges      : 0x61b
    <cde32>   DW_AT_call_file   : 1
    <cde32>   DW_AT_call_line   : 160
    <cde33>   DW_AT_call_column : 9
    <cde34>   DW_AT_sibling     : <0xcde6d>
 <4><cde38>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cde39>   DW_AT_abstract_origin: <0xcd9d5>
    <cde3d>   DW_AT_location    : 0x1223 (location list)
    <cde41>   DW_AT_GNU_locviews: 0x1221
 <4><cde45>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cde46>   DW_AT_abstract_origin: <0xcd9c9>
    <cde4a>   DW_AT_location    : 0x122f (location list)
    <cde4e>   DW_AT_GNU_locviews: 0x122d
 <4><cde52>: Abbrev Number: 10 (DW_TAG_call_site)
    <cde53>   DW_AT_call_return_pc: 0x9d04bb
    <cde5b>   DW_AT_call_origin : <0xcd7e8>
 <5><cde5f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde60>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cde62>   DW_AT_call_value  : 3 byte block: 91 ff 7e 	(DW_OP_fbreg: -129)
 <5><cde66>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde67>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cde69>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <5><cde6b>: Abbrev Number: 0
 <4><cde6c>: Abbrev Number: 0
 <3><cde6d>: Abbrev Number: 13 (DW_TAG_call_site)
    <cde6e>   DW_AT_call_return_pc: 0x9d03e6
    <cde76>   DW_AT_call_origin : <0xcd98b>
    <cde7a>   DW_AT_sibling     : <0xcde8c>
 <4><cde7e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde7f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cde81>   DW_AT_call_value  : 9 byte block: 3 f0 be a3 0 0 0 0 0 	(DW_OP_addr: a3bef0)
 <4><cde8b>: Abbrev Number: 0
 <3><cde8c>: Abbrev Number: 10 (DW_TAG_call_site)
    <cde8d>   DW_AT_call_return_pc: 0x9d04ce
    <cde95>   DW_AT_call_origin : <0xcd96e>
 <4><cde99>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde9a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cde9c>   DW_AT_call_value  : 1 byte block: 3a 	(DW_OP_lit10)
 <4><cde9e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cde9f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdea1>   DW_AT_call_value  : 9 byte block: 3 10 5 9d 0 0 0 0 0 	(DW_OP_addr: 9d0510)
 <4><cdeab>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdeac>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cdeae>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <4><cdeb0>: Abbrev Number: 0
 <3><cdeb1>: Abbrev Number: 0
 <2><cdeb2>: Abbrev Number: 26 (DW_TAG_call_site)
    <cdeb3>   DW_AT_call_return_pc: 0x9d050a
    <cdebb>   DW_AT_call_origin : <0xce176>
 <2><cdebf>: Abbrev Number: 0
 <1><cdec0>: Abbrev Number: 32 (DW_TAG_subprogram)
    <cdec1>   DW_AT_abstract_origin: <0xcda61>
    <cdec5>   DW_AT_low_pc      : 0x9d0510
    <cdecd>   DW_AT_high_pc     : 0x236
    <cded5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cded7>   DW_AT_call_all_calls: 1
    <cded7>   DW_AT_sibling     : <0xce142>
 <2><cdedb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdedc>   DW_AT_abstract_origin: <0xcda6b>
    <cdee0>   DW_AT_location    : 0x123f (location list)
    <cdee4>   DW_AT_GNU_locviews: 0x1237
 <2><cdee8>: Abbrev Number: 70 (DW_TAG_variable)
    <cdee9>   DW_AT_abstract_origin: <0xcda75>
 <2><cdeed>: Abbrev Number: 71 (DW_TAG_inlined_subroutine)
    <cdeee>   DW_AT_abstract_origin: <0xcda61>
    <cdef2>   DW_AT_ranges      : 0x626
    <cdef6>   DW_AT_call_file   : 1
    <cdef7>   DW_AT_call_line   : 201
    <cdef8>   DW_AT_call_column : 13
    <cdef9>   DW_AT_sibling     : <0xce134>
 <3><cdefd>: Abbrev Number: 72 (DW_TAG_formal_parameter)
    <cdefe>   DW_AT_abstract_origin: <0xcda6b>
 <3><cdf02>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <cdf03>   DW_AT_ranges      : 0x626
 <4><cdf07>: Abbrev Number: 27 (DW_TAG_variable)
    <cdf08>   DW_AT_abstract_origin: <0xcda75>
    <cdf0c>   DW_AT_location    : 0x1272 (location list)
    <cdf10>   DW_AT_GNU_locviews: 0x1262
 <4><cdf14>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <cdf15>   DW_AT_abstract_origin: <0xcdadb>
    <cdf19>   DW_AT_entry_pc    : 0x9d0636
    <cdf21>   DW_AT_GNU_entry_view: 2
    <cdf22>   DW_AT_ranges      : 0x63b
    <cdf26>   DW_AT_call_file   : 1
    <cdf26>   DW_AT_call_line   : 229
    <cdf27>   DW_AT_call_column : 17
    <cdf28>   DW_AT_sibling     : <0xcdf77>
 <5><cdf2c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdf2d>   DW_AT_abstract_origin: <0xcdaf0>
    <cdf31>   DW_AT_location    : 0x12bf (location list)
    <cdf35>   DW_AT_GNU_locviews: 0x12bb
 <5><cdf39>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdf3a>   DW_AT_abstract_origin: <0xcdae5>
    <cdf3e>   DW_AT_location    : 0x12f1 (location list)
    <cdf42>   DW_AT_GNU_locviews: 0x12eb
 <5><cdf46>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <cdf47>   DW_AT_ranges      : 0x63b
 <6><cdf4b>: Abbrev Number: 30 (DW_TAG_variable)
    <cdf4c>   DW_AT_abstract_origin: <0xcdafb>
    <cdf50>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <6><cdf53>: Abbrev Number: 30 (DW_TAG_variable)
    <cdf54>   DW_AT_abstract_origin: <0xcdb06>
    <cdf58>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <6><cdf5b>: Abbrev Number: 10 (DW_TAG_call_site)
    <cdf5c>   DW_AT_call_return_pc: 0x9d0664
    <cdf64>   DW_AT_call_origin : <0xcd956>
 <7><cdf68>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdf69>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <cdf6b>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <7><cdf6e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdf6f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdf71>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <7><cdf74>: Abbrev Number: 0
 <6><cdf75>: Abbrev Number: 0
 <5><cdf76>: Abbrev Number: 0
 <4><cdf77>: Abbrev Number: 28 (DW_TAG_inlined_subroutine)
    <cdf78>   DW_AT_abstract_origin: <0xcd9e2>
    <cdf7c>   DW_AT_entry_pc    : 0x9d0585
    <cdf84>   DW_AT_GNU_entry_view: 1
    <cdf85>   DW_AT_ranges      : 0x655
    <cdf89>   DW_AT_call_file   : 1
    <cdf89>   DW_AT_call_line   : 211
    <cdf8a>   DW_AT_call_column : 19
    <cdf8b>   DW_AT_sibling     : <0xcdfc4>
 <5><cdf8f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdf90>   DW_AT_abstract_origin: <0xcd9f1>
    <cdf94>   DW_AT_location    : 0x1310 (location list)
    <cdf98>   DW_AT_GNU_locviews: 0x130a
 <5><cdf9c>: Abbrev Number: 29 (DW_TAG_lexical_block)
    <cdf9d>   DW_AT_ranges      : 0x655
 <6><cdfa1>: Abbrev Number: 30 (DW_TAG_variable)
    <cdfa2>   DW_AT_abstract_origin: <0xcd9fd>
    <cdfa6>   DW_AT_location    : 2 byte block: 91 40 	(DW_OP_fbreg: -64)
 <6><cdfa9>: Abbrev Number: 10 (DW_TAG_call_site)
    <cdfaa>   DW_AT_call_return_pc: 0x9d0559
    <cdfb2>   DW_AT_call_origin : <0xcd8ea>
 <7><cdfb6>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdfb7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <cdfb9>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <7><cdfbc>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <cdfbd>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <cdfbf>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <7><cdfc1>: Abbrev Number: 0
 <6><cdfc2>: Abbrev Number: 0
 <5><cdfc3>: Abbrev Number: 0
 <4><cdfc4>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <cdfc5>   DW_AT_abstract_origin: <0xcd9a2>
    <cdfc9>   DW_AT_entry_pc    : 0x9d05d8
    <cdfd1>   DW_AT_GNU_entry_view: 1
    <cdfd2>   DW_AT_low_pc      : 0x9d05d8
    <cdfda>   DW_AT_high_pc     : 0xe
    <cdfe2>   DW_AT_call_file   : 1
    <cdfe2>   DW_AT_call_line   : 246
    <cdfe3>   DW_AT_call_column : 13
    <cdfe3>   DW_AT_sibling     : <0xce008>
 <5><cdfe7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <cdfe8>   DW_AT_abstract_origin: <0xcd9ad>
    <cdfec>   DW_AT_location    : 0x1338 (location list)
    <cdff0>   DW_AT_GNU_locviews: 0x1336
 <5><cdff4>: Abbrev Number: 10 (DW_TAG_call_site)
    <cdff5>   DW_AT_call_return_pc: 0x9d05e6
    <cdffd>   DW_AT_call_origin : <0xcd90b>
 <6><ce001>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <ce002>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ce004>   DW_AT_call_value  : 1 byte block: 32 	(DW_OP_lit2)
 <6><ce006>: Abbrev Number: 0
 <5><ce007>: Abbrev Number: 0
 <4><ce008>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <ce009>   DW_AT_abstract_origin: <0xcd9ba>
    <ce00d>   DW_AT_entry_pc    : 0x9d06b5
    <ce015>   DW_AT_GNU_entry_view: 0
    <ce016>   DW_AT_low_pc      : 0x9d06b5
    <ce01e>   DW_AT_high_pc     : 0x1a
    <ce026>   DW_AT_call_file   : 1
    <ce026>   DW_AT_call_line   : 241
    <ce027>   DW_AT_call_column : 13
    <ce027>   DW_AT_sibling     : <0xce05f>
 <5><ce02b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce02c>   DW_AT_abstract_origin: <0xcd9d5>
    <ce030>   DW_AT_location    : 0x1344 (location list)
    <ce034>   DW_AT_GNU_locviews: 0x1340
 <5><ce038>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce039>   DW_AT_abstract_origin: <0xcd9c9>
    <ce03d>   DW_AT_location    : 0x1358 (location list)
    <ce041>   DW_AT_GNU_locviews: 0x1356
 <5><ce045>: Abbrev Number: 10 (DW_TAG_call_site)
    <ce046>   DW_AT_call_return_pc: 0x9d06cf
    <ce04e>   DW_AT_call_origin : <0xcd7e8>
 <6><ce052>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <ce053>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ce055>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <6><ce058>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <ce059>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ce05b>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <6><ce05d>: Abbrev Number: 0
 <5><ce05e>: Abbrev Number: 0
 <4><ce05f>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <ce060>   DW_AT_abstract_origin: <0xcd9ba>
    <ce064>   DW_AT_entry_pc    : 0x9d06da
    <ce06c>   DW_AT_GNU_entry_view: 0
    <ce06d>   DW_AT_low_pc      : 0x9d06da
    <ce075>   DW_AT_high_pc     : 0x18
    <ce07d>   DW_AT_call_file   : 1
    <ce07d>   DW_AT_call_line   : 242
    <ce07e>   DW_AT_call_column : 13
    <ce07e>   DW_AT_sibling     : <0xce0b6>
 <5><ce082>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce083>   DW_AT_abstract_origin: <0xcd9d5>
    <ce087>   DW_AT_location    : 0x136c (location list)
    <ce08b>   DW_AT_GNU_locviews: 0x1368
 <5><ce08f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce090>   DW_AT_abstract_origin: <0xcd9c9>
    <ce094>   DW_AT_location    : 0x1380 (location list)
    <ce098>   DW_AT_GNU_locviews: 0x137e
 <5><ce09c>: Abbrev Number: 10 (DW_TAG_call_site)
    <ce09d>   DW_AT_call_return_pc: 0x9d06f2
    <ce0a5>   DW_AT_call_origin : <0xcd7e8>
 <6><ce0a9>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <ce0aa>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ce0ac>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <6><ce0af>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <ce0b0>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <ce0b2>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <6><ce0b4>: Abbrev Number: 0
 <5><ce0b5>: Abbrev Number: 0
 <4><ce0b6>: Abbrev Number: 31 (DW_TAG_inlined_subroutine)
    <ce0b7>   DW_AT_abstract_origin: <0xcd9ba>
    <ce0bb>   DW_AT_entry_pc    : 0x9d06fd
    <ce0c3>   DW_AT_GNU_entry_view: 0
    <ce0c4>   DW_AT_low_pc      : 0x9d06fd
    <ce0cc>   DW_AT_high_pc     : 0x18
    <ce0d4>   DW_AT_call_file   : 1
    <ce0d4>   DW_AT_call_line   : 243
    <ce0d5>   DW_AT_call_column : 13
    <ce0d5>   DW_AT_sibling     : <0xce10d>
 <5><ce0d9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce0da>   DW_AT_abstract_origin: <0xcd9d5>
    <ce0de>   DW_AT_location    : 0x138c (location list)
    <ce0e2>   DW_AT_GNU_locviews: 0x1388
 <5><ce0e6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <ce0e7>   DW_AT_abstract_origin: <0xcd9c9>
    <ce0eb>   DW_AT_location    : 0x13a0 (location list)
    <ce0ef>   DW_AT_GNU_locviews: 0x139e
