    <dac0d>   DW_AT_external    : 1
    <dac0d>   DW_AT_declaration : 1
 <1><dac0d>: Abbrev Number: 39 (DW_TAG_variable)
    <dac0e>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <dac12>   DW_AT_decl_file   : 9
    <dac12>   DW_AT_decl_line   : 787
    <dac14>   DW_AT_decl_column : 18
    <dac15>   DW_AT_type        : <0xda486>
    <dac19>   DW_AT_external    : 1
    <dac19>   DW_AT_declaration : 1
 <1><dac19>: Abbrev Number: 26 (DW_TAG_subprogram)
    <dac1a>   DW_AT_external    : 1
    <dac1a>   DW_AT_name        : (indirect string, offset: 0x4ca28): free
    <dac1e>   DW_AT_decl_file   : 10
    <dac1f>   DW_AT_decl_line   : 565
    <dac21>   DW_AT_decl_column : 13
    <dac22>   DW_AT_prototyped  : 1
    <dac22>   DW_AT_declaration : 1
    <dac22>   DW_AT_sibling     : <0xdac2c>
 <2><dac26>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dac27>   DW_AT_type        : <0xd9d7f>
 <2><dac2b>: Abbrev Number: 0
 <1><dac2c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <dac2d>   DW_AT_external    : 1
    <dac2d>   DW_AT_name        : (indirect string, offset: 0x136e1): malloc
    <dac31>   DW_AT_decl_file   : 10
    <dac32>   DW_AT_decl_line   : 539
    <dac34>   DW_AT_decl_column : 14
    <dac35>   DW_AT_prototyped  : 1
    <dac35>   DW_AT_type        : <0xd9d7f>
    <dac39>   DW_AT_declaration : 1
    <dac39>   DW_AT_sibling     : <0xdac43>
 <2><dac3d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <dac3e>   DW_AT_type        : <0xd9d9d>

  Compilation Unit @ offset 0xdbb68:
   Length:        0x2001 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x4235
   Pointer Size:  8
 <0><dbb74>: Abbrev Number: 60 (DW_TAG_compile_unit)
    <dbb75>   DW_AT_producer    : (indirect string, offset: 0x8e3e7): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O2
    <dbb79>   DW_AT_language    : 29	(C11)
    <dbb7a>   DW_AT_name        : (indirect line string, offset: 0x1aae): ../../src/freeglut_structure.c
    <dbb7e>   DW_AT_comp_dir    : (indirect line string, offset: 0x18af): /home/main/qb64/internal/c/parts/core/os/lnx
    <dbb82>   DW_AT_low_pc      : 0x9d5000
    <dbb8a>   DW_AT_high_pc     : 0xe75
    <dbb92>   DW_AT_stmt_list   : 0x29bdde
 <1><dbb96>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbb97>   DW_AT_byte_size   : 4
    <dbb98>   DW_AT_encoding    : 7	(unsigned)
    <dbb99>   DW_AT_name        : (indirect string, offset: 0x21686): unsigned int
 <1><dbb9d>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbb9e>   DW_AT_name        : (indirect string, offset: 0x7ffc7): GLboolean
    <dbba2>   DW_AT_decl_file   : 2
    <dbba3>   DW_AT_decl_line   : 117
    <dbba4>   DW_AT_decl_column : 23
    <dbba5>   DW_AT_type        : <0xdbba9>
 <1><dbba9>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbaa>   DW_AT_byte_size   : 1
    <dbbab>   DW_AT_encoding    : 8	(unsigned char)
    <dbbac>   DW_AT_name        : (indirect string, offset: 0x26886): unsigned char
 <1><dbbb0>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbb1>   DW_AT_byte_size   : 1
    <dbbb2>   DW_AT_encoding    : 6	(signed char)
    <dbbb3>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><dbbb7>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbb8>   DW_AT_byte_size   : 2
    <dbbb9>   DW_AT_encoding    : 5	(signed)
    <dbbba>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><dbbbe>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbbbf>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <dbbc3>   DW_AT_decl_file   : 2
    <dbbc4>   DW_AT_decl_line   : 122
    <dbbc5>   DW_AT_decl_column : 14
    <dbbc6>   DW_AT_type        : <0xdbbca>
 <1><dbbca>: Abbrev Number: 61 (DW_TAG_base_type)
    <dbbcb>   DW_AT_byte_size   : 4
    <dbbcc>   DW_AT_encoding    : 5	(signed)
    <dbbcd>   DW_AT_name        : int
 <1><dbbd1>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbd2>   DW_AT_byte_size   : 2
    <dbbd3>   DW_AT_encoding    : 7	(unsigned)
    <dbbd4>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><dbbd8>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbbd9>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <dbbdd>   DW_AT_decl_file   : 2
    <dbbde>   DW_AT_decl_line   : 125
    <dbbdf>   DW_AT_decl_column : 22
    <dbbe0>   DW_AT_type        : <0xdbb96>
 <1><dbbe4>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbe5>   DW_AT_byte_size   : 4
    <dbbe6>   DW_AT_encoding    : 4	(float)
    <dbbe7>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><dbbeb>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbec>   DW_AT_byte_size   : 8
    <dbbed>   DW_AT_encoding    : 4	(float)
    <dbbee>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><dbbf2>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbf3>   DW_AT_byte_size   : 8
    <dbbf4>   DW_AT_encoding    : 7	(unsigned)
    <dbbf5>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><dbbf9>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbbfa>   DW_AT_byte_size   : 8
    <dbbfb>   DW_AT_encoding    : 5	(signed)
    <dbbfc>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><dbc00>: Abbrev Number: 62 (DW_TAG_pointer_type)
    <dbc01>   DW_AT_byte_size   : 8
 <1><dbc02>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbc03>   DW_AT_byte_size   : 8
    <dbc03>   DW_AT_type        : <0xdbc07>
 <1><dbc07>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbc08>   DW_AT_byte_size   : 1
    <dbc09>   DW_AT_encoding    : 6	(signed char)
    <dbc0a>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><dbc0e>: Abbrev Number: 63 (DW_TAG_const_type)
    <dbc0f>   DW_AT_type        : <0xdbc07>
 <1><dbc13>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbc14>   DW_AT_byte_size   : 8
    <dbc14>   DW_AT_type        : <0xdbc18>
 <1><dbc18>: Abbrev Number: 64 (DW_TAG_subroutine_type)
    <dbc19>   DW_AT_prototyped  : 1
 <1><dbc19>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbc1a>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <dbc1e>   DW_AT_decl_file   : 3
    <dbc1f>   DW_AT_decl_line   : 209
    <dbc20>   DW_AT_decl_column : 23
    <dbc21>   DW_AT_type        : <0xdbbf2>
 <1><dbc25>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbc26>   DW_AT_byte_size   : 8
    <dbc27>   DW_AT_encoding    : 5	(signed)
    <dbc28>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><dbc2c>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbc2d>   DW_AT_byte_size   : 8
    <dbc2e>   DW_AT_encoding    : 7	(unsigned)
    <dbc2f>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><dbc33>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbc34>   DW_AT_byte_size   : 8
    <dbc34>   DW_AT_type        : <0xdbc38>
 <1><dbc38>: Abbrev Number: 65 (DW_TAG_subroutine_type)
    <dbc39>   DW_AT_sibling     : <0xdbc3f>
 <2><dbc3d>: Abbrev Number: 43 (DW_TAG_unspecified_parameters)
 <2><dbc3e>: Abbrev Number: 0
 <1><dbc3f>: Abbrev Number: 66 (DW_TAG_structure_type)
    <dbc40>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <dbc44>   DW_AT_byte_size   : 24
    <dbc45>   DW_AT_decl_file   : 4
    <dbc46>   DW_AT_decl_line   : 0
    <dbc47>   DW_AT_sibling     : <0xdbc74>
 <2><dbc4b>: Abbrev Number: 31 (DW_TAG_member)
    <dbc4c>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <dbc50>   DW_AT_decl_file   : 4
    <dbc50>   DW_AT_decl_line   : 0
    <dbc50>   DW_AT_type        : <0xdbb96>
    <dbc54>   DW_AT_data_member_location: 0
 <2><dbc55>: Abbrev Number: 31 (DW_TAG_member)
    <dbc56>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <dbc5a>   DW_AT_decl_file   : 4
    <dbc5a>   DW_AT_decl_line   : 0
    <dbc5a>   DW_AT_type        : <0xdbb96>
    <dbc5e>   DW_AT_data_member_location: 4
 <2><dbc5f>: Abbrev Number: 31 (DW_TAG_member)
    <dbc60>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <dbc64>   DW_AT_decl_file   : 4
    <dbc64>   DW_AT_decl_line   : 0
    <dbc64>   DW_AT_type        : <0xdbc00>
    <dbc68>   DW_AT_data_member_location: 8
 <2><dbc69>: Abbrev Number: 31 (DW_TAG_member)
    <dbc6a>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <dbc6e>   DW_AT_decl_file   : 4
    <dbc6e>   DW_AT_decl_line   : 0
    <dbc6e>   DW_AT_type        : <0xdbc00>
    <dbc72>   DW_AT_data_member_location: 16
 <2><dbc73>: Abbrev Number: 0
 <1><dbc74>: Abbrev Number: 67 (DW_TAG_typedef)
    <dbc75>   DW_AT_name        : XID
    <dbc79>   DW_AT_decl_file   : 5
    <dbc7a>   DW_AT_decl_line   : 66
    <dbc7b>   DW_AT_decl_column : 23
    <dbc7c>   DW_AT_type        : <0xdbbf2>
 <1><dbc80>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbc81>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <dbc85>   DW_AT_decl_file   : 5
    <dbc86>   DW_AT_decl_line   : 96
    <dbc87>   DW_AT_decl_column : 13
    <dbc88>   DW_AT_type        : <0xdbc74>
 <1><dbc8c>: Abbrev Number: 12 (DW_TAG_base_type)
    <dbc8d>   DW_AT_byte_size   : 16
    <dbc8e>   DW_AT_encoding    : 4	(float)
    <dbc8f>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><dbc93>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbc94>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <dbc98>   DW_AT_decl_file   : 6
    <dbc99>   DW_AT_decl_line   : 165
    <dbc9a>   DW_AT_decl_column : 33
    <dbc9b>   DW_AT_type        : <0xdbc9f>
 <1><dbc9f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbca0>   DW_AT_byte_size   : 8
    <dbca0>   DW_AT_type        : <0xdbca4>
 <1><dbca4>: Abbrev Number: 44 (DW_TAG_structure_type)
    <dbca5>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <dbca9>   DW_AT_declaration : 1
 <1><dbca9>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbcaa>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <dbcae>   DW_AT_decl_file   : 6
    <dbcaf>   DW_AT_decl_line   : 169
    <dbcb0>   DW_AT_decl_column : 34
    <dbcb1>   DW_AT_type        : <0xdbcb5>
 <1><dbcb5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbcb6>   DW_AT_byte_size   : 8
    <dbcb6>   DW_AT_type        : <0xdbcba>
 <1><dbcba>: Abbrev Number: 44 (DW_TAG_structure_type)
    <dbcbb>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <dbcbf>   DW_AT_declaration : 1
 <1><dbcbf>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbcc0>   DW_AT_byte_size   : 8
    <dbcc0>   DW_AT_type        : <0xdbca9>
 <1><dbcc4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbcc5>   DW_AT_byte_size   : 8
    <dbcc5>   DW_AT_type        : <0xdbc0e>
 <1><dbcc9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbcca>   DW_AT_byte_size   : 8
    <dbcca>   DW_AT_type        : <0xdbcce>
 <1><dbcce>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <dbccf>   DW_AT_prototyped  : 1
    <dbccf>   DW_AT_sibling     : <0xdbcd9>
 <2><dbcd3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbcd4>   DW_AT_type        : <0xdbbca>
 <2><dbcd8>: Abbrev Number: 0
 <1><dbcd9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbcda>   DW_AT_byte_size   : 8
    <dbcda>   DW_AT_type        : <0xdbcde>
 <1><dbcde>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <dbcdf>   DW_AT_prototyped  : 1
    <dbcdf>   DW_AT_sibling     : <0xdbcf3>
 <2><dbce3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbce4>   DW_AT_type        : <0xdbbca>
 <2><dbce8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbce9>   DW_AT_type        : <0xdbbca>
 <2><dbced>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbcee>   DW_AT_type        : <0xdbbca>
 <2><dbcf2>: Abbrev Number: 0
 <1><dbcf3>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbcf4>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <dbcf8>   DW_AT_decl_file   : 7
    <dbcf9>   DW_AT_decl_line   : 239
    <dbcfa>   DW_AT_decl_column : 17
    <dbcfb>   DW_AT_type        : <0xdbc13>
 <1><dbcff>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbd00>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <dbd04>   DW_AT_decl_file   : 7
    <dbd05>   DW_AT_decl_line   : 247
    <dbd06>   DW_AT_decl_column : 17
    <dbd07>   DW_AT_type        : <0xdbc13>
 <1><dbd0b>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbd0c>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <dbd10>   DW_AT_decl_file   : 7
    <dbd11>   DW_AT_decl_line   : 249
    <dbd12>   DW_AT_decl_column : 17
    <dbd13>   DW_AT_type        : <0xdbcc9>
 <1><dbd17>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbd18>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <dbd1c>   DW_AT_decl_file   : 7
    <dbd1d>   DW_AT_decl_line   : 250
    <dbd1e>   DW_AT_decl_column : 17
    <dbd1f>   DW_AT_type        : <0xdbcd9>
 <1><dbd23>: Abbrev Number: 13 (DW_TAG_typedef)
    <dbd24>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <dbd28>   DW_AT_decl_file   : 7
    <dbd29>   DW_AT_decl_line   : 253
    <dbd2a>   DW_AT_decl_column : 17
    <dbd2b>   DW_AT_type        : <0xdbcc9>
 <1><dbd2f>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbd30>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <dbd34>   DW_AT_decl_file   : 7
    <dbd34>   DW_AT_decl_line   : 256
    <dbd36>   DW_AT_decl_column : 17
    <dbd37>   DW_AT_type        : <0xdbd3b>
 <1><dbd3b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbd3c>   DW_AT_byte_size   : 8
    <dbd3c>   DW_AT_type        : <0xdbd40>
 <1><dbd40>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <dbd41>   DW_AT_prototyped  : 1
    <dbd41>   DW_AT_sibling     : <0xdbd50>
 <2><dbd45>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbd46>   DW_AT_type        : <0xdbcc4>
 <2><dbd4a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dbd4b>   DW_AT_type        : <0xdbd50>
 <2><dbd4f>: Abbrev Number: 0
 <1><dbd50>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dbd51>   DW_AT_byte_size   : 8
    <dbd51>   DW_AT_type        : <0xdbc3f>
 <1><dbd55>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbd56>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <dbd5a>   DW_AT_decl_file   : 7
    <dbd5a>   DW_AT_decl_line   : 257
    <dbd5c>   DW_AT_decl_column : 17
    <dbd5d>   DW_AT_type        : <0xdbd3b>
 <1><dbd61>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbd62>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <dbd66>   DW_AT_decl_file   : 7
    <dbd66>   DW_AT_decl_line   : 261
    <dbd68>   DW_AT_decl_column : 28
    <dbd69>   DW_AT_type        : <0xdbd6d>
 <1><dbd6d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dbd6e>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <dbd72>   DW_AT_byte_size   : 16
    <dbd73>   DW_AT_decl_file   : 7
    <dbd73>   DW_AT_decl_line   : 262
    <dbd75>   DW_AT_decl_column : 8
    <dbd75>   DW_AT_sibling     : <0xdbd94>
 <2><dbd79>: Abbrev Number: 1 (DW_TAG_member)
    <dbd7a>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <dbd7e>   DW_AT_decl_file   : 7
    <dbd7e>   DW_AT_decl_line   : 264
    <dbd80>   DW_AT_decl_column : 11
    <dbd81>   DW_AT_type        : <0xdbc00>
    <dbd85>   DW_AT_data_member_location: 0
 <2><dbd86>: Abbrev Number: 1 (DW_TAG_member)
    <dbd87>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <dbd8b>   DW_AT_decl_file   : 7
    <dbd8b>   DW_AT_decl_line   : 265
    <dbd8d>   DW_AT_decl_column : 11
    <dbd8e>   DW_AT_type        : <0xdbc00>
    <dbd92>   DW_AT_data_member_location: 8
 <2><dbd93>: Abbrev Number: 0
 <1><dbd94>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbd95>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <dbd99>   DW_AT_decl_file   : 7
    <dbd99>   DW_AT_decl_line   : 269
    <dbd9b>   DW_AT_decl_column : 28
    <dbd9c>   DW_AT_type        : <0xdbda0>
 <1><dbda0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dbda1>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <dbda5>   DW_AT_byte_size   : 16
    <dbda6>   DW_AT_decl_file   : 7
    <dbda6>   DW_AT_decl_line   : 270
    <dbda8>   DW_AT_decl_column : 8
    <dbda8>   DW_AT_sibling     : <0xdbdc7>
 <2><dbdac>: Abbrev Number: 1 (DW_TAG_member)
    <dbdad>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <dbdb1>   DW_AT_decl_file   : 7
    <dbdb1>   DW_AT_decl_line   : 272
    <dbdb3>   DW_AT_decl_column : 11
    <dbdb4>   DW_AT_type        : <0xdbc00>
    <dbdb8>   DW_AT_data_member_location: 0
 <2><dbdb9>: Abbrev Number: 1 (DW_TAG_member)
    <dbdba>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <dbdbe>   DW_AT_decl_file   : 7
    <dbdbe>   DW_AT_decl_line   : 273
    <dbdc0>   DW_AT_decl_column : 11
    <dbdc1>   DW_AT_type        : <0xdbc00>
    <dbdc5>   DW_AT_data_member_location: 8
 <2><dbdc6>: Abbrev Number: 0
 <1><dbdc7>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbdc8>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <dbdcc>   DW_AT_decl_file   : 7
    <dbdcc>   DW_AT_decl_line   : 277
    <dbdce>   DW_AT_decl_column : 29
    <dbdcf>   DW_AT_type        : <0xdbdd3>
 <1><dbdd3>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dbdd4>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <dbdd8>   DW_AT_byte_size   : 12
    <dbdd9>   DW_AT_decl_file   : 7
    <dbdd9>   DW_AT_decl_line   : 278
    <dbddb>   DW_AT_decl_column : 8
    <dbddb>   DW_AT_sibling     : <0xdbe03>
 <2><dbddf>: Abbrev Number: 18 (DW_TAG_member)
    <dbde0>   DW_AT_name        : X
    <dbde2>   DW_AT_decl_file   : 7
    <dbde2>   DW_AT_decl_line   : 280
    <dbde4>   DW_AT_decl_column : 21
    <dbde5>   DW_AT_type        : <0xdbbbe>
    <dbde9>   DW_AT_data_member_location: 0
 <2><dbdea>: Abbrev Number: 18 (DW_TAG_member)
    <dbdeb>   DW_AT_name        : Y
    <dbded>   DW_AT_decl_file   : 7
    <dbded>   DW_AT_decl_line   : 280
    <dbdef>   DW_AT_decl_column : 24
    <dbdf0>   DW_AT_type        : <0xdbbbe>
    <dbdf4>   DW_AT_data_member_location: 4
 <2><dbdf5>: Abbrev Number: 18 (DW_TAG_member)
    <dbdf6>   DW_AT_name        : Use
    <dbdfa>   DW_AT_decl_file   : 7
    <dbdfa>   DW_AT_decl_line   : 281
    <dbdfc>   DW_AT_decl_column : 21
    <dbdfd>   DW_AT_type        : <0xdbb9d>
    <dbe01>   DW_AT_data_member_location: 8
 <2><dbe02>: Abbrev Number: 0
 <1><dbe03>: Abbrev Number: 45 (DW_TAG_enumeration_type)
    <dbe04>   DW_AT_encoding    : 7	(void)
    <dbe04>   DW_AT_byte_size   : 4
    <dbe04>   DW_AT_type        : <0xdbb96>
    <dbe08>   DW_AT_decl_file   : 7
    <dbe08>   DW_AT_decl_line   : 289
    <dbe0a>   DW_AT_decl_column : 1
    <dbe0a>   DW_AT_sibling     : <0xdbe21>
 <2><dbe0e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbe0f>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <dbe13>   DW_AT_const_value : 0
 <2><dbe14>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbe15>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <dbe19>   DW_AT_const_value : 1
 <2><dbe1a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dbe1b>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <dbe1f>   DW_AT_const_value : 2
 <2><dbe20>: Abbrev Number: 0
 <1><dbe21>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbe22>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <dbe26>   DW_AT_decl_file   : 7
    <dbe26>   DW_AT_decl_line   : 293
    <dbe28>   DW_AT_decl_column : 3
    <dbe29>   DW_AT_type        : <0xdbe03>
 <1><dbe2d>: Abbrev Number: 7 (DW_TAG_typedef)
    <dbe2e>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <dbe32>   DW_AT_decl_file   : 7
    <dbe32>   DW_AT_decl_line   : 296
    <dbe34>   DW_AT_decl_column : 29
    <dbe35>   DW_AT_type        : <0xdbe39>
 <1><dbe39>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dbe3a>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <dbe3e>   DW_AT_byte_size   : 232
    <dbe3f>   DW_AT_decl_file   : 7
    <dbe3f>   DW_AT_decl_line   : 297
    <dbe41>   DW_AT_decl_column : 8
    <dbe41>   DW_AT_sibling     : <0xdc041>
 <2><dbe45>: Abbrev Number: 1 (DW_TAG_member)
    <dbe46>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <dbe4a>   DW_AT_decl_file   : 7
    <dbe4a>   DW_AT_decl_line   : 299
    <dbe4c>   DW_AT_decl_column : 22
    <dbe4d>   DW_AT_type        : <0xdbdc7>
    <dbe51>   DW_AT_data_member_location: 0
 <2><dbe52>: Abbrev Number: 1 (DW_TAG_member)
    <dbe53>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <dbe57>   DW_AT_decl_file   : 7
    <dbe57>   DW_AT_decl_line   : 300
    <dbe59>   DW_AT_decl_column : 22
    <dbe5a>   DW_AT_type        : <0xdbdc7>
    <dbe5e>   DW_AT_data_member_location: 12
 <2><dbe5f>: Abbrev Number: 1 (DW_TAG_member)
    <dbe60>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <dbe64>   DW_AT_decl_file   : 7
    <dbe64>   DW_AT_decl_line   : 301
    <dbe66>   DW_AT_decl_column : 22
    <dbe67>   DW_AT_type        : <0xdbb96>
    <dbe6b>   DW_AT_data_member_location: 24
 <2><dbe6c>: Abbrev Number: 1 (DW_TAG_member)
    <dbe6d>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <dbe71>   DW_AT_decl_file   : 7
    <dbe71>   DW_AT_decl_line   : 303
    <dbe73>   DW_AT_decl_column : 22
    <dbe74>   DW_AT_type        : <0xdbb9d>
    <dbe78>   DW_AT_data_member_location: 28
 <2><dbe79>: Abbrev Number: 1 (DW_TAG_member)
    <dbe7a>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <dbe7e>   DW_AT_decl_file   : 7
    <dbe7e>   DW_AT_decl_line   : 305
    <dbe80>   DW_AT_decl_column : 22
    <dbe81>   DW_AT_type        : <0xdbbca>
    <dbe85>   DW_AT_data_member_location: 32
 <2><dbe86>: Abbrev Number: 1 (DW_TAG_member)
    <dbe87>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <dbe8b>   DW_AT_decl_file   : 7
    <dbe8b>   DW_AT_decl_line   : 307
    <dbe8d>   DW_AT_decl_column : 22
    <dbe8e>   DW_AT_type        : <0xdbb9d>
    <dbe92>   DW_AT_data_member_location: 36
 <2><dbe93>: Abbrev Number: 1 (DW_TAG_member)
    <dbe94>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <dbe98>   DW_AT_decl_file   : 7
    <dbe98>   DW_AT_decl_line   : 308
    <dbe9a>   DW_AT_decl_column : 22
    <dbe9b>   DW_AT_type        : <0xdbb9d>
    <dbe9f>   DW_AT_data_member_location: 37
 <2><dbea0>: Abbrev Number: 1 (DW_TAG_member)
    <dbea1>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <dbea5>   DW_AT_decl_file   : 7
    <dbea5>   DW_AT_decl_line   : 310
    <dbea7>   DW_AT_decl_column : 22
    <dbea8>   DW_AT_type        : <0xdbb9d>
    <dbeac>   DW_AT_data_member_location: 38
 <2><dbead>: Abbrev Number: 1 (DW_TAG_member)
    <dbeae>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <dbeb2>   DW_AT_decl_file   : 7
    <dbeb2>   DW_AT_decl_line   : 311
    <dbeb4>   DW_AT_decl_column : 22
    <dbeb5>   DW_AT_type        : <0xdbb9d>
    <dbeb9>   DW_AT_data_member_location: 39
 <2><dbeba>: Abbrev Number: 1 (DW_TAG_member)
    <dbebb>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <dbebf>   DW_AT_decl_file   : 7
    <dbebf>   DW_AT_decl_line   : 313
    <dbec1>   DW_AT_decl_column : 22
    <dbec2>   DW_AT_type        : <0xdbbca>
    <dbec6>   DW_AT_data_member_location: 40
 <2><dbec7>: Abbrev Number: 1 (DW_TAG_member)
    <dbec8>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <dbecc>   DW_AT_decl_file   : 7
    <dbecc>   DW_AT_decl_line   : 314
    <dbece>   DW_AT_decl_column : 22
    <dbecf>   DW_AT_type        : <0xdbbca>
    <dbed3>   DW_AT_data_member_location: 44
 <2><dbed4>: Abbrev Number: 1 (DW_TAG_member)
    <dbed5>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <dbed9>   DW_AT_decl_file   : 7
    <dbed9>   DW_AT_decl_line   : 316
    <dbedb>   DW_AT_decl_column : 22
    <dbedc>   DW_AT_type        : <0xdbbd8>
    <dbee0>   DW_AT_data_member_location: 48
 <2><dbee1>: Abbrev Number: 1 (DW_TAG_member)
    <dbee2>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <dbee6>   DW_AT_decl_file   : 7
    <dbee6>   DW_AT_decl_line   : 317
    <dbee8>   DW_AT_decl_column : 22
    <dbee9>   DW_AT_type        : <0xdbbd8>
    <dbeed>   DW_AT_data_member_location: 52
 <2><dbeee>: Abbrev Number: 1 (DW_TAG_member)
    <dbeef>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <dbef3>   DW_AT_decl_file   : 7
    <dbef3>   DW_AT_decl_line   : 318
    <dbef5>   DW_AT_decl_column : 22
    <dbef6>   DW_AT_type        : <0xdbbd8>
    <dbefa>   DW_AT_data_member_location: 56
 <2><dbefb>: Abbrev Number: 1 (DW_TAG_member)
    <dbefc>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <dbf00>   DW_AT_decl_file   : 7
    <dbf00>   DW_AT_decl_line   : 320
    <dbf02>   DW_AT_decl_column : 22
    <dbf03>   DW_AT_type        : <0xdbbf2>
    <dbf07>   DW_AT_data_member_location: 64
 <2><dbf08>: Abbrev Number: 1 (DW_TAG_member)
    <dbf09>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <dbf0d>   DW_AT_decl_file   : 7
    <dbf0d>   DW_AT_decl_line   : 321
    <dbf0f>   DW_AT_decl_column : 22
    <dbf10>   DW_AT_type        : <0xdbd61>
    <dbf14>   DW_AT_data_member_location: 72
 <2><dbf15>: Abbrev Number: 1 (DW_TAG_member)
    <dbf16>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <dbf1a>   DW_AT_decl_file   : 7
    <dbf1a>   DW_AT_decl_line   : 322
    <dbf1c>   DW_AT_decl_column : 22
    <dbf1d>   DW_AT_type        : <0xdbd61>
    <dbf21>   DW_AT_data_member_location: 88
 <2><dbf22>: Abbrev Number: 1 (DW_TAG_member)
    <dbf23>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <dbf27>   DW_AT_decl_file   : 7
    <dbf27>   DW_AT_decl_line   : 324
    <dbf29>   DW_AT_decl_column : 22
    <dbf2a>   DW_AT_type        : <0xdbcff>
    <dbf2e>   DW_AT_data_member_location: 104
 <2><dbf2f>: Abbrev Number: 1 (DW_TAG_member)
    <dbf30>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <dbf34>   DW_AT_decl_file   : 7
    <dbf34>   DW_AT_decl_line   : 326
    <dbf36>   DW_AT_decl_column : 22
    <dbf37>   DW_AT_type        : <0xdbbca>
    <dbf3b>   DW_AT_data_member_location: 112
 <2><dbf3c>: Abbrev Number: 1 (DW_TAG_member)
    <dbf3d>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <dbf41>   DW_AT_decl_file   : 7
    <dbf41>   DW_AT_decl_line   : 327
    <dbf43>   DW_AT_decl_column : 22
    <dbf44>   DW_AT_type        : <0xdbd0b>
    <dbf48>   DW_AT_data_member_location: 120
 <2><dbf49>: Abbrev Number: 1 (DW_TAG_member)
    <dbf4a>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <dbf4e>   DW_AT_decl_file   : 7
    <dbf4e>   DW_AT_decl_line   : 328
    <dbf50>   DW_AT_decl_column : 22
    <dbf51>   DW_AT_type        : <0xdbd17>
    <dbf55>   DW_AT_data_member_location: 128
 <2><dbf56>: Abbrev Number: 1 (DW_TAG_member)
    <dbf57>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <dbf5b>   DW_AT_decl_file   : 7
    <dbf5b>   DW_AT_decl_line   : 330
    <dbf5d>   DW_AT_decl_column : 22
    <dbf5e>   DW_AT_type        : <0xdbdc7>
    <dbf62>   DW_AT_data_member_location: 136
 <2><dbf63>: Abbrev Number: 1 (DW_TAG_member)
    <dbf64>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <dbf68>   DW_AT_decl_file   : 7
    <dbf68>   DW_AT_decl_line   : 331
    <dbf6a>   DW_AT_decl_column : 22
    <dbf6b>   DW_AT_type        : <0xdbbca>
    <dbf6f>   DW_AT_data_member_location: 148
 <2><dbf70>: Abbrev Number: 1 (DW_TAG_member)
    <dbf71>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <dbf75>   DW_AT_decl_file   : 7
    <dbf75>   DW_AT_decl_line   : 332
    <dbf77>   DW_AT_decl_column : 22
    <dbf78>   DW_AT_type        : <0xdbbca>
    <dbf7c>   DW_AT_data_member_location: 152
 <2><dbf7d>: Abbrev Number: 1 (DW_TAG_member)
    <dbf7e>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <dbf82>   DW_AT_decl_file   : 7
    <dbf82>   DW_AT_decl_line   : 334
    <dbf84>   DW_AT_decl_column : 22
    <dbf85>   DW_AT_type        : <0xdbbca>
    <dbf89>   DW_AT_data_member_location: 156
 <2><dbf8a>: Abbrev Number: 1 (DW_TAG_member)
    <dbf8b>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <dbf8f>   DW_AT_decl_file   : 7
    <dbf8f>   DW_AT_decl_line   : 336
    <dbf91>   DW_AT_decl_column : 22
    <dbf92>   DW_AT_type        : <0xdbe21>
    <dbf96>   DW_AT_data_member_location: 160
 <2><dbf97>: Abbrev Number: 1 (DW_TAG_member)
    <dbf98>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <dbf9c>   DW_AT_decl_file   : 7
    <dbf9c>   DW_AT_decl_line   : 337
    <dbf9e>   DW_AT_decl_column : 22
    <dbf9f>   DW_AT_type        : <0xdbc02>
    <dbfa3>   DW_AT_data_member_location: 168
 <2><dbfa4>: Abbrev Number: 1 (DW_TAG_member)
    <dbfa5>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <dbfa9>   DW_AT_decl_file   : 7
    <dbfa9>   DW_AT_decl_line   : 338
    <dbfab>   DW_AT_decl_column : 22
    <dbfac>   DW_AT_type        : <0xdbb9d>
    <dbfb0>   DW_AT_data_member_location: 176
 <2><dbfb1>: Abbrev Number: 1 (DW_TAG_member)
    <dbfb2>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <dbfb6>   DW_AT_decl_file   : 7
    <dbfb6>   DW_AT_decl_line   : 339
    <dbfb8>   DW_AT_decl_column : 22
    <dbfb9>   DW_AT_type        : <0xdbbca>
    <dbfbd>   DW_AT_data_member_location: 180
 <2><dbfbe>: Abbrev Number: 1 (DW_TAG_member)
    <dbfbf>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <dbfc3>   DW_AT_decl_file   : 7
    <dbfc3>   DW_AT_decl_line   : 340
    <dbfc5>   DW_AT_decl_column : 22
    <dbfc6>   DW_AT_type        : <0xdbb9d>
    <dbfca>   DW_AT_data_member_location: 184
 <2><dbfcb>: Abbrev Number: 1 (DW_TAG_member)
    <dbfcc>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <dbfd0>   DW_AT_decl_file   : 7
    <dbfd0>   DW_AT_decl_line   : 342
    <dbfd2>   DW_AT_decl_column : 19
    <dbfd3>   DW_AT_type        : <0xdbbca>
    <dbfd7>   DW_AT_data_member_location: 188
 <2><dbfd8>: Abbrev Number: 1 (DW_TAG_member)
    <dbfd9>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <dbfdd>   DW_AT_decl_file   : 7
    <dbfdd>   DW_AT_decl_line   : 344
    <dbfdf>   DW_AT_decl_column : 22
    <dbfe0>   DW_AT_type        : <0xdbbca>
    <dbfe4>   DW_AT_data_member_location: 192
 <2><dbfe5>: Abbrev Number: 1 (DW_TAG_member)
    <dbfe6>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <dbfea>   DW_AT_decl_file   : 7
    <dbfea>   DW_AT_decl_line   : 345
    <dbfec>   DW_AT_decl_column : 22
    <dbfed>   DW_AT_type        : <0xdbbca>
    <dbff1>   DW_AT_data_member_location: 196
 <2><dbff2>: Abbrev Number: 1 (DW_TAG_member)
    <dbff3>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <dbff7>   DW_AT_decl_file   : 7
    <dbff7>   DW_AT_decl_line   : 347
    <dbff9>   DW_AT_decl_column : 22
    <dbffa>   DW_AT_type        : <0xdbbca>
    <dbffe>   DW_AT_data_member_location: 200
 <2><dbfff>: Abbrev Number: 1 (DW_TAG_member)
    <dc000>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <dc004>   DW_AT_decl_file   : 7
    <dc004>   DW_AT_decl_line   : 348
    <dc006>   DW_AT_decl_column : 22
    <dc007>   DW_AT_type        : <0xdbbca>
    <dc00b>   DW_AT_data_member_location: 204
 <2><dc00c>: Abbrev Number: 1 (DW_TAG_member)
    <dc00d>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <dc011>   DW_AT_decl_file   : 7
    <dc011>   DW_AT_decl_line   : 349
    <dc013>   DW_AT_decl_column : 22
    <dc014>   DW_AT_type        : <0xdbbca>
    <dc018>   DW_AT_data_member_location: 208
 <2><dc019>: Abbrev Number: 1 (DW_TAG_member)
    <dc01a>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <dc01e>   DW_AT_decl_file   : 7
    <dc01e>   DW_AT_decl_line   : 350
    <dc020>   DW_AT_decl_column : 22
    <dc021>   DW_AT_type        : <0xdbbca>
    <dc025>   DW_AT_data_member_location: 212
 <2><dc026>: Abbrev Number: 1 (DW_TAG_member)
    <dc027>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <dc02b>   DW_AT_decl_file   : 7
    <dc02b>   DW_AT_decl_line   : 351
    <dc02d>   DW_AT_decl_column : 22
    <dc02e>   DW_AT_type        : <0xdbd2f>
    <dc032>   DW_AT_data_member_location: 216
 <2><dc033>: Abbrev Number: 1 (DW_TAG_member)
    <dc034>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <dc038>   DW_AT_decl_file   : 7
    <dc038>   DW_AT_decl_line   : 352
    <dc03a>   DW_AT_decl_column : 22
    <dc03b>   DW_AT_type        : <0xdbd55>
    <dc03f>   DW_AT_data_member_location: 224
 <2><dc040>: Abbrev Number: 0
 <1><dc041>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc042>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <dc046>   DW_AT_decl_file   : 7
    <dc046>   DW_AT_decl_line   : 419
    <dc048>   DW_AT_decl_column : 20
    <dc049>   DW_AT_type        : <0xdbc80>
 <1><dc04d>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc04e>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <dc052>   DW_AT_decl_file   : 7
    <dc052>   DW_AT_decl_line   : 420
    <dc054>   DW_AT_decl_column : 20
    <dc055>   DW_AT_type        : <0xdbc93>
 <1><dc059>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc05a>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <dc05e>   DW_AT_decl_file   : 7
    <dc05e>   DW_AT_decl_line   : 433
    <dc060>   DW_AT_decl_column : 31
    <dc061>   DW_AT_type        : <0xdc065>
 <1><dc065>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc066>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <dc06a>   DW_AT_byte_size   : 32
    <dc06b>   DW_AT_decl_file   : 7
    <dc06b>   DW_AT_decl_line   : 434
    <dc06d>   DW_AT_decl_column : 8
    <dc06d>   DW_AT_sibling     : <0xdc0a6>
 <2><dc071>: Abbrev Number: 1 (DW_TAG_member)
    <dc072>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <dc076>   DW_AT_decl_file   : 7
    <dc076>   DW_AT_decl_line   : 436
    <dc078>   DW_AT_decl_column : 27
    <dc079>   DW_AT_type        : <0xdc041>
    <dc07d>   DW_AT_data_member_location: 0
 <2><dc07e>: Abbrev Number: 1 (DW_TAG_member)
    <dc07f>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <dc083>   DW_AT_decl_file   : 7
    <dc083>   DW_AT_decl_line   : 437
    <dc085>   DW_AT_decl_column : 27
    <dc086>   DW_AT_type        : <0xdc04d>
    <dc08a>   DW_AT_data_member_location: 8
 <2><dc08b>: Abbrev Number: 1 (DW_TAG_member)
    <dc08c>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <dc090>   DW_AT_decl_file   : 7
    <dc090>   DW_AT_decl_line   : 440
    <dc092>   DW_AT_decl_column : 21
    <dc093>   DW_AT_type        : <0xdbcbf>
    <dc097>   DW_AT_data_member_location: 16
 <2><dc098>: Abbrev Number: 1 (DW_TAG_member)
    <dc099>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <dc09d>   DW_AT_decl_file   : 7
    <dc09d>   DW_AT_decl_line   : 445
    <dc09f>   DW_AT_decl_column : 21
    <dc0a0>   DW_AT_type        : <0xdbbca>
    <dc0a4>   DW_AT_data_member_location: 24
 <2><dc0a5>: Abbrev Number: 0
 <1><dc0a6>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc0a7>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <dc0ab>   DW_AT_decl_file   : 7
    <dc0ab>   DW_AT_decl_line   : 449
    <dc0ad>   DW_AT_decl_column : 35
    <dc0ae>   DW_AT_type        : <0xdc0b2>
 <1><dc0b2>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc0b3>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <dc0b7>   DW_AT_byte_size   : 56
    <dc0b8>   DW_AT_decl_file   : 7
    <dc0b8>   DW_AT_decl_line   : 450
    <dc0ba>   DW_AT_decl_column : 8
    <dc0ba>   DW_AT_sibling     : <0xdc182>
 <2><dc0be>: Abbrev Number: 1 (DW_TAG_member)
    <dc0bf>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <dc0c3>   DW_AT_decl_file   : 7
    <dc0c3>   DW_AT_decl_line   : 453
    <dc0c5>   DW_AT_decl_column : 21
    <dc0c6>   DW_AT_type        : <0xdbbca>
    <dc0ca>   DW_AT_data_member_location: 0
 <2><dc0cb>: Abbrev Number: 1 (DW_TAG_member)
    <dc0cc>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <dc0d0>   DW_AT_decl_file   : 7
    <dc0d0>   DW_AT_decl_line   : 454
    <dc0d2>   DW_AT_decl_column : 21
    <dc0d3>   DW_AT_type        : <0xdbbca>
    <dc0d7>   DW_AT_data_member_location: 4
 <2><dc0d8>: Abbrev Number: 1 (DW_TAG_member)
    <dc0d9>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <dc0dd>   DW_AT_decl_file   : 7
    <dc0dd>   DW_AT_decl_line   : 456
    <dc0df>   DW_AT_decl_column : 21
    <dc0e0>   DW_AT_type        : <0xdbbca>
    <dc0e4>   DW_AT_data_member_location: 8
 <2><dc0e5>: Abbrev Number: 1 (DW_TAG_member)
    <dc0e6>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <dc0ea>   DW_AT_decl_file   : 7
    <dc0ea>   DW_AT_decl_line   : 457
    <dc0ec>   DW_AT_decl_column : 21
    <dc0ed>   DW_AT_type        : <0xdbbca>
    <dc0f1>   DW_AT_data_member_location: 12
 <2><dc0f2>: Abbrev Number: 1 (DW_TAG_member)
    <dc0f3>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <dc0f7>   DW_AT_decl_file   : 7
    <dc0f7>   DW_AT_decl_line   : 463
    <dc0f9>   DW_AT_decl_column : 21
    <dc0fa>   DW_AT_type        : <0xdbb9d>
    <dc0fe>   DW_AT_data_member_location: 16
 <2><dc0ff>: Abbrev Number: 1 (DW_TAG_member)
    <dc100>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <dc104>   DW_AT_decl_file   : 7
    <dc104>   DW_AT_decl_line   : 464
    <dc106>   DW_AT_decl_column : 21
    <dc107>   DW_AT_type        : <0xdbb9d>
    <dc10b>   DW_AT_data_member_location: 17
 <2><dc10c>: Abbrev Number: 1 (DW_TAG_member)
    <dc10d>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <dc111>   DW_AT_decl_file   : 7
    <dc111>   DW_AT_decl_line   : 466
    <dc113>   DW_AT_decl_column : 21
    <dc114>   DW_AT_type        : <0xdbbca>
    <dc118>   DW_AT_data_member_location: 20
 <2><dc119>: Abbrev Number: 1 (DW_TAG_member)
    <dc11a>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <dc11e>   DW_AT_decl_file   : 7
    <dc11e>   DW_AT_decl_line   : 468
    <dc120>   DW_AT_decl_column : 21
    <dc121>   DW_AT_type        : <0xdbbf9>
    <dc125>   DW_AT_data_member_location: 24
 <2><dc126>: Abbrev Number: 1 (DW_TAG_member)
    <dc127>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <dc12b>   DW_AT_decl_file   : 7
    <dc12b>   DW_AT_decl_line   : 469
    <dc12d>   DW_AT_decl_column : 21
    <dc12e>   DW_AT_type        : <0xdbbf9>
    <dc132>   DW_AT_data_member_location: 32
 <2><dc133>: Abbrev Number: 1 (DW_TAG_member)
    <dc134>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <dc138>   DW_AT_decl_file   : 7
    <dc138>   DW_AT_decl_line   : 471
    <dc13a>   DW_AT_decl_column : 21
    <dc13b>   DW_AT_type        : <0xdbbca>
    <dc13f>   DW_AT_data_member_location: 40
 <2><dc140>: Abbrev Number: 1 (DW_TAG_member)
    <dc141>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <dc145>   DW_AT_decl_file   : 7
    <dc145>   DW_AT_decl_line   : 471
    <dc147>   DW_AT_decl_column : 29
    <dc148>   DW_AT_type        : <0xdbbca>
    <dc14c>   DW_AT_data_member_location: 44
 <2><dc14d>: Abbrev Number: 1 (DW_TAG_member)
    <dc14e>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <dc152>   DW_AT_decl_file   : 7
    <dc152>   DW_AT_decl_line   : 473
    <dc154>   DW_AT_decl_column : 21
    <dc155>   DW_AT_type        : <0xdbb9d>
    <dc159>   DW_AT_data_member_location: 48
 <2><dc15a>: Abbrev Number: 1 (DW_TAG_member)
    <dc15b>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <dc15f>   DW_AT_decl_file   : 7
    <dc15f>   DW_AT_decl_line   : 474
    <dc161>   DW_AT_decl_column : 21
    <dc162>   DW_AT_type        : <0xdbb9d>
    <dc166>   DW_AT_data_member_location: 49
 <2><dc167>: Abbrev Number: 1 (DW_TAG_member)
    <dc168>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <dc16c>   DW_AT_decl_file   : 7
    <dc16c>   DW_AT_decl_line   : 476
    <dc16e>   DW_AT_decl_column : 21
    <dc16f>   DW_AT_type        : <0xdbb9d>
    <dc173>   DW_AT_data_member_location: 50
 <2><dc174>: Abbrev Number: 1 (DW_TAG_member)
    <dc175>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <dc179>   DW_AT_decl_file   : 7
    <dc179>   DW_AT_decl_line   : 478
    <dc17b>   DW_AT_decl_column : 21
    <dc17c>   DW_AT_type        : <0xdbb9d>
    <dc180>   DW_AT_data_member_location: 51
 <2><dc181>: Abbrev Number: 0
 <1><dc182>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc183>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <dc187>   DW_AT_decl_file   : 7
    <dc187>   DW_AT_decl_line   : 487
    <dc189>   DW_AT_decl_column : 16
    <dc18a>   DW_AT_type        : <0xdbc33>
 <1><dc18e>: Abbrev Number: 45 (DW_TAG_enumeration_type)
    <dc18f>   DW_AT_encoding    : 7	(void)
    <dc18f>   DW_AT_byte_size   : 4
    <dc18f>   DW_AT_type        : <0xdbb96>
    <dc193>   DW_AT_decl_file   : 7
    <dc193>   DW_AT_decl_line   : 587
    <dc195>   DW_AT_decl_column : 1
    <dc195>   DW_AT_sibling     : <0xdc248>
 <2><dc199>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc19a>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <dc19e>   DW_AT_const_value : 0
 <2><dc19f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1a0>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <dc1a4>   DW_AT_const_value : 1
 <2><dc1a5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1a6>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <dc1aa>   DW_AT_const_value : 2
 <2><dc1ab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1ac>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <dc1b0>   DW_AT_const_value : 3
 <2><dc1b1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1b2>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <dc1b6>   DW_AT_const_value : 4
 <2><dc1b7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1b8>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <dc1bc>   DW_AT_const_value : 5
 <2><dc1bd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1be>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <dc1c2>   DW_AT_const_value : 6
 <2><dc1c3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1c4>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <dc1c8>   DW_AT_const_value : 7
 <2><dc1c9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1ca>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <dc1ce>   DW_AT_const_value : 8
 <2><dc1cf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1d0>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <dc1d4>   DW_AT_const_value : 9
 <2><dc1d5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1d6>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <dc1da>   DW_AT_const_value : 10
 <2><dc1db>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1dc>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <dc1e0>   DW_AT_const_value : 11
 <2><dc1e1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1e2>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <dc1e6>   DW_AT_const_value : 12
 <2><dc1e7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1e8>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <dc1ec>   DW_AT_const_value : 13
 <2><dc1ed>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1ee>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <dc1f2>   DW_AT_const_value : 14
 <2><dc1f3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1f4>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <dc1f8>   DW_AT_const_value : 15
 <2><dc1f9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc1fa>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <dc1fe>   DW_AT_const_value : 16
 <2><dc1ff>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc200>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <dc204>   DW_AT_const_value : 17
 <2><dc205>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc206>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <dc20a>   DW_AT_const_value : 18
 <2><dc20b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc20c>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <dc210>   DW_AT_const_value : 19
 <2><dc211>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc212>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <dc216>   DW_AT_const_value : 20
 <2><dc217>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc218>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <dc21c>   DW_AT_const_value : 21
 <2><dc21d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc21e>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <dc222>   DW_AT_const_value : 22
 <2><dc223>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc224>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <dc228>   DW_AT_const_value : 23
 <2><dc229>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc22a>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <dc22e>   DW_AT_const_value : 24
 <2><dc22f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc230>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <dc234>   DW_AT_const_value : 25
 <2><dc235>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc236>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <dc23a>   DW_AT_const_value : 26
 <2><dc23b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc23c>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <dc240>   DW_AT_const_value : 27
 <2><dc241>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dc242>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <dc246>   DW_AT_const_value : 28
 <2><dc247>: Abbrev Number: 0
 <1><dc248>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc249>   DW_AT_name        : (indirect string, offset: 0x8e56b): SFG_MenuContext
    <dc24d>   DW_AT_decl_file   : 7
    <dc24d>   DW_AT_decl_line   : 627
    <dc24f>   DW_AT_decl_column : 35
    <dc250>   DW_AT_type        : <0xdc254>
 <1><dc254>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc255>   DW_AT_name        : (indirect string, offset: 0x8e568): tagSFG_MenuContext
    <dc259>   DW_AT_byte_size   : 8
    <dc25a>   DW_AT_decl_file   : 7
    <dc25a>   DW_AT_decl_line   : 628
    <dc25c>   DW_AT_decl_column : 8
    <dc25c>   DW_AT_sibling     : <0xdc26e>
 <2><dc260>: Abbrev Number: 1 (DW_TAG_member)
    <dc261>   DW_AT_name        : (indirect string, offset: 0x8e24f): MContext
    <dc265>   DW_AT_decl_file   : 7
    <dc265>   DW_AT_decl_line   : 630
    <dc267>   DW_AT_decl_column : 27
    <dc268>   DW_AT_type        : <0xdc04d>
    <dc26c>   DW_AT_data_member_location: 0
 <2><dc26d>: Abbrev Number: 0
 <1><dc26e>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc26f>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <dc273>   DW_AT_decl_file   : 7
    <dc273>   DW_AT_decl_line   : 634
    <dc275>   DW_AT_decl_column : 30
    <dc276>   DW_AT_type        : <0xdc27a>
 <1><dc27a>: Abbrev Number: 68 (DW_TAG_structure_type)
    <dc27b>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <dc27f>   DW_AT_byte_size   : 408
    <dc281>   DW_AT_decl_file   : 7
    <dc282>   DW_AT_decl_line   : 673
    <dc284>   DW_AT_decl_column : 8
    <dc285>   DW_AT_sibling     : <0xdc31e>
 <2><dc289>: Abbrev Number: 1 (DW_TAG_member)
    <dc28a>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <dc28e>   DW_AT_decl_file   : 7
    <dc28e>   DW_AT_decl_line   : 675
    <dc290>   DW_AT_decl_column : 25
    <dc291>   DW_AT_type        : <0xdbd94>
    <dc295>   DW_AT_data_member_location: 0
 <2><dc296>: Abbrev Number: 18 (DW_TAG_member)
    <dc297>   DW_AT_name        : ID
    <dc29a>   DW_AT_decl_file   : 7
    <dc29a>   DW_AT_decl_line   : 676
    <dc29c>   DW_AT_decl_column : 25
    <dc29d>   DW_AT_type        : <0xdbbca>
    <dc2a1>   DW_AT_data_member_location: 16
 <2><dc2a2>: Abbrev Number: 1 (DW_TAG_member)
    <dc2a3>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <dc2a7>   DW_AT_decl_file   : 7
    <dc2a7>   DW_AT_decl_line   : 678
    <dc2a9>   DW_AT_decl_column : 25
    <dc2aa>   DW_AT_type        : <0xdc059>
    <dc2ae>   DW_AT_data_member_location: 24
 <2><dc2af>: Abbrev Number: 1 (DW_TAG_member)
    <dc2b0>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <dc2b4>   DW_AT_decl_file   : 7
    <dc2b4>   DW_AT_decl_line   : 679
    <dc2b6>   DW_AT_decl_column : 25
    <dc2b7>   DW_AT_type        : <0xdc0a6>
    <dc2bb>   DW_AT_data_member_location: 56
 <2><dc2bc>: Abbrev Number: 1 (DW_TAG_member)
    <dc2bd>   DW_AT_name        : (indirect string, offset: 0x900ce): CallBacks
    <dc2c1>   DW_AT_decl_file   : 7
    <dc2c1>   DW_AT_decl_line   : 680
    <dc2c3>   DW_AT_decl_column : 25
    <dc2c4>   DW_AT_type        : <0xdc46a>
    <dc2c8>   DW_AT_data_member_location: 112
 <2><dc2c9>: Abbrev Number: 24 (DW_TAG_member)
    <dc2ca>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <dc2ce>   DW_AT_decl_file   : 7
    <dc2ce>   DW_AT_decl_line   : 681
    <dc2d0>   DW_AT_decl_column : 25
    <dc2d1>   DW_AT_type        : <0xdbc00>
    <dc2d5>   DW_AT_data_member_location: 336
 <2><dc2d7>: Abbrev Number: 24 (DW_TAG_member)
    <dc2d8>   DW_AT_name        : (indirect string, offset: 0x8df1d): Menu
    <dc2dc>   DW_AT_decl_file   : 7
    <dc2dc>   DW_AT_decl_line   : 683
    <dc2de>   DW_AT_decl_column : 21
    <dc2df>   DW_AT_type        : <0xdc47a>
    <dc2e3>   DW_AT_data_member_location: 344
 <2><dc2e5>: Abbrev Number: 24 (DW_TAG_member)
    <dc2e6>   DW_AT_name        : (indirect string, offset: 0x8f46f): ActiveMenu
    <dc2ea>   DW_AT_decl_file   : 7
    <dc2ea>   DW_AT_decl_line   : 684
    <dc2ec>   DW_AT_decl_column : 21
    <dc2ed>   DW_AT_type        : <0xdc465>
    <dc2f1>   DW_AT_data_member_location: 368
 <2><dc2f3>: Abbrev Number: 24 (DW_TAG_member)
    <dc2f4>   DW_AT_name        : (indirect string, offset: 0x8e0e5): Parent
    <dc2f8>   DW_AT_decl_file   : 7
    <dc2f8>   DW_AT_decl_line   : 686
    <dc2fa>   DW_AT_decl_column : 25
    <dc2fb>   DW_AT_type        : <0xdc460>
    <dc2ff>   DW_AT_data_member_location: 376
 <2><dc301>: Abbrev Number: 24 (DW_TAG_member)
    <dc302>   DW_AT_name        : (indirect string, offset: 0x8dfdc): Children
    <dc306>   DW_AT_decl_file   : 7
    <dc306>   DW_AT_decl_line   : 687
    <dc308>   DW_AT_decl_column : 25
    <dc309>   DW_AT_type        : <0xdbd61>
    <dc30d>   DW_AT_data_member_location: 384
 <2><dc30f>: Abbrev Number: 24 (DW_TAG_member)
    <dc310>   DW_AT_name        : (indirect string, offset: 0x8e06d): IsMenu
    <dc314>   DW_AT_decl_file   : 7
    <dc314>   DW_AT_decl_line   : 689
    <dc316>   DW_AT_decl_column : 25
    <dc317>   DW_AT_type        : <0xdbb9d>
    <dc31b>   DW_AT_data_member_location: 400
 <2><dc31d>: Abbrev Number: 0
 <1><dc31e>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc31f>   DW_AT_name        : (indirect string, offset: 0x8e762): SFG_MenuEntry
    <dc323>   DW_AT_decl_file   : 7
    <dc323>   DW_AT_decl_line   : 635
    <dc325>   DW_AT_decl_column : 33
    <dc326>   DW_AT_type        : <0xdc32a>
 <1><dc32a>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc32b>   DW_AT_name        : (indirect string, offset: 0x8e75f): tagSFG_MenuEntry
    <dc32f>   DW_AT_byte_size   : 48
    <dc330>   DW_AT_decl_file   : 7
    <dc330>   DW_AT_decl_line   : 656
    <dc332>   DW_AT_decl_column : 8
    <dc332>   DW_AT_sibling     : <0xdc391>
 <2><dc336>: Abbrev Number: 1 (DW_TAG_member)
    <dc337>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <dc33b>   DW_AT_decl_file   : 7
    <dc33b>   DW_AT_decl_line   : 658
    <dc33d>   DW_AT_decl_column : 25
    <dc33e>   DW_AT_type        : <0xdbd94>
    <dc342>   DW_AT_data_member_location: 0
 <2><dc343>: Abbrev Number: 18 (DW_TAG_member)
    <dc344>   DW_AT_name        : ID
    <dc347>   DW_AT_decl_file   : 7
    <dc347>   DW_AT_decl_line   : 659
    <dc349>   DW_AT_decl_column : 25
    <dc34a>   DW_AT_type        : <0xdbbca>
    <dc34e>   DW_AT_data_member_location: 16
 <2><dc34f>: Abbrev Number: 1 (DW_TAG_member)
    <dc350>   DW_AT_name        : (indirect string, offset: 0x8e00a): Ordinal
    <dc354>   DW_AT_decl_file   : 7
    <dc354>   DW_AT_decl_line   : 660
    <dc356>   DW_AT_decl_column : 25
    <dc357>   DW_AT_type        : <0xdbbca>
    <dc35b>   DW_AT_data_member_location: 20
 <2><dc35c>: Abbrev Number: 1 (DW_TAG_member)
    <dc35d>   DW_AT_name        : (indirect string, offset: 0x8fc1b): Text
    <dc361>   DW_AT_decl_file   : 7
    <dc361>   DW_AT_decl_line   : 661
    <dc363>   DW_AT_decl_column : 25
    <dc364>   DW_AT_type        : <0xdbc02>
    <dc368>   DW_AT_data_member_location: 24
 <2><dc369>: Abbrev Number: 1 (DW_TAG_member)
    <dc36a>   DW_AT_name        : (indirect string, offset: 0x8f9db): SubMenu
    <dc36e>   DW_AT_decl_file   : 7
    <dc36e>   DW_AT_decl_line   : 662
    <dc370>   DW_AT_decl_column : 25
    <dc371>   DW_AT_type        : <0xdc465>
    <dc375>   DW_AT_data_member_location: 32
 <2><dc376>: Abbrev Number: 1 (DW_TAG_member)
    <dc377>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <dc37b>   DW_AT_decl_file   : 7
    <dc37b>   DW_AT_decl_line   : 663
    <dc37d>   DW_AT_decl_column : 25
    <dc37e>   DW_AT_type        : <0xdbb9d>
    <dc382>   DW_AT_data_member_location: 40
 <2><dc383>: Abbrev Number: 1 (DW_TAG_member)
    <dc384>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <dc388>   DW_AT_decl_file   : 7
    <dc388>   DW_AT_decl_line   : 664
    <dc38a>   DW_AT_decl_column : 25
    <dc38b>   DW_AT_type        : <0xdbbca>
    <dc38f>   DW_AT_data_member_location: 44
 <2><dc390>: Abbrev Number: 0
 <1><dc391>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc392>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <dc396>   DW_AT_decl_file   : 7
    <dc396>   DW_AT_decl_line   : 636
    <dc398>   DW_AT_decl_column : 28
    <dc399>   DW_AT_type        : <0xdc39d>
 <1><dc39d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc39e>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <dc3a2>   DW_AT_byte_size   : 112
    <dc3a3>   DW_AT_decl_file   : 7
    <dc3a3>   DW_AT_decl_line   : 637
    <dc3a5>   DW_AT_decl_column : 8
    <dc3a5>   DW_AT_sibling     : <0xdc45b>
 <2><dc3a9>: Abbrev Number: 1 (DW_TAG_member)
    <dc3aa>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <dc3ae>   DW_AT_decl_file   : 7
    <dc3ae>   DW_AT_decl_line   : 639
    <dc3b0>   DW_AT_decl_column : 25
    <dc3b1>   DW_AT_type        : <0xdbd94>
    <dc3b5>   DW_AT_data_member_location: 0
 <2><dc3b6>: Abbrev Number: 1 (DW_TAG_member)
    <dc3b7>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <dc3bb>   DW_AT_decl_file   : 7
    <dc3bb>   DW_AT_decl_line   : 640
    <dc3bd>   DW_AT_decl_column : 25
    <dc3be>   DW_AT_type        : <0xdbc00>
    <dc3c2>   DW_AT_data_member_location: 16
 <2><dc3c3>: Abbrev Number: 18 (DW_TAG_member)
    <dc3c4>   DW_AT_name        : ID
    <dc3c7>   DW_AT_decl_file   : 7
    <dc3c7>   DW_AT_decl_line   : 641
    <dc3c9>   DW_AT_decl_column : 25
    <dc3ca>   DW_AT_type        : <0xdbbca>
    <dc3ce>   DW_AT_data_member_location: 24
 <2><dc3cf>: Abbrev Number: 1 (DW_TAG_member)
    <dc3d0>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <dc3d4>   DW_AT_decl_file   : 7
    <dc3d4>   DW_AT_decl_line   : 642
    <dc3d6>   DW_AT_decl_column : 25
    <dc3d7>   DW_AT_type        : <0xdbd61>
    <dc3db>   DW_AT_data_member_location: 32
 <2><dc3dc>: Abbrev Number: 1 (DW_TAG_member)
    <dc3dd>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <dc3e1>   DW_AT_decl_file   : 7
    <dc3e1>   DW_AT_decl_line   : 643
    <dc3e3>   DW_AT_decl_column : 25
    <dc3e4>   DW_AT_type        : <0xdbd23>
    <dc3e8>   DW_AT_data_member_location: 48
 <2><dc3e9>: Abbrev Number: 1 (DW_TAG_member)
    <dc3ea>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <dc3ee>   DW_AT_decl_file   : 7
    <dc3ee>   DW_AT_decl_line   : 644
    <dc3f0>   DW_AT_decl_column : 25
    <dc3f1>   DW_AT_type        : <0xdbcf3>
    <dc3f5>   DW_AT_data_member_location: 56
 <2><dc3f6>: Abbrev Number: 1 (DW_TAG_member)
    <dc3f7>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <dc3fb>   DW_AT_decl_file   : 7
    <dc3fb>   DW_AT_decl_line   : 645
    <dc3fd>   DW_AT_decl_column : 25
    <dc3fe>   DW_AT_type        : <0xdbb9d>
    <dc402>   DW_AT_data_member_location: 64
 <2><dc403>: Abbrev Number: 1 (DW_TAG_member)
    <dc404>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <dc408>   DW_AT_decl_file   : 7
    <dc408>   DW_AT_decl_line   : 646
    <dc40a>   DW_AT_decl_column : 25
    <dc40b>   DW_AT_type        : <0xdbbca>
    <dc40f>   DW_AT_data_member_location: 68
 <2><dc410>: Abbrev Number: 1 (DW_TAG_member)
    <dc411>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <dc415>   DW_AT_decl_file   : 7
    <dc415>   DW_AT_decl_line   : 647
    <dc417>   DW_AT_decl_column : 25
    <dc418>   DW_AT_type        : <0xdbbca>
    <dc41c>   DW_AT_data_member_location: 72
 <2><dc41d>: Abbrev Number: 18 (DW_TAG_member)
    <dc41e>   DW_AT_name        : X
    <dc420>   DW_AT_decl_file   : 7
    <dc420>   DW_AT_decl_line   : 648
    <dc422>   DW_AT_decl_column : 25
    <dc423>   DW_AT_type        : <0xdbbca>
    <dc427>   DW_AT_data_member_location: 76
 <2><dc428>: Abbrev Number: 18 (DW_TAG_member)
    <dc429>   DW_AT_name        : Y
    <dc42b>   DW_AT_decl_file   : 7
    <dc42b>   DW_AT_decl_line   : 648
    <dc42d>   DW_AT_decl_column : 28
    <dc42e>   DW_AT_type        : <0xdbbca>
    <dc432>   DW_AT_data_member_location: 80
 <2><dc433>: Abbrev Number: 1 (DW_TAG_member)
    <dc434>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <dc438>   DW_AT_decl_file   : 7
    <dc438>   DW_AT_decl_line   : 650
    <dc43a>   DW_AT_decl_column : 25
    <dc43b>   DW_AT_type        : <0xdc45b>
    <dc43f>   DW_AT_data_member_location: 88
 <2><dc440>: Abbrev Number: 1 (DW_TAG_member)
    <dc441>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <dc445>   DW_AT_decl_file   : 7
    <dc445>   DW_AT_decl_line   : 651
    <dc447>   DW_AT_decl_column : 25
    <dc448>   DW_AT_type        : <0xdc460>
    <dc44c>   DW_AT_data_member_location: 96
 <2><dc44d>: Abbrev Number: 1 (DW_TAG_member)
    <dc44e>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <dc452>   DW_AT_decl_file   : 7
    <dc452>   DW_AT_decl_line   : 652
    <dc454>   DW_AT_decl_column : 25
    <dc455>   DW_AT_type        : <0xdc460>
    <dc459>   DW_AT_data_member_location: 104
 <2><dc45a>: Abbrev Number: 0
 <1><dc45b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc45c>   DW_AT_byte_size   : 8
    <dc45c>   DW_AT_type        : <0xdc31e>
 <1><dc460>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc461>   DW_AT_byte_size   : 8
    <dc461>   DW_AT_type        : <0xdc26e>
 <1><dc465>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc466>   DW_AT_byte_size   : 8
    <dc466>   DW_AT_type        : <0xdc391>
 <1><dc46a>: Abbrev Number: 46 (DW_TAG_array_type)
    <dc46b>   DW_AT_type        : <0xdc182>
    <dc46f>   DW_AT_sibling     : <0xdc47a>
 <2><dc473>: Abbrev Number: 47 (DW_TAG_subrange_type)
    <dc474>   DW_AT_type        : <0xdbbf2>
    <dc478>   DW_AT_upper_bound : 27
 <2><dc479>: Abbrev Number: 0
 <1><dc47a>: Abbrev Number: 46 (DW_TAG_array_type)
    <dc47b>   DW_AT_type        : <0xdc465>
    <dc47f>   DW_AT_sibling     : <0xdc48a>
 <2><dc483>: Abbrev Number: 47 (DW_TAG_subrange_type)
    <dc484>   DW_AT_type        : <0xdbbf2>
    <dc488>   DW_AT_upper_bound : 2
 <2><dc489>: Abbrev Number: 0
 <1><dc48a>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc48b>   DW_AT_name        : (indirect string, offset: 0x90022): SFG_WindowList
    <dc48f>   DW_AT_decl_file   : 7
    <dc48f>   DW_AT_decl_line   : 694
    <dc491>   DW_AT_decl_column : 34
    <dc492>   DW_AT_type        : <0xdc496>
 <1><dc496>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc497>   DW_AT_name        : (indirect string, offset: 0x9001f): tagSFG_WindowList
    <dc49b>   DW_AT_byte_size   : 24
    <dc49c>   DW_AT_decl_file   : 7
    <dc49c>   DW_AT_decl_line   : 695
    <dc49e>   DW_AT_decl_column : 8
    <dc49e>   DW_AT_sibling     : <0xdc4bd>
 <2><dc4a2>: Abbrev Number: 1 (DW_TAG_member)
    <dc4a3>   DW_AT_name        : (indirect string, offset: 0x8e596): node
    <dc4a7>   DW_AT_decl_file   : 7
    <dc4a7>   DW_AT_decl_line   : 697
    <dc4a9>   DW_AT_decl_column : 14
    <dc4aa>   DW_AT_type        : <0xdbd94>
    <dc4ae>   DW_AT_data_member_location: 0
 <2><dc4af>: Abbrev Number: 1 (DW_TAG_member)
    <dc4b0>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dc4b4>   DW_AT_decl_file   : 7
    <dc4b4>   DW_AT_decl_line   : 698
    <dc4b6>   DW_AT_decl_column : 17
    <dc4b7>   DW_AT_type        : <0xdc460>
    <dc4bb>   DW_AT_data_member_location: 16
 <2><dc4bc>: Abbrev Number: 0
 <1><dc4bd>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc4be>   DW_AT_name        : (indirect string, offset: 0x8e11b): SFG_Structure
    <dc4c2>   DW_AT_decl_file   : 7
    <dc4c2>   DW_AT_decl_line   : 702
    <dc4c4>   DW_AT_decl_column : 33
    <dc4c5>   DW_AT_type        : <0xdc4c9>
 <1><dc4c9>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc4ca>   DW_AT_name        : (indirect string, offset: 0x8e118): tagSFG_Structure
    <dc4ce>   DW_AT_byte_size   : 88
    <dc4cf>   DW_AT_decl_file   : 7
    <dc4cf>   DW_AT_decl_line   : 703
    <dc4d1>   DW_AT_decl_column : 8
    <dc4d1>   DW_AT_sibling     : <0xdc54b>
 <2><dc4d5>: Abbrev Number: 1 (DW_TAG_member)
    <dc4d6>   DW_AT_name        : (indirect string, offset: 0x8f090): Windows
    <dc4da>   DW_AT_decl_file   : 7
    <dc4da>   DW_AT_decl_line   : 705
    <dc4dc>   DW_AT_decl_column : 21
    <dc4dd>   DW_AT_type        : <0xdbd61>
    <dc4e1>   DW_AT_data_member_location: 0
 <2><dc4e2>: Abbrev Number: 1 (DW_TAG_member)
    <dc4e3>   DW_AT_name        : (indirect string, offset: 0x8e25e): Menus
    <dc4e7>   DW_AT_decl_file   : 7
    <dc4e7>   DW_AT_decl_line   : 706
    <dc4e9>   DW_AT_decl_column : 21
    <dc4ea>   DW_AT_type        : <0xdbd61>
    <dc4ee>   DW_AT_data_member_location: 16
 <2><dc4ef>: Abbrev Number: 1 (DW_TAG_member)
    <dc4f0>   DW_AT_name        : (indirect string, offset: 0x8e65c): WindowsToDestroy
    <dc4f4>   DW_AT_decl_file   : 7
    <dc4f4>   DW_AT_decl_line   : 707
    <dc4f6>   DW_AT_decl_column : 21
    <dc4f7>   DW_AT_type        : <0xdbd61>
    <dc4fb>   DW_AT_data_member_location: 32
 <2><dc4fc>: Abbrev Number: 1 (DW_TAG_member)
    <dc4fd>   DW_AT_name        : (indirect string, offset: 0x8e343): CurrentWindow
    <dc501>   DW_AT_decl_file   : 7
    <dc501>   DW_AT_decl_line   : 709
    <dc503>   DW_AT_decl_column : 21
    <dc504>   DW_AT_type        : <0xdc460>
    <dc508>   DW_AT_data_member_location: 48
 <2><dc509>: Abbrev Number: 1 (DW_TAG_member)
    <dc50a>   DW_AT_name        : (indirect string, offset: 0x8e07f): CurrentMenu
    <dc50e>   DW_AT_decl_file   : 7
    <dc50e>   DW_AT_decl_line   : 710
    <dc510>   DW_AT_decl_column : 21
    <dc511>   DW_AT_type        : <0xdc465>
    <dc515>   DW_AT_data_member_location: 56
 <2><dc516>: Abbrev Number: 1 (DW_TAG_member)
    <dc517>   DW_AT_name        : (indirect string, offset: 0x8e56f): MenuContext
    <dc51b>   DW_AT_decl_file   : 7
    <dc51b>   DW_AT_decl_line   : 712
    <dc51d>   DW_AT_decl_column : 22
    <dc51e>   DW_AT_type        : <0xdc54b>
    <dc522>   DW_AT_data_member_location: 64
 <2><dc523>: Abbrev Number: 1 (DW_TAG_member)
    <dc524>   DW_AT_name        : (indirect string, offset: 0x8e5bb): GameModeWindow
    <dc528>   DW_AT_decl_file   : 7
    <dc528>   DW_AT_decl_line   : 714
    <dc52a>   DW_AT_decl_column : 22
    <dc52b>   DW_AT_type        : <0xdc460>
    <dc52f>   DW_AT_data_member_location: 72
 <2><dc530>: Abbrev Number: 1 (DW_TAG_member)
    <dc531>   DW_AT_name        : (indirect string, offset: 0x8e2ad): WindowID
    <dc535>   DW_AT_decl_file   : 7
    <dc535>   DW_AT_decl_line   : 716
    <dc537>   DW_AT_decl_column : 22
    <dc538>   DW_AT_type        : <0xdbbca>
    <dc53c>   DW_AT_data_member_location: 80
 <2><dc53d>: Abbrev Number: 1 (DW_TAG_member)
    <dc53e>   DW_AT_name        : (indirect string, offset: 0x8f878): MenuID
    <dc542>   DW_AT_decl_file   : 7
    <dc542>   DW_AT_decl_line   : 717
    <dc544>   DW_AT_decl_column : 22
    <dc545>   DW_AT_type        : <0xdbbca>
    <dc549>   DW_AT_data_member_location: 84
 <2><dc54a>: Abbrev Number: 0
 <1><dc54b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc54c>   DW_AT_byte_size   : 8
    <dc54c>   DW_AT_type        : <0xdc248>
 <1><dc550>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc551>   DW_AT_name        : (indirect string, offset: 0x8f042): SFG_Enumerator
    <dc555>   DW_AT_decl_file   : 7
    <dc555>   DW_AT_decl_line   : 726
    <dc557>   DW_AT_decl_column : 34
    <dc558>   DW_AT_type        : <0xdc55c>
 <1><dc55c>: Abbrev Number: 14 (DW_TAG_structure_type)
    <dc55d>   DW_AT_name        : (indirect string, offset: 0x8f03f): tagSFG_Enumerator
    <dc561>   DW_AT_byte_size   : 16
    <dc562>   DW_AT_decl_file   : 7
    <dc562>   DW_AT_decl_line   : 727
    <dc564>   DW_AT_decl_column : 8
    <dc564>   DW_AT_sibling     : <0xdc583>
 <2><dc568>: Abbrev Number: 1 (DW_TAG_member)
    <dc569>   DW_AT_name        : (indirect string, offset: 0x8f108): found
    <dc56d>   DW_AT_decl_file   : 7
    <dc56d>   DW_AT_decl_line   : 729
    <dc56f>   DW_AT_decl_column : 17
    <dc570>   DW_AT_type        : <0xdbb9d>
    <dc574>   DW_AT_data_member_location: 0
 <2><dc575>: Abbrev Number: 1 (DW_TAG_member)
    <dc576>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <dc57a>   DW_AT_decl_file   : 7
    <dc57a>   DW_AT_decl_line   : 730
    <dc57c>   DW_AT_decl_column : 17
    <dc57d>   DW_AT_type        : <0xdbc00>
    <dc581>   DW_AT_data_member_location: 8
 <2><dc582>: Abbrev Number: 0
 <1><dc583>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc584>   DW_AT_name        : (indirect string, offset: 0x8f059): FGCBenumerator
    <dc588>   DW_AT_decl_file   : 7
    <dc588>   DW_AT_decl_line   : 732
    <dc58a>   DW_AT_decl_column : 17
    <dc58b>   DW_AT_type        : <0xdc58f>
 <1><dc58f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc590>   DW_AT_byte_size   : 8
    <dc590>   DW_AT_type        : <0xdc594>
 <1><dc594>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <dc595>   DW_AT_prototyped  : 1
    <dc595>   DW_AT_sibling     : <0xdc5a4>
 <2><dc599>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc59a>   DW_AT_type        : <0xdc460>
 <2><dc59e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc59f>   DW_AT_type        : <0xdc5a4>
 <2><dc5a3>: Abbrev Number: 0
 <1><dc5a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc5a5>   DW_AT_byte_size   : 8
    <dc5a5>   DW_AT_type        : <0xdc550>
 <1><dc5a9>: Abbrev Number: 48 (DW_TAG_variable)
    <dc5aa>   DW_AT_name        : (indirect string, offset: 0x8e3ad): fgStructure
    <dc5ae>   DW_AT_decl_file   : 7
    <dc5ae>   DW_AT_decl_line   : 784
    <dc5b0>   DW_AT_decl_column : 22
    <dc5b1>   DW_AT_type        : <0xdc4bd>
    <dc5b5>   DW_AT_external    : 1
    <dc5b5>   DW_AT_declaration : 1
 <1><dc5b5>: Abbrev Number: 48 (DW_TAG_variable)
    <dc5b6>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <dc5ba>   DW_AT_decl_file   : 7
    <dc5ba>   DW_AT_decl_line   : 787
    <dc5bc>   DW_AT_decl_column : 18
    <dc5bd>   DW_AT_type        : <0xdbe2d>
    <dc5c1>   DW_AT_external    : 1
    <dc5c1>   DW_AT_declaration : 1
 <1><dc5c1>: Abbrev Number: 69 (DW_TAG_variable)
    <dc5c2>   DW_AT_specification: <0xdc5a9>
    <dc5c6>   DW_AT_decl_file   : 1
    <dc5c7>   DW_AT_decl_line   : 41
    <dc5c8>   DW_AT_decl_column : 15
    <dc5c9>   DW_AT_location    : 9 byte block: 3 40 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a40)
 <1><dc5d3>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc5d4>   DW_AT_external    : 1
    <dc5d4>   DW_AT_name        : (indirect string, offset: 0x8ffe0): fgCloseWindow
    <dc5d8>   DW_AT_decl_file   : 7
    <dc5d9>   DW_AT_decl_line   : 883
    <dc5db>   DW_AT_decl_column : 13
    <dc5dc>   DW_AT_prototyped  : 1
    <dc5dc>   DW_AT_declaration : 1
    <dc5dc>   DW_AT_sibling     : <0xdc5e6>
 <2><dc5e0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc5e1>   DW_AT_type        : <0xdc460>
 <2><dc5e5>: Abbrev Number: 0
 <1><dc5e6>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc5e7>   DW_AT_external    : 1
    <dc5e7>   DW_AT_name        : (indirect string, offset: 0x8f81c): fgDeactivateMenu
    <dc5eb>   DW_AT_decl_file   : 7
    <dc5ec>   DW_AT_decl_line   : 975
    <dc5ee>   DW_AT_decl_column : 6
    <dc5ef>   DW_AT_prototyped  : 1
    <dc5ef>   DW_AT_declaration : 1
    <dc5ef>   DW_AT_sibling     : <0xdc5f9>
 <2><dc5f3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc5f4>   DW_AT_type        : <0xdc460>
 <2><dc5f8>: Abbrev Number: 0
 <1><dc5f9>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc5fa>   DW_AT_external    : 1
    <dc5fa>   DW_AT_name        : (indirect string, offset: 0x8e9c9): fgError
    <dc5fe>   DW_AT_decl_file   : 7
    <dc5ff>   DW_AT_decl_line   : 998
    <dc601>   DW_AT_decl_column : 6
    <dc602>   DW_AT_prototyped  : 1
    <dc602>   DW_AT_declaration : 1
    <dc602>   DW_AT_sibling     : <0xdc60d>
 <2><dc606>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc607>   DW_AT_type        : <0xdbcc4>
 <2><dc60b>: Abbrev Number: 43 (DW_TAG_unspecified_parameters)
 <2><dc60c>: Abbrev Number: 0
 <1><dc60d>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc60e>   DW_AT_external    : 1
    <dc60e>   DW_AT_name        : (indirect string, offset: 0x4ca28): free
    <dc612>   DW_AT_decl_file   : 8
    <dc613>   DW_AT_decl_line   : 565
    <dc615>   DW_AT_decl_column : 13
    <dc616>   DW_AT_prototyped  : 1
    <dc616>   DW_AT_declaration : 1
    <dc616>   DW_AT_sibling     : <0xdc620>
 <2><dc61a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc61b>   DW_AT_type        : <0xdbc00>
 <2><dc61f>: Abbrev Number: 0
 <1><dc620>: Abbrev Number: 49 (DW_TAG_subprogram)
    <dc621>   DW_AT_external    : 1
    <dc621>   DW_AT_name        : (indirect string, offset: 0x136e1): malloc
    <dc625>   DW_AT_decl_file   : 8
    <dc625>   DW_AT_decl_line   : 539
    <dc627>   DW_AT_decl_column : 14
    <dc627>   DW_AT_prototyped  : 1
    <dc627>   DW_AT_type        : <0xdbc00>
    <dc62b>   DW_AT_declaration : 1
    <dc62b>   DW_AT_sibling     : <0xdc635>
 <2><dc62f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc630>   DW_AT_type        : <0xdbc19>
 <2><dc634>: Abbrev Number: 0
 <1><dc635>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc636>   DW_AT_external    : 1
    <dc636>   DW_AT_name        : (indirect string, offset: 0x8dfe5): fgSetWindow
    <dc63a>   DW_AT_decl_file   : 7
    <dc63b>   DW_AT_decl_line   : 878
    <dc63d>   DW_AT_decl_column : 13
    <dc63e>   DW_AT_prototyped  : 1
    <dc63e>   DW_AT_declaration : 1
    <dc63e>   DW_AT_sibling     : <0xdc648>
 <2><dc642>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc643>   DW_AT_type        : <0xdc460>
 <2><dc647>: Abbrev Number: 0
 <1><dc648>: Abbrev Number: 50 (DW_TAG_subprogram)
    <dc649>   DW_AT_external    : 1
    <dc649>   DW_AT_name        : (indirect string, offset: 0x83853): glutHideWindow
    <dc64d>   DW_AT_decl_file   : 9
    <dc64e>   DW_AT_decl_line   : 415
    <dc650>   DW_AT_decl_column : 26
    <dc651>   DW_AT_prototyped  : 1
    <dc651>   DW_AT_declaration : 1
 <1><dc651>: Abbrev Number: 50 (DW_TAG_subprogram)
    <dc652>   DW_AT_external    : 1
    <dc652>   DW_AT_name        : (indirect string, offset: 0x8f897): fgDisplayMenu
    <dc656>   DW_AT_decl_file   : 7
    <dc657>   DW_AT_decl_line   : 982
    <dc659>   DW_AT_decl_column : 6
    <dc65a>   DW_AT_prototyped  : 1
    <dc65a>   DW_AT_declaration : 1
 <1><dc65a>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc65b>   DW_AT_external    : 1
    <dc65b>   DW_AT_name        : (indirect string, offset: 0x8a3c1): glutDisplayFunc
    <dc65f>   DW_AT_decl_file   : 9
    <dc660>   DW_AT_decl_line   : 473
    <dc662>   DW_AT_decl_column : 26
    <dc663>   DW_AT_prototyped  : 1
    <dc663>   DW_AT_declaration : 1
    <dc663>   DW_AT_sibling     : <0xdc66d>
 <2><dc667>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc668>   DW_AT_type        : <0xdbc13>
 <2><dc66c>: Abbrev Number: 0
 <1><dc66d>: Abbrev Number: 22 (DW_TAG_subprogram)
    <dc66e>   DW_AT_external    : 1
    <dc66e>   DW_AT_name        : (indirect string, offset: 0x9007b): fgOpenWindow
    <dc672>   DW_AT_decl_file   : 7
    <dc673>   DW_AT_decl_line   : 879
    <dc675>   DW_AT_decl_column : 13
    <dc676>   DW_AT_prototyped  : 1
    <dc676>   DW_AT_declaration : 1
    <dc676>   DW_AT_sibling     : <0xdc6ad>
 <2><dc67a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc67b>   DW_AT_type        : <0xdc460>
 <2><dc67f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc680>   DW_AT_type        : <0xdbcc4>
 <2><dc684>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc685>   DW_AT_type        : <0xdbb9d>
 <2><dc689>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc68a>   DW_AT_type        : <0xdbbca>
 <2><dc68e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc68f>   DW_AT_type        : <0xdbbca>
 <2><dc693>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc694>   DW_AT_type        : <0xdbb9d>
 <2><dc698>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc699>   DW_AT_type        : <0xdbbca>
 <2><dc69d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc69e>   DW_AT_type        : <0xdbbca>
 <2><dc6a2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc6a3>   DW_AT_type        : <0xdbb9d>
 <2><dc6a7>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc6a8>   DW_AT_type        : <0xdbb9d>
 <2><dc6ac>: Abbrev Number: 0
 <1><dc6ad>: Abbrev Number: 49 (DW_TAG_subprogram)
    <dc6ae>   DW_AT_external    : 1
    <dc6ae>   DW_AT_name        : (indirect string, offset: 0x8efd0): calloc
    <dc6b2>   DW_AT_decl_file   : 8
    <dc6b2>   DW_AT_decl_line   : 542
    <dc6b4>   DW_AT_decl_column : 14
    <dc6b4>   DW_AT_prototyped  : 1
    <dc6b4>   DW_AT_type        : <0xdbc00>
    <dc6b8>   DW_AT_declaration : 1
    <dc6b8>   DW_AT_sibling     : <0xdc6c7>
 <2><dc6bc>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc6bd>   DW_AT_type        : <0xdbc19>
 <2><dc6c1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <dc6c2>   DW_AT_type        : <0xdbc19>
 <2><dc6c6>: Abbrev Number: 0
 <1><dc6c7>: Abbrev Number: 35 (DW_TAG_subprogram)
    <dc6c8>   DW_AT_external    : 1
    <dc6c8>   DW_AT_name        : (indirect string, offset: 0x8e224): fgListInsert
    <dc6cc>   DW_AT_decl_file   : 1
    <dc6cc>   DW_AT_decl_line   : 580
    <dc6ce>   DW_AT_decl_column : 6
    <dc6ce>   DW_AT_prototyped  : 1
    <dc6ce>   DW_AT_low_pc      : 0x9d5e40
    <dc6d6>   DW_AT_high_pc     : 0x35
    <dc6de>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc6e0>   DW_AT_call_all_calls: 1
    <dc6e0>   DW_AT_sibling     : <0xdc723>
 <2><dc6e4>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <dc6e5>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <dc6e9>   DW_AT_decl_file   : 1
    <dc6e9>   DW_AT_decl_line   : 580
    <dc6eb>   DW_AT_decl_column : 29
    <dc6ec>   DW_AT_type        : <0xdc723>
    <dc6f0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
 <2><dc6f2>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <dc6f3>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <dc6f7>   DW_AT_decl_file   : 1
    <dc6f7>   DW_AT_decl_line   : 580
    <dc6f9>   DW_AT_decl_column : 45
    <dc6fa>   DW_AT_type        : <0xdc728>
    <dc6fe>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
 <2><dc700>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <dc701>   DW_AT_name        : (indirect string, offset: 0x8e596): node
    <dc705>   DW_AT_decl_file   : 1
    <dc705>   DW_AT_decl_line   : 580
    <dc707>   DW_AT_decl_column : 61
    <dc708>   DW_AT_type        : <0xdc728>
    <dc70c>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
 <2><dc70e>: Abbrev Number: 19 (DW_TAG_variable)
    <dc70f>   DW_AT_name        : (indirect string, offset: 0x6b000): prev
    <dc713>   DW_AT_decl_file   : 1
    <dc713>   DW_AT_decl_line   : 582
    <dc715>   DW_AT_decl_column : 15
    <dc716>   DW_AT_type        : <0xdc728>
    <dc71a>   DW_AT_location    : 0x3b5b (location list)
    <dc71e>   DW_AT_GNU_locviews: 0x3b57
 <2><dc722>: Abbrev Number: 0
 <1><dc723>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc724>   DW_AT_byte_size   : 8
    <dc724>   DW_AT_type        : <0xdbd61>
 <1><dc728>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <dc729>   DW_AT_byte_size   : 8
    <dc729>   DW_AT_type        : <0xdbd94>
 <1><dc72d>: Abbrev Number: 33 (DW_TAG_subprogram)
    <dc72e>   DW_AT_external    : 1
    <dc72e>   DW_AT_name        : (indirect string, offset: 0x8feb8): fgListLength
    <dc732>   DW_AT_decl_file   : 1
    <dc732>   DW_AT_decl_line   : 566
    <dc734>   DW_AT_decl_column : 5
    <dc735>   DW_AT_prototyped  : 1
    <dc735>   DW_AT_type        : <0xdbbca>
    <dc739>   DW_AT_low_pc      : 0x9d5e20
    <dc741>   DW_AT_high_pc     : 0x20
    <dc749>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc74b>   DW_AT_call_all_calls: 1
    <dc74b>   DW_AT_sibling     : <0xdc786>
 <2><dc74f>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <dc750>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <dc754>   DW_AT_decl_file   : 1
    <dc754>   DW_AT_decl_line   : 566
    <dc756>   DW_AT_decl_column : 28
    <dc757>   DW_AT_type        : <0xdc723>
    <dc75b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
 <2><dc75d>: Abbrev Number: 19 (DW_TAG_variable)
    <dc75e>   DW_AT_name        : (indirect string, offset: 0x8e596): node
    <dc762>   DW_AT_decl_file   : 1
    <dc762>   DW_AT_decl_line   : 568
    <dc764>   DW_AT_decl_column : 15
    <dc765>   DW_AT_type        : <0xdc728>
    <dc769>   DW_AT_location    : 0x3b6e (location list)
    <dc76d>   DW_AT_GNU_locviews: 0x3b6a
 <2><dc771>: Abbrev Number: 19 (DW_TAG_variable)
    <dc772>   DW_AT_name        : (indirect string, offset: 0x7801a): length
    <dc776>   DW_AT_decl_file   : 1
    <dc776>   DW_AT_decl_line   : 569
    <dc778>   DW_AT_decl_column : 9
    <dc779>   DW_AT_type        : <0xdbbca>
    <dc77d>   DW_AT_location    : 0x3b81 (location list)
    <dc781>   DW_AT_GNU_locviews: 0x3b7d
 <2><dc785>: Abbrev Number: 0
 <1><dc786>: Abbrev Number: 30 (DW_TAG_subprogram)
    <dc787>   DW_AT_external    : 1
    <dc787>   DW_AT_name        : (indirect string, offset: 0x8e5ca): fgListRemove
    <dc78b>   DW_AT_decl_file   : 1
    <dc78b>   DW_AT_decl_line   : 554
    <dc78d>   DW_AT_decl_column : 6
    <dc78d>   DW_AT_prototyped  : 1
    <dc78d>   DW_AT_inline      : 1	(not inlined)
    <dc78d>   DW_AT_sibling     : <0xdc7aa>
 <2><dc791>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc792>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <dc796>   DW_AT_decl_file   : 1
    <dc796>   DW_AT_decl_line   : 554
    <dc798>   DW_AT_decl_column : 29
    <dc799>   DW_AT_type        : <0xdc723>
 <2><dc79d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc79e>   DW_AT_name        : (indirect string, offset: 0x8e596): node
    <dc7a2>   DW_AT_decl_file   : 1
    <dc7a2>   DW_AT_decl_line   : 554
    <dc7a4>   DW_AT_decl_column : 45
    <dc7a5>   DW_AT_type        : <0xdc728>
 <2><dc7a9>: Abbrev Number: 0
 <1><dc7aa>: Abbrev Number: 30 (DW_TAG_subprogram)
    <dc7ab>   DW_AT_external    : 1
    <dc7ab>   DW_AT_name        : (indirect string, offset: 0x8f455): fgListAppend
    <dc7af>   DW_AT_decl_file   : 1
    <dc7af>   DW_AT_decl_line   : 536
    <dc7b1>   DW_AT_decl_column : 6
    <dc7b1>   DW_AT_prototyped  : 1
    <dc7b1>   DW_AT_inline      : 1	(not inlined)
    <dc7b1>   DW_AT_sibling     : <0xdc7dc>
 <2><dc7b5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc7b6>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <dc7ba>   DW_AT_decl_file   : 1
    <dc7ba>   DW_AT_decl_line   : 536
    <dc7bc>   DW_AT_decl_column : 29
    <dc7bd>   DW_AT_type        : <0xdc723>
 <2><dc7c1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc7c2>   DW_AT_name        : (indirect string, offset: 0x8e596): node
    <dc7c6>   DW_AT_decl_file   : 1
    <dc7c6>   DW_AT_decl_line   : 536
    <dc7c8>   DW_AT_decl_column : 45
    <dc7c9>   DW_AT_type        : <0xdc728>
 <2><dc7cd>: Abbrev Number: 36 (DW_TAG_lexical_block)
 <3><dc7ce>: Abbrev Number: 70 (DW_TAG_variable)
    <dc7cf>   DW_AT_name        : ln
    <dc7d2>   DW_AT_decl_file   : 1
    <dc7d3>   DW_AT_decl_line   : 540
    <dc7d5>   DW_AT_decl_column : 19
    <dc7d6>   DW_AT_type        : <0xdc728>
 <3><dc7da>: Abbrev Number: 0
 <2><dc7db>: Abbrev Number: 0
 <1><dc7dc>: Abbrev Number: 30 (DW_TAG_subprogram)
    <dc7dd>   DW_AT_external    : 1
    <dc7dd>   DW_AT_name        : (indirect string, offset: 0x8ea44): fgListInit
    <dc7e1>   DW_AT_decl_file   : 1
    <dc7e1>   DW_AT_decl_line   : 530
    <dc7e3>   DW_AT_decl_column : 6
    <dc7e3>   DW_AT_prototyped  : 1
    <dc7e3>   DW_AT_inline      : 1	(not inlined)
    <dc7e3>   DW_AT_sibling     : <0xdc7f4>
 <2><dc7e7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc7e8>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <dc7ec>   DW_AT_decl_file   : 1
    <dc7ec>   DW_AT_decl_line   : 530
    <dc7ee>   DW_AT_decl_column : 27
    <dc7ef>   DW_AT_type        : <0xdc723>
 <2><dc7f3>: Abbrev Number: 0
 <1><dc7f4>: Abbrev Number: 33 (DW_TAG_subprogram)
    <dc7f5>   DW_AT_external    : 1
    <dc7f5>   DW_AT_name        : (indirect string, offset: 0x8f7cf): fgMenuByID
    <dc7f9>   DW_AT_decl_file   : 1
    <dc7f9>   DW_AT_decl_line   : 514
    <dc7fb>   DW_AT_decl_column : 11
    <dc7fc>   DW_AT_prototyped  : 1
    <dc7fc>   DW_AT_type        : <0xdc465>
    <dc800>   DW_AT_low_pc      : 0x9d5d70
    <dc808>   DW_AT_high_pc     : 0x1e
    <dc810>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc812>   DW_AT_call_all_calls: 1
    <dc812>   DW_AT_sibling     : <0xdc839>
 <2><dc816>: Abbrev Number: 29 (DW_TAG_formal_parameter)
    <dc817>   DW_AT_name        : (indirect string, offset: 0x8fa3a): menuID
    <dc81b>   DW_AT_decl_file   : 1
    <dc81b>   DW_AT_decl_line   : 514
    <dc81d>   DW_AT_decl_column : 27
    <dc81e>   DW_AT_type        : <0xdbbca>
    <dc822>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
 <2><dc824>: Abbrev Number: 19 (DW_TAG_variable)
    <dc825>   DW_AT_name        : (indirect string, offset: 0x8f900): menu
    <dc829>   DW_AT_decl_file   : 1
    <dc829>   DW_AT_decl_line   : 516
    <dc82b>   DW_AT_decl_column : 15
    <dc82c>   DW_AT_type        : <0xdc465>
    <dc830>   DW_AT_location    : 0x3b95 (location list)
    <dc834>   DW_AT_GNU_locviews: 0x3b91
 <2><dc838>: Abbrev Number: 0
 <1><dc839>: Abbrev Number: 33 (DW_TAG_subprogram)
    <dc83a>   DW_AT_external    : 1
    <dc83a>   DW_AT_name        : (indirect string, offset: 0x8e951): fgWindowByID
    <dc83e>   DW_AT_decl_file   : 1
    <dc83e>   DW_AT_decl_line   : 497
    <dc840>   DW_AT_decl_column : 13
    <dc841>   DW_AT_prototyped  : 1
    <dc841>   DW_AT_type        : <0xdc460>
    <dc845>   DW_AT_low_pc      : 0x9d5c40
    <dc84d>   DW_AT_high_pc     : 0x122
    <dc855>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc857>   DW_AT_call_all_calls: 1
    <dc857>   DW_AT_sibling     : <0xdc9ba>
 <2><dc85b>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <dc85c>   DW_AT_name        : (indirect string, offset: 0x8e948): windowID
    <dc860>   DW_AT_decl_file   : 1
    <dc860>   DW_AT_decl_line   : 497
    <dc862>   DW_AT_decl_column : 31
    <dc863>   DW_AT_type        : <0xdbbca>
    <dc867>   DW_AT_location    : 0x3ba7 (location list)
    <dc86b>   DW_AT_GNU_locviews: 0x3ba5
 <2><dc86f>: Abbrev Number: 51 (DW_TAG_variable)
    <dc870>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <dc874>   DW_AT_decl_file   : 1
    <dc874>   DW_AT_decl_line   : 499
    <dc876>   DW_AT_decl_column : 20
    <dc876>   DW_AT_type        : <0xdc550>
    <dc87a>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><dc87e>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <dc87f>   DW_AT_abstract_origin: <0xdcbbf>
    <dc883>   DW_AT_entry_pc    : 0x9d5c89
    <dc88b>   DW_AT_GNU_entry_view: 1
    <dc88c>   DW_AT_ranges      : 0xc1a
    <dc890>   DW_AT_call_file   : 1
    <dc890>   DW_AT_call_line   : 504
    <dc892>   DW_AT_call_column : 5
    <dc892>   DW_AT_sibling     : <0xdc9ac>
 <3><dc896>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc897>   DW_AT_abstract_origin: <0xdcbd6>
    <dc89b>   DW_AT_location    : 0x3bb5 (location list)
    <dc89f>   DW_AT_GNU_locviews: 0x3baf
 <3><dc8a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc8a4>   DW_AT_abstract_origin: <0xdcbca>
    <dc8a8>   DW_AT_location    : 0x3bda (location list)
    <dc8ac>   DW_AT_GNU_locviews: 0x3bd4
 <3><dc8b0>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <dc8b1>   DW_AT_ranges      : 0xc1a
 <4><dc8b5>: Abbrev Number: 8 (DW_TAG_variable)
    <dc8b6>   DW_AT_abstract_origin: <0xdcbe2>
    <dc8ba>   DW_AT_location    : 0x3c13 (location list)
    <dc8be>   DW_AT_GNU_locviews: 0x3c0b
 <4><dc8c2>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dc8c3>   DW_AT_abstract_origin: <0xdc9ba>
    <dc8c7>   DW_AT_entry_pc    : 0x9d5d2a
    <dc8cf>   DW_AT_GNU_entry_view: 1
    <dc8d0>   DW_AT_ranges      : 0xc43
    <dc8d4>   DW_AT_call_file   : 1
    <dc8d4>   DW_AT_call_line   : 399
    <dc8d6>   DW_AT_call_column : 9
 <5><dc8d7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc8d8>   DW_AT_abstract_origin: <0xdc9d1>
    <dc8dc>   DW_AT_location    : 0x3c38 (location list)
    <dc8e0>   DW_AT_GNU_locviews: 0x3c30
 <5><dc8e4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc8e5>   DW_AT_abstract_origin: <0xdc9c5>
    <dc8e9>   DW_AT_location    : 0x3c69 (location list)
    <dc8ed>   DW_AT_GNU_locviews: 0x3c61
 <5><dc8f1>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dc8f2>   DW_AT_abstract_origin: <0xdc9ba>
    <dc8f6>   DW_AT_entry_pc    : 0x9d5c98
    <dc8fe>   DW_AT_GNU_entry_view: 0
    <dc8ff>   DW_AT_ranges      : 0xc6c
    <dc903>   DW_AT_call_file   : 1
    <dc903>   DW_AT_call_line   : 473
    <dc905>   DW_AT_call_column : 13
 <6><dc906>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc907>   DW_AT_abstract_origin: <0xdc9d1>
    <dc90b>   DW_AT_location    : 0x3c8a (location list)
    <dc90f>   DW_AT_GNU_locviews: 0x3c86
 <6><dc913>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc914>   DW_AT_abstract_origin: <0xdc9c5>
    <dc918>   DW_AT_location    : 0x3ca3 (location list)
    <dc91c>   DW_AT_GNU_locviews: 0x3c9f
 <6><dc920>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dc921>   DW_AT_abstract_origin: <0xdcb83>
    <dc925>   DW_AT_entry_pc    : 0x9d5ca1
    <dc92d>   DW_AT_GNU_entry_view: 1
    <dc92e>   DW_AT_ranges      : 0xc81
    <dc932>   DW_AT_call_file   : 1
    <dc932>   DW_AT_call_line   : 489
    <dc934>   DW_AT_call_column : 5
 <7><dc935>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc936>   DW_AT_abstract_origin: <0xdcba6>
    <dc93a>   DW_AT_location    : 0x3cb6 (location list)
    <dc93e>   DW_AT_GNU_locviews: 0x3cb2
 <7><dc942>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc943>   DW_AT_abstract_origin: <0xdcb9a>
    <dc947>   DW_AT_location    : 0x3ccf (location list)
    <dc94b>   DW_AT_GNU_locviews: 0x3ccb
 <7><dc94f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dc950>   DW_AT_abstract_origin: <0xdcb8e>
    <dc954>   DW_AT_location    : 0x3cf4 (location list)
    <dc958>   DW_AT_GNU_locviews: 0x3cf0
 <7><dc95c>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <dc95d>   DW_AT_ranges      : 0xc81
 <8><dc961>: Abbrev Number: 8 (DW_TAG_variable)
    <dc962>   DW_AT_abstract_origin: <0xdcbb2>
    <dc966>   DW_AT_location    : 0x3d07 (location list)
    <dc96a>   DW_AT_GNU_locviews: 0x3d03
 <8><dc96e>: Abbrev Number: 10 (DW_TAG_call_site)
    <dc96f>   DW_AT_call_return_pc: 0x9d5cd3
    <dc977>   DW_AT_call_origin : <0xdc9ba>
    <dc97b>   DW_AT_sibling     : <0xdc98c>
 <9><dc97f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dc980>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dc982>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <9><dc985>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dc986>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dc988>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <9><dc98b>: Abbrev Number: 0
 <8><dc98c>: Abbrev Number: 11 (DW_TAG_call_site)
    <dc98d>   DW_AT_call_return_pc: 0x9d5d0d
    <dc995>   DW_AT_call_origin : <0xdc5f9>
 <9><dc999>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dc99a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dc99c>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <9><dc99f>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dc9a0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dc9a2>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <9><dc9a5>: Abbrev Number: 0
 <8><dc9a6>: Abbrev Number: 0
 <7><dc9a7>: Abbrev Number: 0
 <6><dc9a8>: Abbrev Number: 0
 <5><dc9a9>: Abbrev Number: 0
 <4><dc9aa>: Abbrev Number: 0
 <3><dc9ab>: Abbrev Number: 0
 <2><dc9ac>: Abbrev Number: 16 (DW_TAG_call_site)
    <dc9ad>   DW_AT_call_return_pc: 0x9d5d62
    <dc9b5>   DW_AT_call_origin : <0xddb63>
 <2><dc9b9>: Abbrev Number: 0
 <1><dc9ba>: Abbrev Number: 38 (DW_TAG_subprogram)
    <dc9bb>   DW_AT_name        : (indirect string, offset: 0x9006b): fghcbWindowByID
    <dc9bf>   DW_AT_decl_file   : 1
    <dc9bf>   DW_AT_decl_line   : 473
    <dc9c1>   DW_AT_decl_column : 13
    <dc9c1>   DW_AT_prototyped  : 1
    <dc9c1>   DW_AT_inline      : 1	(not inlined)
    <dc9c1>   DW_AT_sibling     : <0xdc9de>
 <2><dc9c5>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc9c6>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dc9ca>   DW_AT_decl_file   : 1
    <dc9ca>   DW_AT_decl_line   : 473
    <dc9cc>   DW_AT_decl_column : 42
    <dc9cd>   DW_AT_type        : <0xdc460>
 <2><dc9d1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dc9d2>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <dc9d6>   DW_AT_decl_file   : 1
    <dc9d6>   DW_AT_decl_line   : 473
    <dc9d8>   DW_AT_decl_column : 66
    <dc9d9>   DW_AT_type        : <0xdc5a4>
 <2><dc9dd>: Abbrev Number: 0
 <1><dc9de>: Abbrev Number: 33 (DW_TAG_subprogram)
    <dc9df>   DW_AT_external    : 1
    <dc9df>   DW_AT_name        : (indirect string, offset: 0x8f737): fgWindowByHandle
    <dc9e3>   DW_AT_decl_file   : 1
    <dc9e3>   DW_AT_decl_line   : 456
    <dc9e5>   DW_AT_decl_column : 13
    <dc9e6>   DW_AT_prototyped  : 1
    <dc9e6>   DW_AT_type        : <0xdc460>
    <dc9ea>   DW_AT_low_pc      : 0x9d5b20
    <dc9f2>   DW_AT_high_pc     : 0x111
    <dc9fa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dc9fc>   DW_AT_call_all_calls: 1
    <dc9fc>   DW_AT_sibling     : <0xdcb5f>
 <2><dca00>: Abbrev Number: 37 (DW_TAG_formal_parameter)
    <dca01>   DW_AT_name        : (indirect string, offset: 0x903af): hWindow
    <dca05>   DW_AT_decl_file   : 1
    <dca05>   DW_AT_decl_line   : 456
    <dca07>   DW_AT_decl_column : 53
    <dca08>   DW_AT_type        : <0xdc041>
    <dca0c>   DW_AT_location    : 0x3d1a (location list)
    <dca10>   DW_AT_GNU_locviews: 0x3d16
 <2><dca14>: Abbrev Number: 51 (DW_TAG_variable)
    <dca15>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <dca19>   DW_AT_decl_file   : 1
    <dca19>   DW_AT_decl_line   : 458
    <dca1b>   DW_AT_decl_column : 20
    <dca1b>   DW_AT_type        : <0xdc550>
    <dca1f>   DW_AT_location    : 3 byte block: 91 b0 7f 	(DW_OP_fbreg: -80)
 <2><dca23>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <dca24>   DW_AT_abstract_origin: <0xdcbbf>
    <dca28>   DW_AT_entry_pc    : 0x9d5b5d
    <dca30>   DW_AT_GNU_entry_view: 1
    <dca31>   DW_AT_ranges      : 0xb9e
    <dca35>   DW_AT_call_file   : 1
    <dca35>   DW_AT_call_line   : 463
    <dca37>   DW_AT_call_column : 5
    <dca37>   DW_AT_sibling     : <0xdcb51>
 <3><dca3b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dca3c>   DW_AT_abstract_origin: <0xdcbd6>
    <dca40>   DW_AT_location    : 0x3d32 (location list)
    <dca44>   DW_AT_GNU_locviews: 0x3d2c
 <3><dca48>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dca49>   DW_AT_abstract_origin: <0xdcbca>
    <dca4d>   DW_AT_location    : 0x3d57 (location list)
    <dca51>   DW_AT_GNU_locviews: 0x3d51
 <3><dca55>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <dca56>   DW_AT_ranges      : 0xb9e
 <4><dca5a>: Abbrev Number: 8 (DW_TAG_variable)
    <dca5b>   DW_AT_abstract_origin: <0xdcbe2>
    <dca5f>   DW_AT_location    : 0x3d90 (location list)
    <dca63>   DW_AT_GNU_locviews: 0x3d88
 <4><dca67>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dca68>   DW_AT_abstract_origin: <0xdcb5f>
    <dca6c>   DW_AT_entry_pc    : 0x9d5bf9
    <dca74>   DW_AT_GNU_entry_view: 1
    <dca75>   DW_AT_ranges      : 0xbc7
    <dca79>   DW_AT_call_file   : 1
    <dca79>   DW_AT_call_line   : 399
    <dca7b>   DW_AT_call_column : 9
 <5><dca7c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dca7d>   DW_AT_abstract_origin: <0xdcb76>
    <dca81>   DW_AT_location    : 0x3db5 (location list)
    <dca85>   DW_AT_GNU_locviews: 0x3dad
 <5><dca89>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dca8a>   DW_AT_abstract_origin: <0xdcb6a>
    <dca8e>   DW_AT_location    : 0x3de6 (location list)
    <dca92>   DW_AT_GNU_locviews: 0x3dde
 <5><dca96>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dca97>   DW_AT_abstract_origin: <0xdcb5f>
    <dca9b>   DW_AT_entry_pc    : 0x9d5b70
    <dcaa3>   DW_AT_GNU_entry_view: 0
    <dcaa4>   DW_AT_ranges      : 0xbf0
    <dcaa8>   DW_AT_call_file   : 1
    <dcaa8>   DW_AT_call_line   : 432
    <dcaaa>   DW_AT_call_column : 13
 <6><dcaab>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcaac>   DW_AT_abstract_origin: <0xdcb76>
    <dcab0>   DW_AT_location    : 0x3e07 (location list)
    <dcab4>   DW_AT_GNU_locviews: 0x3e03
 <6><dcab8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcab9>   DW_AT_abstract_origin: <0xdcb6a>
    <dcabd>   DW_AT_location    : 0x3e20 (location list)
    <dcac1>   DW_AT_GNU_locviews: 0x3e1c
 <6><dcac5>: Abbrev Number: 15 (DW_TAG_inlined_subroutine)
    <dcac6>   DW_AT_abstract_origin: <0xdcb83>
    <dcaca>   DW_AT_entry_pc    : 0x9d5b77
    <dcad2>   DW_AT_GNU_entry_view: 1
    <dcad3>   DW_AT_ranges      : 0xc05
    <dcad7>   DW_AT_call_file   : 1
    <dcad7>   DW_AT_call_line   : 448
    <dcad9>   DW_AT_call_column : 5
 <7><dcada>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcadb>   DW_AT_abstract_origin: <0xdcba6>
    <dcadf>   DW_AT_location    : 0x3e33 (location list)
    <dcae3>   DW_AT_GNU_locviews: 0x3e2f
 <7><dcae7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcae8>   DW_AT_abstract_origin: <0xdcb9a>
    <dcaec>   DW_AT_location    : 0x3e4c (location list)
    <dcaf0>   DW_AT_GNU_locviews: 0x3e48
 <7><dcaf4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <dcaf5>   DW_AT_abstract_origin: <0xdcb8e>
    <dcaf9>   DW_AT_location    : 0x3e71 (location list)
    <dcafd>   DW_AT_GNU_locviews: 0x3e6d
 <7><dcb01>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <dcb02>   DW_AT_ranges      : 0xc05
 <8><dcb06>: Abbrev Number: 8 (DW_TAG_variable)
    <dcb07>   DW_AT_abstract_origin: <0xdcbb2>
    <dcb0b>   DW_AT_location    : 0x3e84 (location list)
    <dcb0f>   DW_AT_GNU_locviews: 0x3e80
 <8><dcb13>: Abbrev Number: 10 (DW_TAG_call_site)
    <dcb14>   DW_AT_call_return_pc: 0x9d5ba3
    <dcb1c>   DW_AT_call_origin : <0xdcb5f>
    <dcb20>   DW_AT_sibling     : <0xdcb31>
 <9><dcb24>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dcb25>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dcb27>   DW_AT_call_value  : 2 byte block: 73 0 	(DW_OP_breg3 (rbx): 0)
 <9><dcb2a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dcb2b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dcb2d>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <9><dcb30>: Abbrev Number: 0
 <8><dcb31>: Abbrev Number: 11 (DW_TAG_call_site)
    <dcb32>   DW_AT_call_return_pc: 0x9d5bdd
    <dcb3a>   DW_AT_call_origin : <0xdc5f9>
 <9><dcb3e>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dcb3f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <dcb41>   DW_AT_call_value  : 2 byte block: 7d 0 	(DW_OP_breg13 (r13): 0)
 <9><dcb44>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <dcb45>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <dcb47>   DW_AT_call_value  : 2 byte block: 7e 0 	(DW_OP_breg14 (r14): 0)
 <9><dcb4a>: Abbrev Number: 0
 <8><dcb4b>: Abbrev Number: 0
 <7><dcb4c>: Abbrev Number: 0
 <6><dcb4d>: Abbrev Number: 0
 <5><dcb4e>: Abbrev Number: 0
 <4><dcb4f>: Abbrev Number: 0
 <3><dcb50>: Abbrev Number: 0
 <2><dcb51>: Abbrev Number: 16 (DW_TAG_call_site)
    <dcb52>   DW_AT_call_return_pc: 0x9d5c31
    <dcb5a>   DW_AT_call_origin : <0xddb63>
 <2><dcb5e>: Abbrev Number: 0
 <1><dcb5f>: Abbrev Number: 38 (DW_TAG_subprogram)
    <dcb60>   DW_AT_name        : (indirect string, offset: 0x90088): fghcbWindowByHandle
    <dcb64>   DW_AT_decl_file   : 1
    <dcb64>   DW_AT_decl_line   : 432
    <dcb66>   DW_AT_decl_column : 13
    <dcb66>   DW_AT_prototyped  : 1
    <dcb66>   DW_AT_inline      : 1	(not inlined)
    <dcb66>   DW_AT_sibling     : <0xdcb83>
 <2><dcb6a>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dcb6b>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dcb6f>   DW_AT_decl_file   : 1
    <dcb6f>   DW_AT_decl_line   : 432
    <dcb71>   DW_AT_decl_column : 46
    <dcb72>   DW_AT_type        : <0xdc460>
 <2><dcb76>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dcb77>   DW_AT_name        : (indirect string, offset: 0x8f05d): enumerator
    <dcb7b>   DW_AT_decl_file   : 1
    <dcb7b>   DW_AT_decl_line   : 433
    <dcb7d>   DW_AT_decl_column : 50
    <dcb7e>   DW_AT_type        : <0xdc5a4>
 <2><dcb82>: Abbrev Number: 0
 <1><dcb83>: Abbrev Number: 30 (DW_TAG_subprogram)
    <dcb84>   DW_AT_external    : 1
    <dcb84>   DW_AT_name        : (indirect string, offset: 0x8f087): fgEnumSubWindows
    <dcb88>   DW_AT_decl_file   : 1
    <dcb88>   DW_AT_decl_line   : 409
    <dcb8a>   DW_AT_decl_column : 6
    <dcb8a>   DW_AT_prototyped  : 1
    <dcb8a>   DW_AT_inline      : 1	(not inlined)
    <dcb8a>   DW_AT_sibling     : <0xdcbbf>
 <2><dcb8e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <dcb8f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dcb93>   DW_AT_decl_file   : 1
    <dcb93>   DW_AT_decl_line   : 409
