 <1><cfc8d>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfc8e>   DW_AT_name        : (indirect string, offset: 0x8f65f): __suseconds_t
    <cfc92>   DW_AT_decl_file   : 3
    <cfc93>   DW_AT_decl_line   : 162
    <cfc94>   DW_AT_decl_column : 31
    <cfc95>   DW_AT_type        : <0xcfc62>
 <1><cfc99>: Abbrev Number: 68 (DW_TAG_pointer_type)
    <cfc9a>   DW_AT_byte_size   : 8
 <1><cfc9b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfc9c>   DW_AT_byte_size   : 8
    <cfc9c>   DW_AT_type        : <0xcfca0>
 <1><cfca0>: Abbrev Number: 16 (DW_TAG_base_type)
    <cfca1>   DW_AT_byte_size   : 1
    <cfca2>   DW_AT_encoding    : 6	(signed char)
    <cfca3>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><cfca7>: Abbrev Number: 53 (DW_TAG_const_type)
    <cfca8>   DW_AT_type        : <0xcfca0>
 <1><cfcac>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfcad>   DW_AT_byte_size   : 8
    <cfcad>   DW_AT_type        : <0xcfcb1>
 <1><cfcb1>: Abbrev Number: 69 (DW_TAG_subroutine_type)
    <cfcb2>   DW_AT_prototyped  : 1
 <1><cfcb2>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfcb3>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <cfcb7>   DW_AT_decl_file   : 4
    <cfcb8>   DW_AT_decl_line   : 209
    <cfcb9>   DW_AT_decl_column : 23
    <cfcba>   DW_AT_type        : <0xcfc5b>
 <1><cfcbe>: Abbrev Number: 16 (DW_TAG_base_type)
    <cfcbf>   DW_AT_byte_size   : 8
    <cfcc0>   DW_AT_encoding    : 5	(signed)
    <cfcc1>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><cfcc5>: Abbrev Number: 38 (DW_TAG_structure_type)
    <cfcc6>   DW_AT_name        : (indirect string, offset: 0x8f4d0): timeval
    <cfcca>   DW_AT_byte_size   : 16
    <cfccb>   DW_AT_decl_file   : 5
    <cfccc>   DW_AT_decl_line   : 8
    <cfccd>   DW_AT_decl_column : 8
    <cfcce>   DW_AT_sibling     : <0xcfced>
 <2><cfcd2>: Abbrev Number: 6 (DW_TAG_member)
    <cfcd3>   DW_AT_name        : (indirect string, offset: 0x88f72): tv_sec
    <cfcd7>   DW_AT_decl_file   : 5
    <cfcd8>   DW_AT_decl_line   : 10
    <cfcd9>   DW_AT_decl_column : 12
    <cfcda>   DW_AT_type        : <0xcfc81>
    <cfcde>   DW_AT_data_member_location: 0
 <2><cfcdf>: Abbrev Number: 6 (DW_TAG_member)
    <cfce0>   DW_AT_name        : (indirect string, offset: 0x8f520): tv_usec
    <cfce4>   DW_AT_decl_file   : 5
    <cfce5>   DW_AT_decl_line   : 11
    <cfce6>   DW_AT_decl_column : 17
    <cfce7>   DW_AT_type        : <0xcfc8d>
    <cfceb>   DW_AT_data_member_location: 8
 <2><cfcec>: Abbrev Number: 0
 <1><cfced>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfcee>   DW_AT_name        : (indirect string, offset: 0x8f509): __fd_mask
    <cfcf2>   DW_AT_decl_file   : 6
    <cfcf3>   DW_AT_decl_line   : 49
    <cfcf4>   DW_AT_decl_column : 18
    <cfcf5>   DW_AT_type        : <0xcfc62>
 <1><cfcf9>: Abbrev Number: 45 (DW_TAG_structure_type)
    <cfcfa>   DW_AT_byte_size   : 128
    <cfcfb>   DW_AT_decl_file   : 6
    <cfcfc>   DW_AT_decl_line   : 59
    <cfcfd>   DW_AT_decl_column : 9
    <cfcfd>   DW_AT_sibling     : <0xcfd0f>
 <2><cfd01>: Abbrev Number: 6 (DW_TAG_member)
    <cfd02>   DW_AT_name        : (indirect string, offset: 0x8f490): __fds_bits
    <cfd06>   DW_AT_decl_file   : 6
    <cfd07>   DW_AT_decl_line   : 67
    <cfd08>   DW_AT_decl_column : 15
    <cfd09>   DW_AT_type        : <0xcfd0f>
    <cfd0d>   DW_AT_data_member_location: 0
 <2><cfd0e>: Abbrev Number: 0
 <1><cfd0f>: Abbrev Number: 22 (DW_TAG_array_type)
    <cfd10>   DW_AT_type        : <0xcfced>
    <cfd14>   DW_AT_sibling     : <0xcfd1f>
 <2><cfd18>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <cfd19>   DW_AT_type        : <0xcfc5b>
    <cfd1d>   DW_AT_upper_bound : 15
 <2><cfd1e>: Abbrev Number: 0
 <1><cfd1f>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfd20>   DW_AT_name        : (indirect string, offset: 0x8f707): fd_set
    <cfd24>   DW_AT_decl_file   : 6
    <cfd25>   DW_AT_decl_line   : 70
    <cfd26>   DW_AT_decl_column : 5
    <cfd27>   DW_AT_type        : <0xcfcf9>
 <1><cfd2b>: Abbrev Number: 16 (DW_TAG_base_type)
    <cfd2c>   DW_AT_byte_size   : 8
    <cfd2d>   DW_AT_encoding    : 7	(unsigned)
    <cfd2e>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><cfd32>: Abbrev Number: 22 (DW_TAG_array_type)
    <cfd33>   DW_AT_type        : <0xcfca0>
    <cfd37>   DW_AT_sibling     : <0xcfd42>
 <2><cfd3b>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <cfd3c>   DW_AT_type        : <0xcfc5b>
    <cfd40>   DW_AT_upper_bound : 31
 <2><cfd41>: Abbrev Number: 0
 <1><cfd42>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfd43>   DW_AT_byte_size   : 8
    <cfd43>   DW_AT_type        : <0xcfd47>
 <1><cfd47>: Abbrev Number: 70 (DW_TAG_subroutine_type)
    <cfd48>   DW_AT_sibling     : <0xcfd4e>
 <2><cfd4c>: Abbrev Number: 36 (DW_TAG_unspecified_parameters)
 <2><cfd4d>: Abbrev Number: 0
 <1><cfd4e>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfd4f>   DW_AT_name        : (indirect string, offset: 0x8f4ad): __gnuc_va_list
    <cfd53>   DW_AT_decl_file   : 7
    <cfd54>   DW_AT_decl_line   : 40
    <cfd55>   DW_AT_decl_column : 27
    <cfd56>   DW_AT_type        : <0xcfd5a>
 <1><cfd5a>: Abbrev Number: 71 (DW_TAG_typedef)
    <cfd5b>   DW_AT_name        : (indirect string, offset: 0x8f49b): __builtin_va_list
    <cfd5f>   DW_AT_type        : <0xcfd63>
 <1><cfd63>: Abbrev Number: 22 (DW_TAG_array_type)
    <cfd64>   DW_AT_type        : <0xcfd73>
    <cfd68>   DW_AT_sibling     : <0xcfd73>
 <2><cfd6c>: Abbrev Number: 23 (DW_TAG_subrange_type)
    <cfd6d>   DW_AT_type        : <0xcfc5b>
    <cfd71>   DW_AT_upper_bound : 0
 <2><cfd72>: Abbrev Number: 0
 <1><cfd73>: Abbrev Number: 72 (DW_TAG_structure_type)
    <cfd74>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <cfd78>   DW_AT_byte_size   : 24
    <cfd79>   DW_AT_decl_file   : 8
    <cfd7a>   DW_AT_decl_line   : 0
    <cfd7b>   DW_AT_sibling     : <0xcfda8>
 <2><cfd7f>: Abbrev Number: 39 (DW_TAG_member)
    <cfd80>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <cfd84>   DW_AT_decl_file   : 8
    <cfd84>   DW_AT_decl_line   : 0
    <cfd84>   DW_AT_type        : <0xcfbf3>
    <cfd88>   DW_AT_data_member_location: 0
 <2><cfd89>: Abbrev Number: 39 (DW_TAG_member)
    <cfd8a>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <cfd8e>   DW_AT_decl_file   : 8
    <cfd8e>   DW_AT_decl_line   : 0
    <cfd8e>   DW_AT_type        : <0xcfbf3>
    <cfd92>   DW_AT_data_member_location: 4
 <2><cfd93>: Abbrev Number: 39 (DW_TAG_member)
    <cfd94>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <cfd98>   DW_AT_decl_file   : 8
    <cfd98>   DW_AT_decl_line   : 0
    <cfd98>   DW_AT_type        : <0xcfc99>
    <cfd9c>   DW_AT_data_member_location: 8
 <2><cfd9d>: Abbrev Number: 39 (DW_TAG_member)
    <cfd9e>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <cfda2>   DW_AT_decl_file   : 8
    <cfda2>   DW_AT_decl_line   : 0
    <cfda2>   DW_AT_type        : <0xcfc99>
    <cfda6>   DW_AT_data_member_location: 16
 <2><cfda7>: Abbrev Number: 0
 <1><cfda8>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfda9>   DW_AT_name        : (indirect string, offset: 0x8f4b4): va_list
    <cfdad>   DW_AT_decl_file   : 7
    <cfdae>   DW_AT_decl_line   : 99
    <cfdaf>   DW_AT_decl_column : 24
    <cfdb0>   DW_AT_type        : <0xcfd4e>
 <1><cfdb4>: Abbrev Number: 54 (DW_TAG_typedef)
    <cfdb5>   DW_AT_name        : XID
    <cfdb9>   DW_AT_decl_file   : 9
    <cfdba>   DW_AT_decl_line   : 66
    <cfdbb>   DW_AT_decl_column : 23
    <cfdbc>   DW_AT_type        : <0xcfc5b>
 <1><cfdc0>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfdc1>   DW_AT_name        : (indirect string, offset: 0x6eb27): Atom
    <cfdc5>   DW_AT_decl_file   : 9
    <cfdc6>   DW_AT_decl_line   : 74
    <cfdc7>   DW_AT_decl_column : 23
    <cfdc8>   DW_AT_type        : <0xcfc5b>
 <1><cfdcc>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfdcd>   DW_AT_name        : (indirect string, offset: 0x7c79a): VisualID
    <cfdd1>   DW_AT_decl_file   : 9
    <cfdd2>   DW_AT_decl_line   : 76
    <cfdd3>   DW_AT_decl_column : 23
    <cfdd4>   DW_AT_type        : <0xcfc5b>
 <1><cfdd8>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfdd9>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <cfddd>   DW_AT_decl_file   : 9
    <cfdde>   DW_AT_decl_line   : 77
    <cfddf>   DW_AT_decl_column : 23
    <cfde0>   DW_AT_type        : <0xcfc5b>
 <1><cfde4>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfde5>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <cfde9>   DW_AT_decl_file   : 9
    <cfdea>   DW_AT_decl_line   : 96
    <cfdeb>   DW_AT_decl_column : 13
    <cfdec>   DW_AT_type        : <0xcfdb4>
 <1><cfdf0>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfdf1>   DW_AT_name        : (indirect string, offset: 0x7f5b4): Drawable
    <cfdf5>   DW_AT_decl_file   : 9
    <cfdf6>   DW_AT_decl_line   : 97
    <cfdf7>   DW_AT_decl_column : 13
    <cfdf8>   DW_AT_type        : <0xcfdb4>
 <1><cfdfc>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfdfd>   DW_AT_name        : (indirect string, offset: 0x90395): Colormap
    <cfe01>   DW_AT_decl_file   : 9
    <cfe02>   DW_AT_decl_line   : 104
    <cfe03>   DW_AT_decl_column : 13
    <cfe04>   DW_AT_type        : <0xcfdb4>
 <1><cfe08>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfe09>   DW_AT_name        : (indirect string, offset: 0x8f5eb): KeySym
    <cfe0d>   DW_AT_decl_file   : 9
    <cfe0e>   DW_AT_decl_line   : 106
    <cfe0f>   DW_AT_decl_column : 13
    <cfe10>   DW_AT_type        : <0xcfdb4>
 <1><cfe14>: Abbrev Number: 16 (DW_TAG_base_type)
    <cfe15>   DW_AT_byte_size   : 16
    <cfe16>   DW_AT_encoding    : 4	(float)
    <cfe17>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><cfe1b>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfe1c>   DW_AT_name        : (indirect string, offset: 0x7030a): XPointer
    <cfe20>   DW_AT_decl_file   : 10
    <cfe21>   DW_AT_decl_line   : 80
    <cfe22>   DW_AT_decl_column : 15
    <cfe23>   DW_AT_type        : <0xcfc9b>
 <1><cfe27>: Abbrev Number: 38 (DW_TAG_structure_type)
    <cfe28>   DW_AT_name        : (indirect string, offset: 0x7fc01): _XExtData
    <cfe2c>   DW_AT_byte_size   : 32
    <cfe2d>   DW_AT_decl_file   : 10
    <cfe2e>   DW_AT_decl_line   : 148
    <cfe2f>   DW_AT_decl_column : 16
    <cfe30>   DW_AT_sibling     : <0xcfe69>
 <2><cfe34>: Abbrev Number: 6 (DW_TAG_member)
    <cfe35>   DW_AT_name        : (indirect string, offset: 0x8f519): number
    <cfe39>   DW_AT_decl_file   : 10
    <cfe3a>   DW_AT_decl_line   : 149
    <cfe3b>   DW_AT_decl_column : 6
    <cfe3c>   DW_AT_type        : <0xcfc27>
    <cfe40>   DW_AT_data_member_location: 0
 <2><cfe41>: Abbrev Number: 6 (DW_TAG_member)
    <cfe42>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <cfe46>   DW_AT_decl_file   : 10
    <cfe47>   DW_AT_decl_line   : 150
    <cfe48>   DW_AT_decl_column : 20
    <cfe49>   DW_AT_type        : <0xcfe69>
    <cfe4d>   DW_AT_data_member_location: 8
 <2><cfe4e>: Abbrev Number: 6 (DW_TAG_member)
    <cfe4f>   DW_AT_name        : (indirect string, offset: 0x8b0b7): free_private
    <cfe53>   DW_AT_decl_file   : 10
    <cfe54>   DW_AT_decl_line   : 151
    <cfe55>   DW_AT_decl_column : 8
    <cfe56>   DW_AT_type        : <0xcfe7d>
    <cfe5a>   DW_AT_data_member_location: 16
 <2><cfe5b>: Abbrev Number: 6 (DW_TAG_member)
    <cfe5c>   DW_AT_name        : (indirect string, offset: 0x6bca1): private_data
    <cfe60>   DW_AT_decl_file   : 10
    <cfe61>   DW_AT_decl_line   : 154
    <cfe62>   DW_AT_decl_column : 11
    <cfe63>   DW_AT_type        : <0xcfe1b>
    <cfe67>   DW_AT_data_member_location: 24
 <2><cfe68>: Abbrev Number: 0
 <1><cfe69>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfe6a>   DW_AT_byte_size   : 8
    <cfe6a>   DW_AT_type        : <0xcfe27>
 <1><cfe6e>: Abbrev Number: 46 (DW_TAG_subroutine_type)
    <cfe6f>   DW_AT_prototyped  : 1
    <cfe6f>   DW_AT_type        : <0xcfc27>
    <cfe73>   DW_AT_sibling     : <0xcfe7d>
 <2><cfe77>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cfe78>   DW_AT_type        : <0xcfe69>
 <2><cfe7c>: Abbrev Number: 0
 <1><cfe7d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfe7e>   DW_AT_byte_size   : 8
    <cfe7e>   DW_AT_type        : <0xcfe6e>
 <1><cfe82>: Abbrev Number: 7 (DW_TAG_typedef)
    <cfe83>   DW_AT_name        : (indirect string, offset: 0x7fc02): XExtData
    <cfe87>   DW_AT_decl_file   : 10
    <cfe88>   DW_AT_decl_line   : 155
    <cfe89>   DW_AT_decl_column : 3
    <cfe8a>   DW_AT_type        : <0xcfe27>
 <1><cfe8e>: Abbrev Number: 54 (DW_TAG_typedef)
    <cfe8f>   DW_AT_name        : GC
    <cfe92>   DW_AT_decl_file   : 10
    <cfe93>   DW_AT_decl_line   : 222
    <cfe94>   DW_AT_decl_column : 2
    <cfe95>   DW_AT_type        : <0xcfe99>
 <1><cfe99>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cfe9a>   DW_AT_byte_size   : 8
    <cfe9a>   DW_AT_type        : <0xcfe9e>
 <1><cfe9e>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cfe9f>   DW_AT_name        : (indirect string, offset: 0x8e99c): _XGC
    <cfea3>   DW_AT_declaration : 1
 <1><cfea3>: Abbrev Number: 45 (DW_TAG_structure_type)
    <cfea4>   DW_AT_byte_size   : 56
    <cfea5>   DW_AT_decl_file   : 10
    <cfea6>   DW_AT_decl_line   : 227
    <cfea7>   DW_AT_decl_column : 9
    <cfea7>   DW_AT_sibling     : <0xcff14>
 <2><cfeab>: Abbrev Number: 6 (DW_TAG_member)
    <cfeac>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <cfeb0>   DW_AT_decl_file   : 10
    <cfeb1>   DW_AT_decl_line   : 228
    <cfeb2>   DW_AT_decl_column : 12
    <cfeb3>   DW_AT_type        : <0xcff14>
    <cfeb7>   DW_AT_data_member_location: 0
 <2><cfeb8>: Abbrev Number: 6 (DW_TAG_member)
    <cfeb9>   DW_AT_name        : (indirect string, offset: 0x6994f): visualid
    <cfebd>   DW_AT_decl_file   : 10
    <cfebe>   DW_AT_decl_line   : 229
    <cfebf>   DW_AT_decl_column : 11
    <cfec0>   DW_AT_type        : <0xcfdcc>
    <cfec4>   DW_AT_data_member_location: 8
 <2><cfec5>: Abbrev Number: 6 (DW_TAG_member)
    <cfec6>   DW_AT_name        : (indirect string, offset: 0x7e4d3): class
    <cfeca>   DW_AT_decl_file   : 10
    <cfecb>   DW_AT_decl_line   : 233
    <cfecc>   DW_AT_decl_column : 6
    <cfecd>   DW_AT_type        : <0xcfc27>
    <cfed1>   DW_AT_data_member_location: 16
 <2><cfed2>: Abbrev Number: 6 (DW_TAG_member)
    <cfed3>   DW_AT_name        : (indirect string, offset: 0x86da8): red_mask
    <cfed7>   DW_AT_decl_file   : 10
    <cfed8>   DW_AT_decl_line   : 235
    <cfed9>   DW_AT_decl_column : 16
    <cfeda>   DW_AT_type        : <0xcfc5b>
    <cfede>   DW_AT_data_member_location: 24
 <2><cfedf>: Abbrev Number: 6 (DW_TAG_member)
    <cfee0>   DW_AT_name        : (indirect string, offset: 0x6943c): green_mask
    <cfee4>   DW_AT_decl_file   : 10
    <cfee5>   DW_AT_decl_line   : 235
    <cfee6>   DW_AT_decl_column : 26
    <cfee7>   DW_AT_type        : <0xcfc5b>
    <cfeeb>   DW_AT_data_member_location: 32
 <2><cfeec>: Abbrev Number: 6 (DW_TAG_member)
    <cfeed>   DW_AT_name        : (indirect string, offset: 0x679ce): blue_mask
    <cfef1>   DW_AT_decl_file   : 10
    <cfef2>   DW_AT_decl_line   : 235
    <cfef3>   DW_AT_decl_column : 38
    <cfef4>   DW_AT_type        : <0xcfc5b>
    <cfef8>   DW_AT_data_member_location: 40
 <2><cfef9>: Abbrev Number: 6 (DW_TAG_member)
    <cfefa>   DW_AT_name        : (indirect string, offset: 0x88e77): bits_per_rgb
    <cfefe>   DW_AT_decl_file   : 10
    <cfeff>   DW_AT_decl_line   : 236
    <cff00>   DW_AT_decl_column : 6
    <cff01>   DW_AT_type        : <0xcfc27>
    <cff05>   DW_AT_data_member_location: 48
 <2><cff06>: Abbrev Number: 6 (DW_TAG_member)
    <cff07>   DW_AT_name        : (indirect string, offset: 0x85773): map_entries
    <cff0b>   DW_AT_decl_file   : 10
    <cff0c>   DW_AT_decl_line   : 237
    <cff0d>   DW_AT_decl_column : 6
    <cff0e>   DW_AT_type        : <0xcfc27>
    <cff12>   DW_AT_data_member_location: 52
 <2><cff13>: Abbrev Number: 0
 <1><cff14>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cff15>   DW_AT_byte_size   : 8
    <cff15>   DW_AT_type        : <0xcfe82>
 <1><cff19>: Abbrev Number: 7 (DW_TAG_typedef)
    <cff1a>   DW_AT_name        : (indirect string, offset: 0x8721d): Visual
    <cff1e>   DW_AT_decl_file   : 10
    <cff1f>   DW_AT_decl_line   : 238
    <cff20>   DW_AT_decl_column : 3
    <cff21>   DW_AT_type        : <0xcfea3>
 <1><cff25>: Abbrev Number: 45 (DW_TAG_structure_type)
    <cff26>   DW_AT_byte_size   : 16
    <cff27>   DW_AT_decl_file   : 10
    <cff28>   DW_AT_decl_line   : 243
    <cff29>   DW_AT_decl_column : 9
    <cff29>   DW_AT_sibling     : <0xcff55>
 <2><cff2d>: Abbrev Number: 6 (DW_TAG_member)
    <cff2e>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <cff32>   DW_AT_decl_file   : 10
    <cff33>   DW_AT_decl_line   : 244
    <cff34>   DW_AT_decl_column : 6
    <cff35>   DW_AT_type        : <0xcfc27>
    <cff39>   DW_AT_data_member_location: 0
 <2><cff3a>: Abbrev Number: 6 (DW_TAG_member)
    <cff3b>   DW_AT_name        : (indirect string, offset: 0x8ee30): nvisuals
    <cff3f>   DW_AT_decl_file   : 10
    <cff40>   DW_AT_decl_line   : 245
    <cff41>   DW_AT_decl_column : 6
    <cff42>   DW_AT_type        : <0xcfc27>
    <cff46>   DW_AT_data_member_location: 4
 <2><cff47>: Abbrev Number: 6 (DW_TAG_member)
    <cff48>   DW_AT_name        : (indirect string, offset: 0x8ee31): visuals
    <cff4c>   DW_AT_decl_file   : 10
    <cff4d>   DW_AT_decl_line   : 246
    <cff4e>   DW_AT_decl_column : 10
    <cff4f>   DW_AT_type        : <0xcff55>
    <cff53>   DW_AT_data_member_location: 8
 <2><cff54>: Abbrev Number: 0
 <1><cff55>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cff56>   DW_AT_byte_size   : 8
    <cff56>   DW_AT_type        : <0xcff19>
 <1><cff5a>: Abbrev Number: 7 (DW_TAG_typedef)
    <cff5b>   DW_AT_name        : (indirect string, offset: 0x8e26c): Depth
    <cff5f>   DW_AT_decl_file   : 10
    <cff60>   DW_AT_decl_line   : 247
    <cff61>   DW_AT_decl_column : 3
    <cff62>   DW_AT_type        : <0xcff25>
 <1><cff66>: Abbrev Number: 9 (DW_TAG_structure_type)
    <cff67>   DW_AT_byte_size   : 128
    <cff68>   DW_AT_decl_file   : 10
    <cff68>   DW_AT_decl_line   : 257
    <cff6a>   DW_AT_decl_column : 9
    <cff6a>   DW_AT_sibling     : <0xd0087>
 <2><cff6e>: Abbrev Number: 1 (DW_TAG_member)
    <cff6f>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <cff73>   DW_AT_decl_file   : 10
    <cff74>   DW_AT_decl_line   : 258
    <cff76>   DW_AT_decl_column : 12
    <cff77>   DW_AT_type        : <0xcff14>
    <cff7b>   DW_AT_data_member_location: 0
 <2><cff7c>: Abbrev Number: 1 (DW_TAG_member)
    <cff7d>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <cff81>   DW_AT_decl_file   : 10
    <cff82>   DW_AT_decl_line   : 259
    <cff84>   DW_AT_decl_column : 20
    <cff85>   DW_AT_type        : <0xd008c>
    <cff89>   DW_AT_data_member_location: 8
 <2><cff8a>: Abbrev Number: 1 (DW_TAG_member)
    <cff8b>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <cff8f>   DW_AT_decl_file   : 10
    <cff90>   DW_AT_decl_line   : 260
    <cff92>   DW_AT_decl_column : 9
    <cff93>   DW_AT_type        : <0xcfde4>
    <cff97>   DW_AT_data_member_location: 16
 <2><cff98>: Abbrev Number: 1 (DW_TAG_member)
    <cff99>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <cff9d>   DW_AT_decl_file   : 10
    <cff9e>   DW_AT_decl_line   : 261
    <cffa0>   DW_AT_decl_column : 6
    <cffa1>   DW_AT_type        : <0xcfc27>
    <cffa5>   DW_AT_data_member_location: 24
 <2><cffa6>: Abbrev Number: 1 (DW_TAG_member)
    <cffa7>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <cffab>   DW_AT_decl_file   : 10
    <cffac>   DW_AT_decl_line   : 261
    <cffae>   DW_AT_decl_column : 13
    <cffaf>   DW_AT_type        : <0xcfc27>
    <cffb3>   DW_AT_data_member_location: 28
 <2><cffb4>: Abbrev Number: 1 (DW_TAG_member)
    <cffb5>   DW_AT_name        : (indirect string, offset: 0x8ef5b): mwidth
    <cffb9>   DW_AT_decl_file   : 10
    <cffba>   DW_AT_decl_line   : 262
    <cffbc>   DW_AT_decl_column : 6
    <cffbd>   DW_AT_type        : <0xcfc27>
    <cffc1>   DW_AT_data_member_location: 32
 <2><cffc2>: Abbrev Number: 1 (DW_TAG_member)
    <cffc3>   DW_AT_name        : (indirect string, offset: 0x8ec40): mheight
    <cffc7>   DW_AT_decl_file   : 10
    <cffc8>   DW_AT_decl_line   : 262
    <cffca>   DW_AT_decl_column : 14
    <cffcb>   DW_AT_type        : <0xcfc27>
    <cffcf>   DW_AT_data_member_location: 36
 <2><cffd0>: Abbrev Number: 1 (DW_TAG_member)
    <cffd1>   DW_AT_name        : (indirect string, offset: 0x8ed65): ndepths
    <cffd5>   DW_AT_decl_file   : 10
    <cffd6>   DW_AT_decl_line   : 263
    <cffd8>   DW_AT_decl_column : 6
    <cffd9>   DW_AT_type        : <0xcfc27>
    <cffdd>   DW_AT_data_member_location: 40
 <2><cffde>: Abbrev Number: 1 (DW_TAG_member)
    <cffdf>   DW_AT_name        : (indirect string, offset: 0x8ed66): depths
    <cffe3>   DW_AT_decl_file   : 10
    <cffe4>   DW_AT_decl_line   : 264
    <cffe6>   DW_AT_decl_column : 9
    <cffe7>   DW_AT_type        : <0xd0091>
    <cffeb>   DW_AT_data_member_location: 48
 <2><cffec>: Abbrev Number: 1 (DW_TAG_member)
    <cffed>   DW_AT_name        : (indirect string, offset: 0x8ea6b): root_depth
    <cfff1>   DW_AT_decl_file   : 10
    <cfff2>   DW_AT_decl_line   : 265
    <cfff4>   DW_AT_decl_column : 6
    <cfff5>   DW_AT_type        : <0xcfc27>
    <cfff9>   DW_AT_data_member_location: 56
 <2><cfffa>: Abbrev Number: 1 (DW_TAG_member)
    <cfffb>   DW_AT_name        : (indirect string, offset: 0x8ebbe): root_visual
    <cffff>   DW_AT_decl_file   : 10
    <d0000>   DW_AT_decl_line   : 266
    <d0002>   DW_AT_decl_column : 10
    <d0003>   DW_AT_type        : <0xcff55>
    <d0007>   DW_AT_data_member_location: 64
 <2><d0008>: Abbrev Number: 1 (DW_TAG_member)
    <d0009>   DW_AT_name        : (indirect string, offset: 0x8ed1a): default_gc
    <d000d>   DW_AT_decl_file   : 10
    <d000e>   DW_AT_decl_line   : 267
    <d0010>   DW_AT_decl_column : 5
    <d0011>   DW_AT_type        : <0xcfe8e>
    <d0015>   DW_AT_data_member_location: 72
 <2><d0016>: Abbrev Number: 1 (DW_TAG_member)
    <d0017>   DW_AT_name        : (indirect string, offset: 0x8ebf6): cmap
    <d001b>   DW_AT_decl_file   : 10
    <d001c>   DW_AT_decl_line   : 268
    <d001e>   DW_AT_decl_column : 11
    <d001f>   DW_AT_type        : <0xcfdfc>
    <d0023>   DW_AT_data_member_location: 80
 <2><d0024>: Abbrev Number: 1 (DW_TAG_member)
    <d0025>   DW_AT_name        : (indirect string, offset: 0x8edfe): white_pixel
    <d0029>   DW_AT_decl_file   : 10
    <d002a>   DW_AT_decl_line   : 269
    <d002c>   DW_AT_decl_column : 16
    <d002d>   DW_AT_type        : <0xcfc5b>
    <d0031>   DW_AT_data_member_location: 88
 <2><d0032>: Abbrev Number: 1 (DW_TAG_member)
    <d0033>   DW_AT_name        : (indirect string, offset: 0x8ae26): black_pixel
    <d0037>   DW_AT_decl_file   : 10
    <d0038>   DW_AT_decl_line   : 270
    <d003a>   DW_AT_decl_column : 16
    <d003b>   DW_AT_type        : <0xcfc5b>
    <d003f>   DW_AT_data_member_location: 96
 <2><d0040>: Abbrev Number: 1 (DW_TAG_member)
    <d0041>   DW_AT_name        : (indirect string, offset: 0x8ec81): max_maps
    <d0045>   DW_AT_decl_file   : 10
    <d0046>   DW_AT_decl_line   : 271
    <d0048>   DW_AT_decl_column : 6
    <d0049>   DW_AT_type        : <0xcfc27>
    <d004d>   DW_AT_data_member_location: 104
 <2><d004e>: Abbrev Number: 1 (DW_TAG_member)
    <d004f>   DW_AT_name        : (indirect string, offset: 0x8ee27): min_maps
    <d0053>   DW_AT_decl_file   : 10
    <d0054>   DW_AT_decl_line   : 271
    <d0056>   DW_AT_decl_column : 16
    <d0057>   DW_AT_type        : <0xcfc27>
    <d005b>   DW_AT_data_member_location: 108
 <2><d005c>: Abbrev Number: 1 (DW_TAG_member)
    <d005d>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <d0061>   DW_AT_decl_file   : 10
    <d0062>   DW_AT_decl_line   : 272
    <d0064>   DW_AT_decl_column : 6
    <d0065>   DW_AT_type        : <0xcfc27>
    <d0069>   DW_AT_data_member_location: 112
 <2><d006a>: Abbrev Number: 1 (DW_TAG_member)
    <d006b>   DW_AT_name        : (indirect string, offset: 0x8eb52): save_unders
    <d006f>   DW_AT_decl_file   : 10
    <d0070>   DW_AT_decl_line   : 273
    <d0072>   DW_AT_decl_column : 7
    <d0073>   DW_AT_type        : <0xcfc27>
    <d0077>   DW_AT_data_member_location: 116
 <2><d0078>: Abbrev Number: 1 (DW_TAG_member)
    <d0079>   DW_AT_name        : (indirect string, offset: 0x8ea5b): root_input_mask
    <d007d>   DW_AT_decl_file   : 10
    <d007e>   DW_AT_decl_line   : 274
    <d0080>   DW_AT_decl_column : 7
    <d0081>   DW_AT_type        : <0xcfc62>
    <d0085>   DW_AT_data_member_location: 120
 <2><d0086>: Abbrev Number: 0
 <1><d0087>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d0088>   DW_AT_name        : (indirect string, offset: 0x8bb46): _XDisplay
    <d008c>   DW_AT_declaration : 1
 <1><d008c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d008d>   DW_AT_byte_size   : 8
    <d008d>   DW_AT_type        : <0xd0087>
 <1><d0091>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d0092>   DW_AT_byte_size   : 8
    <d0092>   DW_AT_type        : <0xcff5a>
 <1><d0096>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0097>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <d009b>   DW_AT_decl_file   : 10
    <d009c>   DW_AT_decl_line   : 275
    <d009e>   DW_AT_decl_column : 3
    <d009f>   DW_AT_type        : <0xcff66>
 <1><d00a3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d00a4>   DW_AT_byte_size   : 24
    <d00a5>   DW_AT_decl_file   : 10
    <d00a5>   DW_AT_decl_line   : 280
    <d00a7>   DW_AT_decl_column : 9
    <d00a7>   DW_AT_sibling     : <0xd00e4>
 <2><d00ab>: Abbrev Number: 1 (DW_TAG_member)
    <d00ac>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d00b0>   DW_AT_decl_file   : 10
    <d00b1>   DW_AT_decl_line   : 281
    <d00b3>   DW_AT_decl_column : 12
    <d00b4>   DW_AT_type        : <0xcff14>
    <d00b8>   DW_AT_data_member_location: 0
 <2><d00b9>: Abbrev Number: 1 (DW_TAG_member)
    <d00ba>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <d00be>   DW_AT_decl_file   : 10
    <d00bf>   DW_AT_decl_line   : 282
    <d00c1>   DW_AT_decl_column : 6
    <d00c2>   DW_AT_type        : <0xcfc27>
    <d00c6>   DW_AT_data_member_location: 8
 <2><d00c7>: Abbrev Number: 1 (DW_TAG_member)
    <d00c8>   DW_AT_name        : (indirect string, offset: 0x6313a): bits_per_pixel
    <d00cc>   DW_AT_decl_file   : 10
    <d00cd>   DW_AT_decl_line   : 283
    <d00cf>   DW_AT_decl_column : 6
    <d00d0>   DW_AT_type        : <0xcfc27>
    <d00d4>   DW_AT_data_member_location: 12
 <2><d00d5>: Abbrev Number: 1 (DW_TAG_member)
    <d00d6>   DW_AT_name        : (indirect string, offset: 0x8edf1): scanline_pad
    <d00da>   DW_AT_decl_file   : 10
    <d00db>   DW_AT_decl_line   : 284
    <d00dd>   DW_AT_decl_column : 6
    <d00de>   DW_AT_type        : <0xcfc27>
    <d00e2>   DW_AT_data_member_location: 16
 <2><d00e3>: Abbrev Number: 0
 <1><d00e4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d00e5>   DW_AT_name        : (indirect string, offset: 0x8ebb1): ScreenFormat
    <d00e9>   DW_AT_decl_file   : 10
    <d00ea>   DW_AT_decl_line   : 285
    <d00ec>   DW_AT_decl_column : 3
    <d00ed>   DW_AT_type        : <0xd00a3>
 <1><d00f1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d00f2>   DW_AT_byte_size   : 8
    <d00f2>   DW_AT_type        : <0xd0096>
 <1><d00f6>: Abbrev Number: 4 (DW_TAG_typedef)
    <d00f7>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <d00fb>   DW_AT_decl_file   : 10
    <d00fc>   DW_AT_decl_line   : 487
    <d00fe>   DW_AT_decl_column : 26
    <d00ff>   DW_AT_type        : <0xd0087>
 <1><d0103>: Abbrev Number: 73 (DW_TAG_structure_type)
    <d0104>   DW_AT_byte_size   : 296
    <d0106>   DW_AT_decl_file   : 10
    <d0107>   DW_AT_decl_line   : 493
    <d0109>   DW_AT_decl_column : 9
    <d010a>   DW_AT_sibling     : <0xd037b>
 <2><d010e>: Abbrev Number: 1 (DW_TAG_member)
    <d010f>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d0113>   DW_AT_decl_file   : 10
    <d0114>   DW_AT_decl_line   : 498
    <d0116>   DW_AT_decl_column : 12
    <d0117>   DW_AT_type        : <0xcff14>
    <d011b>   DW_AT_data_member_location: 0
 <2><d011c>: Abbrev Number: 1 (DW_TAG_member)
    <d011d>   DW_AT_name        : (indirect string, offset: 0x8eabf): private1
    <d0121>   DW_AT_decl_file   : 10
    <d0122>   DW_AT_decl_line   : 499
    <d0124>   DW_AT_decl_column : 20
    <d0125>   DW_AT_type        : <0xd0380>
    <d0129>   DW_AT_data_member_location: 8
 <2><d012a>: Abbrev Number: 10 (DW_TAG_member)
    <d012b>   DW_AT_name        : fd
    <d012e>   DW_AT_decl_file   : 10
    <d012f>   DW_AT_decl_line   : 500
    <d0131>   DW_AT_decl_column : 6
    <d0132>   DW_AT_type        : <0xcfc27>
    <d0136>   DW_AT_data_member_location: 16
 <2><d0137>: Abbrev Number: 1 (DW_TAG_member)
    <d0138>   DW_AT_name        : (indirect string, offset: 0x8ed89): private2
    <d013c>   DW_AT_decl_file   : 10
    <d013d>   DW_AT_decl_line   : 501
    <d013f>   DW_AT_decl_column : 6
    <d0140>   DW_AT_type        : <0xcfc27>
    <d0144>   DW_AT_data_member_location: 20
 <2><d0145>: Abbrev Number: 1 (DW_TAG_member)
    <d0146>   DW_AT_name        : (indirect string, offset: 0x8ecc8): proto_major_version
    <d014a>   DW_AT_decl_file   : 10
    <d014b>   DW_AT_decl_line   : 502
    <d014d>   DW_AT_decl_column : 6
    <d014e>   DW_AT_type        : <0xcfc27>
    <d0152>   DW_AT_data_member_location: 24
 <2><d0153>: Abbrev Number: 1 (DW_TAG_member)
    <d0154>   DW_AT_name        : (indirect string, offset: 0x8ed06): proto_minor_version
    <d0158>   DW_AT_decl_file   : 10
    <d0159>   DW_AT_decl_line   : 503
    <d015b>   DW_AT_decl_column : 6
    <d015c>   DW_AT_type        : <0xcfc27>
    <d0160>   DW_AT_data_member_location: 28
 <2><d0161>: Abbrev Number: 1 (DW_TAG_member)
    <d0162>   DW_AT_name        : (indirect string, offset: 0x8eb36): vendor
    <d0166>   DW_AT_decl_file   : 10
    <d0167>   DW_AT_decl_line   : 504
    <d0169>   DW_AT_decl_column : 8
    <d016a>   DW_AT_type        : <0xcfc9b>
    <d016e>   DW_AT_data_member_location: 32
 <2><d016f>: Abbrev Number: 1 (DW_TAG_member)
    <d0170>   DW_AT_name        : (indirect string, offset: 0x8ed92): private3
    <d0174>   DW_AT_decl_file   : 10
    <d0175>   DW_AT_decl_line   : 505
    <d0177>   DW_AT_decl_column : 13
    <d0178>   DW_AT_type        : <0xcfdb4>
    <d017c>   DW_AT_data_member_location: 40
 <2><d017d>: Abbrev Number: 1 (DW_TAG_member)
    <d017e>   DW_AT_name        : (indirect string, offset: 0x8ed9b): private4
    <d0182>   DW_AT_decl_file   : 10
    <d0183>   DW_AT_decl_line   : 506
    <d0185>   DW_AT_decl_column : 6
    <d0186>   DW_AT_type        : <0xcfdb4>
    <d018a>   DW_AT_data_member_location: 48
 <2><d018b>: Abbrev Number: 1 (DW_TAG_member)
    <d018c>   DW_AT_name        : (indirect string, offset: 0x8ee81): private5
    <d0190>   DW_AT_decl_file   : 10
    <d0191>   DW_AT_decl_line   : 507
    <d0193>   DW_AT_decl_column : 6
    <d0194>   DW_AT_type        : <0xcfdb4>
    <d0198>   DW_AT_data_member_location: 56
 <2><d0199>: Abbrev Number: 1 (DW_TAG_member)
    <d019a>   DW_AT_name        : (indirect string, offset: 0x8edaf): private6
    <d019e>   DW_AT_decl_file   : 10
    <d019f>   DW_AT_decl_line   : 508
    <d01a1>   DW_AT_decl_column : 6
    <d01a2>   DW_AT_type        : <0xcfc27>
    <d01a6>   DW_AT_data_member_location: 64
 <2><d01a7>: Abbrev Number: 1 (DW_TAG_member)
    <d01a8>   DW_AT_name        : (indirect string, offset: 0x8eb5e): resource_alloc
    <d01ac>   DW_AT_decl_file   : 10
    <d01ad>   DW_AT_decl_line   : 509
    <d01af>   DW_AT_decl_column : 8
    <d01b0>   DW_AT_type        : <0xd0394>
    <d01b4>   DW_AT_data_member_location: 72
 <2><d01b5>: Abbrev Number: 1 (DW_TAG_member)
    <d01b6>   DW_AT_name        : (indirect string, offset: 0x8ecdc): byte_order
    <d01ba>   DW_AT_decl_file   : 10
    <d01bb>   DW_AT_decl_line   : 512
    <d01bd>   DW_AT_decl_column : 6
    <d01be>   DW_AT_type        : <0xcfc27>
    <d01c2>   DW_AT_data_member_location: 80
 <2><d01c3>: Abbrev Number: 1 (DW_TAG_member)
    <d01c4>   DW_AT_name        : (indirect string, offset: 0x8ec75): bitmap_unit
    <d01c8>   DW_AT_decl_file   : 10
    <d01c9>   DW_AT_decl_line   : 513
    <d01cb>   DW_AT_decl_column : 6
    <d01cc>   DW_AT_type        : <0xcfc27>
    <d01d0>   DW_AT_data_member_location: 84
 <2><d01d1>: Abbrev Number: 1 (DW_TAG_member)
    <d01d2>   DW_AT_name        : (indirect string, offset: 0x8ee60): bitmap_pad
    <d01d6>   DW_AT_decl_file   : 10
    <d01d7>   DW_AT_decl_line   : 514
    <d01d9>   DW_AT_decl_column : 6
    <d01da>   DW_AT_type        : <0xcfc27>
    <d01de>   DW_AT_data_member_location: 88
 <2><d01df>: Abbrev Number: 1 (DW_TAG_member)
    <d01e0>   DW_AT_name        : (indirect string, offset: 0x8ea33): bitmap_bit_order
    <d01e4>   DW_AT_decl_file   : 10
    <d01e5>   DW_AT_decl_line   : 515
    <d01e7>   DW_AT_decl_column : 6
    <d01e8>   DW_AT_type        : <0xcfc27>
    <d01ec>   DW_AT_data_member_location: 92
 <2><d01ed>: Abbrev Number: 1 (DW_TAG_member)
    <d01ee>   DW_AT_name        : (indirect string, offset: 0x8eddc): nformats
    <d01f2>   DW_AT_decl_file   : 10
    <d01f3>   DW_AT_decl_line   : 516
    <d01f5>   DW_AT_decl_column : 6
    <d01f6>   DW_AT_type        : <0xcfc27>
    <d01fa>   DW_AT_data_member_location: 96
 <2><d01fb>: Abbrev Number: 1 (DW_TAG_member)
    <d01fc>   DW_AT_name        : (indirect string, offset: 0x8ec9d): pixmap_format
    <d0200>   DW_AT_decl_file   : 10
    <d0201>   DW_AT_decl_line   : 517
    <d0203>   DW_AT_decl_column : 16
    <d0204>   DW_AT_type        : <0xd0399>
    <d0208>   DW_AT_data_member_location: 104
 <2><d0209>: Abbrev Number: 1 (DW_TAG_member)
    <d020a>   DW_AT_name        : (indirect string, offset: 0x8edca): private8
    <d020e>   DW_AT_decl_file   : 10
    <d020f>   DW_AT_decl_line   : 518
    <d0211>   DW_AT_decl_column : 6
    <d0212>   DW_AT_type        : <0xcfc27>
    <d0216>   DW_AT_data_member_location: 112
 <2><d0217>: Abbrev Number: 1 (DW_TAG_member)
    <d0218>   DW_AT_name        : (indirect string, offset: 0xa9ad): release
    <d021c>   DW_AT_decl_file   : 10
    <d021d>   DW_AT_decl_line   : 519
    <d021f>   DW_AT_decl_column : 6
    <d0220>   DW_AT_type        : <0xcfc27>
    <d0224>   DW_AT_data_member_location: 116
 <2><d0225>: Abbrev Number: 1 (DW_TAG_member)
    <d0226>   DW_AT_name        : (indirect string, offset: 0x8edd3): private9
    <d022a>   DW_AT_decl_file   : 10
    <d022b>   DW_AT_decl_line   : 520
    <d022d>   DW_AT_decl_column : 20
    <d022e>   DW_AT_type        : <0xd0380>
    <d0232>   DW_AT_data_member_location: 120
 <2><d0233>: Abbrev Number: 1 (DW_TAG_member)
    <d0234>   DW_AT_name        : (indirect string, offset: 0x8eea2): private10
    <d0238>   DW_AT_decl_file   : 10
    <d0239>   DW_AT_decl_line   : 520
    <d023b>   DW_AT_decl_column : 31
    <d023c>   DW_AT_type        : <0xd0380>
    <d0240>   DW_AT_data_member_location: 128
 <2><d0241>: Abbrev Number: 1 (DW_TAG_member)
    <d0242>   DW_AT_name        : (indirect string, offset: 0x8eb9f): qlen
    <d0246>   DW_AT_decl_file   : 10
    <d0247>   DW_AT_decl_line   : 521
    <d0249>   DW_AT_decl_column : 6
    <d024a>   DW_AT_type        : <0xcfc27>
    <d024e>   DW_AT_data_member_location: 136
 <2><d024f>: Abbrev Number: 1 (DW_TAG_member)
    <d0250>   DW_AT_name        : (indirect string, offset: 0x8ea04): last_request_read
    <d0254>   DW_AT_decl_file   : 10
    <d0255>   DW_AT_decl_line   : 522
    <d0257>   DW_AT_decl_column : 16
    <d0258>   DW_AT_type        : <0xcfc5b>
    <d025c>   DW_AT_data_member_location: 144
 <2><d025d>: Abbrev Number: 1 (DW_TAG_member)
    <d025e>   DW_AT_name        : (indirect string, offset: 0x7ad1f): request
    <d0262>   DW_AT_decl_file   : 10
    <d0263>   DW_AT_decl_line   : 523
    <d0265>   DW_AT_decl_column : 16
    <d0266>   DW_AT_type        : <0xcfc5b>
    <d026a>   DW_AT_data_member_location: 152
 <2><d026b>: Abbrev Number: 1 (DW_TAG_member)
    <d026c>   DW_AT_name        : (indirect string, offset: 0x8eeac): private11
    <d0270>   DW_AT_decl_file   : 10
    <d0271>   DW_AT_decl_line   : 524
    <d0273>   DW_AT_decl_column : 11
    <d0274>   DW_AT_type        : <0xcfe1b>
    <d0278>   DW_AT_data_member_location: 160
 <2><d0279>: Abbrev Number: 1 (DW_TAG_member)
    <d027a>   DW_AT_name        : (indirect string, offset: 0x8eed5): private12
    <d027e>   DW_AT_decl_file   : 10
    <d027f>   DW_AT_decl_line   : 525
    <d0281>   DW_AT_decl_column : 11
    <d0282>   DW_AT_type        : <0xcfe1b>
    <d0286>   DW_AT_data_member_location: 168
 <2><d0287>: Abbrev Number: 1 (DW_TAG_member)
    <d0288>   DW_AT_name        : (indirect string, offset: 0x8eedf): private13
    <d028c>   DW_AT_decl_file   : 10
    <d028d>   DW_AT_decl_line   : 526
    <d028f>   DW_AT_decl_column : 11
    <d0290>   DW_AT_type        : <0xcfe1b>
    <d0294>   DW_AT_data_member_location: 176
 <2><d0295>: Abbrev Number: 1 (DW_TAG_member)
    <d0296>   DW_AT_name        : (indirect string, offset: 0x8eee9): private14
    <d029a>   DW_AT_decl_file   : 10
    <d029b>   DW_AT_decl_line   : 527
    <d029d>   DW_AT_decl_column : 11
    <d029e>   DW_AT_type        : <0xcfe1b>
    <d02a2>   DW_AT_data_member_location: 184
 <2><d02a3>: Abbrev Number: 1 (DW_TAG_member)
    <d02a4>   DW_AT_name        : (indirect string, offset: 0x8e9a1): max_request_size
    <d02a8>   DW_AT_decl_file   : 10
    <d02a9>   DW_AT_decl_line   : 528
    <d02ab>   DW_AT_decl_column : 11
    <d02ac>   DW_AT_type        : <0xcfbf3>
    <d02b0>   DW_AT_data_member_location: 192
 <2><d02b1>: Abbrev Number: 10 (DW_TAG_member)
    <d02b2>   DW_AT_name        : db
    <d02b5>   DW_AT_decl_file   : 10
    <d02b6>   DW_AT_decl_line   : 529
    <d02b8>   DW_AT_decl_column : 28
    <d02b9>   DW_AT_type        : <0xd03a3>
    <d02bd>   DW_AT_data_member_location: 200
 <2><d02be>: Abbrev Number: 1 (DW_TAG_member)
    <d02bf>   DW_AT_name        : (indirect string, offset: 0x8eef3): private15
    <d02c3>   DW_AT_decl_file   : 10
    <d02c4>   DW_AT_decl_line   : 530
    <d02c6>   DW_AT_decl_column : 8
    <d02c7>   DW_AT_type        : <0xd03b7>
    <d02cb>   DW_AT_data_member_location: 208
 <2><d02cc>: Abbrev Number: 1 (DW_TAG_member)
    <d02cd>   DW_AT_name        : (indirect string, offset: 0x8ea9d): display_name
    <d02d1>   DW_AT_decl_file   : 10
    <d02d2>   DW_AT_decl_line   : 533
    <d02d4>   DW_AT_decl_column : 8
    <d02d5>   DW_AT_type        : <0xcfc9b>
    <d02d9>   DW_AT_data_member_location: 216
 <2><d02da>: Abbrev Number: 1 (DW_TAG_member)
    <d02db>   DW_AT_name        : (indirect string, offset: 0x8ee93): default_screen
    <d02df>   DW_AT_decl_file   : 10
    <d02e0>   DW_AT_decl_line   : 534
    <d02e2>   DW_AT_decl_column : 6
    <d02e3>   DW_AT_type        : <0xcfc27>
    <d02e7>   DW_AT_data_member_location: 224
 <2><d02e8>: Abbrev Number: 1 (DW_TAG_member)
    <d02e9>   DW_AT_name        : (indirect string, offset: 0x8ebca): nscreens
    <d02ed>   DW_AT_decl_file   : 10
    <d02ee>   DW_AT_decl_line   : 535
    <d02f0>   DW_AT_decl_column : 6
    <d02f1>   DW_AT_type        : <0xcfc27>
    <d02f5>   DW_AT_data_member_location: 228
 <2><d02f6>: Abbrev Number: 1 (DW_TAG_member)
    <d02f7>   DW_AT_name        : (indirect string, offset: 0x8ebcb): screens
    <d02fb>   DW_AT_decl_file   : 10
    <d02fc>   DW_AT_decl_line   : 536
    <d02fe>   DW_AT_decl_column : 10
    <d02ff>   DW_AT_type        : <0xd00f1>
    <d0303>   DW_AT_data_member_location: 232
 <2><d0304>: Abbrev Number: 1 (DW_TAG_member)
    <d0305>   DW_AT_name        : (indirect string, offset: 0x8eb6d): motion_buffer
    <d0309>   DW_AT_decl_file   : 10
    <d030a>   DW_AT_decl_line   : 537
    <d030c>   DW_AT_decl_column : 16
    <d030d>   DW_AT_type        : <0xcfc5b>
    <d0311>   DW_AT_data_member_location: 240
 <2><d0312>: Abbrev Number: 1 (DW_TAG_member)
    <d0313>   DW_AT_name        : (indirect string, offset: 0x8eefd): private16
    <d0317>   DW_AT_decl_file   : 10
    <d0318>   DW_AT_decl_line   : 538
    <d031a>   DW_AT_decl_column : 16
    <d031b>   DW_AT_type        : <0xcfc5b>
    <d031f>   DW_AT_data_member_location: 248
 <2><d0320>: Abbrev Number: 20 (DW_TAG_member)
    <d0321>   DW_AT_name        : (indirect string, offset: 0x8eb7b): min_keycode
    <d0325>   DW_AT_decl_file   : 10
    <d0326>   DW_AT_decl_line   : 539
    <d0328>   DW_AT_decl_column : 6
    <d0329>   DW_AT_type        : <0xcfc27>
    <d032d>   DW_AT_data_member_location: 256
 <2><d032f>: Abbrev Number: 20 (DW_TAG_member)
    <d0330>   DW_AT_name        : (indirect string, offset: 0x8eb46): max_keycode
    <d0334>   DW_AT_decl_file   : 10
    <d0335>   DW_AT_decl_line   : 540
    <d0337>   DW_AT_decl_column : 6
    <d0338>   DW_AT_type        : <0xcfc27>
    <d033c>   DW_AT_data_member_location: 260
 <2><d033e>: Abbrev Number: 20 (DW_TAG_member)
    <d033f>   DW_AT_name        : (indirect string, offset: 0x8ef07): private17
    <d0343>   DW_AT_decl_file   : 10
    <d0344>   DW_AT_decl_line   : 541
    <d0346>   DW_AT_decl_column : 11
    <d0347>   DW_AT_type        : <0xcfe1b>
    <d034b>   DW_AT_data_member_location: 264
 <2><d034d>: Abbrev Number: 20 (DW_TAG_member)
    <d034e>   DW_AT_name        : (indirect string, offset: 0x8ef11): private18
    <d0352>   DW_AT_decl_file   : 10
    <d0353>   DW_AT_decl_line   : 542
    <d0355>   DW_AT_decl_column : 11
    <d0356>   DW_AT_type        : <0xcfe1b>
    <d035a>   DW_AT_data_member_location: 272
 <2><d035c>: Abbrev Number: 20 (DW_TAG_member)
    <d035d>   DW_AT_name        : (indirect string, offset: 0x8ef1b): private19
    <d0361>   DW_AT_decl_file   : 10
    <d0362>   DW_AT_decl_line   : 543
    <d0364>   DW_AT_decl_column : 6
    <d0365>   DW_AT_type        : <0xcfc27>
    <d0369>   DW_AT_data_member_location: 280
 <2><d036b>: Abbrev Number: 20 (DW_TAG_member)
    <d036c>   DW_AT_name        : (indirect string, offset: 0x8ea16): xdefaults
    <d0370>   DW_AT_decl_file   : 10
    <d0371>   DW_AT_decl_line   : 544
    <d0373>   DW_AT_decl_column : 8
    <d0374>   DW_AT_type        : <0xcfc9b>
    <d0378>   DW_AT_data_member_location: 288
 <2><d037a>: Abbrev Number: 0
 <1><d037b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d037c>   DW_AT_name        : (indirect string, offset: 0x8ed7f): _XPrivate
    <d0380>   DW_AT_declaration : 1
 <1><d0380>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d0381>   DW_AT_byte_size   : 8
    <d0381>   DW_AT_type        : <0xd037b>
 <1><d0385>: Abbrev Number: 46 (DW_TAG_subroutine_type)
    <d0386>   DW_AT_prototyped  : 1
    <d0386>   DW_AT_type        : <0xcfdb4>
    <d038a>   DW_AT_sibling     : <0xd0394>
 <2><d038e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d038f>   DW_AT_type        : <0xd008c>
 <2><d0393>: Abbrev Number: 0
 <1><d0394>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d0395>   DW_AT_byte_size   : 8
    <d0395>   DW_AT_type        : <0xd0385>
 <1><d0399>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d039a>   DW_AT_byte_size   : 8
    <d039a>   DW_AT_type        : <0xd00e4>
 <1><d039e>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d039f>   DW_AT_name        : (indirect string, offset: 0x8ef49): _XrmHashBucketRec
    <d03a3>   DW_AT_declaration : 1
 <1><d03a3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d03a4>   DW_AT_byte_size   : 8
    <d03a4>   DW_AT_type        : <0xd039e>
 <1><d03a8>: Abbrev Number: 46 (DW_TAG_subroutine_type)
    <d03a9>   DW_AT_prototyped  : 1
    <d03a9>   DW_AT_type        : <0xcfc27>
    <d03ad>   DW_AT_sibling     : <0xd03b7>
 <2><d03b1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <d03b2>   DW_AT_type        : <0xd008c>
 <2><d03b6>: Abbrev Number: 0
 <1><d03b7>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d03b8>   DW_AT_byte_size   : 8
    <d03b8>   DW_AT_type        : <0xd03a8>
 <1><d03bc>: Abbrev Number: 4 (DW_TAG_typedef)
    <d03bd>   DW_AT_name        : (indirect string, offset: 0x8ed46): _XPrivDisplay
    <d03c1>   DW_AT_decl_file   : 10
    <d03c2>   DW_AT_decl_line   : 550
    <d03c4>   DW_AT_decl_column : 2
    <d03c5>   DW_AT_type        : <0xd03c9>
 <1><d03c9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d03ca>   DW_AT_byte_size   : 8
    <d03ca>   DW_AT_type        : <0xd0103>
 <1><d03ce>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d03cf>   DW_AT_byte_size   : 96
    <d03d0>   DW_AT_decl_file   : 10
    <d03d0>   DW_AT_decl_line   : 557
    <d03d2>   DW_AT_decl_column : 9
    <d03d2>   DW_AT_sibling     : <0xd04a5>
 <2><d03d6>: Abbrev Number: 1 (DW_TAG_member)
    <d03d7>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d03db>   DW_AT_decl_file   : 10
    <d03dc>   DW_AT_decl_line   : 558
    <d03de>   DW_AT_decl_column : 6
    <d03df>   DW_AT_type        : <0xcfc27>
    <d03e3>   DW_AT_data_member_location: 0
 <2><d03e4>: Abbrev Number: 1 (DW_TAG_member)
    <d03e5>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d03e9>   DW_AT_decl_file   : 10
    <d03ea>   DW_AT_decl_line   : 559
    <d03ec>   DW_AT_decl_column : 16
    <d03ed>   DW_AT_type        : <0xcfc5b>
    <d03f1>   DW_AT_data_member_location: 8
 <2><d03f2>: Abbrev Number: 1 (DW_TAG_member)
    <d03f3>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d03f7>   DW_AT_decl_file   : 10
    <d03f8>   DW_AT_decl_line   : 560
    <d03fa>   DW_AT_decl_column : 7
    <d03fb>   DW_AT_type        : <0xcfc27>
    <d03ff>   DW_AT_data_member_location: 16
 <2><d0400>: Abbrev Number: 1 (DW_TAG_member)
    <d0401>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0405>   DW_AT_decl_file   : 10
    <d0406>   DW_AT_decl_line   : 561
    <d0408>   DW_AT_decl_column : 11
    <d0409>   DW_AT_type        : <0xd04a5>
    <d040d>   DW_AT_data_member_location: 24
 <2><d040e>: Abbrev Number: 1 (DW_TAG_member)
    <d040f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0413>   DW_AT_decl_file   : 10
    <d0414>   DW_AT_decl_line   : 562
    <d0416>   DW_AT_decl_column : 9
    <d0417>   DW_AT_type        : <0xcfde4>
    <d041b>   DW_AT_data_member_location: 32
 <2><d041c>: Abbrev Number: 1 (DW_TAG_member)
    <d041d>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d0421>   DW_AT_decl_file   : 10
    <d0422>   DW_AT_decl_line   : 563
    <d0424>   DW_AT_decl_column : 9
    <d0425>   DW_AT_type        : <0xcfde4>
    <d0429>   DW_AT_data_member_location: 40
 <2><d042a>: Abbrev Number: 1 (DW_TAG_member)
    <d042b>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d042f>   DW_AT_decl_file   : 10
    <d0430>   DW_AT_decl_line   : 564
    <d0432>   DW_AT_decl_column : 9
    <d0433>   DW_AT_type        : <0xcfde4>
    <d0437>   DW_AT_data_member_location: 48
 <2><d0438>: Abbrev Number: 1 (DW_TAG_member)
    <d0439>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d043d>   DW_AT_decl_file   : 10
    <d043e>   DW_AT_decl_line   : 565
    <d0440>   DW_AT_decl_column : 7
    <d0441>   DW_AT_type        : <0xcfdd8>
    <d0445>   DW_AT_data_member_location: 56
 <2><d0446>: Abbrev Number: 10 (DW_TAG_member)
    <d0447>   DW_AT_name        : x
    <d0449>   DW_AT_decl_file   : 10
    <d044a>   DW_AT_decl_line   : 566
    <d044c>   DW_AT_decl_column : 6
    <d044d>   DW_AT_type        : <0xcfc27>
    <d0451>   DW_AT_data_member_location: 64
 <2><d0452>: Abbrev Number: 10 (DW_TAG_member)
    <d0453>   DW_AT_name        : y
    <d0455>   DW_AT_decl_file   : 10
    <d0456>   DW_AT_decl_line   : 566
    <d0458>   DW_AT_decl_column : 9
    <d0459>   DW_AT_type        : <0xcfc27>
    <d045d>   DW_AT_data_member_location: 68
 <2><d045e>: Abbrev Number: 1 (DW_TAG_member)
    <d045f>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d0463>   DW_AT_decl_file   : 10
    <d0464>   DW_AT_decl_line   : 567
    <d0466>   DW_AT_decl_column : 6
    <d0467>   DW_AT_type        : <0xcfc27>
    <d046b>   DW_AT_data_member_location: 72
 <2><d046c>: Abbrev Number: 1 (DW_TAG_member)
    <d046d>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d0471>   DW_AT_decl_file   : 10
    <d0472>   DW_AT_decl_line   : 567
    <d0474>   DW_AT_decl_column : 14
    <d0475>   DW_AT_type        : <0xcfc27>
    <d0479>   DW_AT_data_member_location: 76
 <2><d047a>: Abbrev Number: 1 (DW_TAG_member)
    <d047b>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d047f>   DW_AT_decl_file   : 10
    <d0480>   DW_AT_decl_line   : 568
    <d0482>   DW_AT_decl_column : 15
    <d0483>   DW_AT_type        : <0xcfbf3>
    <d0487>   DW_AT_data_member_location: 80
 <2><d0488>: Abbrev Number: 1 (DW_TAG_member)
    <d0489>   DW_AT_name        : (indirect string, offset: 0x8eb7f): keycode
    <d048d>   DW_AT_decl_file   : 10
    <d048e>   DW_AT_decl_line   : 569
    <d0490>   DW_AT_decl_column : 15
    <d0491>   DW_AT_type        : <0xcfbf3>
    <d0495>   DW_AT_data_member_location: 84
 <2><d0496>: Abbrev Number: 1 (DW_TAG_member)
    <d0497>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d049b>   DW_AT_decl_file   : 10
    <d049c>   DW_AT_decl_line   : 570
    <d049e>   DW_AT_decl_column : 7
    <d049f>   DW_AT_type        : <0xcfc27>
    <d04a3>   DW_AT_data_member_location: 88
 <2><d04a4>: Abbrev Number: 0
 <1><d04a5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d04a6>   DW_AT_byte_size   : 8
    <d04a6>   DW_AT_type        : <0xd00f6>
 <1><d04aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <d04ab>   DW_AT_name        : (indirect string, offset: 0x6d211): XKeyEvent
    <d04af>   DW_AT_decl_file   : 10
    <d04b0>   DW_AT_decl_line   : 571
    <d04b2>   DW_AT_decl_column : 3
    <d04b3>   DW_AT_type        : <0xd03ce>
 <1><d04b7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d04b8>   DW_AT_byte_size   : 96
    <d04b9>   DW_AT_decl_file   : 10
    <d04b9>   DW_AT_decl_line   : 575
    <d04bb>   DW_AT_decl_column : 9
    <d04bb>   DW_AT_sibling     : <0xd058e>
 <2><d04bf>: Abbrev Number: 1 (DW_TAG_member)
    <d04c0>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d04c4>   DW_AT_decl_file   : 10
    <d04c5>   DW_AT_decl_line   : 576
    <d04c7>   DW_AT_decl_column : 6
    <d04c8>   DW_AT_type        : <0xcfc27>
    <d04cc>   DW_AT_data_member_location: 0
 <2><d04cd>: Abbrev Number: 1 (DW_TAG_member)
    <d04ce>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d04d2>   DW_AT_decl_file   : 10
    <d04d3>   DW_AT_decl_line   : 577
    <d04d5>   DW_AT_decl_column : 16
    <d04d6>   DW_AT_type        : <0xcfc5b>
    <d04da>   DW_AT_data_member_location: 8
 <2><d04db>: Abbrev Number: 1 (DW_TAG_member)
    <d04dc>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d04e0>   DW_AT_decl_file   : 10
    <d04e1>   DW_AT_decl_line   : 578
    <d04e3>   DW_AT_decl_column : 7
    <d04e4>   DW_AT_type        : <0xcfc27>
    <d04e8>   DW_AT_data_member_location: 16
 <2><d04e9>: Abbrev Number: 1 (DW_TAG_member)
    <d04ea>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d04ee>   DW_AT_decl_file   : 10
    <d04ef>   DW_AT_decl_line   : 579
    <d04f1>   DW_AT_decl_column : 11
    <d04f2>   DW_AT_type        : <0xd04a5>
    <d04f6>   DW_AT_data_member_location: 24
 <2><d04f7>: Abbrev Number: 1 (DW_TAG_member)
    <d04f8>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d04fc>   DW_AT_decl_file   : 10
    <d04fd>   DW_AT_decl_line   : 580
    <d04ff>   DW_AT_decl_column : 9
    <d0500>   DW_AT_type        : <0xcfde4>
    <d0504>   DW_AT_data_member_location: 32
 <2><d0505>: Abbrev Number: 1 (DW_TAG_member)
    <d0506>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d050a>   DW_AT_decl_file   : 10
    <d050b>   DW_AT_decl_line   : 581
    <d050d>   DW_AT_decl_column : 9
    <d050e>   DW_AT_type        : <0xcfde4>
    <d0512>   DW_AT_data_member_location: 40
 <2><d0513>: Abbrev Number: 1 (DW_TAG_member)
    <d0514>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d0518>   DW_AT_decl_file   : 10
    <d0519>   DW_AT_decl_line   : 582
    <d051b>   DW_AT_decl_column : 9
    <d051c>   DW_AT_type        : <0xcfde4>
    <d0520>   DW_AT_data_member_location: 48
 <2><d0521>: Abbrev Number: 1 (DW_TAG_member)
    <d0522>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d0526>   DW_AT_decl_file   : 10
    <d0527>   DW_AT_decl_line   : 583
    <d0529>   DW_AT_decl_column : 7
    <d052a>   DW_AT_type        : <0xcfdd8>
    <d052e>   DW_AT_data_member_location: 56
 <2><d052f>: Abbrev Number: 10 (DW_TAG_member)
    <d0530>   DW_AT_name        : x
    <d0532>   DW_AT_decl_file   : 10
    <d0533>   DW_AT_decl_line   : 584
    <d0535>   DW_AT_decl_column : 6
    <d0536>   DW_AT_type        : <0xcfc27>
    <d053a>   DW_AT_data_member_location: 64
 <2><d053b>: Abbrev Number: 10 (DW_TAG_member)
    <d053c>   DW_AT_name        : y
    <d053e>   DW_AT_decl_file   : 10
    <d053f>   DW_AT_decl_line   : 584
    <d0541>   DW_AT_decl_column : 9
    <d0542>   DW_AT_type        : <0xcfc27>
    <d0546>   DW_AT_data_member_location: 68
 <2><d0547>: Abbrev Number: 1 (DW_TAG_member)
    <d0548>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d054c>   DW_AT_decl_file   : 10
    <d054d>   DW_AT_decl_line   : 585
    <d054f>   DW_AT_decl_column : 6
    <d0550>   DW_AT_type        : <0xcfc27>
    <d0554>   DW_AT_data_member_location: 72
 <2><d0555>: Abbrev Number: 1 (DW_TAG_member)
    <d0556>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d055a>   DW_AT_decl_file   : 10
    <d055b>   DW_AT_decl_line   : 585
    <d055d>   DW_AT_decl_column : 14
    <d055e>   DW_AT_type        : <0xcfc27>
    <d0562>   DW_AT_data_member_location: 76
 <2><d0563>: Abbrev Number: 1 (DW_TAG_member)
    <d0564>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d0568>   DW_AT_decl_file   : 10
    <d0569>   DW_AT_decl_line   : 586
    <d056b>   DW_AT_decl_column : 15
    <d056c>   DW_AT_type        : <0xcfbf3>
    <d0570>   DW_AT_data_member_location: 80
 <2><d0571>: Abbrev Number: 1 (DW_TAG_member)
    <d0572>   DW_AT_name        : (indirect string, offset: 0x48b67): button
    <d0576>   DW_AT_decl_file   : 10
    <d0577>   DW_AT_decl_line   : 587
    <d0579>   DW_AT_decl_column : 15
    <d057a>   DW_AT_type        : <0xcfbf3>
    <d057e>   DW_AT_data_member_location: 84
 <2><d057f>: Abbrev Number: 1 (DW_TAG_member)
    <d0580>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d0584>   DW_AT_decl_file   : 10
    <d0585>   DW_AT_decl_line   : 588
    <d0587>   DW_AT_decl_column : 7
    <d0588>   DW_AT_type        : <0xcfc27>
    <d058c>   DW_AT_data_member_location: 88
 <2><d058d>: Abbrev Number: 0
 <1><d058e>: Abbrev Number: 4 (DW_TAG_typedef)
    <d058f>   DW_AT_name        : (indirect string, offset: 0x84cdb): XButtonEvent
    <d0593>   DW_AT_decl_file   : 10
    <d0594>   DW_AT_decl_line   : 589
    <d0596>   DW_AT_decl_column : 3
    <d0597>   DW_AT_type        : <0xd04b7>
 <1><d059b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d059c>   DW_AT_byte_size   : 96
    <d059d>   DW_AT_decl_file   : 10
    <d059d>   DW_AT_decl_line   : 593
    <d059f>   DW_AT_decl_column : 9
    <d059f>   DW_AT_sibling     : <0xd0672>
 <2><d05a3>: Abbrev Number: 1 (DW_TAG_member)
    <d05a4>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d05a8>   DW_AT_decl_file   : 10
    <d05a9>   DW_AT_decl_line   : 594
    <d05ab>   DW_AT_decl_column : 6
    <d05ac>   DW_AT_type        : <0xcfc27>
    <d05b0>   DW_AT_data_member_location: 0
 <2><d05b1>: Abbrev Number: 1 (DW_TAG_member)
    <d05b2>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d05b6>   DW_AT_decl_file   : 10
    <d05b7>   DW_AT_decl_line   : 595
    <d05b9>   DW_AT_decl_column : 16
    <d05ba>   DW_AT_type        : <0xcfc5b>
    <d05be>   DW_AT_data_member_location: 8
 <2><d05bf>: Abbrev Number: 1 (DW_TAG_member)
    <d05c0>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d05c4>   DW_AT_decl_file   : 10
    <d05c5>   DW_AT_decl_line   : 596
    <d05c7>   DW_AT_decl_column : 7
    <d05c8>   DW_AT_type        : <0xcfc27>
    <d05cc>   DW_AT_data_member_location: 16
 <2><d05cd>: Abbrev Number: 1 (DW_TAG_member)
    <d05ce>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d05d2>   DW_AT_decl_file   : 10
    <d05d3>   DW_AT_decl_line   : 597
    <d05d5>   DW_AT_decl_column : 11
    <d05d6>   DW_AT_type        : <0xd04a5>
    <d05da>   DW_AT_data_member_location: 24
 <2><d05db>: Abbrev Number: 1 (DW_TAG_member)
    <d05dc>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d05e0>   DW_AT_decl_file   : 10
    <d05e1>   DW_AT_decl_line   : 598
    <d05e3>   DW_AT_decl_column : 9
    <d05e4>   DW_AT_type        : <0xcfde4>
    <d05e8>   DW_AT_data_member_location: 32
 <2><d05e9>: Abbrev Number: 1 (DW_TAG_member)
    <d05ea>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d05ee>   DW_AT_decl_file   : 10
    <d05ef>   DW_AT_decl_line   : 599
    <d05f1>   DW_AT_decl_column : 9
    <d05f2>   DW_AT_type        : <0xcfde4>
    <d05f6>   DW_AT_data_member_location: 40
 <2><d05f7>: Abbrev Number: 1 (DW_TAG_member)
    <d05f8>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d05fc>   DW_AT_decl_file   : 10
    <d05fd>   DW_AT_decl_line   : 600
    <d05ff>   DW_AT_decl_column : 9
    <d0600>   DW_AT_type        : <0xcfde4>
    <d0604>   DW_AT_data_member_location: 48
 <2><d0605>: Abbrev Number: 1 (DW_TAG_member)
    <d0606>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d060a>   DW_AT_decl_file   : 10
    <d060b>   DW_AT_decl_line   : 601
    <d060d>   DW_AT_decl_column : 7
    <d060e>   DW_AT_type        : <0xcfdd8>
    <d0612>   DW_AT_data_member_location: 56
 <2><d0613>: Abbrev Number: 10 (DW_TAG_member)
    <d0614>   DW_AT_name        : x
    <d0616>   DW_AT_decl_file   : 10
    <d0617>   DW_AT_decl_line   : 602
    <d0619>   DW_AT_decl_column : 6
    <d061a>   DW_AT_type        : <0xcfc27>
    <d061e>   DW_AT_data_member_location: 64
 <2><d061f>: Abbrev Number: 10 (DW_TAG_member)
    <d0620>   DW_AT_name        : y
    <d0622>   DW_AT_decl_file   : 10
    <d0623>   DW_AT_decl_line   : 602
    <d0625>   DW_AT_decl_column : 9
    <d0626>   DW_AT_type        : <0xcfc27>
    <d062a>   DW_AT_data_member_location: 68
 <2><d062b>: Abbrev Number: 1 (DW_TAG_member)
    <d062c>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d0630>   DW_AT_decl_file   : 10
    <d0631>   DW_AT_decl_line   : 603
    <d0633>   DW_AT_decl_column : 6
    <d0634>   DW_AT_type        : <0xcfc27>
    <d0638>   DW_AT_data_member_location: 72
 <2><d0639>: Abbrev Number: 1 (DW_TAG_member)
    <d063a>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d063e>   DW_AT_decl_file   : 10
    <d063f>   DW_AT_decl_line   : 603
    <d0641>   DW_AT_decl_column : 14
    <d0642>   DW_AT_type        : <0xcfc27>
    <d0646>   DW_AT_data_member_location: 76
 <2><d0647>: Abbrev Number: 1 (DW_TAG_member)
    <d0648>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d064c>   DW_AT_decl_file   : 10
    <d064d>   DW_AT_decl_line   : 604
    <d064f>   DW_AT_decl_column : 15
    <d0650>   DW_AT_type        : <0xcfbf3>
    <d0654>   DW_AT_data_member_location: 80
 <2><d0655>: Abbrev Number: 1 (DW_TAG_member)
    <d0656>   DW_AT_name        : (indirect string, offset: 0x5e6a8): is_hint
    <d065a>   DW_AT_decl_file   : 10
    <d065b>   DW_AT_decl_line   : 605
    <d065d>   DW_AT_decl_column : 7
    <d065e>   DW_AT_type        : <0xcfca0>
    <d0662>   DW_AT_data_member_location: 84
 <2><d0663>: Abbrev Number: 1 (DW_TAG_member)
    <d0664>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d0668>   DW_AT_decl_file   : 10
    <d0669>   DW_AT_decl_line   : 606
    <d066b>   DW_AT_decl_column : 7
    <d066c>   DW_AT_type        : <0xcfc27>
    <d0670>   DW_AT_data_member_location: 88
 <2><d0671>: Abbrev Number: 0
 <1><d0672>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0673>   DW_AT_name        : (indirect string, offset: 0x6223d): XMotionEvent
    <d0677>   DW_AT_decl_file   : 10
    <d0678>   DW_AT_decl_line   : 607
    <d067a>   DW_AT_decl_column : 3
    <d067b>   DW_AT_type        : <0xd059b>
 <1><d067f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0680>   DW_AT_byte_size   : 104
    <d0681>   DW_AT_decl_file   : 10
    <d0681>   DW_AT_decl_line   : 610
    <d0683>   DW_AT_decl_column : 9
    <d0683>   DW_AT_sibling     : <0xd0772>
 <2><d0687>: Abbrev Number: 1 (DW_TAG_member)
    <d0688>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d068c>   DW_AT_decl_file   : 10
    <d068d>   DW_AT_decl_line   : 611
    <d068f>   DW_AT_decl_column : 6
    <d0690>   DW_AT_type        : <0xcfc27>
    <d0694>   DW_AT_data_member_location: 0
 <2><d0695>: Abbrev Number: 1 (DW_TAG_member)
    <d0696>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d069a>   DW_AT_decl_file   : 10
    <d069b>   DW_AT_decl_line   : 612
    <d069d>   DW_AT_decl_column : 16
    <d069e>   DW_AT_type        : <0xcfc5b>
    <d06a2>   DW_AT_data_member_location: 8
 <2><d06a3>: Abbrev Number: 1 (DW_TAG_member)
    <d06a4>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d06a8>   DW_AT_decl_file   : 10
    <d06a9>   DW_AT_decl_line   : 613
    <d06ab>   DW_AT_decl_column : 7
    <d06ac>   DW_AT_type        : <0xcfc27>
    <d06b0>   DW_AT_data_member_location: 16
 <2><d06b1>: Abbrev Number: 1 (DW_TAG_member)
    <d06b2>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d06b6>   DW_AT_decl_file   : 10
    <d06b7>   DW_AT_decl_line   : 614
    <d06b9>   DW_AT_decl_column : 11
    <d06ba>   DW_AT_type        : <0xd04a5>
    <d06be>   DW_AT_data_member_location: 24
 <2><d06bf>: Abbrev Number: 1 (DW_TAG_member)
    <d06c0>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d06c4>   DW_AT_decl_file   : 10
    <d06c5>   DW_AT_decl_line   : 615
    <d06c7>   DW_AT_decl_column : 9
    <d06c8>   DW_AT_type        : <0xcfde4>
    <d06cc>   DW_AT_data_member_location: 32
 <2><d06cd>: Abbrev Number: 1 (DW_TAG_member)
    <d06ce>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d06d2>   DW_AT_decl_file   : 10
    <d06d3>   DW_AT_decl_line   : 616
    <d06d5>   DW_AT_decl_column : 9
    <d06d6>   DW_AT_type        : <0xcfde4>
    <d06da>   DW_AT_data_member_location: 40
 <2><d06db>: Abbrev Number: 1 (DW_TAG_member)
    <d06dc>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d06e0>   DW_AT_decl_file   : 10
    <d06e1>   DW_AT_decl_line   : 617
    <d06e3>   DW_AT_decl_column : 9
    <d06e4>   DW_AT_type        : <0xcfde4>
    <d06e8>   DW_AT_data_member_location: 48
 <2><d06e9>: Abbrev Number: 1 (DW_TAG_member)
    <d06ea>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d06ee>   DW_AT_decl_file   : 10
    <d06ef>   DW_AT_decl_line   : 618
    <d06f1>   DW_AT_decl_column : 7
    <d06f2>   DW_AT_type        : <0xcfdd8>
    <d06f6>   DW_AT_data_member_location: 56
 <2><d06f7>: Abbrev Number: 10 (DW_TAG_member)
    <d06f8>   DW_AT_name        : x
    <d06fa>   DW_AT_decl_file   : 10
    <d06fb>   DW_AT_decl_line   : 619
    <d06fd>   DW_AT_decl_column : 6
    <d06fe>   DW_AT_type        : <0xcfc27>
    <d0702>   DW_AT_data_member_location: 64
 <2><d0703>: Abbrev Number: 10 (DW_TAG_member)
    <d0704>   DW_AT_name        : y
    <d0706>   DW_AT_decl_file   : 10
    <d0707>   DW_AT_decl_line   : 619
    <d0709>   DW_AT_decl_column : 9
    <d070a>   DW_AT_type        : <0xcfc27>
    <d070e>   DW_AT_data_member_location: 68
 <2><d070f>: Abbrev Number: 1 (DW_TAG_member)
    <d0710>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d0714>   DW_AT_decl_file   : 10
    <d0715>   DW_AT_decl_line   : 620
    <d0717>   DW_AT_decl_column : 6
    <d0718>   DW_AT_type        : <0xcfc27>
    <d071c>   DW_AT_data_member_location: 72
 <2><d071d>: Abbrev Number: 1 (DW_TAG_member)
    <d071e>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d0722>   DW_AT_decl_file   : 10
    <d0723>   DW_AT_decl_line   : 620
    <d0725>   DW_AT_decl_column : 14
    <d0726>   DW_AT_type        : <0xcfc27>
    <d072a>   DW_AT_data_member_location: 76
 <2><d072b>: Abbrev Number: 1 (DW_TAG_member)
    <d072c>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <d0730>   DW_AT_decl_file   : 10
    <d0731>   DW_AT_decl_line   : 621
    <d0733>   DW_AT_decl_column : 6
    <d0734>   DW_AT_type        : <0xcfc27>
    <d0738>   DW_AT_data_member_location: 80
 <2><d0739>: Abbrev Number: 1 (DW_TAG_member)
    <d073a>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <d073e>   DW_AT_decl_file   : 10
    <d073f>   DW_AT_decl_line   : 622
    <d0741>   DW_AT_decl_column : 6
    <d0742>   DW_AT_type        : <0xcfc27>
    <d0746>   DW_AT_data_member_location: 84
 <2><d0747>: Abbrev Number: 1 (DW_TAG_member)
    <d0748>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d074c>   DW_AT_decl_file   : 10
    <d074d>   DW_AT_decl_line   : 627
    <d074f>   DW_AT_decl_column : 7
    <d0750>   DW_AT_type        : <0xcfc27>
    <d0754>   DW_AT_data_member_location: 88
 <2><d0755>: Abbrev Number: 1 (DW_TAG_member)
    <d0756>   DW_AT_name        : (indirect string, offset: 0x5a0d9): focus
    <d075a>   DW_AT_decl_file   : 10
    <d075b>   DW_AT_decl_line   : 628
    <d075d>   DW_AT_decl_column : 7
    <d075e>   DW_AT_type        : <0xcfc27>
    <d0762>   DW_AT_data_member_location: 92
 <2><d0763>: Abbrev Number: 1 (DW_TAG_member)
    <d0764>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d0768>   DW_AT_decl_file   : 10
    <d0769>   DW_AT_decl_line   : 629
    <d076b>   DW_AT_decl_column : 15
    <d076c>   DW_AT_type        : <0xcfbf3>
    <d0770>   DW_AT_data_member_location: 96
 <2><d0771>: Abbrev Number: 0
 <1><d0772>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0773>   DW_AT_name        : (indirect string, offset: 0x735e4): XCrossingEvent
    <d0777>   DW_AT_decl_file   : 10
    <d0778>   DW_AT_decl_line   : 630
    <d077a>   DW_AT_decl_column : 3
    <d077b>   DW_AT_type        : <0xd067f>
 <1><d077f>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0780>   DW_AT_byte_size   : 48
    <d0781>   DW_AT_decl_file   : 10
    <d0781>   DW_AT_decl_line   : 634
    <d0783>   DW_AT_decl_column : 9
    <d0783>   DW_AT_sibling     : <0xd07ea>
 <2><d0787>: Abbrev Number: 1 (DW_TAG_member)
    <d0788>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d078c>   DW_AT_decl_file   : 10
    <d078d>   DW_AT_decl_line   : 635
    <d078f>   DW_AT_decl_column : 6
    <d0790>   DW_AT_type        : <0xcfc27>
    <d0794>   DW_AT_data_member_location: 0
 <2><d0795>: Abbrev Number: 1 (DW_TAG_member)
    <d0796>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d079a>   DW_AT_decl_file   : 10
    <d079b>   DW_AT_decl_line   : 636
    <d079d>   DW_AT_decl_column : 16
    <d079e>   DW_AT_type        : <0xcfc5b>
    <d07a2>   DW_AT_data_member_location: 8
 <2><d07a3>: Abbrev Number: 1 (DW_TAG_member)
    <d07a4>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d07a8>   DW_AT_decl_file   : 10
    <d07a9>   DW_AT_decl_line   : 637
    <d07ab>   DW_AT_decl_column : 7
    <d07ac>   DW_AT_type        : <0xcfc27>
    <d07b0>   DW_AT_data_member_location: 16
 <2><d07b1>: Abbrev Number: 1 (DW_TAG_member)
    <d07b2>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d07b6>   DW_AT_decl_file   : 10
    <d07b7>   DW_AT_decl_line   : 638
    <d07b9>   DW_AT_decl_column : 11
    <d07ba>   DW_AT_type        : <0xd04a5>
    <d07be>   DW_AT_data_member_location: 24
 <2><d07bf>: Abbrev Number: 1 (DW_TAG_member)
    <d07c0>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d07c4>   DW_AT_decl_file   : 10
    <d07c5>   DW_AT_decl_line   : 639
    <d07c7>   DW_AT_decl_column : 9
    <d07c8>   DW_AT_type        : <0xcfde4>
    <d07cc>   DW_AT_data_member_location: 32
 <2><d07cd>: Abbrev Number: 1 (DW_TAG_member)
    <d07ce>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <d07d2>   DW_AT_decl_file   : 10
    <d07d3>   DW_AT_decl_line   : 640
    <d07d5>   DW_AT_decl_column : 6
    <d07d6>   DW_AT_type        : <0xcfc27>
    <d07da>   DW_AT_data_member_location: 40
 <2><d07db>: Abbrev Number: 1 (DW_TAG_member)
    <d07dc>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <d07e0>   DW_AT_decl_file   : 10
    <d07e1>   DW_AT_decl_line   : 642
    <d07e3>   DW_AT_decl_column : 6
    <d07e4>   DW_AT_type        : <0xcfc27>
    <d07e8>   DW_AT_data_member_location: 44
 <2><d07e9>: Abbrev Number: 0
 <1><d07ea>: Abbrev Number: 4 (DW_TAG_typedef)
    <d07eb>   DW_AT_name        : (indirect string, offset: 0x7178a): XFocusChangeEvent
    <d07ef>   DW_AT_decl_file   : 10
    <d07f0>   DW_AT_decl_line   : 648
    <d07f2>   DW_AT_decl_column : 3
    <d07f3>   DW_AT_type        : <0xd077f>
 <1><d07f7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d07f8>   DW_AT_byte_size   : 72
    <d07f9>   DW_AT_decl_file   : 10
    <d07f9>   DW_AT_decl_line   : 653
    <d07fb>   DW_AT_decl_column : 9
    <d07fb>   DW_AT_sibling     : <0xd0854>
 <2><d07ff>: Abbrev Number: 1 (DW_TAG_member)
    <d0800>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0804>   DW_AT_decl_file   : 10
    <d0805>   DW_AT_decl_line   : 654
    <d0807>   DW_AT_decl_column : 6
    <d0808>   DW_AT_type        : <0xcfc27>
    <d080c>   DW_AT_data_member_location: 0
 <2><d080d>: Abbrev Number: 1 (DW_TAG_member)
    <d080e>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0812>   DW_AT_decl_file   : 10
    <d0813>   DW_AT_decl_line   : 655
    <d0815>   DW_AT_decl_column : 16
    <d0816>   DW_AT_type        : <0xcfc5b>
    <d081a>   DW_AT_data_member_location: 8
 <2><d081b>: Abbrev Number: 1 (DW_TAG_member)
    <d081c>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0820>   DW_AT_decl_file   : 10
    <d0821>   DW_AT_decl_line   : 656
    <d0823>   DW_AT_decl_column : 7
    <d0824>   DW_AT_type        : <0xcfc27>
    <d0828>   DW_AT_data_member_location: 16
 <2><d0829>: Abbrev Number: 1 (DW_TAG_member)
    <d082a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d082e>   DW_AT_decl_file   : 10
    <d082f>   DW_AT_decl_line   : 657
    <d0831>   DW_AT_decl_column : 11
    <d0832>   DW_AT_type        : <0xd04a5>
    <d0836>   DW_AT_data_member_location: 24
 <2><d0837>: Abbrev Number: 1 (DW_TAG_member)
    <d0838>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d083c>   DW_AT_decl_file   : 10
    <d083d>   DW_AT_decl_line   : 658
    <d083f>   DW_AT_decl_column : 9
    <d0840>   DW_AT_type        : <0xcfde4>
    <d0844>   DW_AT_data_member_location: 32
 <2><d0845>: Abbrev Number: 1 (DW_TAG_member)
    <d0846>   DW_AT_name        : (indirect string, offset: 0x70daa): key_vector
    <d084a>   DW_AT_decl_file   : 10
    <d084b>   DW_AT_decl_line   : 659
    <d084d>   DW_AT_decl_column : 7
    <d084e>   DW_AT_type        : <0xcfd32>
    <d0852>   DW_AT_data_member_location: 40
 <2><d0853>: Abbrev Number: 0
 <1><d0854>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0855>   DW_AT_name        : (indirect string, offset: 0x6b358): XKeymapEvent
    <d0859>   DW_AT_decl_file   : 10
    <d085a>   DW_AT_decl_line   : 660
    <d085c>   DW_AT_decl_column : 3
    <d085d>   DW_AT_type        : <0xd07f7>
 <1><d0861>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0862>   DW_AT_byte_size   : 64
    <d0863>   DW_AT_decl_file   : 10
    <d0863>   DW_AT_decl_line   : 662
    <d0865>   DW_AT_decl_column : 9
    <d0865>   DW_AT_sibling     : <0xd08f2>
 <2><d0869>: Abbrev Number: 1 (DW_TAG_member)
    <d086a>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d086e>   DW_AT_decl_file   : 10
    <d086f>   DW_AT_decl_line   : 663
    <d0871>   DW_AT_decl_column : 6
    <d0872>   DW_AT_type        : <0xcfc27>
    <d0876>   DW_AT_data_member_location: 0
 <2><d0877>: Abbrev Number: 1 (DW_TAG_member)
    <d0878>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d087c>   DW_AT_decl_file   : 10
    <d087d>   DW_AT_decl_line   : 664
    <d087f>   DW_AT_decl_column : 16
    <d0880>   DW_AT_type        : <0xcfc5b>
    <d0884>   DW_AT_data_member_location: 8
 <2><d0885>: Abbrev Number: 1 (DW_TAG_member)
    <d0886>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d088a>   DW_AT_decl_file   : 10
    <d088b>   DW_AT_decl_line   : 665
    <d088d>   DW_AT_decl_column : 7
    <d088e>   DW_AT_type        : <0xcfc27>
    <d0892>   DW_AT_data_member_location: 16
 <2><d0893>: Abbrev Number: 1 (DW_TAG_member)
    <d0894>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0898>   DW_AT_decl_file   : 10
    <d0899>   DW_AT_decl_line   : 666
    <d089b>   DW_AT_decl_column : 11
    <d089c>   DW_AT_type        : <0xd04a5>
    <d08a0>   DW_AT_data_member_location: 24
 <2><d08a1>: Abbrev Number: 1 (DW_TAG_member)
    <d08a2>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d08a6>   DW_AT_decl_file   : 10
    <d08a7>   DW_AT_decl_line   : 667
    <d08a9>   DW_AT_decl_column : 9
    <d08aa>   DW_AT_type        : <0xcfde4>
    <d08ae>   DW_AT_data_member_location: 32
 <2><d08af>: Abbrev Number: 10 (DW_TAG_member)
    <d08b0>   DW_AT_name        : x
    <d08b2>   DW_AT_decl_file   : 10
    <d08b3>   DW_AT_decl_line   : 668
    <d08b5>   DW_AT_decl_column : 6
    <d08b6>   DW_AT_type        : <0xcfc27>
    <d08ba>   DW_AT_data_member_location: 40
 <2><d08bb>: Abbrev Number: 10 (DW_TAG_member)
    <d08bc>   DW_AT_name        : y
    <d08be>   DW_AT_decl_file   : 10
    <d08bf>   DW_AT_decl_line   : 668
    <d08c1>   DW_AT_decl_column : 9
    <d08c2>   DW_AT_type        : <0xcfc27>
    <d08c6>   DW_AT_data_member_location: 44
 <2><d08c7>: Abbrev Number: 1 (DW_TAG_member)
    <d08c8>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d08cc>   DW_AT_decl_file   : 10
    <d08cd>   DW_AT_decl_line   : 669
    <d08cf>   DW_AT_decl_column : 6
    <d08d0>   DW_AT_type        : <0xcfc27>
    <d08d4>   DW_AT_data_member_location: 48
 <2><d08d5>: Abbrev Number: 1 (DW_TAG_member)
    <d08d6>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d08da>   DW_AT_decl_file   : 10
    <d08db>   DW_AT_decl_line   : 669
    <d08dd>   DW_AT_decl_column : 13
    <d08de>   DW_AT_type        : <0xcfc27>
    <d08e2>   DW_AT_data_member_location: 52
 <2><d08e3>: Abbrev Number: 1 (DW_TAG_member)
    <d08e4>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <d08e8>   DW_AT_decl_file   : 10
    <d08e9>   DW_AT_decl_line   : 670
    <d08eb>   DW_AT_decl_column : 6
    <d08ec>   DW_AT_type        : <0xcfc27>
    <d08f0>   DW_AT_data_member_location: 56
 <2><d08f1>: Abbrev Number: 0
 <1><d08f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d08f3>   DW_AT_name        : (indirect string, offset: 0x834d6): XExposeEvent
    <d08f7>   DW_AT_decl_file   : 10
    <d08f8>   DW_AT_decl_line   : 671
    <d08fa>   DW_AT_decl_column : 3
    <d08fb>   DW_AT_type        : <0xd0861>
 <1><d08ff>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0900>   DW_AT_byte_size   : 72
    <d0901>   DW_AT_decl_file   : 10
    <d0901>   DW_AT_decl_line   : 673
    <d0903>   DW_AT_decl_column : 9
    <d0903>   DW_AT_sibling     : <0xd09ac>
 <2><d0907>: Abbrev Number: 1 (DW_TAG_member)
    <d0908>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d090c>   DW_AT_decl_file   : 10
    <d090d>   DW_AT_decl_line   : 674
    <d090f>   DW_AT_decl_column : 6
    <d0910>   DW_AT_type        : <0xcfc27>
    <d0914>   DW_AT_data_member_location: 0
 <2><d0915>: Abbrev Number: 1 (DW_TAG_member)
    <d0916>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d091a>   DW_AT_decl_file   : 10
    <d091b>   DW_AT_decl_line   : 675
    <d091d>   DW_AT_decl_column : 16
    <d091e>   DW_AT_type        : <0xcfc5b>
    <d0922>   DW_AT_data_member_location: 8
 <2><d0923>: Abbrev Number: 1 (DW_TAG_member)
    <d0924>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0928>   DW_AT_decl_file   : 10
    <d0929>   DW_AT_decl_line   : 676
    <d092b>   DW_AT_decl_column : 7
    <d092c>   DW_AT_type        : <0xcfc27>
    <d0930>   DW_AT_data_member_location: 16
 <2><d0931>: Abbrev Number: 1 (DW_TAG_member)
    <d0932>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0936>   DW_AT_decl_file   : 10
    <d0937>   DW_AT_decl_line   : 677
    <d0939>   DW_AT_decl_column : 11
    <d093a>   DW_AT_type        : <0xd04a5>
    <d093e>   DW_AT_data_member_location: 24
 <2><d093f>: Abbrev Number: 1 (DW_TAG_member)
    <d0940>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <d0944>   DW_AT_decl_file   : 10
    <d0945>   DW_AT_decl_line   : 678
    <d0947>   DW_AT_decl_column : 11
    <d0948>   DW_AT_type        : <0xcfdf0>
    <d094c>   DW_AT_data_member_location: 32
 <2><d094d>: Abbrev Number: 10 (DW_TAG_member)
    <d094e>   DW_AT_name        : x
    <d0950>   DW_AT_decl_file   : 10
    <d0951>   DW_AT_decl_line   : 679
    <d0953>   DW_AT_decl_column : 6
    <d0954>   DW_AT_type        : <0xcfc27>
    <d0958>   DW_AT_data_member_location: 40
 <2><d0959>: Abbrev Number: 10 (DW_TAG_member)
    <d095a>   DW_AT_name        : y
    <d095c>   DW_AT_decl_file   : 10
    <d095d>   DW_AT_decl_line   : 679
    <d095f>   DW_AT_decl_column : 9
    <d0960>   DW_AT_type        : <0xcfc27>
    <d0964>   DW_AT_data_member_location: 44
 <2><d0965>: Abbrev Number: 1 (DW_TAG_member)
    <d0966>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d096a>   DW_AT_decl_file   : 10
    <d096b>   DW_AT_decl_line   : 680
    <d096d>   DW_AT_decl_column : 6
    <d096e>   DW_AT_type        : <0xcfc27>
    <d0972>   DW_AT_data_member_location: 48
 <2><d0973>: Abbrev Number: 1 (DW_TAG_member)
    <d0974>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d0978>   DW_AT_decl_file   : 10
    <d0979>   DW_AT_decl_line   : 680
    <d097b>   DW_AT_decl_column : 13
    <d097c>   DW_AT_type        : <0xcfc27>
    <d0980>   DW_AT_data_member_location: 52
 <2><d0981>: Abbrev Number: 1 (DW_TAG_member)
    <d0982>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <d0986>   DW_AT_decl_file   : 10
    <d0987>   DW_AT_decl_line   : 681
    <d0989>   DW_AT_decl_column : 6
    <d098a>   DW_AT_type        : <0xcfc27>
    <d098e>   DW_AT_data_member_location: 56
 <2><d098f>: Abbrev Number: 1 (DW_TAG_member)
    <d0990>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <d0994>   DW_AT_decl_file   : 10
    <d0995>   DW_AT_decl_line   : 682
    <d0997>   DW_AT_decl_column : 6
    <d0998>   DW_AT_type        : <0xcfc27>
    <d099c>   DW_AT_data_member_location: 60
 <2><d099d>: Abbrev Number: 1 (DW_TAG_member)
    <d099e>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <d09a2>   DW_AT_decl_file   : 10
    <d09a3>   DW_AT_decl_line   : 683
    <d09a5>   DW_AT_decl_column : 6
    <d09a6>   DW_AT_type        : <0xcfc27>
    <d09aa>   DW_AT_data_member_location: 64
 <2><d09ab>: Abbrev Number: 0
 <1><d09ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <d09ad>   DW_AT_name        : (indirect string, offset: 0x8beb5): XGraphicsExposeEvent
    <d09b1>   DW_AT_decl_file   : 10
    <d09b2>   DW_AT_decl_line   : 684
    <d09b4>   DW_AT_decl_column : 3
    <d09b5>   DW_AT_type        : <0xd08ff>
 <1><d09b9>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d09ba>   DW_AT_byte_size   : 48
    <d09bb>   DW_AT_decl_file   : 10
    <d09bb>   DW_AT_decl_line   : 686
    <d09bd>   DW_AT_decl_column : 9
    <d09bd>   DW_AT_sibling     : <0xd0a24>
 <2><d09c1>: Abbrev Number: 1 (DW_TAG_member)
    <d09c2>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d09c6>   DW_AT_decl_file   : 10
    <d09c7>   DW_AT_decl_line   : 687
    <d09c9>   DW_AT_decl_column : 6
    <d09ca>   DW_AT_type        : <0xcfc27>
    <d09ce>   DW_AT_data_member_location: 0
 <2><d09cf>: Abbrev Number: 1 (DW_TAG_member)
    <d09d0>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d09d4>   DW_AT_decl_file   : 10
    <d09d5>   DW_AT_decl_line   : 688
    <d09d7>   DW_AT_decl_column : 16
    <d09d8>   DW_AT_type        : <0xcfc5b>
    <d09dc>   DW_AT_data_member_location: 8
 <2><d09dd>: Abbrev Number: 1 (DW_TAG_member)
    <d09de>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d09e2>   DW_AT_decl_file   : 10
    <d09e3>   DW_AT_decl_line   : 689
    <d09e5>   DW_AT_decl_column : 7
    <d09e6>   DW_AT_type        : <0xcfc27>
    <d09ea>   DW_AT_data_member_location: 16
 <2><d09eb>: Abbrev Number: 1 (DW_TAG_member)
    <d09ec>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d09f0>   DW_AT_decl_file   : 10
    <d09f1>   DW_AT_decl_line   : 690
    <d09f3>   DW_AT_decl_column : 11
    <d09f4>   DW_AT_type        : <0xd04a5>
    <d09f8>   DW_AT_data_member_location: 24
 <2><d09f9>: Abbrev Number: 1 (DW_TAG_member)
    <d09fa>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <d09fe>   DW_AT_decl_file   : 10
    <d09ff>   DW_AT_decl_line   : 691
    <d0a01>   DW_AT_decl_column : 11
    <d0a02>   DW_AT_type        : <0xcfdf0>
    <d0a06>   DW_AT_data_member_location: 32
 <2><d0a07>: Abbrev Number: 1 (DW_TAG_member)
    <d0a08>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <d0a0c>   DW_AT_decl_file   : 10
    <d0a0d>   DW_AT_decl_line   : 692
    <d0a0f>   DW_AT_decl_column : 6
    <d0a10>   DW_AT_type        : <0xcfc27>
    <d0a14>   DW_AT_data_member_location: 40
 <2><d0a15>: Abbrev Number: 1 (DW_TAG_member)
    <d0a16>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <d0a1a>   DW_AT_decl_file   : 10
    <d0a1b>   DW_AT_decl_line   : 693
    <d0a1d>   DW_AT_decl_column : 6
    <d0a1e>   DW_AT_type        : <0xcfc27>
    <d0a22>   DW_AT_data_member_location: 44
 <2><d0a23>: Abbrev Number: 0
 <1><d0a24>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0a25>   DW_AT_name        : (indirect string, offset: 0x70fba): XNoExposeEvent
    <d0a29>   DW_AT_decl_file   : 10
    <d0a2a>   DW_AT_decl_line   : 694
    <d0a2c>   DW_AT_decl_column : 3
    <d0a2d>   DW_AT_type        : <0xd09b9>
 <1><d0a31>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0a32>   DW_AT_byte_size   : 48
    <d0a33>   DW_AT_decl_file   : 10
    <d0a33>   DW_AT_decl_line   : 696
    <d0a35>   DW_AT_decl_column : 9
    <d0a35>   DW_AT_sibling     : <0xd0a8e>
 <2><d0a39>: Abbrev Number: 1 (DW_TAG_member)
    <d0a3a>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0a3e>   DW_AT_decl_file   : 10
    <d0a3f>   DW_AT_decl_line   : 697
    <d0a41>   DW_AT_decl_column : 6
    <d0a42>   DW_AT_type        : <0xcfc27>
    <d0a46>   DW_AT_data_member_location: 0
 <2><d0a47>: Abbrev Number: 1 (DW_TAG_member)
    <d0a48>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0a4c>   DW_AT_decl_file   : 10
    <d0a4d>   DW_AT_decl_line   : 698
    <d0a4f>   DW_AT_decl_column : 16
    <d0a50>   DW_AT_type        : <0xcfc5b>
    <d0a54>   DW_AT_data_member_location: 8
 <2><d0a55>: Abbrev Number: 1 (DW_TAG_member)
    <d0a56>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0a5a>   DW_AT_decl_file   : 10
    <d0a5b>   DW_AT_decl_line   : 699
    <d0a5d>   DW_AT_decl_column : 7
    <d0a5e>   DW_AT_type        : <0xcfc27>
    <d0a62>   DW_AT_data_member_location: 16
 <2><d0a63>: Abbrev Number: 1 (DW_TAG_member)
    <d0a64>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0a68>   DW_AT_decl_file   : 10
    <d0a69>   DW_AT_decl_line   : 700
    <d0a6b>   DW_AT_decl_column : 11
    <d0a6c>   DW_AT_type        : <0xd04a5>
    <d0a70>   DW_AT_data_member_location: 24
 <2><d0a71>: Abbrev Number: 1 (DW_TAG_member)
    <d0a72>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0a76>   DW_AT_decl_file   : 10
    <d0a77>   DW_AT_decl_line   : 701
    <d0a79>   DW_AT_decl_column : 9
    <d0a7a>   DW_AT_type        : <0xcfde4>
    <d0a7e>   DW_AT_data_member_location: 32
 <2><d0a7f>: Abbrev Number: 1 (DW_TAG_member)
    <d0a80>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d0a84>   DW_AT_decl_file   : 10
    <d0a85>   DW_AT_decl_line   : 702
    <d0a87>   DW_AT_decl_column : 6
    <d0a88>   DW_AT_type        : <0xcfc27>
    <d0a8c>   DW_AT_data_member_location: 40
 <2><d0a8d>: Abbrev Number: 0
 <1><d0a8e>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0a8f>   DW_AT_name        : (indirect string, offset: 0x62f5c): XVisibilityEvent
    <d0a93>   DW_AT_decl_file   : 10
    <d0a94>   DW_AT_decl_line   : 703
    <d0a96>   DW_AT_decl_column : 3
    <d0a97>   DW_AT_type        : <0xd0a31>
 <1><d0a9b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0a9c>   DW_AT_byte_size   : 72
    <d0a9d>   DW_AT_decl_file   : 10
    <d0a9d>   DW_AT_decl_line   : 705
    <d0a9f>   DW_AT_decl_column : 9
    <d0a9f>   DW_AT_sibling     : <0xd0b48>
 <2><d0aa3>: Abbrev Number: 1 (DW_TAG_member)
    <d0aa4>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0aa8>   DW_AT_decl_file   : 10
    <d0aa9>   DW_AT_decl_line   : 706
    <d0aab>   DW_AT_decl_column : 6
    <d0aac>   DW_AT_type        : <0xcfc27>
    <d0ab0>   DW_AT_data_member_location: 0
 <2><d0ab1>: Abbrev Number: 1 (DW_TAG_member)
    <d0ab2>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0ab6>   DW_AT_decl_file   : 10
    <d0ab7>   DW_AT_decl_line   : 707
    <d0ab9>   DW_AT_decl_column : 16
    <d0aba>   DW_AT_type        : <0xcfc5b>
    <d0abe>   DW_AT_data_member_location: 8
 <2><d0abf>: Abbrev Number: 1 (DW_TAG_member)
    <d0ac0>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0ac4>   DW_AT_decl_file   : 10
    <d0ac5>   DW_AT_decl_line   : 708
    <d0ac7>   DW_AT_decl_column : 7
    <d0ac8>   DW_AT_type        : <0xcfc27>
    <d0acc>   DW_AT_data_member_location: 16
 <2><d0acd>: Abbrev Number: 1 (DW_TAG_member)
    <d0ace>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0ad2>   DW_AT_decl_file   : 10
    <d0ad3>   DW_AT_decl_line   : 709
    <d0ad5>   DW_AT_decl_column : 11
    <d0ad6>   DW_AT_type        : <0xd04a5>
    <d0ada>   DW_AT_data_member_location: 24
 <2><d0adb>: Abbrev Number: 1 (DW_TAG_member)
    <d0adc>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <d0ae0>   DW_AT_decl_file   : 10
    <d0ae1>   DW_AT_decl_line   : 710
    <d0ae3>   DW_AT_decl_column : 9
    <d0ae4>   DW_AT_type        : <0xcfde4>
    <d0ae8>   DW_AT_data_member_location: 32
 <2><d0ae9>: Abbrev Number: 1 (DW_TAG_member)
    <d0aea>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0aee>   DW_AT_decl_file   : 10
    <d0aef>   DW_AT_decl_line   : 711
    <d0af1>   DW_AT_decl_column : 9
    <d0af2>   DW_AT_type        : <0xcfde4>
    <d0af6>   DW_AT_data_member_location: 40
 <2><d0af7>: Abbrev Number: 10 (DW_TAG_member)
    <d0af8>   DW_AT_name        : x
    <d0afa>   DW_AT_decl_file   : 10
    <d0afb>   DW_AT_decl_line   : 712
    <d0afd>   DW_AT_decl_column : 6
    <d0afe>   DW_AT_type        : <0xcfc27>
    <d0b02>   DW_AT_data_member_location: 48
 <2><d0b03>: Abbrev Number: 10 (DW_TAG_member)
    <d0b04>   DW_AT_name        : y
    <d0b06>   DW_AT_decl_file   : 10
    <d0b07>   DW_AT_decl_line   : 712
    <d0b09>   DW_AT_decl_column : 9
    <d0b0a>   DW_AT_type        : <0xcfc27>
    <d0b0e>   DW_AT_data_member_location: 52
 <2><d0b0f>: Abbrev Number: 1 (DW_TAG_member)
    <d0b10>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d0b14>   DW_AT_decl_file   : 10
    <d0b15>   DW_AT_decl_line   : 713
    <d0b17>   DW_AT_decl_column : 6
    <d0b18>   DW_AT_type        : <0xcfc27>
    <d0b1c>   DW_AT_data_member_location: 56
 <2><d0b1d>: Abbrev Number: 1 (DW_TAG_member)
    <d0b1e>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d0b22>   DW_AT_decl_file   : 10
    <d0b23>   DW_AT_decl_line   : 713
    <d0b25>   DW_AT_decl_column : 13
    <d0b26>   DW_AT_type        : <0xcfc27>
    <d0b2a>   DW_AT_data_member_location: 60
 <2><d0b2b>: Abbrev Number: 1 (DW_TAG_member)
    <d0b2c>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <d0b30>   DW_AT_decl_file   : 10
    <d0b31>   DW_AT_decl_line   : 714
    <d0b33>   DW_AT_decl_column : 6
    <d0b34>   DW_AT_type        : <0xcfc27>
    <d0b38>   DW_AT_data_member_location: 64
 <2><d0b39>: Abbrev Number: 1 (DW_TAG_member)
    <d0b3a>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <d0b3e>   DW_AT_decl_file   : 10
    <d0b3f>   DW_AT_decl_line   : 715
    <d0b41>   DW_AT_decl_column : 7
    <d0b42>   DW_AT_type        : <0xcfc27>
    <d0b46>   DW_AT_data_member_location: 68
 <2><d0b47>: Abbrev Number: 0
 <1><d0b48>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0b49>   DW_AT_name        : (indirect string, offset: 0x88215): XCreateWindowEvent
    <d0b4d>   DW_AT_decl_file   : 10
    <d0b4e>   DW_AT_decl_line   : 716
    <d0b50>   DW_AT_decl_column : 3
    <d0b51>   DW_AT_type        : <0xd0a9b>
 <1><d0b55>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0b56>   DW_AT_byte_size   : 48
    <d0b57>   DW_AT_decl_file   : 10
    <d0b57>   DW_AT_decl_line   : 718
    <d0b59>   DW_AT_decl_column : 9
    <d0b59>   DW_AT_sibling     : <0xd0bb2>
 <2><d0b5d>: Abbrev Number: 1 (DW_TAG_member)
    <d0b5e>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0b62>   DW_AT_decl_file   : 10
    <d0b63>   DW_AT_decl_line   : 719
    <d0b65>   DW_AT_decl_column : 6
    <d0b66>   DW_AT_type        : <0xcfc27>
    <d0b6a>   DW_AT_data_member_location: 0
 <2><d0b6b>: Abbrev Number: 1 (DW_TAG_member)
    <d0b6c>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0b70>   DW_AT_decl_file   : 10
    <d0b71>   DW_AT_decl_line   : 720
    <d0b73>   DW_AT_decl_column : 16
    <d0b74>   DW_AT_type        : <0xcfc5b>
    <d0b78>   DW_AT_data_member_location: 8
 <2><d0b79>: Abbrev Number: 1 (DW_TAG_member)
    <d0b7a>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0b7e>   DW_AT_decl_file   : 10
    <d0b7f>   DW_AT_decl_line   : 721
    <d0b81>   DW_AT_decl_column : 7
    <d0b82>   DW_AT_type        : <0xcfc27>
    <d0b86>   DW_AT_data_member_location: 16
 <2><d0b87>: Abbrev Number: 1 (DW_TAG_member)
    <d0b88>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0b8c>   DW_AT_decl_file   : 10
    <d0b8d>   DW_AT_decl_line   : 722
    <d0b8f>   DW_AT_decl_column : 11
    <d0b90>   DW_AT_type        : <0xd04a5>
    <d0b94>   DW_AT_data_member_location: 24
 <2><d0b95>: Abbrev Number: 1 (DW_TAG_member)
    <d0b96>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d0b9a>   DW_AT_decl_file   : 10
    <d0b9b>   DW_AT_decl_line   : 723
    <d0b9d>   DW_AT_decl_column : 9
    <d0b9e>   DW_AT_type        : <0xcfde4>
    <d0ba2>   DW_AT_data_member_location: 32
 <2><d0ba3>: Abbrev Number: 1 (DW_TAG_member)
    <d0ba4>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0ba8>   DW_AT_decl_file   : 10
    <d0ba9>   DW_AT_decl_line   : 724
    <d0bab>   DW_AT_decl_column : 9
    <d0bac>   DW_AT_type        : <0xcfde4>
    <d0bb0>   DW_AT_data_member_location: 40
 <2><d0bb1>: Abbrev Number: 0
 <1><d0bb2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0bb3>   DW_AT_name        : (indirect string, offset: 0x7994b): XDestroyWindowEvent
    <d0bb7>   DW_AT_decl_file   : 10
    <d0bb8>   DW_AT_decl_line   : 725
    <d0bba>   DW_AT_decl_column : 3
    <d0bbb>   DW_AT_type        : <0xd0b55>
 <1><d0bbf>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0bc0>   DW_AT_byte_size   : 56
    <d0bc1>   DW_AT_decl_file   : 10
    <d0bc1>   DW_AT_decl_line   : 727
    <d0bc3>   DW_AT_decl_column : 9
    <d0bc3>   DW_AT_sibling     : <0xd0c2a>
 <2><d0bc7>: Abbrev Number: 1 (DW_TAG_member)
    <d0bc8>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0bcc>   DW_AT_decl_file   : 10
    <d0bcd>   DW_AT_decl_line   : 728
    <d0bcf>   DW_AT_decl_column : 6
    <d0bd0>   DW_AT_type        : <0xcfc27>
    <d0bd4>   DW_AT_data_member_location: 0
 <2><d0bd5>: Abbrev Number: 1 (DW_TAG_member)
    <d0bd6>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0bda>   DW_AT_decl_file   : 10
    <d0bdb>   DW_AT_decl_line   : 729
    <d0bdd>   DW_AT_decl_column : 16
    <d0bde>   DW_AT_type        : <0xcfc5b>
    <d0be2>   DW_AT_data_member_location: 8
 <2><d0be3>: Abbrev Number: 1 (DW_TAG_member)
    <d0be4>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0be8>   DW_AT_decl_file   : 10
    <d0be9>   DW_AT_decl_line   : 730
    <d0beb>   DW_AT_decl_column : 7
    <d0bec>   DW_AT_type        : <0xcfc27>
    <d0bf0>   DW_AT_data_member_location: 16
 <2><d0bf1>: Abbrev Number: 1 (DW_TAG_member)
    <d0bf2>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0bf6>   DW_AT_decl_file   : 10
    <d0bf7>   DW_AT_decl_line   : 731
    <d0bf9>   DW_AT_decl_column : 11
    <d0bfa>   DW_AT_type        : <0xd04a5>
    <d0bfe>   DW_AT_data_member_location: 24
 <2><d0bff>: Abbrev Number: 1 (DW_TAG_member)
    <d0c00>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d0c04>   DW_AT_decl_file   : 10
    <d0c05>   DW_AT_decl_line   : 732
    <d0c07>   DW_AT_decl_column : 9
    <d0c08>   DW_AT_type        : <0xcfde4>
    <d0c0c>   DW_AT_data_member_location: 32
 <2><d0c0d>: Abbrev Number: 1 (DW_TAG_member)
    <d0c0e>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0c12>   DW_AT_decl_file   : 10
    <d0c13>   DW_AT_decl_line   : 733
    <d0c15>   DW_AT_decl_column : 9
    <d0c16>   DW_AT_type        : <0xcfde4>
    <d0c1a>   DW_AT_data_member_location: 40
 <2><d0c1b>: Abbrev Number: 1 (DW_TAG_member)
    <d0c1c>   DW_AT_name        : (indirect string, offset: 0x6ee8a): from_configure
    <d0c20>   DW_AT_decl_file   : 10
    <d0c21>   DW_AT_decl_line   : 734
    <d0c23>   DW_AT_decl_column : 7
    <d0c24>   DW_AT_type        : <0xcfc27>
    <d0c28>   DW_AT_data_member_location: 48
 <2><d0c29>: Abbrev Number: 0
 <1><d0c2a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0c2b>   DW_AT_name        : (indirect string, offset: 0x6fb44): XUnmapEvent
    <d0c2f>   DW_AT_decl_file   : 10
    <d0c30>   DW_AT_decl_line   : 735
    <d0c32>   DW_AT_decl_column : 3
    <d0c33>   DW_AT_type        : <0xd0bbf>
 <1><d0c37>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0c38>   DW_AT_byte_size   : 56
    <d0c39>   DW_AT_decl_file   : 10
    <d0c39>   DW_AT_decl_line   : 737
    <d0c3b>   DW_AT_decl_column : 9
    <d0c3b>   DW_AT_sibling     : <0xd0ca2>
 <2><d0c3f>: Abbrev Number: 1 (DW_TAG_member)
    <d0c40>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0c44>   DW_AT_decl_file   : 10
    <d0c45>   DW_AT_decl_line   : 738
    <d0c47>   DW_AT_decl_column : 6
    <d0c48>   DW_AT_type        : <0xcfc27>
    <d0c4c>   DW_AT_data_member_location: 0
 <2><d0c4d>: Abbrev Number: 1 (DW_TAG_member)
    <d0c4e>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0c52>   DW_AT_decl_file   : 10
    <d0c53>   DW_AT_decl_line   : 739
    <d0c55>   DW_AT_decl_column : 16
    <d0c56>   DW_AT_type        : <0xcfc5b>
    <d0c5a>   DW_AT_data_member_location: 8
 <2><d0c5b>: Abbrev Number: 1 (DW_TAG_member)
    <d0c5c>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0c60>   DW_AT_decl_file   : 10
    <d0c61>   DW_AT_decl_line   : 740
    <d0c63>   DW_AT_decl_column : 7
    <d0c64>   DW_AT_type        : <0xcfc27>
    <d0c68>   DW_AT_data_member_location: 16
 <2><d0c69>: Abbrev Number: 1 (DW_TAG_member)
    <d0c6a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0c6e>   DW_AT_decl_file   : 10
    <d0c6f>   DW_AT_decl_line   : 741
    <d0c71>   DW_AT_decl_column : 11
    <d0c72>   DW_AT_type        : <0xd04a5>
    <d0c76>   DW_AT_data_member_location: 24
 <2><d0c77>: Abbrev Number: 1 (DW_TAG_member)
    <d0c78>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d0c7c>   DW_AT_decl_file   : 10
    <d0c7d>   DW_AT_decl_line   : 742
    <d0c7f>   DW_AT_decl_column : 9
    <d0c80>   DW_AT_type        : <0xcfde4>
    <d0c84>   DW_AT_data_member_location: 32
 <2><d0c85>: Abbrev Number: 1 (DW_TAG_member)
    <d0c86>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0c8a>   DW_AT_decl_file   : 10
    <d0c8b>   DW_AT_decl_line   : 743
    <d0c8d>   DW_AT_decl_column : 9
    <d0c8e>   DW_AT_type        : <0xcfde4>
    <d0c92>   DW_AT_data_member_location: 40
 <2><d0c93>: Abbrev Number: 1 (DW_TAG_member)
    <d0c94>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <d0c98>   DW_AT_decl_file   : 10
    <d0c99>   DW_AT_decl_line   : 744
    <d0c9b>   DW_AT_decl_column : 7
    <d0c9c>   DW_AT_type        : <0xcfc27>
    <d0ca0>   DW_AT_data_member_location: 48
 <2><d0ca1>: Abbrev Number: 0
 <1><d0ca2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d0ca3>   DW_AT_name        : (indirect string, offset: 0x7dc25): XMapEvent
    <d0ca7>   DW_AT_decl_file   : 10
    <d0ca8>   DW_AT_decl_line   : 745
    <d0caa>   DW_AT_decl_column : 3
    <d0cab>   DW_AT_type        : <0xd0c37>
 <1><d0caf>: Abbrev Number: 9 (DW_TAG_structure_type)
    <d0cb0>   DW_AT_byte_size   : 48
    <d0cb1>   DW_AT_decl_file   : 10
    <d0cb1>   DW_AT_decl_line   : 747
    <d0cb3>   DW_AT_decl_column : 9
    <d0cb3>   DW_AT_sibling     : <0xd0d0c>
 <2><d0cb7>: Abbrev Number: 1 (DW_TAG_member)
    <d0cb8>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d0cbc>   DW_AT_decl_file   : 10
    <d0cbd>   DW_AT_decl_line   : 748
    <d0cbf>   DW_AT_decl_column : 6
    <d0cc0>   DW_AT_type        : <0xcfc27>
    <d0cc4>   DW_AT_data_member_location: 0
 <2><d0cc5>: Abbrev Number: 1 (DW_TAG_member)
    <d0cc6>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d0cca>   DW_AT_decl_file   : 10
    <d0ccb>   DW_AT_decl_line   : 749
    <d0ccd>   DW_AT_decl_column : 16
    <d0cce>   DW_AT_type        : <0xcfc5b>
    <d0cd2>   DW_AT_data_member_location: 8
 <2><d0cd3>: Abbrev Number: 1 (DW_TAG_member)
    <d0cd4>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d0cd8>   DW_AT_decl_file   : 10
    <d0cd9>   DW_AT_decl_line   : 750
    <d0cdb>   DW_AT_decl_column : 7
    <d0cdc>   DW_AT_type        : <0xcfc27>
    <d0ce0>   DW_AT_data_member_location: 16
 <2><d0ce1>: Abbrev Number: 1 (DW_TAG_member)
    <d0ce2>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d0ce6>   DW_AT_decl_file   : 10
    <d0ce7>   DW_AT_decl_line   : 751
    <d0ce9>   DW_AT_decl_column : 11
    <d0cea>   DW_AT_type        : <0xd04a5>
    <d0cee>   DW_AT_data_member_location: 24
 <2><d0cef>: Abbrev Number: 1 (DW_TAG_member)
    <d0cf0>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <d0cf4>   DW_AT_decl_file   : 10
    <d0cf5>   DW_AT_decl_line   : 752
    <d0cf7>   DW_AT_decl_column : 9
    <d0cf8>   DW_AT_type        : <0xcfde4>
    <d0cfc>   DW_AT_data_member_location: 32
 <2><d0cfd>: Abbrev Number: 1 (DW_TAG_member)
    <d0cfe>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d0d02>   DW_AT_decl_file   : 10
