 <2><e04a4>: Abbrev Number: 0
 <1><e04a5>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e04a6>   DW_AT_external    : 1
    <e04a6>   DW_AT_name        : (indirect string, offset: 0x6e0fe): strlen
    <e04aa>   DW_AT_decl_file   : 11
    <e04ab>   DW_AT_decl_line   : 391
    <e04ad>   DW_AT_decl_column : 15
    <e04ae>   DW_AT_prototyped  : 1
    <e04ae>   DW_AT_type        : <0xddc2f>
    <e04b2>   DW_AT_declaration : 1
    <e04b2>   DW_AT_sibling     : <0xe04bc>
 <2><e04b6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e04b7>   DW_AT_type        : <0xdfa51>
 <2><e04bb>: Abbrev Number: 0
 <1><e04bc>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e04bd>   DW_AT_external    : 1
    <e04bd>   DW_AT_name        : (indirect string, offset: 0x900e3): XIconifyWindow
    <e04c1>   DW_AT_decl_file   : 6
    <e04c2>   DW_AT_decl_line   : 1904
    <e04c4>   DW_AT_decl_column : 15
    <e04c5>   DW_AT_prototyped  : 1
    <e04c5>   DW_AT_type        : <0xddbdb>
    <e04c9>   DW_AT_declaration : 1
    <e04c9>   DW_AT_sibling     : <0xe04dd>
 <2><e04cd>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e04ce>   DW_AT_type        : <0xde2c0>
 <2><e04d2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e04d3>   DW_AT_type        : <0xddcca>
 <2><e04d7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e04d8>   DW_AT_type        : <0xddbdb>
 <2><e04dc>: Abbrev Number: 0
 <1><e04dd>: Abbrev Number: 13 (DW_TAG_subprogram)
    <e04de>   DW_AT_external    : 1

    <e23c6>   DW_AT_byte_size   : 1
    <e23c7>   DW_AT_encoding    : 6	(signed char)
    <e23c8>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><e23cc>: Abbrev Number: 10 (DW_TAG_base_type)
    <e23cd>   DW_AT_byte_size   : 2
    <e23ce>   DW_AT_encoding    : 5	(signed)
    <e23cf>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><e23d3>: Abbrev Number: 11 (DW_TAG_typedef)
    <e23d4>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <e23d8>   DW_AT_decl_file   : 2
    <e23d9>   DW_AT_decl_line   : 122
    <e23da>   DW_AT_decl_column : 14
    <e23db>   DW_AT_type        : <0xe23df>
 <1><e23df>: Abbrev Number: 30 (DW_TAG_base_type)
    <e23e0>   DW_AT_byte_size   : 4
    <e23e1>   DW_AT_encoding    : 5	(signed)
    <e23e2>   DW_AT_name        : int
 <1><e23e6>: Abbrev Number: 11 (DW_TAG_typedef)
    <e23e7>   DW_AT_name        : (indirect string, offset: 0x87985): GLubyte
    <e23eb>   DW_AT_decl_file   : 2
    <e23ec>   DW_AT_decl_line   : 123
    <e23ed>   DW_AT_decl_column : 23
    <e23ee>   DW_AT_type        : <0xe23b9>
 <1><e23f2>: Abbrev Number: 18 (DW_TAG_const_type)
    <e23f3>   DW_AT_type        : <0xe23e6>
 <1><e23f7>: Abbrev Number: 10 (DW_TAG_base_type)
    <e23f8>   DW_AT_byte_size   : 2
    <e23f9>   DW_AT_encoding    : 7	(unsigned)
    <e23fa>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><e23fe>: Abbrev Number: 11 (DW_TAG_typedef)
    <e23ff>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <e2403>   DW_AT_decl_file   : 2
    <e2404>   DW_AT_decl_line   : 125
    <e2405>   DW_AT_decl_column : 22
    <e2406>   DW_AT_type        : <0xe23a6>
 <1><e240a>: Abbrev Number: 11 (DW_TAG_typedef)
    <e240b>   DW_AT_name        : (indirect string, offset: 0x75b45): GLfloat
    <e240f>   DW_AT_decl_file   : 2
    <e2410>   DW_AT_decl_line   : 127
    <e2411>   DW_AT_decl_column : 16
    <e2412>   DW_AT_type        : <0xe2416>
 <1><e2416>: Abbrev Number: 10 (DW_TAG_base_type)
    <e2417>   DW_AT_byte_size   : 4
    <e2418>   DW_AT_encoding    : 4	(float)
    <e2419>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><e241d>: Abbrev Number: 11 (DW_TAG_typedef)
    <e241e>   DW_AT_name        : (indirect string, offset: 0x7d6ed): GLdouble
    <e2422>   DW_AT_decl_file   : 2
    <e2423>   DW_AT_decl_line   : 129
    <e2424>   DW_AT_decl_column : 17
    <e2425>   DW_AT_type        : <0xe2429>
 <1><e2429>: Abbrev Number: 10 (DW_TAG_base_type)
    <e242a>   DW_AT_byte_size   : 8
    <e242b>   DW_AT_encoding    : 4	(float)
    <e242c>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><e2430>: Abbrev Number: 10 (DW_TAG_base_type)
    <e2431>   DW_AT_byte_size   : 8
    <e2432>   DW_AT_encoding    : 7	(unsigned)
    <e2433>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><e2437>: Abbrev Number: 10 (DW_TAG_base_type)
    <e2438>   DW_AT_byte_size   : 8
    <e2439>   DW_AT_encoding    : 5	(signed)
    <e243a>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><e243e>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <e243f>   DW_AT_byte_size   : 8
 <1><e2440>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2441>   DW_AT_byte_size   : 8
    <e2441>   DW_AT_type        : <0xe2445>
 <1><e2445>: Abbrev Number: 10 (DW_TAG_base_type)
    <e2446>   DW_AT_byte_size   : 1
    <e2447>   DW_AT_encoding    : 6	(signed char)
    <e2448>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><e244c>: Abbrev Number: 18 (DW_TAG_const_type)
    <e244d>   DW_AT_type        : <0xe2445>
 <1><e2451>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2452>   DW_AT_byte_size   : 8
    <e2452>   DW_AT_type        : <0xe23f2>
 <1><e2456>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2457>   DW_AT_byte_size   : 8
    <e2457>   DW_AT_type        : <0xe241d>
 <1><e245b>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e245c>   DW_AT_byte_size   : 8
    <e245c>   DW_AT_type        : <0xe2460>
 <1><e2460>: Abbrev Number: 32 (DW_TAG_subroutine_type)
    <e2461>   DW_AT_prototyped  : 1
 <1><e2461>: Abbrev Number: 11 (DW_TAG_typedef)
    <e2462>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <e2466>   DW_AT_decl_file   : 3
    <e2467>   DW_AT_decl_line   : 209
    <e2468>   DW_AT_decl_column : 23
    <e2469>   DW_AT_type        : <0xe2430>
 <1><e246d>: Abbrev Number: 10 (DW_TAG_base_type)
    <e246e>   DW_AT_byte_size   : 8
    <e246f>   DW_AT_encoding    : 5	(signed)
    <e2470>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><e2474>: Abbrev Number: 10 (DW_TAG_base_type)
    <e2475>   DW_AT_byte_size   : 8
    <e2476>   DW_AT_encoding    : 7	(unsigned)
    <e2477>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><e247b>: Abbrev Number: 11 (DW_TAG_typedef)
    <e247c>   DW_AT_name        : (indirect string, offset: 0x906b5): GLUTproc
    <e2480>   DW_AT_decl_file   : 4
    <e2481>   DW_AT_decl_line   : 173
    <e2482>   DW_AT_decl_column : 16
    <e2483>   DW_AT_type        : <0xe2487>
 <1><e2487>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2488>   DW_AT_byte_size   : 8
    <e2488>   DW_AT_type        : <0xe248c>
 <1><e248c>: Abbrev Number: 33 (DW_TAG_subroutine_type)
    <e248d>   DW_AT_sibling     : <0xe2493>
 <2><e2491>: Abbrev Number: 23 (DW_TAG_unspecified_parameters)
 <2><e2492>: Abbrev Number: 0
 <1><e2493>: Abbrev Number: 34 (DW_TAG_structure_type)
    <e2494>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <e2498>   DW_AT_byte_size   : 24
    <e2499>   DW_AT_decl_file   : 5
    <e249a>   DW_AT_decl_line   : 0
    <e249b>   DW_AT_sibling     : <0xe24c8>
 <2><e249f>: Abbrev Number: 16 (DW_TAG_member)
    <e24a0>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <e24a4>   DW_AT_decl_file   : 5
    <e24a4>   DW_AT_decl_line   : 0
    <e24a4>   DW_AT_type        : <0xe23a6>
    <e24a8>   DW_AT_data_member_location: 0
 <2><e24a9>: Abbrev Number: 16 (DW_TAG_member)
    <e24aa>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <e24ae>   DW_AT_decl_file   : 5
    <e24ae>   DW_AT_decl_line   : 0
    <e24ae>   DW_AT_type        : <0xe23a6>
    <e24b2>   DW_AT_data_member_location: 4
 <2><e24b3>: Abbrev Number: 16 (DW_TAG_member)
    <e24b4>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <e24b8>   DW_AT_decl_file   : 5
    <e24b8>   DW_AT_decl_line   : 0
    <e24b8>   DW_AT_type        : <0xe243e>
    <e24bc>   DW_AT_data_member_location: 8
 <2><e24bd>: Abbrev Number: 16 (DW_TAG_member)
    <e24be>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <e24c2>   DW_AT_decl_file   : 5
    <e24c2>   DW_AT_decl_line   : 0
    <e24c2>   DW_AT_type        : <0xe243e>
    <e24c6>   DW_AT_data_member_location: 16
 <2><e24c7>: Abbrev Number: 0
 <1><e24c8>: Abbrev Number: 10 (DW_TAG_base_type)
    <e24c9>   DW_AT_byte_size   : 16
    <e24ca>   DW_AT_encoding    : 4	(float)
    <e24cb>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><e24cf>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e24d0>   DW_AT_byte_size   : 8
    <e24d0>   DW_AT_type        : <0xe2440>
 <1><e24d4>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e24d5>   DW_AT_byte_size   : 8
    <e24d5>   DW_AT_type        : <0xe23df>
 <1><e24d9>: Abbrev Number: 13 (DW_TAG_typedef)
    <e24da>   DW_AT_name        : (indirect string, offset: 0x90965): __GLXextFuncPtr
    <e24de>   DW_AT_decl_file   : 6
    <e24df>   DW_AT_decl_line   : 317
    <e24e1>   DW_AT_decl_column : 16
    <e24e2>   DW_AT_type        : <0xe245b>
 <1><e24e6>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e24e7>   DW_AT_byte_size   : 8
    <e24e7>   DW_AT_type        : <0xe244c>
 <1><e24eb>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e24ec>   DW_AT_byte_size   : 8
    <e24ec>   DW_AT_type        : <0xe2416>
 <1><e24f0>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e24f1>   DW_AT_byte_size   : 8
    <e24f1>   DW_AT_type        : <0xe24f5>
 <1><e24f5>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e24f6>   DW_AT_prototyped  : 1
    <e24f6>   DW_AT_sibling     : <0xe2505>
 <2><e24fa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e24fb>   DW_AT_type        : <0xe23df>
 <2><e24ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2500>   DW_AT_type        : <0xe23df>
 <2><e2504>: Abbrev Number: 0
 <1><e2505>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2506>   DW_AT_byte_size   : 8
    <e2506>   DW_AT_type        : <0xe250a>
 <1><e250a>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e250b>   DW_AT_prototyped  : 1
    <e250b>   DW_AT_sibling     : <0xe2515>
 <2><e250f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2510>   DW_AT_type        : <0xe23df>
 <2><e2514>: Abbrev Number: 0
 <1><e2515>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2516>   DW_AT_byte_size   : 8
    <e2516>   DW_AT_type        : <0xe251a>
 <1><e251a>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e251b>   DW_AT_prototyped  : 1
    <e251b>   DW_AT_sibling     : <0xe252f>
 <2><e251f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2520>   DW_AT_type        : <0xe23b9>
 <2><e2524>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2525>   DW_AT_type        : <0xe23df>
 <2><e2529>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e252a>   DW_AT_type        : <0xe23df>
 <2><e252e>: Abbrev Number: 0
 <1><e252f>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2530>   DW_AT_byte_size   : 8
    <e2530>   DW_AT_type        : <0xe2534>
 <1><e2534>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e2535>   DW_AT_prototyped  : 1
    <e2535>   DW_AT_sibling     : <0xe2549>
 <2><e2539>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e253a>   DW_AT_type        : <0xe23df>
 <2><e253e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e253f>   DW_AT_type        : <0xe23df>
 <2><e2543>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2544>   DW_AT_type        : <0xe23df>
 <2><e2548>: Abbrev Number: 0
 <1><e2549>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e254a>   DW_AT_byte_size   : 8
    <e254a>   DW_AT_type        : <0xe254e>
 <1><e254e>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e254f>   DW_AT_prototyped  : 1
    <e254f>   DW_AT_sibling     : <0xe2568>
 <2><e2553>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2554>   DW_AT_type        : <0xe23df>
 <2><e2558>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2559>   DW_AT_type        : <0xe23df>
 <2><e255d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e255e>   DW_AT_type        : <0xe23df>
 <2><e2562>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2563>   DW_AT_type        : <0xe23df>
 <2><e2567>: Abbrev Number: 0
 <1><e2568>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2569>   DW_AT_byte_size   : 8
    <e2569>   DW_AT_type        : <0xe256d>
 <1><e256d>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e256e>   DW_AT_prototyped  : 1
    <e256e>   DW_AT_sibling     : <0xe2587>
 <2><e2572>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2573>   DW_AT_type        : <0xe23a6>
 <2><e2577>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2578>   DW_AT_type        : <0xe23df>
 <2><e257c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e257d>   DW_AT_type        : <0xe23df>
 <2><e2581>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2582>   DW_AT_type        : <0xe23df>
 <2><e2586>: Abbrev Number: 0
 <1><e2587>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e2588>   DW_AT_byte_size   : 8
    <e2588>   DW_AT_type        : <0xe258c>
 <1><e258c>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e258d>   DW_AT_prototyped  : 1
    <e258d>   DW_AT_sibling     : <0xe25ab>
 <2><e2591>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2592>   DW_AT_type        : <0xe23df>
 <2><e2596>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2597>   DW_AT_type        : <0xe23df>
 <2><e259b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e259c>   DW_AT_type        : <0xe23df>
 <2><e25a0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e25a1>   DW_AT_type        : <0xe23df>
 <2><e25a5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e25a6>   DW_AT_type        : <0xe23df>
 <2><e25aa>: Abbrev Number: 0
 <1><e25ab>: Abbrev Number: 11 (DW_TAG_typedef)
    <e25ac>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <e25b0>   DW_AT_decl_file   : 7
    <e25b1>   DW_AT_decl_line   : 247
    <e25b2>   DW_AT_decl_column : 17
    <e25b3>   DW_AT_type        : <0xe245b>
 <1><e25b7>: Abbrev Number: 11 (DW_TAG_typedef)
    <e25b8>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <e25bc>   DW_AT_decl_file   : 7
    <e25bd>   DW_AT_decl_line   : 249
    <e25be>   DW_AT_decl_column : 17
    <e25bf>   DW_AT_type        : <0xe2505>
 <1><e25c3>: Abbrev Number: 11 (DW_TAG_typedef)
    <e25c4>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <e25c8>   DW_AT_decl_file   : 7
    <e25c9>   DW_AT_decl_line   : 250
    <e25ca>   DW_AT_decl_column : 17
    <e25cb>   DW_AT_type        : <0xe252f>
 <1><e25cf>: Abbrev Number: 13 (DW_TAG_typedef)
    <e25d0>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <e25d4>   DW_AT_decl_file   : 7
    <e25d5>   DW_AT_decl_line   : 256
    <e25d7>   DW_AT_decl_column : 17
    <e25d8>   DW_AT_type        : <0xe25dc>
 <1><e25dc>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e25dd>   DW_AT_byte_size   : 8
    <e25dd>   DW_AT_type        : <0xe25e1>
 <1><e25e1>: Abbrev Number: 14 (DW_TAG_subroutine_type)
    <e25e2>   DW_AT_prototyped  : 1
    <e25e2>   DW_AT_sibling     : <0xe25f1>
 <2><e25e6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e25e7>   DW_AT_type        : <0xe24e6>
 <2><e25eb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e25ec>   DW_AT_type        : <0xe25f1>
 <2><e25f0>: Abbrev Number: 0
 <1><e25f1>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e25f2>   DW_AT_byte_size   : 8
    <e25f2>   DW_AT_type        : <0xe2493>
 <1><e25f6>: Abbrev Number: 13 (DW_TAG_typedef)
    <e25f7>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <e25fb>   DW_AT_decl_file   : 7
    <e25fc>   DW_AT_decl_line   : 257
    <e25fe>   DW_AT_decl_column : 17
    <e25ff>   DW_AT_type        : <0xe25dc>
 <1><e2603>: Abbrev Number: 13 (DW_TAG_typedef)
    <e2604>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <e2608>   DW_AT_decl_file   : 7
    <e2609>   DW_AT_decl_line   : 261
    <e260b>   DW_AT_decl_column : 28
    <e260c>   DW_AT_type        : <0xe2610>
 <1><e2610>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e2611>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <e2615>   DW_AT_byte_size   : 16
    <e2616>   DW_AT_decl_file   : 7
    <e2616>   DW_AT_decl_line   : 262
    <e2618>   DW_AT_decl_column : 8
    <e2618>   DW_AT_sibling     : <0xe2637>
 <2><e261c>: Abbrev Number: 5 (DW_TAG_member)
    <e261d>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <e2621>   DW_AT_decl_file   : 7
    <e2621>   DW_AT_decl_line   : 264
    <e2623>   DW_AT_decl_column : 11
    <e2624>   DW_AT_type        : <0xe243e>
    <e2628>   DW_AT_data_member_location: 0
 <2><e2629>: Abbrev Number: 5 (DW_TAG_member)
    <e262a>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <e262e>   DW_AT_decl_file   : 7
    <e262e>   DW_AT_decl_line   : 265
    <e2630>   DW_AT_decl_column : 11
    <e2631>   DW_AT_type        : <0xe243e>
    <e2635>   DW_AT_data_member_location: 8
 <2><e2636>: Abbrev Number: 0
 <1><e2637>: Abbrev Number: 13 (DW_TAG_typedef)
    <e2638>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <e263c>   DW_AT_decl_file   : 7
    <e263d>   DW_AT_decl_line   : 277
    <e263f>   DW_AT_decl_column : 29
    <e2640>   DW_AT_type        : <0xe2644>
 <1><e2644>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e2645>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <e2649>   DW_AT_byte_size   : 12
    <e264a>   DW_AT_decl_file   : 7
    <e264a>   DW_AT_decl_line   : 278
    <e264c>   DW_AT_decl_column : 8
    <e264c>   DW_AT_sibling     : <0xe2674>
 <2><e2650>: Abbrev Number: 20 (DW_TAG_member)
    <e2651>   DW_AT_name        : X
    <e2653>   DW_AT_decl_file   : 7
    <e2653>   DW_AT_decl_line   : 280
    <e2655>   DW_AT_decl_column : 21
    <e2656>   DW_AT_type        : <0xe23d3>
    <e265a>   DW_AT_data_member_location: 0
 <2><e265b>: Abbrev Number: 20 (DW_TAG_member)
    <e265c>   DW_AT_name        : Y
    <e265e>   DW_AT_decl_file   : 7
    <e265e>   DW_AT_decl_line   : 280
    <e2660>   DW_AT_decl_column : 24
    <e2661>   DW_AT_type        : <0xe23d3>
    <e2665>   DW_AT_data_member_location: 4
 <2><e2666>: Abbrev Number: 20 (DW_TAG_member)
    <e2667>   DW_AT_name        : Use
    <e266b>   DW_AT_decl_file   : 7
    <e266b>   DW_AT_decl_line   : 281
    <e266d>   DW_AT_decl_column : 21
    <e266e>   DW_AT_type        : <0xe23ad>
    <e2672>   DW_AT_data_member_location: 8
 <2><e2673>: Abbrev Number: 0
 <1><e2674>: Abbrev Number: 35 (DW_TAG_enumeration_type)
    <e2675>   DW_AT_encoding    : 7	(unsigned)
    <e2676>   DW_AT_byte_size   : 4
    <e2677>   DW_AT_type        : <0xe23a6>
    <e267b>   DW_AT_decl_file   : 7
    <e267c>   DW_AT_decl_line   : 289
    <e267e>   DW_AT_decl_column : 1
    <e267f>   DW_AT_sibling     : <0xe2696>
 <2><e2683>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e2684>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <e2688>   DW_AT_const_value : 0
 <2><e2689>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e268a>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <e268e>   DW_AT_const_value : 1
 <2><e268f>: Abbrev Number: 21 (DW_TAG_enumerator)
    <e2690>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <e2694>   DW_AT_const_value : 2
 <2><e2695>: Abbrev Number: 0
 <1><e2696>: Abbrev Number: 13 (DW_TAG_typedef)
    <e2697>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <e269b>   DW_AT_decl_file   : 7
    <e269c>   DW_AT_decl_line   : 293
    <e269e>   DW_AT_decl_column : 3
    <e269f>   DW_AT_type        : <0xe2674>
 <1><e26a3>: Abbrev Number: 13 (DW_TAG_typedef)
    <e26a4>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <e26a8>   DW_AT_decl_file   : 7
    <e26a9>   DW_AT_decl_line   : 296
    <e26ab>   DW_AT_decl_column : 29
    <e26ac>   DW_AT_type        : <0xe26b0>
 <1><e26b0>: Abbrev Number: 19 (DW_TAG_structure_type)
    <e26b1>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <e26b5>   DW_AT_byte_size   : 232
    <e26b6>   DW_AT_decl_file   : 7
    <e26b6>   DW_AT_decl_line   : 297
    <e26b8>   DW_AT_decl_column : 8
    <e26b8>   DW_AT_sibling     : <0xe28b8>
 <2><e26bc>: Abbrev Number: 5 (DW_TAG_member)
    <e26bd>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <e26c1>   DW_AT_decl_file   : 7
    <e26c1>   DW_AT_decl_line   : 299
    <e26c3>   DW_AT_decl_column : 22
    <e26c4>   DW_AT_type        : <0xe2637>
    <e26c8>   DW_AT_data_member_location: 0
 <2><e26c9>: Abbrev Number: 5 (DW_TAG_member)
    <e26ca>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <e26ce>   DW_AT_decl_file   : 7
    <e26ce>   DW_AT_decl_line   : 300
    <e26d0>   DW_AT_decl_column : 22
    <e26d1>   DW_AT_type        : <0xe2637>
    <e26d5>   DW_AT_data_member_location: 12
 <2><e26d6>: Abbrev Number: 5 (DW_TAG_member)
    <e26d7>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <e26db>   DW_AT_decl_file   : 7
    <e26db>   DW_AT_decl_line   : 301
    <e26dd>   DW_AT_decl_column : 22
    <e26de>   DW_AT_type        : <0xe23a6>
    <e26e2>   DW_AT_data_member_location: 24
 <2><e26e3>: Abbrev Number: 5 (DW_TAG_member)
    <e26e4>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <e26e8>   DW_AT_decl_file   : 7
    <e26e8>   DW_AT_decl_line   : 303
    <e26ea>   DW_AT_decl_column : 22
    <e26eb>   DW_AT_type        : <0xe23ad>
    <e26ef>   DW_AT_data_member_location: 28
 <2><e26f0>: Abbrev Number: 5 (DW_TAG_member)
    <e26f1>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <e26f5>   DW_AT_decl_file   : 7
    <e26f5>   DW_AT_decl_line   : 305
    <e26f7>   DW_AT_decl_column : 22
    <e26f8>   DW_AT_type        : <0xe23df>
    <e26fc>   DW_AT_data_member_location: 32
 <2><e26fd>: Abbrev Number: 5 (DW_TAG_member)
    <e26fe>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <e2702>   DW_AT_decl_file   : 7
    <e2702>   DW_AT_decl_line   : 307
    <e2704>   DW_AT_decl_column : 22
    <e2705>   DW_AT_type        : <0xe23ad>
    <e2709>   DW_AT_data_member_location: 36
 <2><e270a>: Abbrev Number: 5 (DW_TAG_member)
    <e270b>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <e270f>   DW_AT_decl_file   : 7
    <e270f>   DW_AT_decl_line   : 308
    <e2711>   DW_AT_decl_column : 22
    <e2712>   DW_AT_type        : <0xe23ad>
    <e2716>   DW_AT_data_member_location: 37
 <2><e2717>: Abbrev Number: 5 (DW_TAG_member)
    <e2718>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <e271c>   DW_AT_decl_file   : 7
    <e271c>   DW_AT_decl_line   : 310
    <e271e>   DW_AT_decl_column : 22
    <e271f>   DW_AT_type        : <0xe23ad>
    <e2723>   DW_AT_data_member_location: 38
 <2><e2724>: Abbrev Number: 5 (DW_TAG_member)
    <e2725>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <e2729>   DW_AT_decl_file   : 7
    <e2729>   DW_AT_decl_line   : 311
    <e272b>   DW_AT_decl_column : 22
    <e272c>   DW_AT_type        : <0xe23ad>
    <e2730>   DW_AT_data_member_location: 39
 <2><e2731>: Abbrev Number: 5 (DW_TAG_member)
    <e2732>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <e2736>   DW_AT_decl_file   : 7
    <e2736>   DW_AT_decl_line   : 313
    <e2738>   DW_AT_decl_column : 22
    <e2739>   DW_AT_type        : <0xe23df>
    <e273d>   DW_AT_data_member_location: 40
 <2><e273e>: Abbrev Number: 5 (DW_TAG_member)
    <e273f>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <e2743>   DW_AT_decl_file   : 7
    <e2743>   DW_AT_decl_line   : 314
    <e2745>   DW_AT_decl_column : 22
    <e2746>   DW_AT_type        : <0xe23df>
    <e274a>   DW_AT_data_member_location: 44
 <2><e274b>: Abbrev Number: 5 (DW_TAG_member)
    <e274c>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <e2750>   DW_AT_decl_file   : 7
    <e2750>   DW_AT_decl_line   : 316
    <e2752>   DW_AT_decl_column : 22
    <e2753>   DW_AT_type        : <0xe23fe>
    <e2757>   DW_AT_data_member_location: 48
 <2><e2758>: Abbrev Number: 5 (DW_TAG_member)
    <e2759>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <e275d>   DW_AT_decl_file   : 7
    <e275d>   DW_AT_decl_line   : 317
    <e275f>   DW_AT_decl_column : 22
    <e2760>   DW_AT_type        : <0xe23fe>
    <e2764>   DW_AT_data_member_location: 52
 <2><e2765>: Abbrev Number: 5 (DW_TAG_member)
    <e2766>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <e276a>   DW_AT_decl_file   : 7
    <e276a>   DW_AT_decl_line   : 318
    <e276c>   DW_AT_decl_column : 22
    <e276d>   DW_AT_type        : <0xe23fe>
    <e2771>   DW_AT_data_member_location: 56
 <2><e2772>: Abbrev Number: 5 (DW_TAG_member)
    <e2773>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <e2777>   DW_AT_decl_file   : 7
    <e2777>   DW_AT_decl_line   : 320
    <e2779>   DW_AT_decl_column : 22
    <e277a>   DW_AT_type        : <0xe2430>
    <e277e>   DW_AT_data_member_location: 64
 <2><e277f>: Abbrev Number: 5 (DW_TAG_member)
    <e2780>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <e2784>   DW_AT_decl_file   : 7
    <e2784>   DW_AT_decl_line   : 321
    <e2786>   DW_AT_decl_column : 22
    <e2787>   DW_AT_type        : <0xe2603>
    <e278b>   DW_AT_data_member_location: 72
 <2><e278c>: Abbrev Number: 5 (DW_TAG_member)
    <e278d>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <e2791>   DW_AT_decl_file   : 7
    <e2791>   DW_AT_decl_line   : 322
    <e2793>   DW_AT_decl_column : 22
    <e2794>   DW_AT_type        : <0xe2603>
    <e2798>   DW_AT_data_member_location: 88
 <2><e2799>: Abbrev Number: 5 (DW_TAG_member)
    <e279a>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <e279e>   DW_AT_decl_file   : 7
    <e279e>   DW_AT_decl_line   : 324
    <e27a0>   DW_AT_decl_column : 22
    <e27a1>   DW_AT_type        : <0xe25ab>
    <e27a5>   DW_AT_data_member_location: 104
 <2><e27a6>: Abbrev Number: 5 (DW_TAG_member)
    <e27a7>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <e27ab>   DW_AT_decl_file   : 7
    <e27ab>   DW_AT_decl_line   : 326
    <e27ad>   DW_AT_decl_column : 22
    <e27ae>   DW_AT_type        : <0xe23df>
    <e27b2>   DW_AT_data_member_location: 112
 <2><e27b3>: Abbrev Number: 5 (DW_TAG_member)
    <e27b4>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <e27b8>   DW_AT_decl_file   : 7
    <e27b8>   DW_AT_decl_line   : 327
    <e27ba>   DW_AT_decl_column : 22
    <e27bb>   DW_AT_type        : <0xe25b7>
    <e27bf>   DW_AT_data_member_location: 120
 <2><e27c0>: Abbrev Number: 5 (DW_TAG_member)
    <e27c1>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <e27c5>   DW_AT_decl_file   : 7
    <e27c5>   DW_AT_decl_line   : 328
    <e27c7>   DW_AT_decl_column : 22
    <e27c8>   DW_AT_type        : <0xe25c3>
    <e27cc>   DW_AT_data_member_location: 128
 <2><e27cd>: Abbrev Number: 5 (DW_TAG_member)
    <e27ce>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <e27d2>   DW_AT_decl_file   : 7
    <e27d2>   DW_AT_decl_line   : 330
    <e27d4>   DW_AT_decl_column : 22
    <e27d5>   DW_AT_type        : <0xe2637>
    <e27d9>   DW_AT_data_member_location: 136
 <2><e27da>: Abbrev Number: 5 (DW_TAG_member)
    <e27db>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <e27df>   DW_AT_decl_file   : 7
    <e27df>   DW_AT_decl_line   : 331
    <e27e1>   DW_AT_decl_column : 22
    <e27e2>   DW_AT_type        : <0xe23df>
    <e27e6>   DW_AT_data_member_location: 148
 <2><e27e7>: Abbrev Number: 5 (DW_TAG_member)
    <e27e8>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <e27ec>   DW_AT_decl_file   : 7
    <e27ec>   DW_AT_decl_line   : 332
    <e27ee>   DW_AT_decl_column : 22
    <e27ef>   DW_AT_type        : <0xe23df>
    <e27f3>   DW_AT_data_member_location: 152
 <2><e27f4>: Abbrev Number: 5 (DW_TAG_member)
    <e27f5>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <e27f9>   DW_AT_decl_file   : 7
    <e27f9>   DW_AT_decl_line   : 334
    <e27fb>   DW_AT_decl_column : 22
    <e27fc>   DW_AT_type        : <0xe23df>
    <e2800>   DW_AT_data_member_location: 156
 <2><e2801>: Abbrev Number: 5 (DW_TAG_member)
    <e2802>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <e2806>   DW_AT_decl_file   : 7
    <e2806>   DW_AT_decl_line   : 336
    <e2808>   DW_AT_decl_column : 22
    <e2809>   DW_AT_type        : <0xe2696>
    <e280d>   DW_AT_data_member_location: 160
 <2><e280e>: Abbrev Number: 5 (DW_TAG_member)
    <e280f>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <e2813>   DW_AT_decl_file   : 7
    <e2813>   DW_AT_decl_line   : 337
    <e2815>   DW_AT_decl_column : 22
    <e2816>   DW_AT_type        : <0xe2440>
    <e281a>   DW_AT_data_member_location: 168
 <2><e281b>: Abbrev Number: 5 (DW_TAG_member)
    <e281c>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <e2820>   DW_AT_decl_file   : 7
    <e2820>   DW_AT_decl_line   : 338
    <e2822>   DW_AT_decl_column : 22
    <e2823>   DW_AT_type        : <0xe23ad>
    <e2827>   DW_AT_data_member_location: 176
 <2><e2828>: Abbrev Number: 5 (DW_TAG_member)
    <e2829>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <e282d>   DW_AT_decl_file   : 7
    <e282d>   DW_AT_decl_line   : 339
    <e282f>   DW_AT_decl_column : 22
    <e2830>   DW_AT_type        : <0xe23df>
    <e2834>   DW_AT_data_member_location: 180
 <2><e2835>: Abbrev Number: 5 (DW_TAG_member)
    <e2836>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <e283a>   DW_AT_decl_file   : 7
    <e283a>   DW_AT_decl_line   : 340
    <e283c>   DW_AT_decl_column : 22
    <e283d>   DW_AT_type        : <0xe23ad>
    <e2841>   DW_AT_data_member_location: 184
 <2><e2842>: Abbrev Number: 5 (DW_TAG_member)
    <e2843>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <e2847>   DW_AT_decl_file   : 7
    <e2847>   DW_AT_decl_line   : 342
    <e2849>   DW_AT_decl_column : 19
    <e284a>   DW_AT_type        : <0xe23df>
    <e284e>   DW_AT_data_member_location: 188
 <2><e284f>: Abbrev Number: 5 (DW_TAG_member)
    <e2850>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <e2854>   DW_AT_decl_file   : 7
    <e2854>   DW_AT_decl_line   : 344
    <e2856>   DW_AT_decl_column : 22
    <e2857>   DW_AT_type        : <0xe23df>
    <e285b>   DW_AT_data_member_location: 192
 <2><e285c>: Abbrev Number: 5 (DW_TAG_member)
    <e285d>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <e2861>   DW_AT_decl_file   : 7
    <e2861>   DW_AT_decl_line   : 345
    <e2863>   DW_AT_decl_column : 22
    <e2864>   DW_AT_type        : <0xe23df>
    <e2868>   DW_AT_data_member_location: 196
 <2><e2869>: Abbrev Number: 5 (DW_TAG_member)
    <e286a>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <e286e>   DW_AT_decl_file   : 7
    <e286e>   DW_AT_decl_line   : 347
    <e2870>   DW_AT_decl_column : 22
    <e2871>   DW_AT_type        : <0xe23df>
    <e2875>   DW_AT_data_member_location: 200
 <2><e2876>: Abbrev Number: 5 (DW_TAG_member)
    <e2877>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <e287b>   DW_AT_decl_file   : 7
    <e287b>   DW_AT_decl_line   : 348
    <e287d>   DW_AT_decl_column : 22
    <e287e>   DW_AT_type        : <0xe23df>
    <e2882>   DW_AT_data_member_location: 204
 <2><e2883>: Abbrev Number: 5 (DW_TAG_member)
    <e2884>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <e2888>   DW_AT_decl_file   : 7
    <e2888>   DW_AT_decl_line   : 349
    <e288a>   DW_AT_decl_column : 22
    <e288b>   DW_AT_type        : <0xe23df>
    <e288f>   DW_AT_data_member_location: 208
 <2><e2890>: Abbrev Number: 5 (DW_TAG_member)
    <e2891>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <e2895>   DW_AT_decl_file   : 7
    <e2895>   DW_AT_decl_line   : 350
    <e2897>   DW_AT_decl_column : 22
    <e2898>   DW_AT_type        : <0xe23df>
    <e289c>   DW_AT_data_member_location: 212
 <2><e289d>: Abbrev Number: 5 (DW_TAG_member)
    <e289e>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <e28a2>   DW_AT_decl_file   : 7
    <e28a2>   DW_AT_decl_line   : 351
    <e28a4>   DW_AT_decl_column : 22
    <e28a5>   DW_AT_type        : <0xe25cf>
    <e28a9>   DW_AT_data_member_location: 216
 <2><e28aa>: Abbrev Number: 5 (DW_TAG_member)
    <e28ab>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <e28af>   DW_AT_decl_file   : 7
    <e28af>   DW_AT_decl_line   : 352
    <e28b1>   DW_AT_decl_column : 22
    <e28b2>   DW_AT_type        : <0xe25f6>
    <e28b6>   DW_AT_data_member_location: 224
 <2><e28b7>: Abbrev Number: 0
 <1><e28b8>: Abbrev Number: 13 (DW_TAG_typedef)
    <e28b9>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <e28bd>   DW_AT_decl_file   : 7
    <e28be>   DW_AT_decl_line   : 487
    <e28c0>   DW_AT_decl_column : 16
    <e28c1>   DW_AT_type        : <0xe2487>
 <1><e28c5>: Abbrev Number: 36 (DW_TAG_variable)
    <e28c6>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <e28ca>   DW_AT_decl_file   : 7
    <e28cb>   DW_AT_decl_line   : 787
    <e28cd>   DW_AT_decl_column : 18
    <e28ce>   DW_AT_type        : <0xe26a3>
    <e28d2>   DW_AT_external    : 1
    <e28d2>   DW_AT_declaration : 1
 <1><e28d2>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e28d3>   DW_AT_external    : 1
    <e28d3>   DW_AT_name        : (indirect string, offset: 0x8ec48): glutInitWarningFunc
    <e28d7>   DW_AT_decl_file   : 4
    <e28d7>   DW_AT_decl_line   : 221
    <e28d8>   DW_AT_decl_column : 26
    <e28d9>   DW_AT_prototyped  : 1
    <e28d9>   DW_AT_declaration : 1
    <e28d9>   DW_AT_sibling     : <0xe28e3>
 <2><e28dd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e28de>   DW_AT_type        : <0xe25dc>
 <2><e28e2>: Abbrev Number: 0
 <1><e28e3>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e28e4>   DW_AT_external    : 1
    <e28e4>   DW_AT_name        : (indirect string, offset: 0x8ed6d): glutInitErrorFunc
    <e28e8>   DW_AT_decl_file   : 4
    <e28e8>   DW_AT_decl_line   : 220
    <e28e9>   DW_AT_decl_column : 26
    <e28ea>   DW_AT_prototyped  : 1
    <e28ea>   DW_AT_declaration : 1
    <e28ea>   DW_AT_sibling     : <0xe28f4>
 <2><e28ee>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e28ef>   DW_AT_type        : <0xe25dc>
 <2><e28f3>: Abbrev Number: 0
 <1><e28f4>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e28f5>   DW_AT_external    : 1
    <e28f5>   DW_AT_name        : (indirect string, offset: 0x8ebd3): glutInitContextProfile
    <e28f9>   DW_AT_decl_file   : 4
    <e28f9>   DW_AT_decl_line   : 215
    <e28fa>   DW_AT_decl_column : 26
    <e28fb>   DW_AT_prototyped  : 1
    <e28fb>   DW_AT_declaration : 1
    <e28fb>   DW_AT_sibling     : <0xe2905>
 <2><e28ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2900>   DW_AT_type        : <0xe23df>
 <2><e2904>: Abbrev Number: 0
 <1><e2905>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e2906>   DW_AT_external    : 1
    <e2906>   DW_AT_name        : (indirect string, offset: 0x8eac8): glutInitContextFlags
    <e290a>   DW_AT_decl_file   : 4
    <e290a>   DW_AT_decl_line   : 214
    <e290b>   DW_AT_decl_column : 26
    <e290c>   DW_AT_prototyped  : 1
    <e290c>   DW_AT_declaration : 1
    <e290c>   DW_AT_sibling     : <0xe2916>
 <2><e2910>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2911>   DW_AT_type        : <0xe23df>
 <2><e2915>: Abbrev Number: 0
 <1><e2916>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e2917>   DW_AT_external    : 1
    <e2917>   DW_AT_name        : (indirect string, offset: 0x8ec29): glutInitContextVersion
    <e291b>   DW_AT_decl_file   : 4
    <e291b>   DW_AT_decl_line   : 213
    <e291c>   DW_AT_decl_column : 26
    <e291d>   DW_AT_prototyped  : 1
    <e291d>   DW_AT_declaration : 1
    <e291d>   DW_AT_sibling     : <0xe292c>
 <2><e2921>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2922>   DW_AT_type        : <0xe23df>
 <2><e2926>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2927>   DW_AT_type        : <0xe23df>
 <2><e292b>: Abbrev Number: 0
 <1><e292c>: Abbrev Number: 6 (DW_TAG_subprogram)
    <e292d>   DW_AT_external    : 1
    <e292d>   DW_AT_name        : (indirect string, offset: 0x8f37d): glutJoystickGetCenter
    <e2931>   DW_AT_decl_file   : 4
    <e2931>   DW_AT_decl_line   : 208
    <e2932>   DW_AT_decl_column : 9
    <e2933>   DW_AT_prototyped  : 1
    <e2933>   DW_AT_declaration : 1
    <e2933>   DW_AT_sibling     : <0xe2942>
 <2><e2937>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e2938>   DW_AT_type        : <0xe23df>
