    <148d>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <1491>   DW_AT_decl_file   : 432
    <1491>   DW_AT_decl_line   : 0
    <1491>   DW_AT_type        : <0x1b2>
    <1495>   DW_AT_data_member_location: 16
 <2><1496>: Abbrev Number: 0
 <1><1497>: Abbrev Number: 58 (DW_TAG_structure_type)
    <1498>   DW_AT_byte_size   : 8
    <1499>   DW_AT_decl_file   : 433
    <149b>   DW_AT_decl_line   : 14
    <149c>   DW_AT_decl_column : 1
    <149d>   DW_AT_linkage_name: (indirect string, offset: 0x28a9f): 11__mbstate_t
    <14a1>   DW_AT_sibling     : <0x14e7>
 <2><14a5>: Abbrev Number: 68 (DW_TAG_union_type)
    <14a6>   DW_AT_byte_size   : 4
    <14a7>   DW_AT_decl_file   : 433
    <14a9>   DW_AT_decl_line   : 17
    <14aa>   DW_AT_decl_column : 3
    <14ab>   DW_AT_sibling     : <0x14ca>
 <3><14af>: Abbrev Number: 37 (DW_TAG_member)
    <14b0>   DW_AT_name        : (indirect string, offset: 0x4e68d): __wch
    <14b4>   DW_AT_decl_file   : 433
    <14b6>   DW_AT_decl_line   : 18
    <14b7>   DW_AT_decl_column : 19
    <14b8>   DW_AT_type        : <0x66>
 <3><14bc>: Abbrev Number: 37 (DW_TAG_member)
    <14bd>   DW_AT_name        : (indirect string, offset: 0x4d8c7): __wchb
    <14c1>   DW_AT_decl_file   : 433
    <14c3>   DW_AT_decl_line   : 19
    <14c4>   DW_AT_decl_column : 10
    <14c5>   DW_AT_type        : <0x454>
 <3><14c9>: Abbrev Number: 0
 <2><14ca>: Abbrev Number: 15 (DW_TAG_member)
    <14cb>   DW_AT_name        : (indirect string, offset: 0x17222): __count
    <14cf>   DW_AT_decl_file   : 433
    <14d1>   DW_AT_decl_line   : 15
    <14d2>   DW_AT_decl_column : 7
    <14d3>   DW_AT_type        : <0xc1>
    <14d7>   DW_AT_data_member_location: 0
 <2><14d8>: Abbrev Number: 15 (DW_TAG_member)
    <14d9>   DW_AT_name        : (indirect string, offset: 0x50fcc): __value
    <14dd>   DW_AT_decl_file   : 433
    <14df>   DW_AT_decl_line   : 20
    <14e0>   DW_AT_decl_column : 5
    <14e1>   DW_AT_type        : <0x14a5>
    <14e5>   DW_AT_data_member_location: 4
 <2><14e6>: Abbrev Number: 0
 <1><14e7>: Abbrev Number: 22 (DW_TAG_typedef)
    <14e8>   DW_AT_name        : (indirect string, offset: 0x28aa1): __mbstate_t
    <14ec>   DW_AT_decl_file   : 433
    <14ee>   DW_AT_decl_line   : 21
    <14ef>   DW_AT_decl_column : 3
    <14f0>   DW_AT_type        : <0x1497>
 <1><14f4>: Abbrev Number: 48 (DW_TAG_structure_type)
    <14f5>   DW_AT_name        : (indirect string, offset: 0x25edd): _G_fpos_t
    <14f9>   DW_AT_byte_size   : 16
    <14fa>   DW_AT_decl_file   : 434
    <14fc>   DW_AT_decl_line   : 10
    <14fd>   DW_AT_decl_column : 16
    <14fe>   DW_AT_sibling     : <0x151f>
 <2><1502>: Abbrev Number: 15 (DW_TAG_member)
    <1503>   DW_AT_name        : (indirect string, offset: 0x22e36): __pos
    <1507>   DW_AT_decl_file   : 434
    <1509>   DW_AT_decl_line   : 12
    <150a>   DW_AT_decl_column : 11
    <150b>   DW_AT_type        : <0x17e>
    <150f>   DW_AT_data_member_location: 0
 <2><1510>: Abbrev Number: 15 (DW_TAG_member)
    <1511>   DW_AT_name        : (indirect string, offset: 0x3ed48): __state
    <1515>   DW_AT_decl_file   : 434
    <1517>   DW_AT_decl_line   : 13
    <1518>   DW_AT_decl_column : 15
    <1519>   DW_AT_type        : <0x14e7>
    <151d>   DW_AT_data_member_location: 8
 <2><151e>: Abbrev Number: 0
 <1><151f>: Abbrev Number: 22 (DW_TAG_typedef)
    <1520>   DW_AT_name        : (indirect string, offset: 0x4a342): __fpos_t
    <1524>   DW_AT_decl_file   : 434
    <1526>   DW_AT_decl_line   : 14
    <1527>   DW_AT_decl_column : 3
    <1528>   DW_AT_type        : <0x14f4>
 <1><152c>: Abbrev Number: 22 (DW_TAG_typedef)
    <152d>   DW_AT_name        : (indirect string, offset: 0x868d): __FILE
    <1531>   DW_AT_decl_file   : 435
    <1533>   DW_AT_decl_line   : 5
    <1534>   DW_AT_decl_column : 25
    <1535>   DW_AT_type        : <0x1539>
 <1><1539>: Abbrev Number: 48 (DW_TAG_structure_type)
    <153a>   DW_AT_name        : (indirect string, offset: 0x59af): _IO_FILE
    <153e>   DW_AT_byte_size   : 216
    <153f>   DW_AT_decl_file   : 436
    <1541>   DW_AT_decl_line   : 49
    <1542>   DW_AT_decl_column : 8
    <1543>   DW_AT_sibling     : <0x16de>
 <2><1547>: Abbrev Number: 15 (DW_TAG_member)
    <1548>   DW_AT_name        : (indirect string, offset: 0x4e5de): _flags
    <154c>   DW_AT_decl_file   : 436
    <154e>   DW_AT_decl_line   : 51
    <154f>   DW_AT_decl_column : 7
    <1550>   DW_AT_type        : <0xc1>
    <1554>   DW_AT_data_member_location: 0
 <2><1555>: Abbrev Number: 15 (DW_TAG_member)
    <1556>   DW_AT_name        : (indirect string, offset: 0x3570a): _IO_read_ptr
    <155a>   DW_AT_decl_file   : 436
    <155c>   DW_AT_decl_line   : 54
    <155d>   DW_AT_decl_column : 9
    <155e>   DW_AT_type        : <0x1b4>
    <1562>   DW_AT_data_member_location: 8
 <2><1563>: Abbrev Number: 15 (DW_TAG_member)
    <1564>   DW_AT_name        : (indirect string, offset: 0x4c222): _IO_read_end
    <1568>   DW_AT_decl_file   : 436
    <156a>   DW_AT_decl_line   : 55
    <156b>   DW_AT_decl_column : 9
    <156c>   DW_AT_type        : <0x1b4>
    <1570>   DW_AT_data_member_location: 16
 <2><1571>: Abbrev Number: 15 (DW_TAG_member)
    <1572>   DW_AT_name        : (indirect string, offset: 0x31ac7): _IO_read_base
    <1576>   DW_AT_decl_file   : 436
    <1578>   DW_AT_decl_line   : 56
    <1579>   DW_AT_decl_column : 9
    <157a>   DW_AT_type        : <0x1b4>
    <157e>   DW_AT_data_member_location: 24
 <2><157f>: Abbrev Number: 15 (DW_TAG_member)
    <1580>   DW_AT_name        : (indirect string, offset: 0x42c55): _IO_write_base
    <1584>   DW_AT_decl_file   : 436
    <1586>   DW_AT_decl_line   : 57
    <1587>   DW_AT_decl_column : 9
    <1588>   DW_AT_type        : <0x1b4>
    <158c>   DW_AT_data_member_location: 32
 <2><158d>: Abbrev Number: 15 (DW_TAG_member)
    <158e>   DW_AT_name        : (indirect string, offset: 0x34886): _IO_write_ptr
    <1592>   DW_AT_decl_file   : 436
    <1594>   DW_AT_decl_line   : 58
    <1595>   DW_AT_decl_column : 9
    <1596>   DW_AT_type        : <0x1b4>
    <159a>   DW_AT_data_member_location: 40
 <2><159b>: Abbrev Number: 15 (DW_TAG_member)
    <159c>   DW_AT_name        : (indirect string, offset: 0x4ae61): _IO_write_end
    <15a0>   DW_AT_decl_file   : 436
    <15a2>   DW_AT_decl_line   : 59
    <15a3>   DW_AT_decl_column : 9
    <15a4>   DW_AT_type        : <0x1b4>
    <15a8>   DW_AT_data_member_location: 48
 <2><15a9>: Abbrev Number: 15 (DW_TAG_member)
    <15aa>   DW_AT_name        : (indirect string, offset: 0x1ba0b): _IO_buf_base
    <15ae>   DW_AT_decl_file   : 436
    <15b0>   DW_AT_decl_line   : 60
    <15b1>   DW_AT_decl_column : 9
    <15b2>   DW_AT_type        : <0x1b4>
    <15b6>   DW_AT_data_member_location: 56
 <2><15b7>: Abbrev Number: 15 (DW_TAG_member)
    <15b8>   DW_AT_name        : (indirect string, offset: 0x256c0): _IO_buf_end
    <15bc>   DW_AT_decl_file   : 436
    <15be>   DW_AT_decl_line   : 61
    <15bf>   DW_AT_decl_column : 9
    <15c0>   DW_AT_type        : <0x1b4>
    <15c4>   DW_AT_data_member_location: 64
 <2><15c5>: Abbrev Number: 15 (DW_TAG_member)
    <15c6>   DW_AT_name        : (indirect string, offset: 0x3c689): _IO_save_base
    <15ca>   DW_AT_decl_file   : 436
    <15cc>   DW_AT_decl_line   : 64
    <15cd>   DW_AT_decl_column : 9
    <15ce>   DW_AT_type        : <0x1b4>
    <15d2>   DW_AT_data_member_location: 72
 <2><15d3>: Abbrev Number: 15 (DW_TAG_member)
    <15d4>   DW_AT_name        : (indirect string, offset: 0x3ce9e): _IO_backup_base
    <15d8>   DW_AT_decl_file   : 436
    <15da>   DW_AT_decl_line   : 65
    <15db>   DW_AT_decl_column : 9
    <15dc>   DW_AT_type        : <0x1b4>
    <15e0>   DW_AT_data_member_location: 80
 <2><15e1>: Abbrev Number: 15 (DW_TAG_member)
    <15e2>   DW_AT_name        : (indirect string, offset: 0x42ac8): _IO_save_end
    <15e6>   DW_AT_decl_file   : 436
    <15e8>   DW_AT_decl_line   : 66
    <15e9>   DW_AT_decl_column : 9
    <15ea>   DW_AT_type        : <0x1b4>
    <15ee>   DW_AT_data_member_location: 88
 <2><15ef>: Abbrev Number: 15 (DW_TAG_member)
    <15f0>   DW_AT_name        : (indirect string, offset: 0x489b4): _markers
    <15f4>   DW_AT_decl_file   : 436
    <15f6>   DW_AT_decl_line   : 68
    <15f7>   DW_AT_decl_column : 22
    <15f8>   DW_AT_type        : <0x16f9>
    <15fc>   DW_AT_data_member_location: 96
 <2><15fd>: Abbrev Number: 15 (DW_TAG_member)
    <15fe>   DW_AT_name        : (indirect string, offset: 0x299f0): _chain
    <1602>   DW_AT_decl_file   : 436
    <1604>   DW_AT_decl_line   : 70
    <1605>   DW_AT_decl_column : 20
    <1606>   DW_AT_type        : <0x16fe>
    <160a>   DW_AT_data_member_location: 104
 <2><160b>: Abbrev Number: 15 (DW_TAG_member)
    <160c>   DW_AT_name        : (indirect string, offset: 0x8ec6): _fileno
    <1610>   DW_AT_decl_file   : 436
    <1612>   DW_AT_decl_line   : 72
    <1613>   DW_AT_decl_column : 7
    <1614>   DW_AT_type        : <0xc1>
    <1618>   DW_AT_data_member_location: 112
 <2><1619>: Abbrev Number: 15 (DW_TAG_member)
    <161a>   DW_AT_name        : (indirect string, offset: 0x569c1): _flags2
    <161e>   DW_AT_decl_file   : 436
    <1620>   DW_AT_decl_line   : 73
    <1621>   DW_AT_decl_column : 7
    <1622>   DW_AT_type        : <0xc1>
    <1626>   DW_AT_data_member_location: 116
 <2><1627>: Abbrev Number: 15 (DW_TAG_member)
    <1628>   DW_AT_name        : (indirect string, offset: 0x356da): _old_offset
    <162c>   DW_AT_decl_file   : 436
    <162e>   DW_AT_decl_line   : 74
    <162f>   DW_AT_decl_column : 11
    <1630>   DW_AT_type        : <0x17e>
    <1634>   DW_AT_data_member_location: 120
 <2><1635>: Abbrev Number: 15 (DW_TAG_member)
    <1636>   DW_AT_name        : (indirect string, offset: 0x455ea): _cur_column
    <163a>   DW_AT_decl_file   : 436
    <163c>   DW_AT_decl_line   : 77
    <163d>   DW_AT_decl_column : 18
    <163e>   DW_AT_type        : <0x5f>
    <1642>   DW_AT_data_member_location: 128
 <2><1643>: Abbrev Number: 15 (DW_TAG_member)
    <1644>   DW_AT_name        : (indirect string, offset: 0xda5b): _vtable_offset
    <1648>   DW_AT_decl_file   : 436
    <164a>   DW_AT_decl_line   : 78
    <164b>   DW_AT_decl_column : 15
    <164c>   DW_AT_type        : <0x7a>
    <1650>   DW_AT_data_member_location: 130
 <2><1651>: Abbrev Number: 15 (DW_TAG_member)
    <1652>   DW_AT_name        : (indirect string, offset: 0x3d7c2): _shortbuf
    <1656>   DW_AT_decl_file   : 436
    <1658>   DW_AT_decl_line   : 79
    <1659>   DW_AT_decl_column : 8
    <165a>   DW_AT_type        : <0x1703>
    <165e>   DW_AT_data_member_location: 131
 <2><165f>: Abbrev Number: 15 (DW_TAG_member)
    <1660>   DW_AT_name        : (indirect string, offset: 0x61f5e): _lock
    <1664>   DW_AT_decl_file   : 436
    <1666>   DW_AT_decl_line   : 81
    <1667>   DW_AT_decl_column : 15
    <1668>   DW_AT_type        : <0x1713>
    <166c>   DW_AT_data_member_location: 136
 <2><166d>: Abbrev Number: 15 (DW_TAG_member)
    <166e>   DW_AT_name        : (indirect string, offset: 0x7c0cf): _offset
    <1672>   DW_AT_decl_file   : 436
    <1674>   DW_AT_decl_line   : 89
    <1675>   DW_AT_decl_column : 13
    <1676>   DW_AT_type        : <0x18b>
    <167a>   DW_AT_data_member_location: 144
 <2><167b>: Abbrev Number: 15 (DW_TAG_member)
    <167c>   DW_AT_name        : (indirect string, offset: 0x522dd): _codecvt
    <1680>   DW_AT_decl_file   : 436
    <1682>   DW_AT_decl_line   : 91
    <1683>   DW_AT_decl_column : 23
    <1684>   DW_AT_type        : <0x171d>
    <1688>   DW_AT_data_member_location: 152
 <2><1689>: Abbrev Number: 15 (DW_TAG_member)
    <168a>   DW_AT_name        : (indirect string, offset: 0xdef4): _wide_data
    <168e>   DW_AT_decl_file   : 436
    <1690>   DW_AT_decl_line   : 92
    <1691>   DW_AT_decl_column : 25
    <1692>   DW_AT_type        : <0x1727>
    <1696>   DW_AT_data_member_location: 160
 <2><1697>: Abbrev Number: 15 (DW_TAG_member)
    <1698>   DW_AT_name        : (indirect string, offset: 0x57dac): _freeres_list
    <169c>   DW_AT_decl_file   : 436
    <169e>   DW_AT_decl_line   : 93
    <169f>   DW_AT_decl_column : 20
    <16a0>   DW_AT_type        : <0x16fe>
    <16a4>   DW_AT_data_member_location: 168
 <2><16a5>: Abbrev Number: 15 (DW_TAG_member)
    <16a6>   DW_AT_name        : (indirect string, offset: 0x591d6): _freeres_buf
    <16aa>   DW_AT_decl_file   : 436
    <16ac>   DW_AT_decl_line   : 94
    <16ad>   DW_AT_decl_column : 9
    <16ae>   DW_AT_type        : <0x1b2>
    <16b2>   DW_AT_data_member_location: 176
 <2><16b3>: Abbrev Number: 15 (DW_TAG_member)
    <16b4>   DW_AT_name        : (indirect string, offset: 0x34234): __pad5
    <16b8>   DW_AT_decl_file   : 436
    <16ba>   DW_AT_decl_line   : 95
    <16bb>   DW_AT_decl_column : 10
    <16bc>   DW_AT_type        : <0x31>
    <16c0>   DW_AT_data_member_location: 184
 <2><16c1>: Abbrev Number: 15 (DW_TAG_member)
    <16c2>   DW_AT_name        : (indirect string, offset: 0x7e617): _mode
    <16c6>   DW_AT_decl_file   : 436
    <16c8>   DW_AT_decl_line   : 96
    <16c9>   DW_AT_decl_column : 7
    <16ca>   DW_AT_type        : <0xc1>
    <16ce>   DW_AT_data_member_location: 192
 <2><16cf>: Abbrev Number: 15 (DW_TAG_member)
    <16d0>   DW_AT_name        : (indirect string, offset: 0x217fe): _unused2
    <16d4>   DW_AT_decl_file   : 436
    <16d6>   DW_AT_decl_line   : 98
    <16d7>   DW_AT_decl_column : 8
    <16d8>   DW_AT_type        : <0x172c>
    <16dc>   DW_AT_data_member_location: 196
 <2><16dd>: Abbrev Number: 0
 <1><16de>: Abbrev Number: 22 (DW_TAG_typedef)
    <16df>   DW_AT_name        : (indirect string, offset: 0x5ccf1): FILE
    <16e3>   DW_AT_decl_file   : 437
    <16e5>   DW_AT_decl_line   : 7
    <16e6>   DW_AT_decl_column : 25
    <16e7>   DW_AT_type        : <0x1539>
 <1><16eb>: Abbrev Number: 124 (DW_TAG_typedef)
    <16ec>   DW_AT_name        : (indirect string, offset: 0x5cafc): _IO_lock_t
    <16f0>   DW_AT_decl_file   : 436
    <16f2>   DW_AT_decl_line   : 43
    <16f3>   DW_AT_decl_column : 14
 <1><16f4>: Abbrev Number: 72 (DW_TAG_structure_type)
    <16f5>   DW_AT_name        : (indirect string, offset: 0xa74b): _IO_marker
    <16f9>   DW_AT_declaration : 1
 <1><16f9>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <16fa>   DW_AT_byte_size   : 8
    <16fa>   DW_AT_type        : <0x16f4>
 <1><16fe>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <16ff>   DW_AT_byte_size   : 8
    <16ff>   DW_AT_type        : <0x1539>
 <1><1703>: Abbrev Number: 43 (DW_TAG_array_type)
    <1704>   DW_AT_type        : <0x1b9>
    <1708>   DW_AT_sibling     : <0x1713>
 <2><170c>: Abbrev Number: 53 (DW_TAG_subrange_type)
    <170d>   DW_AT_type        : <0x3e>
    <1711>   DW_AT_upper_bound : 0
 <2><1712>: Abbrev Number: 0
 <1><1713>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1714>   DW_AT_byte_size   : 8
    <1714>   DW_AT_type        : <0x16eb>
 <1><1718>: Abbrev Number: 72 (DW_TAG_structure_type)
    <1719>   DW_AT_name        : (indirect string, offset: 0x522da): _IO_codecvt
    <171d>   DW_AT_declaration : 1
 <1><171d>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <171e>   DW_AT_byte_size   : 8
    <171e>   DW_AT_type        : <0x1718>
 <1><1722>: Abbrev Number: 72 (DW_TAG_structure_type)
    <1723>   DW_AT_name        : (indirect string, offset: 0xdef1): _IO_wide_data
    <1727>   DW_AT_declaration : 1
 <1><1727>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1728>   DW_AT_byte_size   : 8
    <1728>   DW_AT_type        : <0x1722>
 <1><172c>: Abbrev Number: 43 (DW_TAG_array_type)
    <172d>   DW_AT_type        : <0x1b9>
    <1731>   DW_AT_sibling     : <0x173c>
 <2><1735>: Abbrev Number: 53 (DW_TAG_subrange_type)
    <1736>   DW_AT_type        : <0x3e>
    <173a>   DW_AT_upper_bound : 19
 <2><173b>: Abbrev Number: 0
 <1><173c>: Abbrev Number: 22 (DW_TAG_typedef)
    <173d>   DW_AT_name        : (indirect string, offset: 0x25ee0): fpos_t
    <1741>   DW_AT_decl_file   : 438
    <1743>   DW_AT_decl_line   : 84
    <1744>   DW_AT_decl_column : 18
    <1745>   DW_AT_type        : <0x151f>
 <1><1749>: Abbrev Number: 42 (DW_TAG_const_type)
    <174a>   DW_AT_type        : <0x173c>
 <1><174e>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <174f>   DW_AT_byte_size   : 8
    <174f>   DW_AT_type        : <0x16de>
 <1><1753>: Abbrev Number: 33 (DW_TAG_base_type)
    <1754>   DW_AT_byte_size   : 1
    <1755>   DW_AT_encoding    : 2	(boolean)
    <1756>   DW_AT_name        : (indirect string, offset: 0x23d58): bool
 <1><175a>: Abbrev Number: 22 (DW_TAG_typedef)
    <175b>   DW_AT_name        : (indirect string, offset: 0x2ac55): float_t
    <175f>   DW_AT_decl_file   : 439
    <1761>   DW_AT_decl_line   : 149
    <1762>   DW_AT_decl_column : 15
    <1763>   DW_AT_type        : <0x331>
 <1><1767>: Abbrev Number: 22 (DW_TAG_typedef)
    <1768>   DW_AT_name        : (indirect string, offset: 0x3962f): double_t
    <176c>   DW_AT_decl_file   : 439
    <176e>   DW_AT_decl_line   : 150
    <176f>   DW_AT_decl_column : 16
    <1770>   DW_AT_type        : <0x338>
 <1><1774>: Abbrev Number: 33 (DW_TAG_base_type)
    <1775>   DW_AT_byte_size   : 16
    <1776>   DW_AT_encoding    : 7	(unsigned)
    <1777>   DW_AT_name        : (indirect string, offset: 0x2a9fc): __int128 unsigned
 <1><177b>: Abbrev Number: 33 (DW_TAG_base_type)
    <177c>   DW_AT_byte_size   : 2
    <177d>   DW_AT_encoding    : 16	(unicode string)
    <177e>   DW_AT_name        : (indirect string, offset: 0x8674): char16_t
 <1><1782>: Abbrev Number: 33 (DW_TAG_base_type)
    <1783>   DW_AT_byte_size   : 4
    <1784>   DW_AT_encoding    : 16	(unicode string)
    <1785>   DW_AT_name        : (indirect string, offset: 0x425f2): char32_t
 <1><1789>: Abbrev Number: 82 (DW_TAG_namespace)
    <178a>   DW_AT_name        : (indirect string, offset: 0x10b8b): __gnu_debug
    <178e>   DW_AT_decl_file   : 420
    <1790>   DW_AT_decl_line   : 56
    <1791>   DW_AT_decl_column : 11
    <1792>   DW_AT_sibling     : <0x17a0>
 <2><1796>: Abbrev Number: 87 (DW_TAG_imported_module)
    <1797>   DW_AT_decl_file   : 420
    <1799>   DW_AT_decl_line   : 58
    <179a>   DW_AT_decl_column : 24
    <179b>   DW_AT_import      : <0x6b3>	[Abbrev Number: 81 (DW_TAG_namespace)]
 <2><179f>: Abbrev Number: 0
 <1><17a0>: Abbrev Number: 88 (DW_TAG_structure_type)
    <17a1>   DW_AT_name        : tm
    <17a4>   DW_AT_byte_size   : 56
    <17a4>   DW_AT_decl_file   : 440
    <17a6>   DW_AT_decl_line   : 7
    <17a7>   DW_AT_decl_column : 8
    <17a8>   DW_AT_sibling     : <0x1847>
 <2><17ac>: Abbrev Number: 15 (DW_TAG_member)
    <17ad>   DW_AT_name        : (indirect string, offset: 0x1878e): tm_sec
    <17b1>   DW_AT_decl_file   : 440
    <17b3>   DW_AT_decl_line   : 9
    <17b4>   DW_AT_decl_column : 7
    <17b5>   DW_AT_type        : <0xc1>
    <17b9>   DW_AT_data_member_location: 0
 <2><17ba>: Abbrev Number: 15 (DW_TAG_member)
    <17bb>   DW_AT_name        : (indirect string, offset: 0x504c1): tm_min
    <17bf>   DW_AT_decl_file   : 440
    <17c1>   DW_AT_decl_line   : 10
    <17c2>   DW_AT_decl_column : 7
    <17c3>   DW_AT_type        : <0xc1>
    <17c7>   DW_AT_data_member_location: 4
 <2><17c8>: Abbrev Number: 15 (DW_TAG_member)
    <17c9>   DW_AT_name        : (indirect string, offset: 0x3368c): tm_hour
    <17cd>   DW_AT_decl_file   : 440
    <17cf>   DW_AT_decl_line   : 11
    <17d0>   DW_AT_decl_column : 7
    <17d1>   DW_AT_type        : <0xc1>
    <17d5>   DW_AT_data_member_location: 8
 <2><17d6>: Abbrev Number: 15 (DW_TAG_member)
    <17d7>   DW_AT_name        : (indirect string, offset: 0x443d0): tm_mday
    <17db>   DW_AT_decl_file   : 440
    <17dd>   DW_AT_decl_line   : 12
    <17de>   DW_AT_decl_column : 7
    <17df>   DW_AT_type        : <0xc1>
    <17e3>   DW_AT_data_member_location: 12
 <2><17e4>: Abbrev Number: 15 (DW_TAG_member)
    <17e5>   DW_AT_name        : (indirect string, offset: 0x50e2c): tm_mon
    <17e9>   DW_AT_decl_file   : 440
    <17eb>   DW_AT_decl_line   : 13
    <17ec>   DW_AT_decl_column : 7
    <17ed>   DW_AT_type        : <0xc1>
    <17f1>   DW_AT_data_member_location: 16
 <2><17f2>: Abbrev Number: 15 (DW_TAG_member)
    <17f3>   DW_AT_name        : (indirect string, offset: 0x52300): tm_year
    <17f7>   DW_AT_decl_file   : 440
    <17f9>   DW_AT_decl_line   : 14
    <17fa>   DW_AT_decl_column : 7
    <17fb>   DW_AT_type        : <0xc1>
    <17ff>   DW_AT_data_member_location: 20
 <2><1800>: Abbrev Number: 15 (DW_TAG_member)
    <1801>   DW_AT_name        : (indirect string, offset: 0x3b00f): tm_wday
    <1805>   DW_AT_decl_file   : 440
    <1807>   DW_AT_decl_line   : 15
    <1808>   DW_AT_decl_column : 7
    <1809>   DW_AT_type        : <0xc1>
    <180d>   DW_AT_data_member_location: 24
 <2><180e>: Abbrev Number: 15 (DW_TAG_member)
    <180f>   DW_AT_name        : (indirect string, offset: 0x4bd36): tm_yday
    <1813>   DW_AT_decl_file   : 440
    <1815>   DW_AT_decl_line   : 16
    <1816>   DW_AT_decl_column : 7
    <1817>   DW_AT_type        : <0xc1>
    <181b>   DW_AT_data_member_location: 28
 <2><181c>: Abbrev Number: 15 (DW_TAG_member)
    <181d>   DW_AT_name        : (indirect string, offset: 0xb766): tm_isdst
    <1821>   DW_AT_decl_file   : 440
    <1823>   DW_AT_decl_line   : 17
    <1824>   DW_AT_decl_column : 7
    <1825>   DW_AT_type        : <0xc1>
    <1829>   DW_AT_data_member_location: 32
 <2><182a>: Abbrev Number: 15 (DW_TAG_member)
    <182b>   DW_AT_name        : (indirect string, offset: 0x5c13b): tm_gmtoff
    <182f>   DW_AT_decl_file   : 440
    <1831>   DW_AT_decl_line   : 20
    <1832>   DW_AT_decl_column : 12
    <1833>   DW_AT_type        : <0x2a>
    <1837>   DW_AT_data_member_location: 40
 <2><1838>: Abbrev Number: 15 (DW_TAG_member)
    <1839>   DW_AT_name        : (indirect string, offset: 0xf7da): tm_zone
    <183d>   DW_AT_decl_file   : 440
    <183f>   DW_AT_decl_line   : 21
    <1840>   DW_AT_decl_column : 15
    <1841>   DW_AT_type        : <0x401>
    <1845>   DW_AT_data_member_location: 48
 <2><1846>: Abbrev Number: 0
 <1><1847>: Abbrev Number: 42 (DW_TAG_const_type)
    <1848>   DW_AT_type        : <0x17a0>
 <1><184c>: Abbrev Number: 22 (DW_TAG_typedef)
    <184d>   DW_AT_name        : (indirect string, offset: 0x57e45): wint_t
    <1851>   DW_AT_decl_file   : 441
    <1853>   DW_AT_decl_line   : 20
    <1854>   DW_AT_decl_column : 23
    <1855>   DW_AT_type        : <0x66>
 <1><1859>: Abbrev Number: 22 (DW_TAG_typedef)
    <185a>   DW_AT_name        : (indirect string, offset: 0x28aa3): mbstate_t
    <185e>   DW_AT_decl_file   : 442
    <1860>   DW_AT_decl_line   : 6
    <1861>   DW_AT_decl_column : 21
    <1862>   DW_AT_type        : <0x14e7>
 <1><1866>: Abbrev Number: 42 (DW_TAG_const_type)
    <1867>   DW_AT_type        : <0x1859>
 <1><186b>: Abbrev Number: 24 (DW_TAG_subprogram)
    <186c>   DW_AT_external    : 1
    <186c>   DW_AT_name        : (indirect string, offset: 0x26419): btowc
    <1870>   DW_AT_decl_file   : 443
    <1872>   DW_AT_decl_line   : 284
    <1874>   DW_AT_decl_column : 15
    <1875>   DW_AT_type        : <0x184c>
    <1879>   DW_AT_declaration : 1
    <1879>   DW_AT_sibling     : <0x1883>
 <2><187d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <187e>   DW_AT_type        : <0xc1>
 <2><1882>: Abbrev Number: 0
 <1><1883>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1884>   DW_AT_external    : 1
    <1884>   DW_AT_name        : (indirect string, offset: 0x444f1): fgetwc
    <1888>   DW_AT_decl_file   : 443
    <188a>   DW_AT_decl_line   : 729
    <188c>   DW_AT_decl_column : 15
    <188d>   DW_AT_type        : <0x184c>
    <1891>   DW_AT_declaration : 1
    <1891>   DW_AT_sibling     : <0x189b>
 <2><1895>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1896>   DW_AT_type        : <0x189b>
 <2><189a>: Abbrev Number: 0
 <1><189b>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <189c>   DW_AT_byte_size   : 8
    <189c>   DW_AT_type        : <0x152c>
 <1><18a0>: Abbrev Number: 24 (DW_TAG_subprogram)
    <18a1>   DW_AT_external    : 1
    <18a1>   DW_AT_name        : (indirect string, offset: 0x44534): fgetws
    <18a5>   DW_AT_decl_file   : 443
    <18a7>   DW_AT_decl_line   : 758
    <18a9>   DW_AT_decl_column : 17
    <18aa>   DW_AT_type        : <0x10ae>
    <18ae>   DW_AT_declaration : 1
    <18ae>   DW_AT_sibling     : <0x18c2>
 <2><18b2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18b3>   DW_AT_type        : <0x10ae>
 <2><18b7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18b8>   DW_AT_type        : <0xc1>
 <2><18bc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18bd>   DW_AT_type        : <0x189b>
 <2><18c1>: Abbrev Number: 0
 <1><18c2>: Abbrev Number: 24 (DW_TAG_subprogram)
    <18c3>   DW_AT_external    : 1
    <18c3>   DW_AT_name        : (indirect string, offset: 0xd07f): fputwc
    <18c7>   DW_AT_decl_file   : 443
    <18c9>   DW_AT_decl_line   : 743
    <18cb>   DW_AT_decl_column : 15
    <18cc>   DW_AT_type        : <0x184c>
    <18d0>   DW_AT_declaration : 1
    <18d0>   DW_AT_sibling     : <0x18df>
 <2><18d4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18d5>   DW_AT_type        : <0x10b3>
 <2><18d9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18da>   DW_AT_type        : <0x189b>
 <2><18de>: Abbrev Number: 0
 <1><18df>: Abbrev Number: 24 (DW_TAG_subprogram)
    <18e0>   DW_AT_external    : 1
    <18e0>   DW_AT_name        : (indirect string, offset: 0xd0af): fputws
    <18e4>   DW_AT_decl_file   : 443
    <18e6>   DW_AT_decl_line   : 765
    <18e8>   DW_AT_decl_column : 12
    <18e9>   DW_AT_type        : <0xc1>
    <18ed>   DW_AT_declaration : 1
    <18ed>   DW_AT_sibling     : <0x18fc>
 <2><18f1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18f2>   DW_AT_type        : <0x11d2>
 <2><18f6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <18f7>   DW_AT_type        : <0x189b>
 <2><18fb>: Abbrev Number: 0
 <1><18fc>: Abbrev Number: 24 (DW_TAG_subprogram)
    <18fd>   DW_AT_external    : 1
    <18fd>   DW_AT_name        : (indirect string, offset: 0x55473): fwide
    <1901>   DW_AT_decl_file   : 443
    <1903>   DW_AT_decl_line   : 573
    <1905>   DW_AT_decl_column : 12
    <1906>   DW_AT_type        : <0xc1>
    <190a>   DW_AT_declaration : 1
    <190a>   DW_AT_sibling     : <0x1919>
 <2><190e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <190f>   DW_AT_type        : <0x189b>
 <2><1913>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1914>   DW_AT_type        : <0xc1>
 <2><1918>: Abbrev Number: 0
 <1><1919>: Abbrev Number: 24 (DW_TAG_subprogram)
    <191a>   DW_AT_external    : 1
    <191a>   DW_AT_name        : (indirect string, offset: 0x4af79): fwprintf
    <191e>   DW_AT_decl_file   : 443
    <1920>   DW_AT_decl_line   : 580
    <1922>   DW_AT_decl_column : 12
    <1923>   DW_AT_type        : <0xc1>
    <1927>   DW_AT_declaration : 1
    <1927>   DW_AT_sibling     : <0x1937>
 <2><192b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <192c>   DW_AT_type        : <0x189b>
 <2><1930>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1931>   DW_AT_type        : <0x11d2>
 <2><1935>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1936>: Abbrev Number: 0
 <1><1937>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1938>   DW_AT_external    : 1
    <1938>   DW_AT_name        : (indirect string, offset: 0x3779c): fwscanf
    <193c>   DW_AT_decl_file   : 443
    <193e>   DW_AT_decl_line   : 642
    <1940>   DW_AT_decl_column : 12
    <1941>   DW_AT_linkage_name: (indirect string, offset: 0x37793): __isoc99_fwscanf
    <1945>   DW_AT_type        : <0xc1>
    <1949>   DW_AT_declaration : 1
    <1949>   DW_AT_sibling     : <0x1959>
 <2><194d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <194e>   DW_AT_type        : <0x189b>
 <2><1952>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1953>   DW_AT_type        : <0x11d2>
 <2><1957>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1958>: Abbrev Number: 0
 <1><1959>: Abbrev Number: 24 (DW_TAG_subprogram)
    <195a>   DW_AT_external    : 1
    <195a>   DW_AT_name        : (indirect string, offset: 0x444f2): getwc
    <195e>   DW_AT_decl_file   : 443
    <1960>   DW_AT_decl_line   : 730
    <1962>   DW_AT_decl_column : 15
    <1963>   DW_AT_type        : <0x184c>
    <1967>   DW_AT_declaration : 1
    <1967>   DW_AT_sibling     : <0x1971>
 <2><196b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <196c>   DW_AT_type        : <0x189b>
 <2><1970>: Abbrev Number: 0
 <1><1971>: Abbrev Number: 66 (DW_TAG_subprogram)
    <1972>   DW_AT_external    : 1
    <1972>   DW_AT_name        : (indirect string, offset: 0x25814): getwchar
    <1976>   DW_AT_decl_file   : 443
    <1978>   DW_AT_decl_line   : 736
    <197a>   DW_AT_decl_column : 15
    <197b>   DW_AT_type        : <0x184c>
    <197f>   DW_AT_declaration : 1
 <1><197f>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1980>   DW_AT_external    : 1
    <1980>   DW_AT_name        : (indirect string, offset: 0x5d461): mbrlen
    <1984>   DW_AT_decl_file   : 443
    <1986>   DW_AT_decl_line   : 307
    <1988>   DW_AT_decl_column : 15
    <1989>   DW_AT_type        : <0x31>
    <198d>   DW_AT_declaration : 1
    <198d>   DW_AT_sibling     : <0x19a1>
 <2><1991>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1992>   DW_AT_type        : <0x401>
 <2><1996>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1997>   DW_AT_type        : <0x31>
 <2><199b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <199c>   DW_AT_type        : <0x19a1>
 <2><19a0>: Abbrev Number: 0
 <1><19a1>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <19a2>   DW_AT_byte_size   : 8
    <19a2>   DW_AT_type        : <0x1859>
 <1><19a6>: Abbrev Number: 24 (DW_TAG_subprogram)
    <19a7>   DW_AT_external    : 1
    <19a7>   DW_AT_name        : (indirect string, offset: 0x103b6): mbrtowc
    <19ab>   DW_AT_decl_file   : 443
    <19ad>   DW_AT_decl_line   : 296
    <19af>   DW_AT_decl_column : 15
    <19b0>   DW_AT_type        : <0x31>
    <19b4>   DW_AT_declaration : 1
    <19b4>   DW_AT_sibling     : <0x19cd>
 <2><19b8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19b9>   DW_AT_type        : <0x10ae>
 <2><19bd>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19be>   DW_AT_type        : <0x401>
 <2><19c2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19c3>   DW_AT_type        : <0x31>
 <2><19c7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19c8>   DW_AT_type        : <0x19a1>
 <2><19cc>: Abbrev Number: 0
 <1><19cd>: Abbrev Number: 24 (DW_TAG_subprogram)
    <19ce>   DW_AT_external    : 1
    <19ce>   DW_AT_name        : (indirect string, offset: 0xdeff): mbsinit
    <19d2>   DW_AT_decl_file   : 443
    <19d4>   DW_AT_decl_line   : 292
    <19d6>   DW_AT_decl_column : 12
    <19d7>   DW_AT_type        : <0xc1>
    <19db>   DW_AT_declaration : 1
    <19db>   DW_AT_sibling     : <0x19e5>
 <2><19df>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19e0>   DW_AT_type        : <0x19e5>
 <2><19e4>: Abbrev Number: 0
 <1><19e5>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <19e6>   DW_AT_byte_size   : 8
    <19e6>   DW_AT_type        : <0x1866>
 <1><19ea>: Abbrev Number: 24 (DW_TAG_subprogram)
    <19eb>   DW_AT_external    : 1
    <19eb>   DW_AT_name        : (indirect string, offset: 0x39475): mbsrtowcs
    <19ef>   DW_AT_decl_file   : 443
    <19f1>   DW_AT_decl_line   : 337
    <19f3>   DW_AT_decl_column : 15
    <19f4>   DW_AT_type        : <0x31>
    <19f8>   DW_AT_declaration : 1
    <19f8>   DW_AT_sibling     : <0x1a11>
 <2><19fc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <19fd>   DW_AT_type        : <0x10ae>
 <2><1a01>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a02>   DW_AT_type        : <0x1a11>
 <2><1a06>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a07>   DW_AT_type        : <0x31>
 <2><1a0b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a0c>   DW_AT_type        : <0x19a1>
 <2><1a10>: Abbrev Number: 0
 <1><1a11>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1a12>   DW_AT_byte_size   : 8
    <1a12>   DW_AT_type        : <0x401>
 <1><1a16>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1a17>   DW_AT_external    : 1
    <1a17>   DW_AT_name        : (indirect string, offset: 0xd080): putwc
    <1a1b>   DW_AT_decl_file   : 443
    <1a1d>   DW_AT_decl_line   : 744
    <1a1f>   DW_AT_decl_column : 15
    <1a20>   DW_AT_type        : <0x184c>
    <1a24>   DW_AT_declaration : 1
    <1a24>   DW_AT_sibling     : <0x1a33>
 <2><1a28>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a29>   DW_AT_type        : <0x10b3>
 <2><1a2d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a2e>   DW_AT_type        : <0x189b>
 <2><1a32>: Abbrev Number: 0
 <1><1a33>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1a34>   DW_AT_external    : 1
    <1a34>   DW_AT_name        : (indirect string, offset: 0x4cc2b): putwchar
    <1a38>   DW_AT_decl_file   : 443
    <1a3a>   DW_AT_decl_line   : 750
    <1a3c>   DW_AT_decl_column : 15
    <1a3d>   DW_AT_type        : <0x184c>
    <1a41>   DW_AT_declaration : 1
    <1a41>   DW_AT_sibling     : <0x1a4b>
 <2><1a45>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a46>   DW_AT_type        : <0x10b3>
 <2><1a4a>: Abbrev Number: 0
 <1><1a4b>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1a4c>   DW_AT_external    : 1
    <1a4c>   DW_AT_name        : (indirect string, offset: 0x2da63): swprintf
    <1a50>   DW_AT_decl_file   : 443
    <1a52>   DW_AT_decl_line   : 590
    <1a54>   DW_AT_decl_column : 12
    <1a55>   DW_AT_type        : <0xc1>
    <1a59>   DW_AT_declaration : 1
    <1a59>   DW_AT_sibling     : <0x1a6e>
 <2><1a5d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a5e>   DW_AT_type        : <0x10ae>
 <2><1a62>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a63>   DW_AT_type        : <0x31>
 <2><1a67>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a68>   DW_AT_type        : <0x11d2>
 <2><1a6c>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1a6d>: Abbrev Number: 0
 <1><1a6e>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1a6f>   DW_AT_external    : 1
    <1a6f>   DW_AT_name        : (indirect string, offset: 0x27ca8): swscanf
    <1a73>   DW_AT_decl_file   : 443
    <1a75>   DW_AT_decl_line   : 649
    <1a77>   DW_AT_decl_column : 12
    <1a78>   DW_AT_linkage_name: (indirect string, offset: 0x27c9f): __isoc99_swscanf
    <1a7c>   DW_AT_type        : <0xc1>
    <1a80>   DW_AT_declaration : 1
    <1a80>   DW_AT_sibling     : <0x1a90>
 <2><1a84>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a85>   DW_AT_type        : <0x11d2>
 <2><1a89>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1a8a>   DW_AT_type        : <0x11d2>
 <2><1a8e>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1a8f>: Abbrev Number: 0
 <1><1a90>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1a91>   DW_AT_external    : 1
    <1a91>   DW_AT_name        : (indirect string, offset: 0x4ccab): ungetwc
    <1a95>   DW_AT_decl_file   : 443
    <1a97>   DW_AT_decl_line   : 773
    <1a99>   DW_AT_decl_column : 15
    <1a9a>   DW_AT_type        : <0x184c>
    <1a9e>   DW_AT_declaration : 1
    <1a9e>   DW_AT_sibling     : <0x1aad>
 <2><1aa2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1aa3>   DW_AT_type        : <0x184c>
 <2><1aa7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1aa8>   DW_AT_type        : <0x189b>
 <2><1aac>: Abbrev Number: 0
 <1><1aad>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1aae>   DW_AT_external    : 1
    <1aae>   DW_AT_name        : (indirect string, offset: 0x4af78): vfwprintf
    <1ab2>   DW_AT_decl_file   : 443
    <1ab4>   DW_AT_decl_line   : 598
    <1ab6>   DW_AT_decl_column : 12
    <1ab7>   DW_AT_type        : <0xc1>
    <1abb>   DW_AT_declaration : 1
    <1abb>   DW_AT_sibling     : <0x1acf>
 <2><1abf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ac0>   DW_AT_type        : <0x189b>
 <2><1ac4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ac5>   DW_AT_type        : <0x11d2>
 <2><1ac9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1aca>   DW_AT_type        : <0x1acf>
 <2><1ace>: Abbrev Number: 0
 <1><1acf>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1ad0>   DW_AT_byte_size   : 8
    <1ad0>   DW_AT_type        : <0x1461>
 <1><1ad4>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1ad5>   DW_AT_external    : 1
    <1ad5>   DW_AT_name        : (indirect string, offset: 0x1a5e9): vfwscanf
    <1ad9>   DW_AT_decl_file   : 443
    <1adb>   DW_AT_decl_line   : 696
    <1add>   DW_AT_decl_column : 12
    <1ade>   DW_AT_linkage_name: (indirect string, offset: 0x1a5e0): __isoc99_vfwscanf
    <1ae2>   DW_AT_type        : <0xc1>
    <1ae6>   DW_AT_declaration : 1
    <1ae6>   DW_AT_sibling     : <0x1afa>
 <2><1aea>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1aeb>   DW_AT_type        : <0x189b>
 <2><1aef>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1af0>   DW_AT_type        : <0x11d2>
 <2><1af4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1af5>   DW_AT_type        : <0x1acf>
 <2><1af9>: Abbrev Number: 0
 <1><1afa>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1afb>   DW_AT_external    : 1
    <1afb>   DW_AT_name        : (indirect string, offset: 0x2da62): vswprintf
    <1aff>   DW_AT_decl_file   : 443
    <1b01>   DW_AT_decl_line   : 611
    <1b03>   DW_AT_decl_column : 12
    <1b04>   DW_AT_type        : <0xc1>
    <1b08>   DW_AT_declaration : 1
    <1b08>   DW_AT_sibling     : <0x1b21>
 <2><1b0c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b0d>   DW_AT_type        : <0x10ae>
 <2><1b11>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b12>   DW_AT_type        : <0x31>
 <2><1b16>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b17>   DW_AT_type        : <0x11d2>
 <2><1b1b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b1c>   DW_AT_type        : <0x1acf>
 <2><1b20>: Abbrev Number: 0
 <1><1b21>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1b22>   DW_AT_external    : 1
    <1b22>   DW_AT_name        : (indirect string, offset: 0xa75f): vswscanf
    <1b26>   DW_AT_decl_file   : 443
    <1b28>   DW_AT_decl_line   : 703
    <1b2a>   DW_AT_decl_column : 12
    <1b2b>   DW_AT_linkage_name: (indirect string, offset: 0xa756): __isoc99_vswscanf
    <1b2f>   DW_AT_type        : <0xc1>
    <1b33>   DW_AT_declaration : 1
    <1b33>   DW_AT_sibling     : <0x1b47>
 <2><1b37>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b38>   DW_AT_type        : <0x11d2>
 <2><1b3c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b3d>   DW_AT_type        : <0x11d2>
 <2><1b41>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b42>   DW_AT_type        : <0x1acf>
 <2><1b46>: Abbrev Number: 0
 <1><1b47>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1b48>   DW_AT_external    : 1
    <1b48>   DW_AT_name        : (indirect string, offset: 0xc7f4): vwprintf
    <1b4c>   DW_AT_decl_file   : 443
    <1b4e>   DW_AT_decl_line   : 606
    <1b50>   DW_AT_decl_column : 12
    <1b51>   DW_AT_type        : <0xc1>
    <1b55>   DW_AT_declaration : 1
    <1b55>   DW_AT_sibling     : <0x1b64>
 <2><1b59>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b5a>   DW_AT_type        : <0x11d2>
 <2><1b5e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b5f>   DW_AT_type        : <0x1acf>
 <2><1b63>: Abbrev Number: 0
 <1><1b64>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1b65>   DW_AT_external    : 1
    <1b65>   DW_AT_name        : (indirect string, offset: 0x1cb17): vwscanf
    <1b69>   DW_AT_decl_file   : 443
    <1b6b>   DW_AT_decl_line   : 700
    <1b6d>   DW_AT_decl_column : 12
    <1b6e>   DW_AT_linkage_name: (indirect string, offset: 0x1cb0e): __isoc99_vwscanf
    <1b72>   DW_AT_type        : <0xc1>
    <1b76>   DW_AT_declaration : 1
    <1b76>   DW_AT_sibling     : <0x1b85>
 <2><1b7a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b7b>   DW_AT_type        : <0x11d2>
 <2><1b7f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b80>   DW_AT_type        : <0x1acf>
 <2><1b84>: Abbrev Number: 0
 <1><1b85>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1b86>   DW_AT_external    : 1
    <1b86>   DW_AT_name        : (indirect string, offset: 0x9889): wcrtomb
    <1b8a>   DW_AT_decl_file   : 443
    <1b8c>   DW_AT_decl_line   : 301
    <1b8e>   DW_AT_decl_column : 15
    <1b8f>   DW_AT_type        : <0x31>
    <1b93>   DW_AT_declaration : 1
    <1b93>   DW_AT_sibling     : <0x1ba7>
 <2><1b97>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b98>   DW_AT_type        : <0x1b4>
 <2><1b9c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1b9d>   DW_AT_type        : <0x10b3>
 <2><1ba1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ba2>   DW_AT_type        : <0x19a1>
 <2><1ba6>: Abbrev Number: 0
 <1><1ba7>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1ba8>   DW_AT_external    : 1
    <1ba8>   DW_AT_name        : (indirect string, offset: 0x2774b): wcscat
    <1bac>   DW_AT_decl_file   : 443
    <1bae>   DW_AT_decl_line   : 97
    <1baf>   DW_AT_decl_column : 17
    <1bb0>   DW_AT_type        : <0x10ae>
    <1bb4>   DW_AT_declaration : 1
    <1bb4>   DW_AT_sibling     : <0x1bc3>
 <2><1bb8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bb9>   DW_AT_type        : <0x10ae>
 <2><1bbd>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bbe>   DW_AT_type        : <0x11d2>
 <2><1bc2>: Abbrev Number: 0
 <1><1bc3>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1bc4>   DW_AT_external    : 1
    <1bc4>   DW_AT_name        : (indirect string, offset: 0x28a45): wcscmp
    <1bc8>   DW_AT_decl_file   : 443
    <1bca>   DW_AT_decl_line   : 106
    <1bcb>   DW_AT_decl_column : 12
    <1bcc>   DW_AT_type        : <0xc1>
    <1bd0>   DW_AT_declaration : 1
    <1bd0>   DW_AT_sibling     : <0x1bdf>
 <2><1bd4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bd5>   DW_AT_type        : <0x11d2>
 <2><1bd9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bda>   DW_AT_type        : <0x11d2>
 <2><1bde>: Abbrev Number: 0
 <1><1bdf>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1be0>   DW_AT_external    : 1
    <1be0>   DW_AT_name        : (indirect string, offset: 0x39c5b): wcscoll
    <1be4>   DW_AT_decl_file   : 443
    <1be6>   DW_AT_decl_line   : 131
    <1be7>   DW_AT_decl_column : 12
    <1be8>   DW_AT_type        : <0xc1>
    <1bec>   DW_AT_declaration : 1
    <1bec>   DW_AT_sibling     : <0x1bfb>
 <2><1bf0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bf1>   DW_AT_type        : <0x11d2>
 <2><1bf5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1bf6>   DW_AT_type        : <0x11d2>
 <2><1bfa>: Abbrev Number: 0
 <1><1bfb>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1bfc>   DW_AT_external    : 1
    <1bfc>   DW_AT_name        : (indirect string, offset: 0x28d03): wcscpy
    <1c00>   DW_AT_decl_file   : 443
    <1c02>   DW_AT_decl_line   : 87
    <1c03>   DW_AT_decl_column : 17
    <1c04>   DW_AT_type        : <0x10ae>
    <1c08>   DW_AT_declaration : 1
    <1c08>   DW_AT_sibling     : <0x1c17>
 <2><1c0c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c0d>   DW_AT_type        : <0x10ae>
 <2><1c11>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c12>   DW_AT_type        : <0x11d2>
 <2><1c16>: Abbrev Number: 0
 <1><1c17>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1c18>   DW_AT_external    : 1
    <1c18>   DW_AT_name        : (indirect string, offset: 0x53f3b): wcscspn
    <1c1c>   DW_AT_decl_file   : 443
    <1c1e>   DW_AT_decl_line   : 187
    <1c1f>   DW_AT_decl_column : 15
    <1c20>   DW_AT_type        : <0x31>
    <1c24>   DW_AT_declaration : 1
    <1c24>   DW_AT_sibling     : <0x1c33>
 <2><1c28>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c29>   DW_AT_type        : <0x11d2>
 <2><1c2d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c2e>   DW_AT_type        : <0x11d2>
 <2><1c32>: Abbrev Number: 0
 <1><1c33>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1c34>   DW_AT_external    : 1
    <1c34>   DW_AT_name        : (indirect string, offset: 0x2ca24): wcsftime
    <1c38>   DW_AT_decl_file   : 443
    <1c3a>   DW_AT_decl_line   : 837
    <1c3c>   DW_AT_decl_column : 15
    <1c3d>   DW_AT_type        : <0x31>
    <1c41>   DW_AT_declaration : 1
    <1c41>   DW_AT_sibling     : <0x1c5a>
 <2><1c45>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c46>   DW_AT_type        : <0x10ae>
 <2><1c4a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c4b>   DW_AT_type        : <0x31>
 <2><1c4f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c50>   DW_AT_type        : <0x11d2>
 <2><1c54>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c55>   DW_AT_type        : <0x1c5a>
 <2><1c59>: Abbrev Number: 0
 <1><1c5a>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1c5b>   DW_AT_byte_size   : 8
    <1c5b>   DW_AT_type        : <0x1847>
 <1><1c5f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1c60>   DW_AT_external    : 1
    <1c60>   DW_AT_name        : (indirect string, offset: 0x37c9): wcslen
    <1c64>   DW_AT_decl_file   : 443
    <1c66>   DW_AT_decl_line   : 222
    <1c67>   DW_AT_decl_column : 15
    <1c68>   DW_AT_type        : <0x31>
    <1c6c>   DW_AT_declaration : 1
    <1c6c>   DW_AT_sibling     : <0x1c76>
 <2><1c70>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c71>   DW_AT_type        : <0x11d2>
 <2><1c75>: Abbrev Number: 0
 <1><1c76>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1c77>   DW_AT_external    : 1
    <1c77>   DW_AT_name        : (indirect string, offset: 0x1a00f): wcsncat
    <1c7b>   DW_AT_decl_file   : 443
    <1c7d>   DW_AT_decl_line   : 101
    <1c7e>   DW_AT_decl_column : 17
    <1c7f>   DW_AT_type        : <0x10ae>
    <1c83>   DW_AT_declaration : 1
    <1c83>   DW_AT_sibling     : <0x1c97>
 <2><1c87>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c88>   DW_AT_type        : <0x10ae>
 <2><1c8c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c8d>   DW_AT_type        : <0x11d2>
 <2><1c91>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1c92>   DW_AT_type        : <0x31>
 <2><1c96>: Abbrev Number: 0
 <1><1c97>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1c98>   DW_AT_external    : 1
    <1c98>   DW_AT_name        : (indirect string, offset: 0x1b3ff): wcsncmp
    <1c9c>   DW_AT_decl_file   : 443
    <1c9e>   DW_AT_decl_line   : 109
    <1c9f>   DW_AT_decl_column : 12
    <1ca0>   DW_AT_type        : <0xc1>
    <1ca4>   DW_AT_declaration : 1
    <1ca4>   DW_AT_sibling     : <0x1cb8>
 <2><1ca8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ca9>   DW_AT_type        : <0x11d2>
 <2><1cad>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cae>   DW_AT_type        : <0x11d2>
 <2><1cb2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cb3>   DW_AT_type        : <0x31>
 <2><1cb7>: Abbrev Number: 0
 <1><1cb8>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1cb9>   DW_AT_external    : 1
    <1cb9>   DW_AT_name        : (indirect string, offset: 0x1b94d): wcsncpy
    <1cbd>   DW_AT_decl_file   : 443
    <1cbf>   DW_AT_decl_line   : 92
    <1cc0>   DW_AT_decl_column : 17
    <1cc1>   DW_AT_type        : <0x10ae>
    <1cc5>   DW_AT_declaration : 1
    <1cc5>   DW_AT_sibling     : <0x1cd9>
 <2><1cc9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cca>   DW_AT_type        : <0x10ae>
 <2><1cce>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ccf>   DW_AT_type        : <0x11d2>
 <2><1cd3>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cd4>   DW_AT_type        : <0x31>
 <2><1cd8>: Abbrev Number: 0
 <1><1cd9>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1cda>   DW_AT_external    : 1
    <1cda>   DW_AT_name        : (indirect string, offset: 0x4eac9): wcsrtombs
    <1cde>   DW_AT_decl_file   : 443
    <1ce0>   DW_AT_decl_line   : 343
    <1ce2>   DW_AT_decl_column : 15
    <1ce3>   DW_AT_type        : <0x31>
    <1ce7>   DW_AT_declaration : 1
    <1ce7>   DW_AT_sibling     : <0x1d00>
 <2><1ceb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cec>   DW_AT_type        : <0x1b4>
 <2><1cf0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cf1>   DW_AT_type        : <0x1d00>
 <2><1cf5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cf6>   DW_AT_type        : <0x31>
 <2><1cfa>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1cfb>   DW_AT_type        : <0x19a1>
 <2><1cff>: Abbrev Number: 0
 <1><1d00>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1d01>   DW_AT_byte_size   : 8
    <1d01>   DW_AT_type        : <0x11d2>
 <1><1d05>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1d06>   DW_AT_external    : 1
    <1d06>   DW_AT_name        : (indirect string, offset: 0x31b0d): wcsspn
    <1d0a>   DW_AT_decl_file   : 443
    <1d0c>   DW_AT_decl_line   : 191
    <1d0d>   DW_AT_decl_column : 15
    <1d0e>   DW_AT_type        : <0x31>
    <1d12>   DW_AT_declaration : 1
    <1d12>   DW_AT_sibling     : <0x1d21>
 <2><1d16>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d17>   DW_AT_type        : <0x11d2>
 <2><1d1b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d1c>   DW_AT_type        : <0x11d2>
 <2><1d20>: Abbrev Number: 0
 <1><1d21>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1d22>   DW_AT_external    : 1
    <1d22>   DW_AT_name        : (indirect string, offset: 0x37e28): wcstod
    <1d26>   DW_AT_decl_file   : 443
    <1d28>   DW_AT_decl_line   : 377
    <1d2a>   DW_AT_decl_column : 15
    <1d2b>   DW_AT_type        : <0x338>
    <1d2f>   DW_AT_declaration : 1
    <1d2f>   DW_AT_sibling     : <0x1d3e>
 <2><1d33>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d34>   DW_AT_type        : <0x11d2>
 <2><1d38>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d39>   DW_AT_type        : <0x1d3e>
 <2><1d3d>: Abbrev Number: 0
 <1><1d3e>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <1d3f>   DW_AT_byte_size   : 8
    <1d3f>   DW_AT_type        : <0x10ae>
 <1><1d43>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1d44>   DW_AT_external    : 1
    <1d44>   DW_AT_name        : (indirect string, offset: 0x37e41): wcstof
    <1d48>   DW_AT_decl_file   : 443
    <1d4a>   DW_AT_decl_line   : 382
    <1d4c>   DW_AT_decl_column : 14
    <1d4d>   DW_AT_type        : <0x331>
    <1d51>   DW_AT_declaration : 1
    <1d51>   DW_AT_sibling     : <0x1d60>
 <2><1d55>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d56>   DW_AT_type        : <0x11d2>
 <2><1d5a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d5b>   DW_AT_type        : <0x1d3e>
 <2><1d5f>: Abbrev Number: 0
 <1><1d60>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1d61>   DW_AT_external    : 1
    <1d61>   DW_AT_name        : (indirect string, offset: 0x37e48): wcstok
    <1d65>   DW_AT_decl_file   : 443
    <1d67>   DW_AT_decl_line   : 217
    <1d68>   DW_AT_decl_column : 17
    <1d69>   DW_AT_type        : <0x10ae>
    <1d6d>   DW_AT_declaration : 1
    <1d6d>   DW_AT_sibling     : <0x1d81>
 <2><1d71>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d72>   DW_AT_type        : <0x10ae>
 <2><1d76>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d77>   DW_AT_type        : <0x11d2>
 <2><1d7b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d7c>   DW_AT_type        : <0x1d3e>
 <2><1d80>: Abbrev Number: 0
 <1><1d81>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1d82>   DW_AT_external    : 1
    <1d82>   DW_AT_name        : (indirect string, offset: 0x37e4f): wcstol
    <1d86>   DW_AT_decl_file   : 443
    <1d88>   DW_AT_decl_line   : 428
    <1d8a>   DW_AT_decl_column : 17
    <1d8b>   DW_AT_type        : <0x2a>
    <1d8f>   DW_AT_declaration : 1
    <1d8f>   DW_AT_sibling     : <0x1da3>
 <2><1d93>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d94>   DW_AT_type        : <0x11d2>
 <2><1d98>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d99>   DW_AT_type        : <0x1d3e>
 <2><1d9d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1d9e>   DW_AT_type        : <0xc1>
 <2><1da2>: Abbrev Number: 0
 <1><1da3>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1da4>   DW_AT_external    : 1
    <1da4>   DW_AT_name        : (indirect string, offset: 0x3e4a4): wcstoul
    <1da8>   DW_AT_decl_file   : 443
    <1daa>   DW_AT_decl_line   : 433
    <1dac>   DW_AT_decl_column : 26
    <1dad>   DW_AT_type        : <0x3e>
    <1db1>   DW_AT_declaration : 1
    <1db1>   DW_AT_sibling     : <0x1dc5>
 <2><1db5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1db6>   DW_AT_type        : <0x11d2>
 <2><1dba>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1dbb>   DW_AT_type        : <0x1d3e>
 <2><1dbf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1dc0>   DW_AT_type        : <0xc1>
 <2><1dc4>: Abbrev Number: 0
 <1><1dc5>: Abbrev Number: 28 (DW_TAG_subprogram)
    <1dc6>   DW_AT_external    : 1
    <1dc6>   DW_AT_name        : (indirect string, offset: 0x26311): wcsxfrm
    <1dca>   DW_AT_decl_file   : 443
    <1dcc>   DW_AT_decl_line   : 135
    <1dcd>   DW_AT_decl_column : 15
    <1dce>   DW_AT_type        : <0x31>
    <1dd2>   DW_AT_declaration : 1
    <1dd2>   DW_AT_sibling     : <0x1de6>
 <2><1dd6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1dd7>   DW_AT_type        : <0x10ae>
 <2><1ddb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ddc>   DW_AT_type        : <0x11d2>
 <2><1de0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1de1>   DW_AT_type        : <0x31>
 <2><1de5>: Abbrev Number: 0
 <1><1de6>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1de7>   DW_AT_external    : 1
    <1de7>   DW_AT_name        : (indirect string, offset: 0x1768e): wctob
    <1deb>   DW_AT_decl_file   : 443
    <1ded>   DW_AT_decl_line   : 288
    <1def>   DW_AT_decl_column : 12
    <1df0>   DW_AT_type        : <0xc1>
    <1df4>   DW_AT_declaration : 1
    <1df4>   DW_AT_sibling     : <0x1dfe>
 <2><1df8>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1df9>   DW_AT_type        : <0x184c>
 <2><1dfd>: Abbrev Number: 0
 <1><1dfe>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1dff>   DW_AT_external    : 1
    <1dff>   DW_AT_name        : (indirect string, offset: 0x50dd6): wmemcmp
    <1e03>   DW_AT_decl_file   : 443
    <1e05>   DW_AT_decl_line   : 258
    <1e07>   DW_AT_decl_column : 12
    <1e08>   DW_AT_type        : <0xc1>
    <1e0c>   DW_AT_declaration : 1
    <1e0c>   DW_AT_sibling     : <0x1e20>
 <2><1e10>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e11>   DW_AT_type        : <0x11d2>
 <2><1e15>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e16>   DW_AT_type        : <0x11d2>
 <2><1e1a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e1b>   DW_AT_type        : <0x31>
 <2><1e1f>: Abbrev Number: 0
 <1><1e20>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1e21>   DW_AT_external    : 1
    <1e21>   DW_AT_name        : (indirect string, offset: 0x51222): wmemcpy
    <1e25>   DW_AT_decl_file   : 443
    <1e27>   DW_AT_decl_line   : 262
    <1e29>   DW_AT_decl_column : 17
    <1e2a>   DW_AT_type        : <0x10ae>
    <1e2e>   DW_AT_declaration : 1
    <1e2e>   DW_AT_sibling     : <0x1e42>
 <2><1e32>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e33>   DW_AT_type        : <0x10ae>
 <2><1e37>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e38>   DW_AT_type        : <0x11d2>
 <2><1e3c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e3d>   DW_AT_type        : <0x31>
 <2><1e41>: Abbrev Number: 0
 <1><1e42>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1e43>   DW_AT_external    : 1
    <1e43>   DW_AT_name        : (indirect string, offset: 0x43d7e): wmemmove
    <1e47>   DW_AT_decl_file   : 443
    <1e49>   DW_AT_decl_line   : 267
    <1e4b>   DW_AT_decl_column : 17
    <1e4c>   DW_AT_type        : <0x10ae>
    <1e50>   DW_AT_declaration : 1
    <1e50>   DW_AT_sibling     : <0x1e64>
 <2><1e54>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e55>   DW_AT_type        : <0x10ae>
 <2><1e59>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e5a>   DW_AT_type        : <0x11d2>
 <2><1e5e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e5f>   DW_AT_type        : <0x31>
 <2><1e63>: Abbrev Number: 0
 <1><1e64>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1e65>   DW_AT_external    : 1
    <1e65>   DW_AT_name        : (indirect string, offset: 0x58ba1): wmemset
    <1e69>   DW_AT_decl_file   : 443
    <1e6b>   DW_AT_decl_line   : 271
    <1e6d>   DW_AT_decl_column : 17
    <1e6e>   DW_AT_type        : <0x10ae>
    <1e72>   DW_AT_declaration : 1
    <1e72>   DW_AT_sibling     : <0x1e86>
 <2><1e76>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e77>   DW_AT_type        : <0x10ae>
 <2><1e7b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e7c>   DW_AT_type        : <0x10b3>
 <2><1e80>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e81>   DW_AT_type        : <0x31>
 <2><1e85>: Abbrev Number: 0
 <1><1e86>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1e87>   DW_AT_external    : 1
    <1e87>   DW_AT_name        : (indirect string, offset: 0x4af7a): wprintf
    <1e8b>   DW_AT_decl_file   : 443
    <1e8d>   DW_AT_decl_line   : 587
    <1e8f>   DW_AT_decl_column : 12
    <1e90>   DW_AT_type        : <0xc1>
    <1e94>   DW_AT_declaration : 1
    <1e94>   DW_AT_sibling     : <0x1e9f>
 <2><1e98>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1e99>   DW_AT_type        : <0x11d2>
 <2><1e9d>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1e9e>: Abbrev Number: 0
 <1><1e9f>: Abbrev Number: 54 (DW_TAG_subprogram)
    <1ea0>   DW_AT_external    : 1
    <1ea0>   DW_AT_name        : (indirect string, offset: 0x538a4): wscanf
    <1ea4>   DW_AT_decl_file   : 443
    <1ea6>   DW_AT_decl_line   : 646
    <1ea8>   DW_AT_decl_column : 12
    <1ea9>   DW_AT_linkage_name: (indirect string, offset: 0x5389b): __isoc99_wscanf
    <1ead>   DW_AT_type        : <0xc1>
    <1eb1>   DW_AT_declaration : 1
    <1eb1>   DW_AT_sibling     : <0x1ebc>
 <2><1eb5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1eb6>   DW_AT_type        : <0x11d2>
 <2><1eba>: Abbrev Number: 60 (DW_TAG_unspecified_parameters)
 <2><1ebb>: Abbrev Number: 0
 <1><1ebc>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1ebd>   DW_AT_external    : 1
    <1ebd>   DW_AT_name        : (indirect string, offset: 0x28291): wcschr
    <1ec1>   DW_AT_decl_file   : 443
    <1ec1>   DW_AT_decl_line   : 161
    <1ec2>   DW_AT_decl_column : 29
    <1ec3>   DW_AT_linkage_name: (indirect string, offset: 0x28291): wcschr
    <1ec7>   DW_AT_type        : <0x11d2>
    <1ecb>   DW_AT_declaration : 1
    <1ecb>   DW_AT_sibling     : <0x1eda>
 <2><1ecf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ed0>   DW_AT_type        : <0x11d2>
 <2><1ed4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ed5>   DW_AT_type        : <0x10b3>
 <2><1ed9>: Abbrev Number: 0
 <1><1eda>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1edb>   DW_AT_external    : 1
    <1edb>   DW_AT_name        : (indirect string, offset: 0x28291): wcschr
    <1edf>   DW_AT_decl_file   : 443
    <1edf>   DW_AT_decl_line   : 159
    <1ee0>   DW_AT_decl_column : 23
    <1ee1>   DW_AT_linkage_name: (indirect string, offset: 0x28291): wcschr
    <1ee5>   DW_AT_type        : <0x10ae>
    <1ee9>   DW_AT_declaration : 1
    <1ee9>   DW_AT_sibling     : <0x1ef8>
 <2><1eed>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1eee>   DW_AT_type        : <0x10ae>
 <2><1ef2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1ef3>   DW_AT_type        : <0x10b3>
 <2><1ef7>: Abbrev Number: 0
 <1><1ef8>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1ef9>   DW_AT_external    : 1
    <1ef9>   DW_AT_name        : (indirect string, offset: 0x268fc): wcspbrk
    <1efd>   DW_AT_decl_file   : 443
    <1efd>   DW_AT_decl_line   : 197
    <1efe>   DW_AT_decl_column : 29
    <1eff>   DW_AT_linkage_name: (indirect string, offset: 0x268fc): wcspbrk
    <1f03>   DW_AT_type        : <0x11d2>
    <1f07>   DW_AT_declaration : 1
    <1f07>   DW_AT_sibling     : <0x1f16>
 <2><1f0b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f0c>   DW_AT_type        : <0x11d2>
 <2><1f10>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f11>   DW_AT_type        : <0x11d2>
 <2><1f15>: Abbrev Number: 0
 <1><1f16>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1f17>   DW_AT_external    : 1
    <1f17>   DW_AT_name        : (indirect string, offset: 0x268fc): wcspbrk
    <1f1b>   DW_AT_decl_file   : 443
    <1f1b>   DW_AT_decl_line   : 195
    <1f1c>   DW_AT_decl_column : 23
    <1f1d>   DW_AT_linkage_name: (indirect string, offset: 0x268fc): wcspbrk
    <1f21>   DW_AT_type        : <0x10ae>
    <1f25>   DW_AT_declaration : 1
    <1f25>   DW_AT_sibling     : <0x1f34>
 <2><1f29>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f2a>   DW_AT_type        : <0x10ae>
 <2><1f2e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f2f>   DW_AT_type        : <0x11d2>
 <2><1f33>: Abbrev Number: 0
 <1><1f34>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1f35>   DW_AT_external    : 1
    <1f35>   DW_AT_name        : (indirect string, offset: 0x3cc57): wcsrchr
    <1f39>   DW_AT_decl_file   : 443
    <1f39>   DW_AT_decl_line   : 171
    <1f3a>   DW_AT_decl_column : 29
    <1f3b>   DW_AT_linkage_name: (indirect string, offset: 0x3cc57): wcsrchr
    <1f3f>   DW_AT_type        : <0x11d2>
    <1f43>   DW_AT_declaration : 1
    <1f43>   DW_AT_sibling     : <0x1f52>
 <2><1f47>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f48>   DW_AT_type        : <0x11d2>
 <2><1f4c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f4d>   DW_AT_type        : <0x10b3>
 <2><1f51>: Abbrev Number: 0
 <1><1f52>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1f53>   DW_AT_external    : 1
    <1f53>   DW_AT_name        : (indirect string, offset: 0x3cc57): wcsrchr
    <1f57>   DW_AT_decl_file   : 443
    <1f57>   DW_AT_decl_line   : 169
    <1f58>   DW_AT_decl_column : 23
    <1f59>   DW_AT_linkage_name: (indirect string, offset: 0x3cc57): wcsrchr
    <1f5d>   DW_AT_type        : <0x10ae>
    <1f61>   DW_AT_declaration : 1
    <1f61>   DW_AT_sibling     : <0x1f70>
 <2><1f65>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f66>   DW_AT_type        : <0x10ae>
 <2><1f6a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f6b>   DW_AT_type        : <0x10b3>
 <2><1f6f>: Abbrev Number: 0
 <1><1f70>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1f71>   DW_AT_external    : 1
    <1f71>   DW_AT_name        : (indirect string, offset: 0x3211f): wcsstr
    <1f75>   DW_AT_decl_file   : 443
    <1f75>   DW_AT_decl_line   : 208
    <1f76>   DW_AT_decl_column : 29
    <1f77>   DW_AT_linkage_name: (indirect string, offset: 0x3211f): wcsstr
    <1f7b>   DW_AT_type        : <0x11d2>
    <1f7f>   DW_AT_declaration : 1
    <1f7f>   DW_AT_sibling     : <0x1f8e>
 <2><1f83>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f84>   DW_AT_type        : <0x11d2>
 <2><1f88>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1f89>   DW_AT_type        : <0x11d2>
 <2><1f8d>: Abbrev Number: 0
 <1><1f8e>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1f8f>   DW_AT_external    : 1
    <1f8f>   DW_AT_name        : (indirect string, offset: 0x3211f): wcsstr
    <1f93>   DW_AT_decl_file   : 443
    <1f93>   DW_AT_decl_line   : 206
    <1f94>   DW_AT_decl_column : 23
    <1f95>   DW_AT_linkage_name: (indirect string, offset: 0x3211f): wcsstr
    <1f99>   DW_AT_type        : <0x10ae>
    <1f9d>   DW_AT_declaration : 1
    <1f9d>   DW_AT_sibling     : <0x1fac>
 <2><1fa1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fa2>   DW_AT_type        : <0x10ae>
 <2><1fa6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fa7>   DW_AT_type        : <0x11d2>
 <2><1fab>: Abbrev Number: 0
 <1><1fac>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1fad>   DW_AT_external    : 1
    <1fad>   DW_AT_name        : (indirect string, offset: 0x50631): wmemchr
    <1fb1>   DW_AT_decl_file   : 443
    <1fb1>   DW_AT_decl_line   : 249
    <1fb2>   DW_AT_decl_column : 29
    <1fb3>   DW_AT_linkage_name: (indirect string, offset: 0x50631): wmemchr
    <1fb7>   DW_AT_type        : <0x11d2>
    <1fbb>   DW_AT_declaration : 1
    <1fbb>   DW_AT_sibling     : <0x1fcf>
 <2><1fbf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fc0>   DW_AT_type        : <0x11d2>
 <2><1fc4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fc5>   DW_AT_type        : <0x10b3>
 <2><1fc9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fca>   DW_AT_type        : <0x31>
 <2><1fce>: Abbrev Number: 0
 <1><1fcf>: Abbrev Number: 45 (DW_TAG_subprogram)
    <1fd0>   DW_AT_external    : 1
    <1fd0>   DW_AT_name        : (indirect string, offset: 0x50631): wmemchr
    <1fd4>   DW_AT_decl_file   : 443
    <1fd4>   DW_AT_decl_line   : 247
    <1fd5>   DW_AT_decl_column : 23
    <1fd6>   DW_AT_linkage_name: (indirect string, offset: 0x50631): wmemchr
    <1fda>   DW_AT_type        : <0x10ae>
    <1fde>   DW_AT_declaration : 1
    <1fde>   DW_AT_sibling     : <0x1ff2>
 <2><1fe2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fe3>   DW_AT_type        : <0x10ae>
 <2><1fe7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fe8>   DW_AT_type        : <0x10b3>
 <2><1fec>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <1fed>   DW_AT_type        : <0x31>
 <2><1ff1>: Abbrev Number: 0
 <1><1ff2>: Abbrev Number: 24 (DW_TAG_subprogram)
    <1ff3>   DW_AT_external    : 1
    <1ff3>   DW_AT_name        : (indirect string, offset: 0x3d7dd): wcstold
    <1ff7>   DW_AT_decl_file   : 443
    <1ff9>   DW_AT_decl_line   : 384
    <1ffb>   DW_AT_decl_column : 20
    <1ffc>   DW_AT_type        : <0x4c>
    <2000>   DW_AT_declaration : 1
    <2000>   DW_AT_sibling     : <0x200f>
 <2><2004>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2005>   DW_AT_type        : <0x11d2>
 <2><2009>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <200a>   DW_AT_type        : <0x1d3e>
 <2><200e>: Abbrev Number: 0
 <1><200f>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2010>   DW_AT_external    : 1
    <2010>   DW_AT_name        : (indirect string, offset: 0x3d825): wcstoll
    <2014>   DW_AT_decl_file   : 443
    <2016>   DW_AT_decl_line   : 441
    <2018>   DW_AT_decl_column : 22
    <2019>   DW_AT_type        : <0x45>
    <201d>   DW_AT_declaration : 1
    <201d>   DW_AT_sibling     : <0x2031>
 <2><2021>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2022>   DW_AT_type        : <0x11d2>
 <2><2026>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2027>   DW_AT_type        : <0x1d3e>
 <2><202b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <202c>   DW_AT_type        : <0xc1>
 <2><2030>: Abbrev Number: 0
 <1><2031>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2032>   DW_AT_external    : 1
    <2032>   DW_AT_name        : (indirect string, offset: 0x66fa): wcstoull
    <2036>   DW_AT_decl_file   : 443
    <2038>   DW_AT_decl_line   : 448
    <203a>   DW_AT_decl_column : 31
    <203b>   DW_AT_type        : <0x44d>
    <203f>   DW_AT_declaration : 1
    <203f>   DW_AT_sibling     : <0x2053>
 <2><2043>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2044>   DW_AT_type        : <0x11d2>
 <2><2048>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2049>   DW_AT_type        : <0x1d3e>
 <2><204d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <204e>   DW_AT_type        : <0xc1>
 <2><2052>: Abbrev Number: 0
 <1><2053>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <2054>   DW_AT_byte_size   : 8
    <2054>   DW_AT_type        : <0x950>
 <1><2058>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <2059>   DW_AT_byte_size   : 8
    <2059>   DW_AT_type        : <0xb03>
 <1><205d>: Abbrev Number: 69 (DW_TAG_reference_type)
    <205e>   DW_AT_byte_size   : 8
    <205e>   DW_AT_type        : <0xb03>
 <1><2062>: Abbrev Number: 125 (DW_TAG_rvalue_reference_type)
    <2063>   DW_AT_byte_size   : 8
    <2064>   DW_AT_type        : <0x950>
 <1><2068>: Abbrev Number: 69 (DW_TAG_reference_type)
    <2069>   DW_AT_byte_size   : 8
    <2069>   DW_AT_type        : <0x950>
 <1><206d>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <206e>   DW_AT_byte_size   : 8
    <206e>   DW_AT_type        : <0xb45>
 <1><2072>: Abbrev Number: 48 (DW_TAG_structure_type)
    <2073>   DW_AT_name        : (indirect string, offset: 0x4e8fc): lconv
    <2077>   DW_AT_byte_size   : 96
    <2078>   DW_AT_decl_file   : 444
    <207a>   DW_AT_decl_line   : 51
    <207b>   DW_AT_decl_column : 8
    <207c>   DW_AT_sibling     : <0x21d1>
 <2><2080>: Abbrev Number: 15 (DW_TAG_member)
    <2081>   DW_AT_name        : (indirect string, offset: 0x2929a): decimal_point
    <2085>   DW_AT_decl_file   : 444
    <2087>   DW_AT_decl_line   : 55
    <2088>   DW_AT_decl_column : 9
    <2089>   DW_AT_type        : <0x1b4>
    <208d>   DW_AT_data_member_location: 0
 <2><208e>: Abbrev Number: 15 (DW_TAG_member)
    <208f>   DW_AT_name        : (indirect string, offset: 0x364f4): thousands_sep
    <2093>   DW_AT_decl_file   : 444
    <2095>   DW_AT_decl_line   : 56
    <2096>   DW_AT_decl_column : 9
    <2097>   DW_AT_type        : <0x1b4>
    <209b>   DW_AT_data_member_location: 8
 <2><209c>: Abbrev Number: 15 (DW_TAG_member)
    <209d>   DW_AT_name        : (indirect string, offset: 0x4d872): grouping
    <20a1>   DW_AT_decl_file   : 444
    <20a3>   DW_AT_decl_line   : 62
    <20a4>   DW_AT_decl_column : 9
    <20a5>   DW_AT_type        : <0x1b4>
    <20a9>   DW_AT_data_member_location: 16
 <2><20aa>: Abbrev Number: 15 (DW_TAG_member)
    <20ab>   DW_AT_name        : (indirect string, offset: 0x40cd5): int_curr_symbol
    <20af>   DW_AT_decl_file   : 444
    <20b1>   DW_AT_decl_line   : 68
    <20b2>   DW_AT_decl_column : 9
    <20b3>   DW_AT_type        : <0x1b4>
    <20b7>   DW_AT_data_member_location: 24
 <2><20b8>: Abbrev Number: 15 (DW_TAG_member)
    <20b9>   DW_AT_name        : (indirect string, offset: 0x1c1e9): currency_symbol
    <20bd>   DW_AT_decl_file   : 444
    <20bf>   DW_AT_decl_line   : 69
    <20c0>   DW_AT_decl_column : 9
    <20c1>   DW_AT_type        : <0x1b4>
    <20c5>   DW_AT_data_member_location: 32
 <2><20c6>: Abbrev Number: 15 (DW_TAG_member)
    <20c7>   DW_AT_name        : (indirect string, offset: 0x29296): mon_decimal_point
    <20cb>   DW_AT_decl_file   : 444
    <20cd>   DW_AT_decl_line   : 70
    <20ce>   DW_AT_decl_column : 9
    <20cf>   DW_AT_type        : <0x1b4>
    <20d3>   DW_AT_data_member_location: 40
 <2><20d4>: Abbrev Number: 15 (DW_TAG_member)
    <20d5>   DW_AT_name        : (indirect string, offset: 0x364f0): mon_thousands_sep
    <20d9>   DW_AT_decl_file   : 444
    <20db>   DW_AT_decl_line   : 71
    <20dc>   DW_AT_decl_column : 9
    <20dd>   DW_AT_type        : <0x1b4>
    <20e1>   DW_AT_data_member_location: 48
 <2><20e2>: Abbrev Number: 15 (DW_TAG_member)
    <20e3>   DW_AT_name        : (indirect string, offset: 0x4d86e): mon_grouping
    <20e7>   DW_AT_decl_file   : 444
    <20e9>   DW_AT_decl_line   : 72
    <20ea>   DW_AT_decl_column : 9
    <20eb>   DW_AT_type        : <0x1b4>
    <20ef>   DW_AT_data_member_location: 56
 <2><20f0>: Abbrev Number: 15 (DW_TAG_member)
    <20f1>   DW_AT_name        : (indirect string, offset: 0x3e61f): positive_sign
    <20f5>   DW_AT_decl_file   : 444
    <20f7>   DW_AT_decl_line   : 73
    <20f8>   DW_AT_decl_column : 9
    <20f9>   DW_AT_type        : <0x1b4>
    <20fd>   DW_AT_data_member_location: 64
 <2><20fe>: Abbrev Number: 15 (DW_TAG_member)
    <20ff>   DW_AT_name        : (indirect string, offset: 0x1eb56): negative_sign
    <2103>   DW_AT_decl_file   : 444
    <2105>   DW_AT_decl_line   : 74
    <2106>   DW_AT_decl_column : 9
    <2107>   DW_AT_type        : <0x1b4>
    <210b>   DW_AT_data_member_location: 72
 <2><210c>: Abbrev Number: 15 (DW_TAG_member)
    <210d>   DW_AT_name        : (indirect string, offset: 0x3b06c): int_frac_digits
    <2111>   DW_AT_decl_file   : 444
    <2113>   DW_AT_decl_line   : 75
    <2114>   DW_AT_decl_column : 8
    <2115>   DW_AT_type        : <0x1b9>
    <2119>   DW_AT_data_member_location: 80
 <2><211a>: Abbrev Number: 15 (DW_TAG_member)
    <211b>   DW_AT_name        : (indirect string, offset: 0x3b070): frac_digits
    <211f>   DW_AT_decl_file   : 444
    <2121>   DW_AT_decl_line   : 76
    <2122>   DW_AT_decl_column : 8
    <2123>   DW_AT_type        : <0x1b9>
    <2127>   DW_AT_data_member_location: 81
 <2><2128>: Abbrev Number: 15 (DW_TAG_member)
    <2129>   DW_AT_name        : (indirect string, offset: 0x1d411): p_cs_precedes
    <212d>   DW_AT_decl_file   : 444
    <212f>   DW_AT_decl_line   : 78
    <2130>   DW_AT_decl_column : 8
    <2131>   DW_AT_type        : <0x1b9>
    <2135>   DW_AT_data_member_location: 82
 <2><2136>: Abbrev Number: 15 (DW_TAG_member)
    <2137>   DW_AT_name        : (indirect string, offset: 0x10fda): p_sep_by_space
    <213b>   DW_AT_decl_file   : 444
    <213d>   DW_AT_decl_line   : 80
    <213e>   DW_AT_decl_column : 8
    <213f>   DW_AT_type        : <0x1b9>
    <2143>   DW_AT_data_member_location: 83
 <2><2144>: Abbrev Number: 15 (DW_TAG_member)
    <2145>   DW_AT_name        : (indirect string, offset: 0x1c842): n_cs_precedes
    <2149>   DW_AT_decl_file   : 444
    <214b>   DW_AT_decl_line   : 82
    <214c>   DW_AT_decl_column : 8
    <214d>   DW_AT_type        : <0x1b9>
    <2151>   DW_AT_data_member_location: 84
 <2><2152>: Abbrev Number: 15 (DW_TAG_member)
    <2153>   DW_AT_name        : (indirect string, offset: 0x45d35): n_sep_by_space
    <2157>   DW_AT_decl_file   : 444
    <2159>   DW_AT_decl_line   : 84
    <215a>   DW_AT_decl_column : 8
    <215b>   DW_AT_type        : <0x1b9>
    <215f>   DW_AT_data_member_location: 85
 <2><2160>: Abbrev Number: 15 (DW_TAG_member)
    <2161>   DW_AT_name        : (indirect string, offset: 0x31ec3): p_sign_posn
    <2165>   DW_AT_decl_file   : 444
    <2167>   DW_AT_decl_line   : 91
    <2168>   DW_AT_decl_column : 8
    <2169>   DW_AT_type        : <0x1b9>
    <216d>   DW_AT_data_member_location: 86
 <2><216e>: Abbrev Number: 15 (DW_TAG_member)
    <216f>   DW_AT_name        : (indirect string, offset: 0x21ba7): n_sign_posn
    <2173>   DW_AT_decl_file   : 444
    <2175>   DW_AT_decl_line   : 92
    <2176>   DW_AT_decl_column : 8
    <2177>   DW_AT_type        : <0x1b9>
    <217b>   DW_AT_data_member_location: 87
 <2><217c>: Abbrev Number: 15 (DW_TAG_member)
    <217d>   DW_AT_name        : (indirect string, offset: 0x1d40d): int_p_cs_precedes
    <2181>   DW_AT_decl_file   : 444
    <2183>   DW_AT_decl_line   : 95
    <2184>   DW_AT_decl_column : 8
    <2185>   DW_AT_type        : <0x1b9>
    <2189>   DW_AT_data_member_location: 88
 <2><218a>: Abbrev Number: 15 (DW_TAG_member)
    <218b>   DW_AT_name        : (indirect string, offset: 0x10fd6): int_p_sep_by_space
    <218f>   DW_AT_decl_file   : 444
    <2191>   DW_AT_decl_line   : 97
    <2192>   DW_AT_decl_column : 8
    <2193>   DW_AT_type        : <0x1b9>
    <2197>   DW_AT_data_member_location: 89
 <2><2198>: Abbrev Number: 15 (DW_TAG_member)
    <2199>   DW_AT_name        : (indirect string, offset: 0x1c83e): int_n_cs_precedes
    <219d>   DW_AT_decl_file   : 444
    <219f>   DW_AT_decl_line   : 99
    <21a0>   DW_AT_decl_column : 8
    <21a1>   DW_AT_type        : <0x1b9>
    <21a5>   DW_AT_data_member_location: 90
 <2><21a6>: Abbrev Number: 15 (DW_TAG_member)
    <21a7>   DW_AT_name        : (indirect string, offset: 0x45d31): int_n_sep_by_space
    <21ab>   DW_AT_decl_file   : 444
    <21ad>   DW_AT_decl_line   : 101
    <21ae>   DW_AT_decl_column : 8
    <21af>   DW_AT_type        : <0x1b9>
    <21b3>   DW_AT_data_member_location: 91
 <2><21b4>: Abbrev Number: 15 (DW_TAG_member)
    <21b5>   DW_AT_name        : (indirect string, offset: 0x31ebf): int_p_sign_posn
    <21b9>   DW_AT_decl_file   : 444
    <21bb>   DW_AT_decl_line   : 108
    <21bc>   DW_AT_decl_column : 8
    <21bd>   DW_AT_type        : <0x1b9>
    <21c1>   DW_AT_data_member_location: 92
 <2><21c2>: Abbrev Number: 15 (DW_TAG_member)
    <21c3>   DW_AT_name        : (indirect string, offset: 0x21ba3): int_n_sign_posn
    <21c7>   DW_AT_decl_file   : 444
    <21c9>   DW_AT_decl_line   : 109
    <21ca>   DW_AT_decl_column : 8
    <21cb>   DW_AT_type        : <0x1b9>
    <21cf>   DW_AT_data_member_location: 93
 <2><21d0>: Abbrev Number: 0
 <1><21d1>: Abbrev Number: 28 (DW_TAG_subprogram)
    <21d2>   DW_AT_external    : 1
    <21d2>   DW_AT_name        : (indirect string, offset: 0x2231f): setlocale
    <21d6>   DW_AT_decl_file   : 444
    <21d8>   DW_AT_decl_line   : 122
    <21d9>   DW_AT_decl_column : 14
    <21da>   DW_AT_type        : <0x1b4>
    <21de>   DW_AT_declaration : 1
    <21de>   DW_AT_sibling     : <0x21ed>
 <2><21e2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <21e3>   DW_AT_type        : <0xc1>
 <2><21e7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <21e8>   DW_AT_type        : <0x401>
 <2><21ec>: Abbrev Number: 0
 <1><21ed>: Abbrev Number: 89 (DW_TAG_subprogram)
    <21ee>   DW_AT_external    : 1
    <21ee>   DW_AT_name        : (indirect string, offset: 0x4e634): localeconv
    <21f2>   DW_AT_decl_file   : 444
    <21f4>   DW_AT_decl_line   : 125
    <21f5>   DW_AT_decl_column : 22
    <21f6>   DW_AT_type        : <0x21fa>
    <21fa>   DW_AT_declaration : 1
 <1><21fa>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <21fb>   DW_AT_byte_size   : 8
    <21fb>   DW_AT_type        : <0x2072>
 <1><21ff>: Abbrev Number: 55 (DW_TAG_subprogram)
    <2200>   DW_AT_external    : 1
    <2200>   DW_AT_name        : (indirect string, offset: 0xefbe): clearerr
    <2204>   DW_AT_decl_file   : 438
    <2206>   DW_AT_decl_line   : 762
    <2208>   DW_AT_decl_column : 13
    <2208>   DW_AT_declaration : 1
    <2208>   DW_AT_sibling     : <0x2212>
 <2><220c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <220d>   DW_AT_type        : <0x174e>
 <2><2211>: Abbrev Number: 0
 <1><2212>: Abbrev Number: 28 (DW_TAG_subprogram)
    <2213>   DW_AT_external    : 1
    <2213>   DW_AT_name        : (indirect string, offset: 0x1c703): fclose
    <2217>   DW_AT_decl_file   : 438
    <2219>   DW_AT_decl_line   : 213
    <221a>   DW_AT_decl_column : 12
    <221b>   DW_AT_type        : <0xc1>
    <221f>   DW_AT_declaration : 1
    <221f>   DW_AT_sibling     : <0x2229>
 <2><2223>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2224>   DW_AT_type        : <0x174e>
 <2><2228>: Abbrev Number: 0
 <1><2229>: Abbrev Number: 24 (DW_TAG_subprogram)
    <222a>   DW_AT_external    : 1
    <222a>   DW_AT_name        : (indirect string, offset: 0x4087c): feof
    <222e>   DW_AT_decl_file   : 438
    <2230>   DW_AT_decl_line   : 764
    <2232>   DW_AT_decl_column : 12
    <2233>   DW_AT_type        : <0xc1>
    <2237>   DW_AT_declaration : 1
    <2237>   DW_AT_sibling     : <0x2241>
 <2><223b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <223c>   DW_AT_type        : <0x174e>
 <2><2240>: Abbrev Number: 0
 <1><2241>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2242>   DW_AT_external    : 1
    <2242>   DW_AT_name        : (indirect string, offset: 0xe261): ferror
    <2246>   DW_AT_decl_file   : 438
    <2248>   DW_AT_decl_line   : 766
    <224a>   DW_AT_decl_column : 12
    <224b>   DW_AT_type        : <0xc1>
    <224f>   DW_AT_declaration : 1
    <224f>   DW_AT_sibling     : <0x2259>
 <2><2253>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2254>   DW_AT_type        : <0x174e>
 <2><2258>: Abbrev Number: 0
 <1><2259>: Abbrev Number: 28 (DW_TAG_subprogram)
    <225a>   DW_AT_external    : 1
    <225a>   DW_AT_name        : (indirect string, offset: 0x22dda): fflush
    <225e>   DW_AT_decl_file   : 438
    <2260>   DW_AT_decl_line   : 218
    <2261>   DW_AT_decl_column : 12
    <2262>   DW_AT_type        : <0xc1>
    <2266>   DW_AT_declaration : 1
    <2266>   DW_AT_sibling     : <0x2270>
 <2><226a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <226b>   DW_AT_type        : <0x174e>
 <2><226f>: Abbrev Number: 0
 <1><2270>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2271>   DW_AT_external    : 1
    <2271>   DW_AT_name        : (indirect string, offset: 0x136e8): fgetc
    <2275>   DW_AT_decl_file   : 438
    <2277>   DW_AT_decl_line   : 489
    <2279>   DW_AT_decl_column : 12
    <227a>   DW_AT_type        : <0xc1>
    <227e>   DW_AT_declaration : 1
    <227e>   DW_AT_sibling     : <0x2288>
 <2><2282>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2283>   DW_AT_type        : <0x174e>
 <2><2287>: Abbrev Number: 0
 <1><2288>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2289>   DW_AT_external    : 1
    <2289>   DW_AT_name        : (indirect string, offset: 0x57e61): fgetpos
    <228d>   DW_AT_decl_file   : 438
    <228f>   DW_AT_decl_line   : 736
    <2291>   DW_AT_decl_column : 12
    <2292>   DW_AT_type        : <0xc1>
    <2296>   DW_AT_declaration : 1
    <2296>   DW_AT_sibling     : <0x22a5>
 <2><229a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <229b>   DW_AT_type        : <0x174e>
 <2><229f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22a0>   DW_AT_type        : <0x22a5>
 <2><22a4>: Abbrev Number: 0
 <1><22a5>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <22a6>   DW_AT_byte_size   : 8
    <22a6>   DW_AT_type        : <0x173c>
 <1><22aa>: Abbrev Number: 24 (DW_TAG_subprogram)
    <22ab>   DW_AT_external    : 1
    <22ab>   DW_AT_name        : (indirect string, offset: 0x13724): fgets
    <22af>   DW_AT_decl_file   : 438
    <22b1>   DW_AT_decl_line   : 568
    <22b3>   DW_AT_decl_column : 14
    <22b4>   DW_AT_type        : <0x1b4>
    <22b8>   DW_AT_declaration : 1
    <22b8>   DW_AT_sibling     : <0x22cc>
 <2><22bc>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22bd>   DW_AT_type        : <0x1b4>
 <2><22c1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22c2>   DW_AT_type        : <0xc1>
 <2><22c6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22c7>   DW_AT_type        : <0x174e>
 <2><22cb>: Abbrev Number: 0
 <1><22cc>: Abbrev Number: 28 (DW_TAG_subprogram)
    <22cd>   DW_AT_external    : 1
    <22cd>   DW_AT_name        : (indirect string, offset: 0x3f063): fopen
    <22d1>   DW_AT_decl_file   : 438
    <22d3>   DW_AT_decl_line   : 246
    <22d4>   DW_AT_decl_column : 14
    <22d5>   DW_AT_type        : <0x174e>
    <22d9>   DW_AT_declaration : 1
    <22d9>   DW_AT_sibling     : <0x22e8>
 <2><22dd>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22de>   DW_AT_type        : <0x401>
 <2><22e2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22e3>   DW_AT_type        : <0x401>
 <2><22e7>: Abbrev Number: 0
 <1><22e8>: Abbrev Number: 24 (DW_TAG_subprogram)
    <22e9>   DW_AT_external    : 1
    <22e9>   DW_AT_name        : (indirect string, offset: 0x40274): fread
    <22ed>   DW_AT_decl_file   : 438
    <22ef>   DW_AT_decl_line   : 651
    <22f1>   DW_AT_decl_column : 15
    <22f2>   DW_AT_type        : <0x31>
    <22f6>   DW_AT_declaration : 1
    <22f6>   DW_AT_sibling     : <0x230f>
 <2><22fa>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <22fb>   DW_AT_type        : <0x1b2>
 <2><22ff>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2300>   DW_AT_type        : <0x31>
 <2><2304>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2305>   DW_AT_type        : <0x31>
 <2><2309>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <230a>   DW_AT_type        : <0x174e>
 <2><230e>: Abbrev Number: 0
 <1><230f>: Abbrev Number: 28 (DW_TAG_subprogram)
    <2310>   DW_AT_external    : 1
    <2310>   DW_AT_name        : (indirect string, offset: 0x510e0): freopen
    <2314>   DW_AT_decl_file   : 438
    <2316>   DW_AT_decl_line   : 252
    <2317>   DW_AT_decl_column : 14
    <2318>   DW_AT_type        : <0x174e>
    <231c>   DW_AT_declaration : 1
    <231c>   DW_AT_sibling     : <0x2330>
 <2><2320>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2321>   DW_AT_type        : <0x401>
 <2><2325>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2326>   DW_AT_type        : <0x401>
 <2><232a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <232b>   DW_AT_type        : <0x174e>
 <2><232f>: Abbrev Number: 0
 <1><2330>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2331>   DW_AT_external    : 1
    <2331>   DW_AT_name        : (indirect string, offset: 0x19ffc): fseek
    <2335>   DW_AT_decl_file   : 438
    <2337>   DW_AT_decl_line   : 689
    <2339>   DW_AT_decl_column : 12
    <233a>   DW_AT_type        : <0xc1>
    <233e>   DW_AT_declaration : 1
    <233e>   DW_AT_sibling     : <0x2352>
 <2><2342>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2343>   DW_AT_type        : <0x174e>
 <2><2347>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2348>   DW_AT_type        : <0x2a>
 <2><234c>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <234d>   DW_AT_type        : <0xc1>
 <2><2351>: Abbrev Number: 0
 <1><2352>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2353>   DW_AT_external    : 1
    <2353>   DW_AT_name        : (indirect string, offset: 0x4ca45): fsetpos
    <2357>   DW_AT_decl_file   : 438
    <2359>   DW_AT_decl_line   : 741
    <235b>   DW_AT_decl_column : 12
    <235c>   DW_AT_type        : <0xc1>
    <2360>   DW_AT_declaration : 1
    <2360>   DW_AT_sibling     : <0x236f>
 <2><2364>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2365>   DW_AT_type        : <0x174e>
 <2><2369>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <236a>   DW_AT_type        : <0x236f>
 <2><236e>: Abbrev Number: 0
 <1><236f>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <2370>   DW_AT_byte_size   : 8
    <2370>   DW_AT_type        : <0x1749>
 <1><2374>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2375>   DW_AT_external    : 1
    <2375>   DW_AT_name        : (indirect string, offset: 0x51fb4): ftell
    <2379>   DW_AT_decl_file   : 438
    <237b>   DW_AT_decl_line   : 694
    <237d>   DW_AT_decl_column : 17
    <237e>   DW_AT_type        : <0x2a>
    <2382>   DW_AT_declaration : 1
    <2382>   DW_AT_sibling     : <0x238c>
 <2><2386>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2387>   DW_AT_type        : <0x174e>
 <2><238b>: Abbrev Number: 0
 <1><238c>: Abbrev Number: 24 (DW_TAG_subprogram)
    <238d>   DW_AT_external    : 1
    <238d>   DW_AT_name        : (indirect string, offset: 0x136e9): getc
    <2391>   DW_AT_decl_file   : 438
    <2393>   DW_AT_decl_line   : 490
    <2395>   DW_AT_decl_column : 12
    <2396>   DW_AT_type        : <0xc1>
    <239a>   DW_AT_declaration : 1
    <239a>   DW_AT_sibling     : <0x23a4>
 <2><239e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <239f>   DW_AT_type        : <0x174e>
 <2><23a3>: Abbrev Number: 0
 <1><23a4>: Abbrev Number: 66 (DW_TAG_subprogram)
    <23a5>   DW_AT_external    : 1
    <23a5>   DW_AT_name        : (indirect string, offset: 0x8f09f): getchar
    <23a9>   DW_AT_decl_file   : 438
    <23ab>   DW_AT_decl_line   : 496
    <23ad>   DW_AT_decl_column : 12
    <23ae>   DW_AT_type        : <0xc1>
    <23b2>   DW_AT_declaration : 1
 <1><23b2>: Abbrev Number: 55 (DW_TAG_subprogram)
    <23b3>   DW_AT_external    : 1
    <23b3>   DW_AT_name        : (indirect string, offset: 0x416f): perror
    <23b7>   DW_AT_decl_file   : 438
    <23b9>   DW_AT_decl_line   : 780
    <23bb>   DW_AT_decl_column : 13
    <23bb>   DW_AT_declaration : 1
    <23bb>   DW_AT_sibling     : <0x23c5>
 <2><23bf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <23c0>   DW_AT_type        : <0x401>
 <2><23c4>: Abbrev Number: 0
 <1><23c5>: Abbrev Number: 28 (DW_TAG_subprogram)
    <23c6>   DW_AT_external    : 1
    <23c6>   DW_AT_name        : (indirect string, offset: 0x6ed27): remove
    <23ca>   DW_AT_decl_file   : 438
    <23cc>   DW_AT_decl_line   : 146
    <23cd>   DW_AT_decl_column : 12
    <23ce>   DW_AT_type        : <0xc1>
    <23d2>   DW_AT_declaration : 1
    <23d2>   DW_AT_sibling     : <0x23dc>
 <2><23d6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <23d7>   DW_AT_type        : <0x401>
 <2><23db>: Abbrev Number: 0
 <1><23dc>: Abbrev Number: 28 (DW_TAG_subprogram)
    <23dd>   DW_AT_external    : 1
    <23dd>   DW_AT_name        : (indirect string, offset: 0x2eb8f): rename
    <23e1>   DW_AT_decl_file   : 438
    <23e3>   DW_AT_decl_line   : 148
    <23e4>   DW_AT_decl_column : 12
    <23e5>   DW_AT_type        : <0xc1>
    <23e9>   DW_AT_declaration : 1
    <23e9>   DW_AT_sibling     : <0x23f8>
 <2><23ed>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <23ee>   DW_AT_type        : <0x401>
 <2><23f2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <23f3>   DW_AT_type        : <0x401>
 <2><23f7>: Abbrev Number: 0
 <1><23f8>: Abbrev Number: 55 (DW_TAG_subprogram)
    <23f9>   DW_AT_external    : 1
    <23f9>   DW_AT_name        : (indirect string, offset: 0x21bf1): rewind
    <23fd>   DW_AT_decl_file   : 438
    <23ff>   DW_AT_decl_line   : 699
    <2401>   DW_AT_decl_column : 13
    <2401>   DW_AT_declaration : 1
    <2401>   DW_AT_sibling     : <0x240b>
 <2><2405>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2406>   DW_AT_type        : <0x174e>
 <2><240a>: Abbrev Number: 0
 <1><240b>: Abbrev Number: 55 (DW_TAG_subprogram)
    <240c>   DW_AT_external    : 1
    <240c>   DW_AT_name        : (indirect string, offset: 0x9d68): setbuf
    <2410>   DW_AT_decl_file   : 438
    <2412>   DW_AT_decl_line   : 304
    <2414>   DW_AT_decl_column : 13
    <2414>   DW_AT_declaration : 1
    <2414>   DW_AT_sibling     : <0x2423>
 <2><2418>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2419>   DW_AT_type        : <0x174e>
 <2><241d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <241e>   DW_AT_type        : <0x1b4>
 <2><2422>: Abbrev Number: 0
 <1><2423>: Abbrev Number: 24 (DW_TAG_subprogram)
    <2424>   DW_AT_external    : 1
    <2424>   DW_AT_name        : (indirect string, offset: 0x1c665): setvbuf
    <2428>   DW_AT_decl_file   : 438
    <242a>   DW_AT_decl_line   : 308
    <242c>   DW_AT_decl_column : 12
    <242d>   DW_AT_type        : <0xc1>
    <2431>   DW_AT_declaration : 1
    <2431>   DW_AT_sibling     : <0x244a>
 <2><2435>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2436>   DW_AT_type        : <0x174e>
 <2><243a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <243b>   DW_AT_type        : <0x1b4>
 <2><243f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2440>   DW_AT_type        : <0xc1>
 <2><2444>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2445>   DW_AT_type        : <0x31>
 <2><2449>: Abbrev Number: 0
 <1><244a>: Abbrev Number: 89 (DW_TAG_subprogram)
    <244b>   DW_AT_external    : 1
    <244b>   DW_AT_name        : (indirect string, offset: 0x1f620): tmpfile
    <244f>   DW_AT_decl_file   : 438
    <2451>   DW_AT_decl_line   : 173
    <2452>   DW_AT_decl_column : 14
    <2453>   DW_AT_type        : <0x174e>
    <2457>   DW_AT_declaration : 1
 <1><2457>: Abbrev Number: 28 (DW_TAG_subprogram)
    <2458>   DW_AT_external    : 1
    <2458>   DW_AT_name        : (indirect string, offset: 0x58f47): tmpnam
    <245c>   DW_AT_decl_file   : 438
    <245e>   DW_AT_decl_line   : 187
    <245f>   DW_AT_decl_column : 14
    <2460>   DW_AT_type        : <0x1b4>
    <2464>   DW_AT_declaration : 1
    <2464>   DW_AT_sibling     : <0x246e>
 <2><2468>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2469>   DW_AT_type        : <0x1b4>
 <2><246d>: Abbrev Number: 0
 <1><246e>: Abbrev Number: 24 (DW_TAG_subprogram)
    <246f>   DW_AT_external    : 1
    <246f>   DW_AT_name        : (indirect string, offset: 0x36a9f): ungetc
    <2473>   DW_AT_decl_file   : 438
    <2475>   DW_AT_decl_line   : 644
    <2477>   DW_AT_decl_column : 12
    <2478>   DW_AT_type        : <0xc1>
    <247c>   DW_AT_declaration : 1
    <247c>   DW_AT_sibling     : <0x248b>
 <2><2480>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2481>   DW_AT_type        : <0xc1>
 <2><2485>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2486>   DW_AT_type        : <0x174e>
 <2><248a>: Abbrev Number: 0
 <1><248b>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <248c>   DW_AT_byte_size   : 8
    <248c>   DW_AT_type        : <0xd70>
 <1><2490>: Abbrev Number: 42 (DW_TAG_const_type)
    <2491>   DW_AT_type        : <0x248b>
 <1><2495>: Abbrev Number: 69 (DW_TAG_reference_type)
    <2496>   DW_AT_byte_size   : 8
    <2496>   DW_AT_type        : <0xdfe>
 <1><249a>: Abbrev Number: 69 (DW_TAG_reference_type)
    <249b>   DW_AT_byte_size   : 8
    <249b>   DW_AT_type        : <0xd70>
 <1><249f>: Abbrev Number: 22 (DW_TAG_typedef)
    <24a0>   DW_AT_name        : (indirect string, offset: 0x1c6fa): wctype_t
    <24a4>   DW_AT_decl_file   : 445
    <24a6>   DW_AT_decl_line   : 38
    <24a7>   DW_AT_decl_column : 27
    <24a8>   DW_AT_type        : <0x3e>
 <1><24ac>: Abbrev Number: 22 (DW_TAG_typedef)
    <24ad>   DW_AT_name        : (indirect string, offset: 0x2b9ad): wctrans_t
    <24b1>   DW_AT_decl_file   : 446
    <24b3>   DW_AT_decl_line   : 48
    <24b4>   DW_AT_decl_column : 26
    <24b5>   DW_AT_type        : <0x24b9>
 <1><24b9>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <24ba>   DW_AT_byte_size   : 8
    <24ba>   DW_AT_type        : <0xbc>
 <1><24be>: Abbrev Number: 28 (DW_TAG_subprogram)
    <24bf>   DW_AT_external    : 1
    <24bf>   DW_AT_name        : (indirect string, offset: 0xef30): iswctype
    <24c3>   DW_AT_decl_file   : 445
    <24c5>   DW_AT_decl_line   : 159
    <24c6>   DW_AT_decl_column : 12
    <24c7>   DW_AT_type        : <0xc1>
    <24cb>   DW_AT_declaration : 1
    <24cb>   DW_AT_sibling     : <0x24da>
 <2><24cf>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <24d0>   DW_AT_type        : <0x184c>
 <2><24d4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <24d5>   DW_AT_type        : <0x249f>
 <2><24d9>: Abbrev Number: 0
 <1><24da>: Abbrev Number: 28 (DW_TAG_subprogram)
    <24db>   DW_AT_external    : 1
    <24db>   DW_AT_name        : (indirect string, offset: 0x1ef35): towctrans
    <24df>   DW_AT_decl_file   : 446
    <24e1>   DW_AT_decl_line   : 55
    <24e2>   DW_AT_decl_column : 15
    <24e3>   DW_AT_type        : <0x184c>
    <24e7>   DW_AT_declaration : 1
    <24e7>   DW_AT_sibling     : <0x24f6>
 <2><24eb>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <24ec>   DW_AT_type        : <0x184c>
 <2><24f0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <24f1>   DW_AT_type        : <0x24ac>
 <2><24f5>: Abbrev Number: 0
 <1><24f6>: Abbrev Number: 28 (DW_TAG_subprogram)
    <24f7>   DW_AT_external    : 1
    <24f7>   DW_AT_name        : (indirect string, offset: 0x1ef37): wctrans
    <24fb>   DW_AT_decl_file   : 446
    <24fd>   DW_AT_decl_line   : 52
    <24fe>   DW_AT_decl_column : 18
    <24ff>   DW_AT_type        : <0x24ac>
    <2503>   DW_AT_declaration : 1
    <2503>   DW_AT_sibling     : <0x250d>
 <2><2507>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2508>   DW_AT_type        : <0x401>
 <2><250c>: Abbrev Number: 0
 <1><250d>: Abbrev Number: 28 (DW_TAG_subprogram)
    <250e>   DW_AT_external    : 1
    <250e>   DW_AT_name        : (indirect string, offset: 0xef32): wctype
    <2512>   DW_AT_decl_file   : 445
    <2514>   DW_AT_decl_line   : 155
    <2515>   DW_AT_decl_column : 17
    <2516>   DW_AT_type        : <0x249f>
    <251a>   DW_AT_declaration : 1
    <251a>   DW_AT_sibling     : <0x2524>
 <2><251e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <251f>   DW_AT_type        : <0x401>
 <2><2523>: Abbrev Number: 0
 <1><2524>: Abbrev Number: 126 (DW_TAG_variable)
    <2525>   DW_AT_specification: <0xe43>
    <2529>   DW_AT_location    : 9 byte block: 3 60 b b9 0 0 0 0 0 	(DW_OP_addr: b90b60)
 <1><2533>: Abbrev Number: 127 (DW_TAG_enumeration_type)
    <2534>   DW_AT_name        : (indirect string, offset: 0x5a116): __pid_type
    <2538>   DW_AT_encoding    : 7	(unsigned)
    <2539>   DW_AT_byte_size   : 4
    <253a>   DW_AT_type        : <0x66>
    <253e>   DW_AT_decl_file   : 455
    <2540>   DW_AT_decl_line   : 265
    <2542>   DW_AT_decl_column : 6
    <2543>   DW_AT_sibling     : <0x2560>
 <2><2547>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2548>   DW_AT_name        : (indirect string, offset: 0x3fc3e): F_OWNER_TID
    <254c>   DW_AT_const_value : 0
 <2><254d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <254e>   DW_AT_name        : (indirect string, offset: 0x2651c): F_OWNER_PID
    <2552>   DW_AT_const_value : 1
 <2><2553>: Abbrev Number: 13 (DW_TAG_enumerator)
    <2554>   DW_AT_name        : (indirect string, offset: 0x3f53e): F_OWNER_PGRP
    <2558>   DW_AT_const_value : 2
 <2><2559>: Abbrev Number: 13 (DW_TAG_enumerator)
    <255a>   DW_AT_name        : (indirect string, offset: 0x4a1b6): F_OWNER_GID
    <255e>   DW_AT_const_value : 2
 <2><255f>: Abbrev Number: 0
 <1><2560>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <2561>   DW_AT_byte_size   : 8
    <2561>   DW_AT_type        : <0x2565>
 <1><2565>: Abbrev Number: 90 (DW_TAG_subroutine_type)
    <2566>   DW_AT_sibling     : <0x2570>
 <2><256a>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <256b>   DW_AT_type        : <0xc1>
 <2><256f>: Abbrev Number: 0
 <1><2570>: Abbrev Number: 128 (DW_TAG_union_type)
    <2572>   DW_AT_name        : (indirect string, offset: 0x347b3): sigval
    <2576>   DW_AT_byte_size   : 8
    <2577>   DW_AT_decl_file   : 447
    <2579>   DW_AT_decl_line   : 24
    <257a>   DW_AT_decl_column : 7
    <257b>   DW_AT_sibling     : <0x259a>
 <2><257f>: Abbrev Number: 37 (DW_TAG_member)
    <2580>   DW_AT_name        : (indirect string, offset: 0x36984): sival_int
    <2584>   DW_AT_decl_file   : 447
    <2586>   DW_AT_decl_line   : 26
    <2587>   DW_AT_decl_column : 7
    <2588>   DW_AT_type        : <0xc1>
 <2><258c>: Abbrev Number: 37 (DW_TAG_member)
    <258d>   DW_AT_name        : (indirect string, offset: 0x6035): sival_ptr
    <2591>   DW_AT_decl_file   : 447
    <2593>   DW_AT_decl_line   : 27
    <2594>   DW_AT_decl_column : 9
    <2595>   DW_AT_type        : <0x1b2>
 <2><2599>: Abbrev Number: 0
 <1><259a>: Abbrev Number: 22 (DW_TAG_typedef)
    <259b>   DW_AT_name        : (indirect string, offset: 0x4571a): __sigval_t
    <259f>   DW_AT_decl_file   : 447
    <25a1>   DW_AT_decl_line   : 30
    <25a2>   DW_AT_decl_column : 22
    <25a3>   DW_AT_type        : <0x2570>
 <1><25a7>: Abbrev Number: 58 (DW_TAG_structure_type)
    <25a8>   DW_AT_byte_size   : 128
    <25a9>   DW_AT_decl_file   : 448
    <25ab>   DW_AT_decl_line   : 37
    <25ac>   DW_AT_decl_column : 3
    <25ad>   DW_AT_linkage_name: (indirect string, offset: 0x5b601): 9siginfo_t
    <25b1>   DW_AT_sibling     : <0x281f>
 <2><25b5>: Abbrev Number: 68 (DW_TAG_union_type)
    <25b6>   DW_AT_byte_size   : 112
    <25b7>   DW_AT_decl_file   : 448
    <25b9>   DW_AT_decl_line   : 52
    <25ba>   DW_AT_decl_column : 7
    <25bb>   DW_AT_sibling     : <0x27d8>
 <3><25bf>: Abbrev Number: 50 (DW_TAG_structure_type)
    <25c0>   DW_AT_byte_size   : 8
    <25c1>   DW_AT_decl_file   : 448
    <25c1>   DW_AT_decl_line   : 57
    <25c2>   DW_AT_decl_column : 4
    <25c3>   DW_AT_sibling     : <0x25e4>
 <4><25c7>: Abbrev Number: 15 (DW_TAG_member)
    <25c8>   DW_AT_name        : (indirect string, offset: 0x50e7b): si_pid
    <25cc>   DW_AT_decl_file   : 448
    <25ce>   DW_AT_decl_line   : 58
    <25cf>   DW_AT_decl_column : 14
    <25d0>   DW_AT_type        : <0x198>
    <25d4>   DW_AT_data_member_location: 0
 <4><25d5>: Abbrev Number: 15 (DW_TAG_member)
    <25d6>   DW_AT_name        : (indirect string, offset: 0x1310b): si_uid
    <25da>   DW_AT_decl_file   : 448
    <25dc>   DW_AT_decl_line   : 59
    <25dd>   DW_AT_decl_column : 14
    <25de>   DW_AT_type        : <0x171>
    <25e2>   DW_AT_data_member_location: 4
 <4><25e3>: Abbrev Number: 0
 <3><25e4>: Abbrev Number: 50 (DW_TAG_structure_type)
    <25e5>   DW_AT_byte_size   : 16
    <25e6>   DW_AT_decl_file   : 448
    <25e6>   DW_AT_decl_line   : 64
    <25e7>   DW_AT_decl_column : 4
    <25e8>   DW_AT_sibling     : <0x2617>
 <4><25ec>: Abbrev Number: 15 (DW_TAG_member)
    <25ed>   DW_AT_name        : (indirect string, offset: 0xcc03): si_tid
    <25f1>   DW_AT_decl_file   : 448
    <25f3>   DW_AT_decl_line   : 65
    <25f4>   DW_AT_decl_column : 10
    <25f5>   DW_AT_type        : <0xc1>
    <25f9>   DW_AT_data_member_location: 0
 <4><25fa>: Abbrev Number: 15 (DW_TAG_member)
    <25fb>   DW_AT_name        : (indirect string, offset: 0x322eb): si_overrun
    <25ff>   DW_AT_decl_file   : 448
    <2601>   DW_AT_decl_line   : 66
    <2602>   DW_AT_decl_column : 10
    <2603>   DW_AT_type        : <0xc1>
    <2607>   DW_AT_data_member_location: 4
 <4><2608>: Abbrev Number: 15 (DW_TAG_member)
    <2609>   DW_AT_name        : (indirect string, offset: 0x347b0): si_sigval
    <260d>   DW_AT_decl_file   : 448
    <260f>   DW_AT_decl_line   : 67
    <2610>   DW_AT_decl_column : 17
    <2611>   DW_AT_type        : <0x259a>
    <2615>   DW_AT_data_member_location: 8
 <4><2616>: Abbrev Number: 0
 <3><2617>: Abbrev Number: 50 (DW_TAG_structure_type)
    <2618>   DW_AT_byte_size   : 16
    <2619>   DW_AT_decl_file   : 448
    <2619>   DW_AT_decl_line   : 72
    <261a>   DW_AT_decl_column : 4
    <261b>   DW_AT_sibling     : <0x264a>
 <4><261f>: Abbrev Number: 15 (DW_TAG_member)
