 <1><fdb0a>: Abbrev Number: 4 (DW_TAG_array_type)
    <fdb0b>   DW_AT_type        : <0xfd7a2>
    <fdb0f>   DW_AT_sibling     : <0xfdb1a>
 <2><fdb13>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <fdb14>   DW_AT_type        : <0xfd6a9>
    <fdb18>   DW_AT_upper_bound : 15
 <2><fdb19>: Abbrev Number: 0
 <1><fdb1a>: Abbrev Number: 2 (DW_TAG_const_type)
    <fdb1b>   DW_AT_type        : <0xfdb0a>
 <1><fdb1f>: Abbrev Number: 6 (DW_TAG_variable)
    <fdb20>   DW_AT_name        : (indirect string, offset: 0x9cd59): ch37st1
    <fdb24>   DW_AT_decl_file   : 3
    <fdb24>   DW_AT_decl_line   : 184
    <fdb25>   DW_AT_decl_column : 31
    <fdb26>   DW_AT_type        : <0xfdb1a>
    <fdb2a>   DW_AT_location    : 9 byte block: 3 40 d4 a4 0 0 0 0 0 	(DW_OP_addr: a4d440)
 <1><fdb34>: Abbrev Number: 4 (DW_TAG_array_type)
    <fdb35>   DW_AT_type        : <0xfd7a2>
    <fdb39>   DW_AT_sibling     : <0xfdb44>
 <2><fdb3d>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <fdb3e>   DW_AT_type        : <0xfd6a9>
    <fdb42>   DW_AT_upper_bound : 10
 <2><fdb43>: Abbrev Number: 0
 <1><fdb44>: Abbrev Number: 2 (DW_TAG_const_type)
    <fdb45>   DW_AT_type        : <0xfdb34>
 <1><fdb49>: Abbrev Number: 6 (DW_TAG_variable)
    <fdb4a>   DW_AT_name        : (indirect string, offset: 0x9cd61): ch37st2
    <fdb4e>   DW_AT_decl_file   : 3
    <fdb4e>   DW_AT_decl_line   : 204
    <fdb4f>   DW_AT_decl_column : 31
    <fdb50>   DW_AT_type        : <0xfdb44>

    <ffc31>   DW_AT_decl_column : 1
    <ffc32>   DW_AT_sibling     : <0xffce5>
 <2><ffc36>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc37>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <ffc3b>   DW_AT_const_value : 0
 <2><ffc3c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc3d>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <ffc41>   DW_AT_const_value : 1
 <2><ffc42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc43>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <ffc47>   DW_AT_const_value : 2
 <2><ffc48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc49>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <ffc4d>   DW_AT_const_value : 3
 <2><ffc4e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc4f>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <ffc53>   DW_AT_const_value : 4
 <2><ffc54>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc55>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <ffc59>   DW_AT_const_value : 5
 <2><ffc5a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc5b>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <ffc5f>   DW_AT_const_value : 6
 <2><ffc60>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc61>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <ffc65>   DW_AT_const_value : 7
 <2><ffc66>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc67>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <ffc6b>   DW_AT_const_value : 8
 <2><ffc6c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc6d>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <ffc71>   DW_AT_const_value : 9
 <2><ffc72>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc73>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <ffc77>   DW_AT_const_value : 10
 <2><ffc78>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc79>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <ffc7d>   DW_AT_const_value : 11
 <2><ffc7e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc7f>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <ffc83>   DW_AT_const_value : 12
 <2><ffc84>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc85>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <ffc89>   DW_AT_const_value : 13
 <2><ffc8a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc8b>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <ffc8f>   DW_AT_const_value : 14
 <2><ffc90>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc91>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <ffc95>   DW_AT_const_value : 15
 <2><ffc96>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc97>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <ffc9b>   DW_AT_const_value : 16
 <2><ffc9c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffc9d>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <ffca1>   DW_AT_const_value : 17
 <2><ffca2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffca3>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <ffca7>   DW_AT_const_value : 18
 <2><ffca8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffca9>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <ffcad>   DW_AT_const_value : 19
 <2><ffcae>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcaf>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <ffcb3>   DW_AT_const_value : 20
 <2><ffcb4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcb5>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <ffcb9>   DW_AT_const_value : 21
 <2><ffcba>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcbb>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <ffcbf>   DW_AT_const_value : 22
 <2><ffcc0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcc1>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <ffcc5>   DW_AT_const_value : 23
 <2><ffcc6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcc7>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <ffccb>   DW_AT_const_value : 24
 <2><ffccc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffccd>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <ffcd1>   DW_AT_const_value : 25
 <2><ffcd2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcd3>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <ffcd7>   DW_AT_const_value : 26
 <2><ffcd8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcd9>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <ffcdd>   DW_AT_const_value : 27
 <2><ffcde>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ffcdf>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <ffce3>   DW_AT_const_value : 28
 <2><ffce4>: Abbrev Number: 0
 <1><ffce5>: Abbrev Number: 10 (DW_TAG_typedef)
    <ffce6>   DW_AT_name        : (indirect string, offset: 0x90ac4): SFG_StrokeVertex
    <ffcea>   DW_AT_decl_file   : 2
    <ffcea>   DW_AT_decl_line   : 748
    <ffcec>   DW_AT_decl_column : 36
    <ffced>   DW_AT_type        : <0xffcf6>
 <1><ffcf1>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffcf2>   DW_AT_type        : <0xffce5>
 <1><ffcf6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ffcf7>   DW_AT_name        : (indirect string, offset: 0x90ac1): tagSFG_StrokeVertex
    <ffcfb>   DW_AT_byte_size   : 8
    <ffcfc>   DW_AT_decl_file   : 2
    <ffcfc>   DW_AT_decl_line   : 749
    <ffcfe>   DW_AT_decl_column : 8
    <ffcfe>   DW_AT_sibling     : <0xffd15>
 <2><ffd02>: Abbrev Number: 12 (DW_TAG_member)
    <ffd03>   DW_AT_name        : X
    <ffd05>   DW_AT_decl_file   : 2
    <ffd05>   DW_AT_decl_line   : 751
    <ffd05>   DW_AT_decl_column : 21
    <ffd06>   DW_AT_type        : <0xffbde>
    <ffd0a>   DW_AT_data_member_location: 0
 <2><ffd0b>: Abbrev Number: 12 (DW_TAG_member)
    <ffd0c>   DW_AT_name        : Y
    <ffd0e>   DW_AT_decl_file   : 2
    <ffd0e>   DW_AT_decl_line   : 751
    <ffd0e>   DW_AT_decl_column : 24
    <ffd0f>   DW_AT_type        : <0xffbde>
    <ffd13>   DW_AT_data_member_location: 4
 <2><ffd14>: Abbrev Number: 0
 <1><ffd15>: Abbrev Number: 10 (DW_TAG_typedef)
    <ffd16>   DW_AT_name        : (indirect string, offset: 0x90b40): SFG_StrokeStrip
    <ffd1a>   DW_AT_decl_file   : 2
    <ffd1a>   DW_AT_decl_line   : 754
    <ffd1c>   DW_AT_decl_column : 35
    <ffd1d>   DW_AT_type        : <0xffd26>
 <1><ffd21>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffd22>   DW_AT_type        : <0xffd15>
 <1><ffd26>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ffd27>   DW_AT_name        : (indirect string, offset: 0x90b3d): tagSFG_StrokeStrip
    <ffd2b>   DW_AT_byte_size   : 16
    <ffd2c>   DW_AT_decl_file   : 2
    <ffd2c>   DW_AT_decl_line   : 755
    <ffd2e>   DW_AT_decl_column : 8
    <ffd2e>   DW_AT_sibling     : <0xffd4d>
 <2><ffd32>: Abbrev Number: 8 (DW_TAG_member)
    <ffd33>   DW_AT_name        : (indirect string, offset: 0x8e321): Number
    <ffd37>   DW_AT_decl_file   : 2
    <ffd37>   DW_AT_decl_line   : 757
    <ffd39>   DW_AT_decl_column : 21
    <ffd3a>   DW_AT_type        : <0xffbd0>
    <ffd3e>   DW_AT_data_member_location: 0
 <2><ffd3f>: Abbrev Number: 8 (DW_TAG_member)
    <ffd40>   DW_AT_name        : (indirect string, offset: 0x90b85): Vertices
    <ffd44>   DW_AT_decl_file   : 2
    <ffd44>   DW_AT_decl_line   : 758
    <ffd46>   DW_AT_decl_column : 29
    <ffd47>   DW_AT_type        : <0xffd4d>
    <ffd4b>   DW_AT_data_member_location: 8
 <2><ffd4c>: Abbrev Number: 0
 <1><ffd4d>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ffd4e>   DW_AT_byte_size   : 8
    <ffd4e>   DW_AT_type        : <0xffcf1>
 <1><ffd52>: Abbrev Number: 10 (DW_TAG_typedef)
    <ffd53>   DW_AT_name        : (indirect string, offset: 0x90b64): SFG_StrokeChar
    <ffd57>   DW_AT_decl_file   : 2
    <ffd57>   DW_AT_decl_line   : 761
    <ffd59>   DW_AT_decl_column : 34
    <ffd5a>   DW_AT_type        : <0xffd63>
 <1><ffd5e>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffd5f>   DW_AT_type        : <0xffd52>
 <1><ffd63>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ffd64>   DW_AT_name        : (indirect string, offset: 0x90b61): tagSFG_StrokeChar
    <ffd68>   DW_AT_byte_size   : 16
    <ffd69>   DW_AT_decl_file   : 2
    <ffd69>   DW_AT_decl_line   : 762
    <ffd6b>   DW_AT_decl_column : 8
    <ffd6b>   DW_AT_sibling     : <0xffd97>
 <2><ffd6f>: Abbrev Number: 8 (DW_TAG_member)
    <ffd70>   DW_AT_name        : (indirect string, offset: 0x90bb4): Right
    <ffd74>   DW_AT_decl_file   : 2
    <ffd74>   DW_AT_decl_line   : 764
    <ffd76>   DW_AT_decl_column : 21
    <ffd77>   DW_AT_type        : <0xffbde>
    <ffd7b>   DW_AT_data_member_location: 0
 <2><ffd7c>: Abbrev Number: 8 (DW_TAG_member)
    <ffd7d>   DW_AT_name        : (indirect string, offset: 0x8e321): Number
    <ffd81>   DW_AT_decl_file   : 2
    <ffd81>   DW_AT_decl_line   : 765
    <ffd83>   DW_AT_decl_column : 21
    <ffd84>   DW_AT_type        : <0xffbd0>
    <ffd88>   DW_AT_data_member_location: 4
 <2><ffd89>: Abbrev Number: 8 (DW_TAG_member)
    <ffd8a>   DW_AT_name        : (indirect string, offset: 0x90b36): Strips
    <ffd8e>   DW_AT_decl_file   : 2
    <ffd8e>   DW_AT_decl_line   : 766
    <ffd90>   DW_AT_decl_column : 28
    <ffd91>   DW_AT_type        : <0xffd97>
    <ffd95>   DW_AT_data_member_location: 8
 <2><ffd96>: Abbrev Number: 0
 <1><ffd97>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ffd98>   DW_AT_byte_size   : 8
    <ffd98>   DW_AT_type        : <0xffd21>
 <1><ffd9c>: Abbrev Number: 10 (DW_TAG_typedef)
    <ffd9d>   DW_AT_name        : (indirect string, offset: 0x90b76): SFG_StrokeFont
    <ffda1>   DW_AT_decl_file   : 2
    <ffda1>   DW_AT_decl_line   : 769
    <ffda3>   DW_AT_decl_column : 34
    <ffda4>   DW_AT_type        : <0xffdad>
 <1><ffda8>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffda9>   DW_AT_type        : <0xffd9c>
 <1><ffdad>: Abbrev Number: 11 (DW_TAG_structure_type)
    <ffdae>   DW_AT_name        : (indirect string, offset: 0x90b73): tagSFG_StrokeFont
    <ffdb2>   DW_AT_byte_size   : 24
    <ffdb3>   DW_AT_decl_file   : 2
    <ffdb3>   DW_AT_decl_line   : 770
    <ffdb5>   DW_AT_decl_column : 8
    <ffdb5>   DW_AT_sibling     : <0xffdee>
 <2><ffdb9>: Abbrev Number: 8 (DW_TAG_member)
    <ffdba>   DW_AT_name        : (indirect string, offset: 0x8fc0d): Name
    <ffdbe>   DW_AT_decl_file   : 2
    <ffdbe>   DW_AT_decl_line   : 772
    <ffdc0>   DW_AT_decl_column : 21
    <ffdc1>   DW_AT_type        : <0xffc06>
    <ffdc5>   DW_AT_data_member_location: 0
 <2><ffdc6>: Abbrev Number: 8 (DW_TAG_member)
    <ffdc7>   DW_AT_name        : (indirect string, offset: 0x90bab): Quantity
    <ffdcb>   DW_AT_decl_file   : 2
    <ffdcb>   DW_AT_decl_line   : 773
    <ffdcd>   DW_AT_decl_column : 21
    <ffdce>   DW_AT_type        : <0xffbd0>
    <ffdd2>   DW_AT_data_member_location: 8
 <2><ffdd3>: Abbrev Number: 8 (DW_TAG_member)
    <ffdd4>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <ffdd8>   DW_AT_decl_file   : 2
    <ffdd8>   DW_AT_decl_line   : 774
    <ffdda>   DW_AT_decl_column : 21
    <ffddb>   DW_AT_type        : <0xffbde>
    <ffddf>   DW_AT_data_member_location: 12
 <2><ffde0>: Abbrev Number: 8 (DW_TAG_member)
    <ffde1>   DW_AT_name        : (indirect string, offset: 0x90c1a): Characters
    <ffde5>   DW_AT_decl_file   : 2
    <ffde5>   DW_AT_decl_line   : 775
    <ffde7>   DW_AT_decl_column : 28
    <ffde8>   DW_AT_type        : <0xffdee>
    <ffdec>   DW_AT_data_member_location: 16
 <2><ffded>: Abbrev Number: 0
 <1><ffdee>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ffdef>   DW_AT_byte_size   : 8
    <ffdef>   DW_AT_type        : <0xffdf3>
 <1><ffdf3>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ffdf4>   DW_AT_byte_size   : 8
    <ffdf4>   DW_AT_type        : <0xffd5e>
 <1><ffdf8>: Abbrev Number: 4 (DW_TAG_array_type)
    <ffdf9>   DW_AT_type        : <0xffd21>
    <ffdfd>   DW_AT_sibling     : <0xffe08>
 <2><ffe01>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ffe02>   DW_AT_type        : <0xffbf8>
    <ffe06>   DW_AT_upper_bound : 0
 <2><ffe07>: Abbrev Number: 0
 <1><ffe08>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffe09>   DW_AT_type        : <0xffdf8>
 <1><ffe0d>: Abbrev Number: 6 (DW_TAG_variable)
    <ffe0e>   DW_AT_name        : (indirect string, offset: 0x9c4d9): ch32st
    <ffe12>   DW_AT_decl_file   : 3
    <ffe12>   DW_AT_decl_line   : 39
    <ffe13>   DW_AT_decl_column : 30
    <ffe14>   DW_AT_type        : <0xffe08>
    <ffe18>   DW_AT_location    : 9 byte block: 3 40 fc a4 0 0 0 0 0 	(DW_OP_addr: a4fc40)
 <1><ffe22>: Abbrev Number: 6 (DW_TAG_variable)
    <ffe23>   DW_AT_name        : (indirect string, offset: 0x9c75d): ch32
    <ffe27>   DW_AT_decl_file   : 3
    <ffe27>   DW_AT_decl_line   : 44
    <ffe28>   DW_AT_decl_column : 29
    <ffe29>   DW_AT_type        : <0xffd5e>
    <ffe2d>   DW_AT_location    : 9 byte block: 3 40 7d a7 0 0 0 0 0 	(DW_OP_addr: a77d40)
 <1><ffe37>: Abbrev Number: 4 (DW_TAG_array_type)
    <ffe38>   DW_AT_type        : <0xffcf1>
    <ffe3c>   DW_AT_sibling     : <0xffe47>
 <2><ffe40>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ffe41>   DW_AT_type        : <0xffbf8>
    <ffe45>   DW_AT_upper_bound : 1
 <2><ffe46>: Abbrev Number: 0
 <1><ffe47>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffe48>   DW_AT_type        : <0xffe37>
 <1><ffe4c>: Abbrev Number: 6 (DW_TAG_variable)
    <ffe4d>   DW_AT_name        : (indirect string, offset: 0x9cbb9): ch33st0
    <ffe51>   DW_AT_decl_file   : 3
    <ffe51>   DW_AT_decl_line   : 48
    <ffe52>   DW_AT_decl_column : 31
    <ffe53>   DW_AT_type        : <0xffe47>
    <ffe57>   DW_AT_location    : 9 byte block: 3 30 fc a4 0 0 0 0 0 	(DW_OP_addr: a4fc30)
 <1><ffe61>: Abbrev Number: 4 (DW_TAG_array_type)
    <ffe62>   DW_AT_type        : <0xffcf1>
    <ffe66>   DW_AT_sibling     : <0xffe71>
 <2><ffe6a>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ffe6b>   DW_AT_type        : <0xffbf8>
    <ffe6f>   DW_AT_upper_bound : 4
 <2><ffe70>: Abbrev Number: 0
 <1><ffe71>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffe72>   DW_AT_type        : <0xffe61>
 <1><ffe76>: Abbrev Number: 6 (DW_TAG_variable)
    <ffe77>   DW_AT_name        : (indirect string, offset: 0x9ca37): ch33st1
    <ffe7b>   DW_AT_decl_file   : 3
    <ffe7b>   DW_AT_decl_line   : 54
    <ffe7c>   DW_AT_decl_column : 31
    <ffe7d>   DW_AT_type        : <0xffe71>
    <ffe81>   DW_AT_location    : 9 byte block: 3 0 fc a4 0 0 0 0 0 	(DW_OP_addr: a4fc00)
 <1><ffe8b>: Abbrev Number: 4 (DW_TAG_array_type)
    <ffe8c>   DW_AT_type        : <0xffd21>
    <ffe90>   DW_AT_sibling     : <0xffe9b>
 <2><ffe94>: Abbrev Number: 5 (DW_TAG_subrange_type)
    <ffe95>   DW_AT_type        : <0xffbf8>
    <ffe99>   DW_AT_upper_bound : 1
 <2><ffe9a>: Abbrev Number: 0
 <1><ffe9b>: Abbrev Number: 2 (DW_TAG_const_type)
    <ffe9c>   DW_AT_type        : <0xffe8b>
 <1><ffea0>: Abbrev Number: 6 (DW_TAG_variable)
    <ffea1>   DW_AT_name        : (indirect string, offset: 0x9c972): ch33st
    <ffea5>   DW_AT_decl_file   : 3
    <ffea5>   DW_AT_decl_line   : 63
    <ffea6>   DW_AT_decl_column : 30
    <ffea7>   DW_AT_type        : <0xffe9b>
    <ffeab>   DW_AT_location    : 9 byte block: 3 20 7d a7 0 0 0 0 0 	(DW_OP_addr: a77d20)
 <1><ffeb5>: Abbrev Number: 6 (DW_TAG_variable)
    <ffeb6>   DW_AT_name        : (indirect string, offset: 0x9c762): ch33
    <ffeba>   DW_AT_decl_file   : 3
    <ffeba>   DW_AT_decl_line   : 69
    <ffebb>   DW_AT_decl_column : 29
