    <a2173>   DW_AT_decl_column : 11
    <a2174>   DW_AT_location    : 9 byte block: 3 45 76 b9 0 0 0 0 0 	(DW_OP_addr: b97645)
 <1><a217e>: Abbrev Number: 3 (DW_TAG_variable)
    <a217f>   DW_AT_specification: <0x8f1e2>
    <a2183>   DW_AT_decl_file   : 4
    <a2184>   DW_AT_decl_line   : 2995
    <a2186>   DW_AT_decl_column : 11
    <a2187>   DW_AT_location    : 9 byte block: 3 46 76 b9 0 0 0 0 0 	(DW_OP_addr: b97646)
 <1><a2191>: Abbrev Number: 3 (DW_TAG_variable)
    <a2192>   DW_AT_specification: <0x8f1ef>
    <a2196>   DW_AT_decl_file   : 4
    <a2197>   DW_AT_decl_line   : 2996
    <a2199>   DW_AT_decl_column : 11
    <a219a>   DW_AT_location    : 9 byte block: 3 47 76 b9 0 0 0 0 0 	(DW_OP_addr: b97647)
 <1><a21a4>: Abbrev Number: 3 (DW_TAG_variable)
    <a21a5>   DW_AT_specification: <0x8f1fc>
    <a21a9>   DW_AT_decl_file   : 4
    <a21aa>   DW_AT_decl_line   : 2997
    <a21ac>   DW_AT_decl_column : 11
    <a21ad>   DW_AT_location    : 9 byte block: 3 48 76 b9 0 0 0 0 0 	(DW_OP_addr: b97648)
 <1><a21b7>: Abbrev Number: 3 (DW_TAG_variable)
    <a21b8>   DW_AT_specification: <0x8f209>
    <a21bc>   DW_AT_decl_file   : 4
    <a21bd>   DW_AT_decl_line   : 2998
    <a21bf>   DW_AT_decl_column : 11
    <a21c0>   DW_AT_location    : 9 byte block: 3 49 76 b9 0 0 0 0 0 	(DW_OP_addr: b97649)
 <1><a21ca>: Abbrev Number: 3 (DW_TAG_variable)
    <a21cb>   DW_AT_specification: <0x8f216>
    <a21cf>   DW_AT_decl_file   : 4
    <a21d0>   DW_AT_decl_line   : 2999

    <a44b9>   DW_AT_name        : (indirect string, offset: 0x612d8): image_qbicon16_h
    <a44bd>   DW_AT_decl_file   : 5
    <a44be>   DW_AT_decl_line   : 346
    <a44c0>   DW_AT_decl_column : 14
    <a44c1>   DW_AT_type        : <0x7999f>
    <a44c5>   DW_AT_location    : 9 byte block: 3 1c 89 a7 0 0 0 0 0 	(DW_OP_addr: a7891c)
 <1><a44cf>: Abbrev Number: 30 (DW_TAG_array_type)
    <a44d0>   DW_AT_type        : <0x799c8>
    <a44d4>   DW_AT_sibling     : <0xa44e0>
 <2><a44d8>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a44d9>   DW_AT_type        : <0x79786>
    <a44dd>   DW_AT_upper_bound : 1023
 <2><a44df>: Abbrev Number: 0
 <1><a44e0>: Abbrev Number: 27 (DW_TAG_const_type)
    <a44e1>   DW_AT_type        : <0xa44cf>
 <1><a44e5>: Abbrev Number: 7 (DW_TAG_variable)
    <a44e6>   DW_AT_name        : (indirect string, offset: 0x75050): image_qbicon16
    <a44ea>   DW_AT_decl_file   : 5
    <a44eb>   DW_AT_decl_line   : 347
    <a44ed>   DW_AT_decl_column : 20
    <a44ee>   DW_AT_type        : <0xa44e0>
    <a44f2>   DW_AT_location    : 9 byte block: 3 60 1f a1 0 0 0 0 0 	(DW_OP_addr: a11f60)
 <1><a44fc>: Abbrev Number: 7 (DW_TAG_variable)
    <a44fd>   DW_AT_name        : (indirect string, offset: 0x88c7f): image_qbicon32_w
    <a4501>   DW_AT_decl_file   : 5
    <a4502>   DW_AT_decl_line   : 366
    <a4504>   DW_AT_decl_column : 14
    <a4505>   DW_AT_type        : <0x7999f>
    <a4509>   DW_AT_location    : 9 byte block: 3 20 89 a7 0 0 0 0 0 	(DW_OP_addr: a78920)
 <1><a4513>: Abbrev Number: 7 (DW_TAG_variable)
    <a4514>   DW_AT_name        : (indirect string, offset: 0x88c2d): image_qbicon32_h
    <a4518>   DW_AT_decl_file   : 5
    <a4519>   DW_AT_decl_line   : 367
    <a451b>   DW_AT_decl_column : 14
    <a451c>   DW_AT_type        : <0x7999f>
    <a4520>   DW_AT_location    : 9 byte block: 3 24 89 a7 0 0 0 0 0 	(DW_OP_addr: a78924)
 <1><a452a>: Abbrev Number: 30 (DW_TAG_array_type)
    <a452b>   DW_AT_type        : <0x799c8>
    <a452f>   DW_AT_sibling     : <0xa453b>
 <2><a4533>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a4534>   DW_AT_type        : <0x79786>
    <a4538>   DW_AT_upper_bound : 4095
 <2><a453a>: Abbrev Number: 0
 <1><a453b>: Abbrev Number: 27 (DW_TAG_const_type)
    <a453c>   DW_AT_type        : <0xa452a>
 <1><a4540>: Abbrev Number: 7 (DW_TAG_variable)
    <a4541>   DW_AT_name        : (indirect string, offset: 0x75373): image_qbicon32
    <a4545>   DW_AT_decl_file   : 5
    <a4546>   DW_AT_decl_line   : 368
    <a4548>   DW_AT_decl_column : 20
    <a4549>   DW_AT_type        : <0xa453b>
    <a454d>   DW_AT_location    : 9 byte block: 3 60 23 a1 0 0 0 0 0 	(DW_OP_addr: a12360)
 <1><a4557>: Abbrev Number: 7 (DW_TAG_variable)
    <a4558>   DW_AT_name        : (indirect string, offset: 0x5e004): display_x
    <a455c>   DW_AT_decl_file   : 5
    <a455d>   DW_AT_decl_line   : 407
    <a455f>   DW_AT_decl_column : 14
    <a4560>   DW_AT_type        : <0x7999f>
    <a4564>   DW_AT_location    : 9 byte block: 3 28 89 a7 0 0 0 0 0 	(DW_OP_addr: a78928)
 <1><a456e>: Abbrev Number: 7 (DW_TAG_variable)
    <a456f>   DW_AT_name        : (indirect string, offset: 0x5e00e): display_y
    <a4573>   DW_AT_decl_file   : 5
    <a4574>   DW_AT_decl_line   : 408
    <a4576>   DW_AT_decl_column : 14
    <a4577>   DW_AT_type        : <0x7999f>
    <a457b>   DW_AT_location    : 9 byte block: 3 2c 89 a7 0 0 0 0 0 	(DW_OP_addr: a7892c)
 <1><a4585>: Abbrev Number: 11 (DW_TAG_variable)
    <a4586>   DW_AT_name        : (indirect string, offset: 0x6031c): display_x_prev
    <a458a>   DW_AT_decl_file   : 5
    <a458b>   DW_AT_decl_line   : 409
    <a458d>   DW_AT_decl_column : 7
    <a458e>   DW_AT_type        : <0x7999f>
    <a4592>   DW_AT_external    : 1
    <a4592>   DW_AT_location    : 9 byte block: 3 30 89 a7 0 0 0 0 0 	(DW_OP_addr: a78930)
 <1><a459c>: Abbrev Number: 11 (DW_TAG_variable)
    <a459d>   DW_AT_name        : (indirect string, offset: 0x7619e): display_y_prev
    <a45a1>   DW_AT_decl_file   : 5
    <a45a2>   DW_AT_decl_line   : 409
    <a45a4>   DW_AT_decl_column : 26
    <a45a5>   DW_AT_type        : <0x7999f>
    <a45a9>   DW_AT_external    : 1
    <a45a9>   DW_AT_location    : 9 byte block: 3 34 89 a7 0 0 0 0 0 	(DW_OP_addr: a78934)
 <1><a45b3>: Abbrev Number: 7 (DW_TAG_variable)
    <a45b4>   DW_AT_name        : (indirect string, offset: 0x638af): display_required_x
    <a45b8>   DW_AT_decl_file   : 5
    <a45b9>   DW_AT_decl_line   : 411
    <a45bb>   DW_AT_decl_column : 14
    <a45bc>   DW_AT_type        : <0x7999f>
    <a45c0>   DW_AT_location    : 9 byte block: 3 38 89 a7 0 0 0 0 0 	(DW_OP_addr: a78938)
 <1><a45ca>: Abbrev Number: 7 (DW_TAG_variable)
    <a45cb>   DW_AT_name        : (indirect string, offset: 0x7d1c5): display_required_y
    <a45cf>   DW_AT_decl_file   : 5
    <a45d0>   DW_AT_decl_line   : 412
    <a45d2>   DW_AT_decl_column : 14
    <a45d3>   DW_AT_type        : <0x7999f>
    <a45d7>   DW_AT_location    : 9 byte block: 3 3c 89 a7 0 0 0 0 0 	(DW_OP_addr: a7893c)
 <1><a45e1>: Abbrev Number: 11 (DW_TAG_variable)
    <a45e2>   DW_AT_name        : (indirect string, offset: 0x8c692): dont_call_sub_gl
    <a45e6>   DW_AT_decl_file   : 5
    <a45e7>   DW_AT_decl_line   : 414
    <a45e9>   DW_AT_decl_column : 7
    <a45ea>   DW_AT_type        : <0x7999f>
    <a45ee>   DW_AT_external    : 1
    <a45ee>   DW_AT_location    : 9 byte block: 3 98 7d b9 0 0 0 0 0 	(DW_OP_addr: b97d98)
 <1><a45f8>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a45f9>   DW_AT_name        : (indirect string, offset: 0x6276c): display_frame_struct
    <a45fd>   DW_AT_byte_size   : 40
    <a45fe>   DW_AT_decl_file   : 5
    <a45ff>   DW_AT_decl_line   : 427
    <a4601>   DW_AT_decl_column : 8
    <a4602>   DW_AT_sibling     : <0xa4657>
 <2><a4606>: Abbrev Number: 10 (DW_TAG_member)
    <a4607>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <a460b>   DW_AT_decl_file   : 5
    <a460c>   DW_AT_decl_line   : 428
    <a460e>   DW_AT_decl_column : 11
    <a460f>   DW_AT_type        : <0x7999f>
    <a4613>   DW_AT_data_member_location: 0
 <2><a4614>: Abbrev Number: 10 (DW_TAG_member)
    <a4615>   DW_AT_name        : (indirect string, offset: 0x7e05b): order
    <a4619>   DW_AT_decl_file   : 5
    <a461a>   DW_AT_decl_line   : 429
    <a461c>   DW_AT_decl_column : 11
    <a461d>   DW_AT_type        : <0x799b0>
    <a4621>   DW_AT_data_member_location: 8
 <2><a4622>: Abbrev Number: 10 (DW_TAG_member)
    <a4623>   DW_AT_name        : (indirect string, offset: 0x6b8b5): bgra
    <a4627>   DW_AT_decl_file   : 5
    <a4628>   DW_AT_decl_line   : 430
    <a462a>   DW_AT_decl_column : 13
    <a462b>   DW_AT_type        : <0x93492>
    <a462f>   DW_AT_data_member_location: 16
 <2><a4630>: Abbrev Number: 31 (DW_TAG_member)
    <a4631>   DW_AT_name        : w
    <a4633>   DW_AT_decl_file   : 5
    <a4634>   DW_AT_decl_line   : 431
    <a4636>   DW_AT_decl_column : 11
    <a4637>   DW_AT_type        : <0x7999f>
    <a463b>   DW_AT_data_member_location: 24
 <2><a463c>: Abbrev Number: 31 (DW_TAG_member)
    <a463d>   DW_AT_name        : h
    <a463f>   DW_AT_decl_file   : 5
    <a4640>   DW_AT_decl_line   : 432
    <a4642>   DW_AT_decl_column : 11
    <a4643>   DW_AT_type        : <0x7999f>
    <a4647>   DW_AT_data_member_location: 28
 <2><a4648>: Abbrev Number: 10 (DW_TAG_member)
    <a4649>   DW_AT_name        : (indirect string, offset: 0x62343): bytes
    <a464d>   DW_AT_decl_file   : 5
    <a464e>   DW_AT_decl_line   : 433
    <a4650>   DW_AT_decl_column : 11
    <a4651>   DW_AT_type        : <0x7999f>
    <a4655>   DW_AT_data_member_location: 32
 <2><a4656>: Abbrev Number: 0
 <1><a4657>: Abbrev Number: 30 (DW_TAG_array_type)
    <a4658>   DW_AT_type        : <0xa45f8>
    <a465c>   DW_AT_sibling     : <0xa4667>
 <2><a4660>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <a4661>   DW_AT_type        : <0x79786>
    <a4665>   DW_AT_upper_bound : 2
 <2><a4666>: Abbrev Number: 0
 <1><a4667>: Abbrev Number: 11 (DW_TAG_variable)
    <a4668>   DW_AT_name        : (indirect string, offset: 0x6c495): display_frame
    <a466c>   DW_AT_decl_file   : 5
    <a466d>   DW_AT_decl_line   : 435
    <a466f>   DW_AT_decl_column : 22
    <a4670>   DW_AT_type        : <0xa4657>
    <a4674>   DW_AT_external    : 1
    <a4674>   DW_AT_location    : 9 byte block: 3 a0 7d b9 0 0 0 0 0 	(DW_OP_addr: b97da0)
 <1><a467e>: Abbrev Number: 11 (DW_TAG_variable)
    <a467f>   DW_AT_name        : (indirect string, offset: 0x72d67): display_frame_order_next
    <a4683>   DW_AT_decl_file   : 5
    <a4684>   DW_AT_decl_line   : 436
    <a4686>   DW_AT_decl_column : 7
    <a4687>   DW_AT_type        : <0x799b0>
    <a468b>   DW_AT_external    : 1
    <a468b>   DW_AT_location    : 9 byte block: 3 40 89 a7 0 0 0 0 0 	(DW_OP_addr: a78940)
 <1><a4695>: Abbrev Number: 11 (DW_TAG_variable)
    <a4696>   DW_AT_name        : (indirect string, offset: 0x7e036): last_rendered_hardware_display_frame_order
    <a469a>   DW_AT_decl_file   : 5
    <a469b>   DW_AT_decl_line   : 444
    <a469d>   DW_AT_decl_column : 7
    <a469e>   DW_AT_type        : <0x799b0>
    <a46a2>   DW_AT_external    : 1
    <a46a2>   DW_AT_location    : 9 byte block: 3 18 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e18)
 <1><a46ac>: Abbrev Number: 11 (DW_TAG_variable)
    <a46ad>   DW_AT_name        : (indirect string, offset: 0x6216b): last_hardware_display_frame_order
    <a46b1>   DW_AT_decl_file   : 5
    <a46b2>   DW_AT_decl_line   : 445
    <a46b4>   DW_AT_decl_column : 7
    <a46b5>   DW_AT_type        : <0x799b0>
    <a46b9>   DW_AT_external    : 1
    <a46b9>   DW_AT_location    : 9 byte block: 3 20 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e20)
 <1><a46c3>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a46c4>   DW_AT_name        : (indirect string, offset: 0x691f3): MUTEX
    <a46c8>   DW_AT_byte_size   : 40
    <a46c9>   DW_AT_decl_file   : 5
    <a46ca>   DW_AT_decl_line   : 478
    <a46cc>   DW_AT_decl_column : 12
    <a46cd>   DW_AT_sibling     : <0xa46e0>
 <2><a46d1>: Abbrev Number: 10 (DW_TAG_member)
    <a46d2>   DW_AT_name        : (indirect string, offset: 0x8694b): handle
    <a46d6>   DW_AT_decl_file   : 5
    <a46d7>   DW_AT_decl_line   : 479
    <a46d9>   DW_AT_decl_column : 25
    <a46da>   DW_AT_type        : <0x90035>
    <a46de>   DW_AT_data_member_location: 0
 <2><a46df>: Abbrev Number: 0
 <1><a46e0>: Abbrev Number: 132 (DW_TAG_structure_type)
    <a46e2>   DW_AT_name        : (indirect string, offset: 0x7171b): list
    <a46e6>   DW_AT_byte_size   : 640
    <a46e8>   DW_AT_decl_file   : 5
    <a46e9>   DW_AT_decl_line   : 507
    <a46eb>   DW_AT_decl_column : 8
    <a46ec>   DW_AT_sibling     : <0xa47e6>
 <2><a46f0>: Abbrev Number: 10 (DW_TAG_member)
    <a46f1>   DW_AT_name        : (indirect string, offset: 0x89252): user_structure_size
    <a46f5>   DW_AT_decl_file   : 5
    <a46f6>   DW_AT_decl_line   : 508
    <a46f8>   DW_AT_decl_column : 14
    <a46f9>   DW_AT_type        : <0x799b0>
    <a46fd>   DW_AT_data_member_location: 0
 <2><a46fe>: Abbrev Number: 10 (DW_TAG_member)
    <a46ff>   DW_AT_name        : (indirect string, offset: 0x672c5): internal_structure_size
    <a4703>   DW_AT_decl_file   : 5
    <a4704>   DW_AT_decl_line   : 509
    <a4706>   DW_AT_decl_column : 14
    <a4707>   DW_AT_type        : <0x799b0>
    <a470b>   DW_AT_data_member_location: 8
 <2><a470c>: Abbrev Number: 10 (DW_TAG_member)
    <a470d>   DW_AT_name        : (indirect string, offset: 0x6d009): structure
    <a4711>   DW_AT_decl_file   : 5
    <a4712>   DW_AT_decl_line   : 510
    <a4714>   DW_AT_decl_column : 12
    <a4715>   DW_AT_type        : <0x931d3>
    <a4719>   DW_AT_data_member_location: 16
 <2><a471a>: Abbrev Number: 10 (DW_TAG_member)
    <a471b>   DW_AT_name        : (indirect string, offset: 0x7be4d): structures
    <a471f>   DW_AT_decl_file   : 5
    <a4720>   DW_AT_decl_line   : 511
    <a4722>   DW_AT_decl_column : 14
    <a4723>   DW_AT_type        : <0x799b0>
    <a4727>   DW_AT_data_member_location: 24
 <2><a4728>: Abbrev Number: 10 (DW_TAG_member)
    <a4729>   DW_AT_name        : (indirect string, offset: 0x687f3): structures_last
    <a472d>   DW_AT_decl_file   : 5
    <a472e>   DW_AT_decl_line   : 512
    <a4730>   DW_AT_decl_column : 14
    <a4731>   DW_AT_type        : <0x799b0>
    <a4735>   DW_AT_data_member_location: 32
 <2><a4736>: Abbrev Number: 10 (DW_TAG_member)
    <a4737>   DW_AT_name        : (indirect string, offset: 0x81104): structure_freed
    <a473b>   DW_AT_decl_file   : 5
    <a473c>   DW_AT_decl_line   : 513
    <a473e>   DW_AT_decl_column : 15
    <a473f>   DW_AT_type        : <0x95c1e>
    <a4743>   DW_AT_data_member_location: 40
 <2><a4744>: Abbrev Number: 10 (DW_TAG_member)
    <a4745>   DW_AT_name        : (indirect string, offset: 0x674f2): structure_freed_cleanup
    <a4749>   DW_AT_decl_file   : 5
    <a474a>   DW_AT_decl_line   : 514
    <a474c>   DW_AT_decl_column : 15
    <a474d>   DW_AT_type        : <0x95c1e>
    <a4751>   DW_AT_data_member_location: 48
 <2><a4752>: Abbrev Number: 10 (DW_TAG_member)
    <a4753>   DW_AT_name        : (indirect string, offset: 0x8cdfe): structures_freed
    <a4757>   DW_AT_decl_file   : 5
    <a4758>   DW_AT_decl_line   : 515
    <a475a>   DW_AT_decl_column : 14
    <a475b>   DW_AT_type        : <0x799b0>
    <a475f>   DW_AT_data_member_location: 56
 <2><a4760>: Abbrev Number: 10 (DW_TAG_member)
    <a4761>   DW_AT_name        : (indirect string, offset: 0x70511): structures_freed_last
    <a4765>   DW_AT_decl_file   : 5
    <a4766>   DW_AT_decl_line   : 516
    <a4768>   DW_AT_decl_column : 14
    <a4769>   DW_AT_type        : <0x799b0>
    <a476d>   DW_AT_data_member_location: 64
 <2><a476e>: Abbrev Number: 10 (DW_TAG_member)
    <a476f>   DW_AT_name        : (indirect string, offset: 0x6b379): structure_base
    <a4773>   DW_AT_decl_file   : 5
    <a4774>   DW_AT_decl_line   : 517
    <a4776>   DW_AT_decl_column : 14
    <a4777>   DW_AT_type        : <0xa47e6>
    <a477b>   DW_AT_data_member_location: 72
 <2><a477c>: Abbrev Number: 64 (DW_TAG_member)
    <a477d>   DW_AT_name        : (indirect string, offset: 0x88d69): structure_bases
    <a4781>   DW_AT_decl_file   : 5
    <a4782>   DW_AT_decl_line   : 519
    <a4784>   DW_AT_decl_column : 14
    <a4785>   DW_AT_type        : <0x799b0>
    <a4789>   DW_AT_data_member_location: 584
 <2><a478b>: Abbrev Number: 64 (DW_TAG_member)
    <a478c>   DW_AT_name        : (indirect string, offset: 0x646b3): index
    <a4790>   DW_AT_decl_file   : 5
    <a4791>   DW_AT_decl_line   : 520
    <a4793>   DW_AT_decl_column : 15
    <a4794>   DW_AT_type        : <0x95c1e>
    <a4798>   DW_AT_data_member_location: 592
 <2><a479a>: Abbrev Number: 64 (DW_TAG_member)
    <a479b>   DW_AT_name        : (indirect string, offset: 0x64343): index_cleanup
    <a479f>   DW_AT_decl_file   : 5
    <a47a0>   DW_AT_decl_line   : 521
    <a47a2>   DW_AT_decl_column : 15
    <a47a3>   DW_AT_type        : <0x95c1e>
    <a47a7>   DW_AT_data_member_location: 600
 <2><a47a9>: Abbrev Number: 64 (DW_TAG_member)
    <a47aa>   DW_AT_name        : (indirect string, offset: 0x7f104): indexes
    <a47ae>   DW_AT_decl_file   : 5
    <a47af>   DW_AT_decl_line   : 522
    <a47b1>   DW_AT_decl_column : 14
    <a47b2>   DW_AT_type        : <0x799b0>
    <a47b6>   DW_AT_data_member_location: 608
 <2><a47b8>: Abbrev Number: 64 (DW_TAG_member)
    <a47b9>   DW_AT_name        : (indirect string, offset: 0x62ab2): indexes_last
    <a47bd>   DW_AT_decl_file   : 5
    <a47be>   DW_AT_decl_line   : 523
    <a47c0>   DW_AT_decl_column : 14
    <a47c1>   DW_AT_type        : <0x799b0>
    <a47c5>   DW_AT_data_member_location: 616
 <2><a47c7>: Abbrev Number: 64 (DW_TAG_member)
    <a47c8>   DW_AT_name        : (indirect string, offset: 0x7f161): lock_add
    <a47cc>   DW_AT_decl_file   : 5
    <a47cd>   DW_AT_decl_line   : 524
    <a47cf>   DW_AT_decl_column : 12
    <a47d0>   DW_AT_type        : <0xa47f6>
    <a47d4>   DW_AT_data_member_location: 624
 <2><a47d6>: Abbrev Number: 64 (DW_TAG_member)
    <a47d7>   DW_AT_name        : (indirect string, offset: 0x63aa7): lock_remove
    <a47db>   DW_AT_decl_file   : 5
    <a47dc>   DW_AT_decl_line   : 525
    <a47de>   DW_AT_decl_column : 12
    <a47df>   DW_AT_type        : <0xa47f6>
    <a47e3>   DW_AT_data_member_location: 632
 <2><a47e5>: Abbrev Number: 0
 <1><a47e6>: Abbrev Number: 30 (DW_TAG_array_type)
    <a47e7>   DW_AT_type        : <0x799b0>
    <a47eb>   DW_AT_sibling     : <0xa47f6>
 <2><a47ef>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <a47f0>   DW_AT_type        : <0x79786>
    <a47f4>   DW_AT_upper_bound : 63
 <2><a47f5>: Abbrev Number: 0
 <1><a47f6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a47f7>   DW_AT_byte_size   : 8
    <a47f7>   DW_AT_type        : <0xa46c3>
 <1><a47fb>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a47fc>   DW_AT_name        : (indirect string, offset: 0x620f8): special_handle_struct
    <a4800>   DW_AT_byte_size   : 16
    <a4801>   DW_AT_decl_file   : 5
    <a4802>   DW_AT_decl_line   : 655
    <a4804>   DW_AT_decl_column : 8
    <a4805>   DW_AT_sibling     : <0xa4826>
 <2><a4809>: Abbrev Number: 10 (DW_TAG_member)
    <a480a>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <a480e>   DW_AT_decl_file   : 5
    <a480f>   DW_AT_decl_line   : 656
    <a4811>   DW_AT_decl_column : 10
    <a4812>   DW_AT_type        : <0x79987>
    <a4816>   DW_AT_data_member_location: 0
 <2><a4817>: Abbrev Number: 10 (DW_TAG_member)
    <a4818>   DW_AT_name        : (indirect string, offset: 0x646b3): index
    <a481c>   DW_AT_decl_file   : 5
    <a481d>   DW_AT_decl_line   : 660
    <a481f>   DW_AT_decl_column : 14
    <a4820>   DW_AT_type        : <0x799b0>
    <a4824>   DW_AT_data_member_location: 8
 <2><a4825>: Abbrev Number: 0
 <1><a4826>: Abbrev Number: 11 (DW_TAG_variable)
    <a4827>   DW_AT_name        : (indirect string, offset: 0x61c55): special_handles
    <a482b>   DW_AT_decl_file   : 5
    <a482c>   DW_AT_decl_line   : 662
    <a482e>   DW_AT_decl_column : 7
    <a482f>   DW_AT_type        : <0xa483d>
    <a4833>   DW_AT_external    : 1
    <a4833>   DW_AT_location    : 9 byte block: 3 28 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e28)
 <1><a483d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a483e>   DW_AT_byte_size   : 8
    <a483e>   DW_AT_type        : <0xa46e0>
 <1><a4842>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4843>   DW_AT_name        : (indirect string, offset: 0x730e1): stream_struct
    <a4847>   DW_AT_byte_size   : 40
    <a4848>   DW_AT_decl_file   : 5
    <a4849>   DW_AT_decl_line   : 667
    <a484b>   DW_AT_decl_column : 8
    <a484c>   DW_AT_sibling     : <0xa48a4>
 <2><a4850>: Abbrev Number: 31 (DW_TAG_member)
    <a4851>   DW_AT_name        : in
    <a4854>   DW_AT_decl_file   : 5
    <a4855>   DW_AT_decl_line   : 668
    <a4857>   DW_AT_decl_column : 12
    <a4858>   DW_AT_type        : <0x931d3>
    <a485c>   DW_AT_data_member_location: 0
 <2><a485d>: Abbrev Number: 10 (DW_TAG_member)
    <a485e>   DW_AT_name        : (indirect string, offset: 0x88a24): in_size
    <a4862>   DW_AT_decl_file   : 5
    <a4863>   DW_AT_decl_line   : 669
    <a4865>   DW_AT_decl_column : 14
    <a4866>   DW_AT_type        : <0x799b0>
    <a486a>   DW_AT_data_member_location: 8
 <2><a486b>: Abbrev Number: 10 (DW_TAG_member)
    <a486c>   DW_AT_name        : (indirect string, offset: 0x6f29f): in_limit
    <a4870>   DW_AT_decl_file   : 5
    <a4871>   DW_AT_decl_line   : 670
    <a4873>   DW_AT_decl_column : 14
    <a4874>   DW_AT_type        : <0x799b0>
    <a4878>   DW_AT_data_member_location: 16
 <2><a4879>: Abbrev Number: 31 (DW_TAG_member)
    <a487a>   DW_AT_name        : eof
    <a487e>   DW_AT_decl_file   : 5
    <a487f>   DW_AT_decl_line   : 671
    <a4881>   DW_AT_decl_column : 10
    <a4882>   DW_AT_type        : <0x79987>
    <a4886>   DW_AT_data_member_location: 24
 <2><a4887>: Abbrev Number: 10 (DW_TAG_member)
    <a4888>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <a488c>   DW_AT_decl_file   : 5
    <a488d>   DW_AT_decl_line   : 674
    <a488f>   DW_AT_decl_column : 10
    <a4890>   DW_AT_type        : <0x79987>
    <a4894>   DW_AT_data_member_location: 25
 <2><a4895>: Abbrev Number: 10 (DW_TAG_member)
    <a4896>   DW_AT_name        : (indirect string, offset: 0x646b3): index
    <a489a>   DW_AT_decl_file   : 5
    <a489b>   DW_AT_decl_line   : 676
    <a489d>   DW_AT_decl_column : 14
    <a489e>   DW_AT_type        : <0x799b0>
    <a48a2>   DW_AT_data_member_location: 32
 <2><a48a3>: Abbrev Number: 0
 <1><a48a4>: Abbrev Number: 11 (DW_TAG_variable)
    <a48a5>   DW_AT_name        : (indirect string, offset: 0x83f61): stream_handles
    <a48a9>   DW_AT_decl_file   : 5
    <a48aa>   DW_AT_decl_line   : 678
    <a48ac>   DW_AT_decl_column : 7
    <a48ad>   DW_AT_type        : <0xa483d>
    <a48b1>   DW_AT_external    : 1
    <a48b1>   DW_AT_location    : 9 byte block: 3 30 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e30)
 <1><a48bb>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a48bc>   DW_AT_name        : (indirect string, offset: 0x877e2): RENDER_STATE_DEST
    <a48c0>   DW_AT_byte_size   : 4
    <a48c1>   DW_AT_decl_file   : 5
    <a48c2>   DW_AT_decl_line   : 697
    <a48c4>   DW_AT_decl_column : 8
    <a48c5>   DW_AT_sibling     : <0xa48d8>
 <2><a48c9>: Abbrev Number: 10 (DW_TAG_member)
    <a48ca>   DW_AT_name        : (indirect string, offset: 0x3e042): ignore
    <a48ce>   DW_AT_decl_file   : 5
    <a48cf>   DW_AT_decl_line   : 698
    <a48d1>   DW_AT_decl_column : 11
    <a48d2>   DW_AT_type        : <0x7999f>
    <a48d6>   DW_AT_data_member_location: 0
 <2><a48d7>: Abbrev Number: 0
 <1><a48d8>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a48d9>   DW_AT_name        : (indirect string, offset: 0x66b36): RENDER_STATE_SOURCE
    <a48dd>   DW_AT_byte_size   : 16
    <a48de>   DW_AT_decl_file   : 5
    <a48df>   DW_AT_decl_line   : 700
    <a48e1>   DW_AT_decl_column : 8
    <a48e2>   DW_AT_sibling     : <0xa491f>
 <2><a48e6>: Abbrev Number: 10 (DW_TAG_member)
    <a48e7>   DW_AT_name        : (indirect string, offset: 0x88851): smooth_stretched
    <a48eb>   DW_AT_decl_file   : 5
    <a48ec>   DW_AT_decl_line   : 701
    <a48ee>   DW_AT_decl_column : 11
    <a48ef>   DW_AT_type        : <0x7999f>
    <a48f3>   DW_AT_data_member_location: 0
 <2><a48f4>: Abbrev Number: 10 (DW_TAG_member)
    <a48f5>   DW_AT_name        : (indirect string, offset: 0x84e94): smooth_shrunk
    <a48f9>   DW_AT_decl_file   : 5
    <a48fa>   DW_AT_decl_line   : 702
    <a48fc>   DW_AT_decl_column : 11
    <a48fd>   DW_AT_type        : <0x7999f>
    <a4901>   DW_AT_data_member_location: 4
 <2><a4902>: Abbrev Number: 10 (DW_TAG_member)
    <a4903>   DW_AT_name        : (indirect string, offset: 0x8d355): texture_wrap
    <a4907>   DW_AT_decl_file   : 5
    <a4908>   DW_AT_decl_line   : 703
    <a490a>   DW_AT_decl_column : 11
    <a490b>   DW_AT_type        : <0x7999f>
    <a490f>   DW_AT_data_member_location: 8
 <2><a4910>: Abbrev Number: 10 (DW_TAG_member)
    <a4911>   DW_AT_name        : (indirect string, offset: 0x6b3bb): PO2_fix
    <a4915>   DW_AT_decl_file   : 5
    <a4916>   DW_AT_decl_line   : 704
    <a4918>   DW_AT_decl_column : 11
    <a4919>   DW_AT_type        : <0x7999f>
    <a491d>   DW_AT_data_member_location: 12
 <2><a491e>: Abbrev Number: 0
 <1><a491f>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4920>   DW_AT_name        : (indirect string, offset: 0x8a33f): RENDER_STATE_GLOBAL
    <a4924>   DW_AT_byte_size   : 40
    <a4925>   DW_AT_decl_file   : 5
    <a4926>   DW_AT_decl_line   : 706
    <a4928>   DW_AT_decl_column : 8
    <a4929>   DW_AT_sibling     : <0xa499e>
 <2><a492d>: Abbrev Number: 10 (DW_TAG_member)
    <a492e>   DW_AT_name        : (indirect string, offset: 0xeb3d): dest
    <a4932>   DW_AT_decl_file   : 5
    <a4933>   DW_AT_decl_line   : 707
    <a4935>   DW_AT_decl_column : 24
    <a4936>   DW_AT_type        : <0xa499e>
    <a493a>   DW_AT_data_member_location: 0
 <2><a493b>: Abbrev Number: 10 (DW_TAG_member)
    <a493c>   DW_AT_name        : (indirect string, offset: 0x761e3): source
    <a4940>   DW_AT_decl_file   : 5
    <a4941>   DW_AT_decl_line   : 708
    <a4943>   DW_AT_decl_column : 26
    <a4944>   DW_AT_type        : <0xa49a3>
    <a4948>   DW_AT_data_member_location: 8
 <2><a4949>: Abbrev Number: 10 (DW_TAG_member)
    <a494a>   DW_AT_name        : (indirect string, offset: 0x7bd2a): dest_handle
    <a494e>   DW_AT_decl_file   : 5
    <a494f>   DW_AT_decl_line   : 709
    <a4951>   DW_AT_decl_column : 11
    <a4952>   DW_AT_type        : <0x7999f>
    <a4956>   DW_AT_data_member_location: 16
 <2><a4957>: Abbrev Number: 10 (DW_TAG_member)
    <a4958>   DW_AT_name        : (indirect string, offset: 0x78bae): source_handle
    <a495c>   DW_AT_decl_file   : 5
    <a495d>   DW_AT_decl_line   : 710
    <a495f>   DW_AT_decl_column : 11
    <a4960>   DW_AT_type        : <0x7999f>
    <a4964>   DW_AT_data_member_location: 20
 <2><a4965>: Abbrev Number: 10 (DW_TAG_member)
    <a4966>   DW_AT_name        : (indirect string, offset: 0x77299): view_mode
    <a496a>   DW_AT_decl_file   : 5
    <a496b>   DW_AT_decl_line   : 711
    <a496d>   DW_AT_decl_column : 11
    <a496e>   DW_AT_type        : <0x7999f>
    <a4972>   DW_AT_data_member_location: 24
 <2><a4973>: Abbrev Number: 10 (DW_TAG_member)
    <a4974>   DW_AT_name        : (indirect string, offset: 0x8d659): use_alpha
    <a4978>   DW_AT_decl_file   : 5
    <a4979>   DW_AT_decl_line   : 712
    <a497b>   DW_AT_decl_column : 11
    <a497c>   DW_AT_type        : <0x7999f>
    <a4980>   DW_AT_data_member_location: 28
 <2><a4981>: Abbrev Number: 10 (DW_TAG_member)
    <a4982>   DW_AT_name        : (indirect string, offset: 0x613cd): depthbuffer_mode
    <a4986>   DW_AT_decl_file   : 5
    <a4987>   DW_AT_decl_line   : 713
    <a4989>   DW_AT_decl_column : 11
    <a498a>   DW_AT_type        : <0x7999f>
    <a498e>   DW_AT_data_member_location: 32
 <2><a498f>: Abbrev Number: 10 (DW_TAG_member)
    <a4990>   DW_AT_name        : (indirect string, offset: 0x7c8ad): cull_mode
    <a4994>   DW_AT_decl_file   : 5
    <a4995>   DW_AT_decl_line   : 714
    <a4997>   DW_AT_decl_column : 11
    <a4998>   DW_AT_type        : <0x7999f>
    <a499c>   DW_AT_data_member_location: 36
 <2><a499d>: Abbrev Number: 0
 <1><a499e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a499f>   DW_AT_byte_size   : 8
    <a499f>   DW_AT_type        : <0xa48bb>
 <1><a49a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a49a4>   DW_AT_byte_size   : 8
    <a49a4>   DW_AT_type        : <0xa48d8>
 <1><a49a8>: Abbrev Number: 11 (DW_TAG_variable)
    <a49a9>   DW_AT_name        : (indirect string, offset: 0x7b3ff): render_state
    <a49ad>   DW_AT_decl_file   : 5
    <a49ae>   DW_AT_decl_line   : 716
    <a49b0>   DW_AT_decl_column : 21
    <a49b1>   DW_AT_type        : <0xa491f>
    <a49b5>   DW_AT_external    : 1
    <a49b5>   DW_AT_location    : 9 byte block: 3 40 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e40)
 <1><a49bf>: Abbrev Number: 11 (DW_TAG_variable)
    <a49c0>   DW_AT_name        : (indirect string, offset: 0x82e40): dest_render_state0
    <a49c4>   DW_AT_decl_file   : 5
    <a49c5>   DW_AT_decl_line   : 717
    <a49c7>   DW_AT_decl_column : 19
    <a49c8>   DW_AT_type        : <0xa48bb>
    <a49cc>   DW_AT_external    : 1
    <a49cc>   DW_AT_location    : 9 byte block: 3 68 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e68)
 <1><a49d6>: Abbrev Number: 11 (DW_TAG_variable)
    <a49d7>   DW_AT_name        : (indirect string, offset: 0x8667d): depthbuffer_mode0
    <a49db>   DW_AT_decl_file   : 5
    <a49dc>   DW_AT_decl_line   : 747
    <a49de>   DW_AT_decl_column : 7
    <a49df>   DW_AT_type        : <0x7999f>
    <a49e3>   DW_AT_external    : 1
    <a49e3>   DW_AT_location    : 9 byte block: 3 48 89 a7 0 0 0 0 0 	(DW_OP_addr: a78948)
 <1><a49ed>: Abbrev Number: 11 (DW_TAG_variable)
    <a49ee>   DW_AT_name        : (indirect string, offset: 0x8668f): depthbuffer_mode1
    <a49f2>   DW_AT_decl_file   : 5
    <a49f3>   DW_AT_decl_line   : 748
    <a49f5>   DW_AT_decl_column : 7
    <a49f6>   DW_AT_type        : <0x7999f>
    <a49fa>   DW_AT_external    : 1
    <a49fa>   DW_AT_location    : 9 byte block: 3 4c 89 a7 0 0 0 0 0 	(DW_OP_addr: a7894c)
 <1><a4a04>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4a05>   DW_AT_name        : (indirect string, offset: 0x7a8e2): hardware_img_struct
    <a4a09>   DW_AT_byte_size   : 80
    <a4a0a>   DW_AT_decl_file   : 5
    <a4a0b>   DW_AT_decl_line   : 752
    <a4a0d>   DW_AT_decl_column : 8
    <a4a0e>   DW_AT_sibling     : <0xa4ae1>
 <2><a4a12>: Abbrev Number: 31 (DW_TAG_member)
    <a4a13>   DW_AT_name        : w
    <a4a15>   DW_AT_decl_file   : 5
    <a4a16>   DW_AT_decl_line   : 753
    <a4a18>   DW_AT_decl_column : 11
    <a4a19>   DW_AT_type        : <0x7999f>
    <a4a1d>   DW_AT_data_member_location: 0
 <2><a4a1e>: Abbrev Number: 31 (DW_TAG_member)
    <a4a1f>   DW_AT_name        : h
    <a4a21>   DW_AT_decl_file   : 5
    <a4a22>   DW_AT_decl_line   : 754
    <a4a24>   DW_AT_decl_column : 11
    <a4a25>   DW_AT_type        : <0x7999f>
    <a4a29>   DW_AT_data_member_location: 4
 <2><a4a2a>: Abbrev Number: 10 (DW_TAG_member)
    <a4a2b>   DW_AT_name        : (indirect string, offset: 0x60275): texture_handle
    <a4a2f>   DW_AT_decl_file   : 5
    <a4a30>   DW_AT_decl_line   : 755
    <a4a32>   DW_AT_decl_column : 11
    <a4a33>   DW_AT_type        : <0x7999f>
    <a4a37>   DW_AT_data_member_location: 8
 <2><a4a38>: Abbrev Number: 10 (DW_TAG_member)
    <a4a39>   DW_AT_name        : (indirect string, offset: 0x89adc): dest_context_handle
    <a4a3d>   DW_AT_decl_file   : 5
    <a4a3e>   DW_AT_decl_line   : 756
    <a4a40>   DW_AT_decl_column : 11
    <a4a41>   DW_AT_type        : <0x7999f>
    <a4a45>   DW_AT_data_member_location: 12
 <2><a4a46>: Abbrev Number: 10 (DW_TAG_member)
    <a4a47>   DW_AT_name        : (indirect string, offset: 0x80433): depthbuffer_handle
    <a4a4b>   DW_AT_decl_file   : 5
    <a4a4c>   DW_AT_decl_line   : 757
    <a4a4e>   DW_AT_decl_column : 11
    <a4a4f>   DW_AT_type        : <0x7999f>
    <a4a53>   DW_AT_data_member_location: 16
 <2><a4a54>: Abbrev Number: 10 (DW_TAG_member)
    <a4a55>   DW_AT_name        : (indirect string, offset: 0x77ba2): pending_commands
    <a4a59>   DW_AT_decl_file   : 5
    <a4a5a>   DW_AT_decl_line   : 758
    <a4a5c>   DW_AT_decl_column : 11
    <a4a5d>   DW_AT_type        : <0x7999f>
    <a4a61>   DW_AT_data_member_location: 20
 <2><a4a62>: Abbrev Number: 10 (DW_TAG_member)
    <a4a63>   DW_AT_name        : (indirect string, offset: 0x6ed27): remove
    <a4a67>   DW_AT_decl_file   : 5
    <a4a68>   DW_AT_decl_line   : 759
    <a4a6a>   DW_AT_decl_column : 11
    <a4a6b>   DW_AT_type        : <0x7999f>
    <a4a6f>   DW_AT_data_member_location: 24
 <2><a4a70>: Abbrev Number: 10 (DW_TAG_member)
    <a4a71>   DW_AT_name        : (indirect string, offset: 0x62606): software_pixel_buffer
    <a4a75>   DW_AT_decl_file   : 5
    <a4a76>   DW_AT_decl_line   : 760
    <a4a78>   DW_AT_decl_column : 13
    <a4a79>   DW_AT_type        : <0x93492>
    <a4a7d>   DW_AT_data_member_location: 32
 <2><a4a7e>: Abbrev Number: 10 (DW_TAG_member)
    <a4a7f>   DW_AT_name        : (indirect string, offset: 0x5eb56): alpha_disabled
    <a4a83>   DW_AT_decl_file   : 5
    <a4a84>   DW_AT_decl_line   : 761
    <a4a86>   DW_AT_decl_column : 11
    <a4a87>   DW_AT_type        : <0x7999f>
    <a4a8b>   DW_AT_data_member_location: 40
 <2><a4a8c>: Abbrev Number: 10 (DW_TAG_member)
    <a4a8d>   DW_AT_name        : (indirect string, offset: 0x613cd): depthbuffer_mode
    <a4a91>   DW_AT_decl_file   : 5
    <a4a92>   DW_AT_decl_line   : 762
    <a4a94>   DW_AT_decl_column : 11
    <a4a95>   DW_AT_type        : <0x7999f>
    <a4a99>   DW_AT_data_member_location: 44
 <2><a4a9a>: Abbrev Number: 10 (DW_TAG_member)
    <a4a9b>   DW_AT_name        : (indirect string, offset: 0x673b9): valid
    <a4a9f>   DW_AT_decl_file   : 5
    <a4aa0>   DW_AT_decl_line   : 763
    <a4aa2>   DW_AT_decl_column : 11
    <a4aa3>   DW_AT_type        : <0x7999f>
    <a4aa7>   DW_AT_data_member_location: 48
 <2><a4aa8>: Abbrev Number: 10 (DW_TAG_member)
    <a4aa9>   DW_AT_name        : (indirect string, offset: 0x76af7): source_state
    <a4aad>   DW_AT_decl_file   : 5
    <a4aae>   DW_AT_decl_line   : 764
    <a4ab0>   DW_AT_decl_column : 25
    <a4ab1>   DW_AT_type        : <0xa48d8>
    <a4ab5>   DW_AT_data_member_location: 52
 <2><a4ab6>: Abbrev Number: 10 (DW_TAG_member)
    <a4ab7>   DW_AT_name        : (indirect string, offset: 0x6e757): dest_state
    <a4abb>   DW_AT_decl_file   : 5
    <a4abc>   DW_AT_decl_line   : 765
    <a4abe>   DW_AT_decl_column : 23
    <a4abf>   DW_AT_type        : <0xa48bb>
    <a4ac3>   DW_AT_data_member_location: 68
 <2><a4ac4>: Abbrev Number: 10 (DW_TAG_member)
    <a4ac5>   DW_AT_name        : (indirect string, offset: 0x784d8): PO2_w
    <a4ac9>   DW_AT_decl_file   : 5
    <a4aca>   DW_AT_decl_line   : 766
    <a4acc>   DW_AT_decl_column : 11
    <a4acd>   DW_AT_type        : <0x7999f>
    <a4ad1>   DW_AT_data_member_location: 72
 <2><a4ad2>: Abbrev Number: 10 (DW_TAG_member)
    <a4ad3>   DW_AT_name        : (indirect string, offset: 0x86c39): PO2_h
    <a4ad7>   DW_AT_decl_file   : 5
    <a4ad8>   DW_AT_decl_line   : 767
    <a4ada>   DW_AT_decl_column : 11
    <a4adb>   DW_AT_type        : <0x7999f>
    <a4adf>   DW_AT_data_member_location: 76
 <2><a4ae0>: Abbrev Number: 0
 <1><a4ae1>: Abbrev Number: 11 (DW_TAG_variable)
    <a4ae2>   DW_AT_name        : (indirect string, offset: 0x603dc): hardware_img_handles
    <a4ae6>   DW_AT_decl_file   : 5
    <a4ae7>   DW_AT_decl_line   : 769
    <a4ae9>   DW_AT_decl_column : 7
    <a4aea>   DW_AT_type        : <0xa483d>
    <a4aee>   DW_AT_external    : 1
    <a4aee>   DW_AT_location    : 9 byte block: 3 70 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e70)
 <1><a4af8>: Abbrev Number: 11 (DW_TAG_variable)
    <a4af9>   DW_AT_name        : (indirect string, offset: 0x771c5): first_hardware_command
    <a4afd>   DW_AT_decl_file   : 5
    <a4afe>   DW_AT_decl_line   : 771
    <a4b00>   DW_AT_decl_column : 7
    <a4b01>   DW_AT_type        : <0x7999f>
    <a4b05>   DW_AT_external    : 1
    <a4b05>   DW_AT_location    : 9 byte block: 3 78 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e78)
 <1><a4b0f>: Abbrev Number: 11 (DW_TAG_variable)
    <a4b10>   DW_AT_name        : (indirect string, offset: 0x68946): last_hardware_command_added
    <a4b14>   DW_AT_decl_file   : 5
    <a4b15>   DW_AT_decl_line   : 772
    <a4b17>   DW_AT_decl_column : 7
    <a4b18>   DW_AT_type        : <0x7999f>
    <a4b1c>   DW_AT_external    : 1
    <a4b1c>   DW_AT_location    : 9 byte block: 3 7c 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e7c)
 <1><a4b26>: Abbrev Number: 11 (DW_TAG_variable)
    <a4b27>   DW_AT_name        : (indirect string, offset: 0x75e23): last_hardware_command_rendered
    <a4b2b>   DW_AT_decl_file   : 5
    <a4b2c>   DW_AT_decl_line   : 773
    <a4b2e>   DW_AT_decl_column : 7
    <a4b2f>   DW_AT_type        : <0x7999f>
    <a4b33>   DW_AT_external    : 1
    <a4b33>   DW_AT_location    : 9 byte block: 3 80 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e80)
 <1><a4b3d>: Abbrev Number: 11 (DW_TAG_variable)
    <a4b3e>   DW_AT_name        : (indirect string, offset: 0x7a44a): next_hardware_command_to_remove
    <a4b42>   DW_AT_decl_file   : 5
    <a4b43>   DW_AT_decl_line   : 774
    <a4b45>   DW_AT_decl_column : 7
    <a4b46>   DW_AT_type        : <0x7999f>
    <a4b4a>   DW_AT_external    : 1
    <a4b4a>   DW_AT_location    : 9 byte block: 3 84 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e84)
 <1><a4b54>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4b55>   DW_AT_name        : (indirect string, offset: 0x7c5d9): hardware_graphics_command_struct
    <a4b59>   DW_AT_byte_size   : 112
    <a4b5a>   DW_AT_decl_file   : 5
    <a4b5b>   DW_AT_decl_line   : 776
    <a4b5d>   DW_AT_decl_column : 8
    <a4b5e>   DW_AT_sibling     : <0xa4cfb>
 <2><a4b62>: Abbrev Number: 47 (DW_TAG_union_type)
    <a4b63>   DW_AT_byte_size   : 4
    <a4b64>   DW_AT_decl_file   : 5
    <a4b65>   DW_AT_decl_line   : 781
    <a4b67>   DW_AT_decl_column : 10
    <a4b68>   DW_AT_sibling     : <0xa4b87>
 <3><a4b6c>: Abbrev Number: 25 (DW_TAG_member)
    <a4b6d>   DW_AT_name        : (indirect string, offset: 0x8a210): option
    <a4b71>   DW_AT_decl_file   : 5
    <a4b72>   DW_AT_decl_line   : 782
    <a4b74>   DW_AT_decl_column : 15
    <a4b75>   DW_AT_type        : <0x7999f>
 <3><a4b79>: Abbrev Number: 25 (DW_TAG_member)
    <a4b7a>   DW_AT_name        : (indirect string, offset: 0x70c0c): src_img
    <a4b7e>   DW_AT_decl_file   : 5
    <a4b7f>   DW_AT_decl_line   : 783
    <a4b81>   DW_AT_decl_column : 15
    <a4b82>   DW_AT_type        : <0x7999f>
 <3><a4b86>: Abbrev Number: 0
 <2><a4b87>: Abbrev Number: 47 (DW_TAG_union_type)
    <a4b88>   DW_AT_byte_size   : 4
    <a4b89>   DW_AT_decl_file   : 5
    <a4b8a>   DW_AT_decl_line   : 785
    <a4b8c>   DW_AT_decl_column : 10
    <a4b8d>   DW_AT_sibling     : <0xa4bac>
 <3><a4b91>: Abbrev Number: 25 (DW_TAG_member)
    <a4b92>   DW_AT_name        : (indirect string, offset: 0x5ef08): dst_img
    <a4b96>   DW_AT_decl_file   : 5
    <a4b97>   DW_AT_decl_line   : 786
    <a4b99>   DW_AT_decl_column : 15
    <a4b9a>   DW_AT_type        : <0x7999f>
 <3><a4b9e>: Abbrev Number: 25 (DW_TAG_member)
    <a4b9f>   DW_AT_name        : (indirect string, offset: 0x8ccdd): target
    <a4ba3>   DW_AT_decl_file   : 5
    <a4ba4>   DW_AT_decl_line   : 787
    <a4ba6>   DW_AT_decl_column : 15
    <a4ba7>   DW_AT_type        : <0x7999f>
 <3><a4bab>: Abbrev Number: 0
 <2><a4bac>: Abbrev Number: 10 (DW_TAG_member)
    <a4bad>   DW_AT_name        : (indirect string, offset: 0x7e05b): order
    <a4bb1>   DW_AT_decl_file   : 5
    <a4bb2>   DW_AT_decl_line   : 777
    <a4bb4>   DW_AT_decl_column : 11
    <a4bb5>   DW_AT_type        : <0x799b0>
    <a4bb9>   DW_AT_data_member_location: 0
 <2><a4bba>: Abbrev Number: 10 (DW_TAG_member)
    <a4bbb>   DW_AT_name        : (indirect string, offset: 0x7b8f8): next_command
    <a4bbf>   DW_AT_decl_file   : 5
    <a4bc0>   DW_AT_decl_line   : 778
    <a4bc2>   DW_AT_decl_column : 11
    <a4bc3>   DW_AT_type        : <0x7999f>
    <a4bc7>   DW_AT_data_member_location: 8
 <2><a4bc8>: Abbrev Number: 10 (DW_TAG_member)
    <a4bc9>   DW_AT_name        : (indirect string, offset: 0x59c79): command
    <a4bcd>   DW_AT_decl_file   : 5
    <a4bce>   DW_AT_decl_line   : 779
    <a4bd0>   DW_AT_decl_column : 11
    <a4bd1>   DW_AT_type        : <0x799b0>
    <a4bd5>   DW_AT_data_member_location: 16
 <2><a4bd6>: Abbrev Number: 46 (DW_TAG_member)
    <a4bd7>   DW_AT_type        : <0xa4b62>
    <a4bdb>   DW_AT_data_member_location: 24
 <2><a4bdc>: Abbrev Number: 46 (DW_TAG_member)
    <a4bdd>   DW_AT_type        : <0xa4b87>
    <a4be1>   DW_AT_data_member_location: 28
 <2><a4be2>: Abbrev Number: 10 (DW_TAG_member)
    <a4be3>   DW_AT_name        : (indirect string, offset: 0x670fe): src_x1
    <a4be7>   DW_AT_decl_file   : 5
    <a4be8>   DW_AT_decl_line   : 789
    <a4bea>   DW_AT_decl_column : 11
    <a4beb>   DW_AT_type        : <0x79ba2>
    <a4bef>   DW_AT_data_member_location: 32
 <2><a4bf0>: Abbrev Number: 10 (DW_TAG_member)
    <a4bf1>   DW_AT_name        : (indirect string, offset: 0x672dd): src_y1
    <a4bf5>   DW_AT_decl_file   : 5
    <a4bf6>   DW_AT_decl_line   : 790
    <a4bf8>   DW_AT_decl_column : 11
    <a4bf9>   DW_AT_type        : <0x79ba2>
    <a4bfd>   DW_AT_data_member_location: 36
 <2><a4bfe>: Abbrev Number: 10 (DW_TAG_member)
    <a4bff>   DW_AT_name        : (indirect string, offset: 0x67105): src_x2
    <a4c03>   DW_AT_decl_file   : 5
    <a4c04>   DW_AT_decl_line   : 791
    <a4c06>   DW_AT_decl_column : 11
    <a4c07>   DW_AT_type        : <0x79ba2>
    <a4c0b>   DW_AT_data_member_location: 40
 <2><a4c0c>: Abbrev Number: 10 (DW_TAG_member)
    <a4c0d>   DW_AT_name        : (indirect string, offset: 0x74054): src_y2
    <a4c11>   DW_AT_decl_file   : 5
    <a4c12>   DW_AT_decl_line   : 792
    <a4c14>   DW_AT_decl_column : 11
    <a4c15>   DW_AT_type        : <0x79ba2>
    <a4c19>   DW_AT_data_member_location: 44
 <2><a4c1a>: Abbrev Number: 10 (DW_TAG_member)
    <a4c1b>   DW_AT_name        : (indirect string, offset: 0x6710c): src_x3
    <a4c1f>   DW_AT_decl_file   : 5
    <a4c20>   DW_AT_decl_line   : 793
    <a4c22>   DW_AT_decl_column : 11
    <a4c23>   DW_AT_type        : <0x79ba2>
    <a4c27>   DW_AT_data_member_location: 48
 <2><a4c28>: Abbrev Number: 10 (DW_TAG_member)
    <a4c29>   DW_AT_name        : (indirect string, offset: 0x672fd): src_y3
    <a4c2d>   DW_AT_decl_file   : 5
    <a4c2e>   DW_AT_decl_line   : 794
    <a4c30>   DW_AT_decl_column : 11
    <a4c31>   DW_AT_type        : <0x79ba2>
    <a4c35>   DW_AT_data_member_location: 52
 <2><a4c36>: Abbrev Number: 10 (DW_TAG_member)
    <a4c37>   DW_AT_name        : (indirect string, offset: 0x60e40): dst_x1
    <a4c3b>   DW_AT_decl_file   : 5
    <a4c3c>   DW_AT_decl_line   : 795
    <a4c3e>   DW_AT_decl_column : 11
    <a4c3f>   DW_AT_type        : <0x79ba2>
    <a4c43>   DW_AT_data_member_location: 56
 <2><a4c44>: Abbrev Number: 10 (DW_TAG_member)
    <a4c45>   DW_AT_name        : (indirect string, offset: 0x61004): dst_y1
    <a4c49>   DW_AT_decl_file   : 5
    <a4c4a>   DW_AT_decl_line   : 796
    <a4c4c>   DW_AT_decl_column : 11
    <a4c4d>   DW_AT_type        : <0x79ba2>
    <a4c51>   DW_AT_data_member_location: 60
 <2><a4c52>: Abbrev Number: 10 (DW_TAG_member)
    <a4c53>   DW_AT_name        : (indirect string, offset: 0x6119d): dst_z1
    <a4c57>   DW_AT_decl_file   : 5
    <a4c58>   DW_AT_decl_line   : 797
    <a4c5a>   DW_AT_decl_column : 11
    <a4c5b>   DW_AT_type        : <0x79ba2>
    <a4c5f>   DW_AT_data_member_location: 64
 <2><a4c60>: Abbrev Number: 10 (DW_TAG_member)
    <a4c61>   DW_AT_name        : (indirect string, offset: 0x60e47): dst_x2
    <a4c65>   DW_AT_decl_file   : 5
    <a4c66>   DW_AT_decl_line   : 798
    <a4c68>   DW_AT_decl_column : 11
    <a4c69>   DW_AT_type        : <0x79ba2>
    <a4c6d>   DW_AT_data_member_location: 68
 <2><a4c6e>: Abbrev Number: 10 (DW_TAG_member)
    <a4c6f>   DW_AT_name        : (indirect string, offset: 0x6100b): dst_y2
    <a4c73>   DW_AT_decl_file   : 5
    <a4c74>   DW_AT_decl_line   : 799
    <a4c76>   DW_AT_decl_column : 11
    <a4c77>   DW_AT_type        : <0x79ba2>
    <a4c7b>   DW_AT_data_member_location: 72
 <2><a4c7c>: Abbrev Number: 10 (DW_TAG_member)
    <a4c7d>   DW_AT_name        : (indirect string, offset: 0x611a4): dst_z2
    <a4c81>   DW_AT_decl_file   : 5
    <a4c82>   DW_AT_decl_line   : 800
    <a4c84>   DW_AT_decl_column : 11
    <a4c85>   DW_AT_type        : <0x79ba2>
    <a4c89>   DW_AT_data_member_location: 76
 <2><a4c8a>: Abbrev Number: 10 (DW_TAG_member)
    <a4c8b>   DW_AT_name        : (indirect string, offset: 0x60e4e): dst_x3
    <a4c8f>   DW_AT_decl_file   : 5
    <a4c90>   DW_AT_decl_line   : 801
    <a4c92>   DW_AT_decl_column : 11
    <a4c93>   DW_AT_type        : <0x79ba2>
    <a4c97>   DW_AT_data_member_location: 80
 <2><a4c98>: Abbrev Number: 10 (DW_TAG_member)
    <a4c99>   DW_AT_name        : (indirect string, offset: 0x61012): dst_y3
    <a4c9d>   DW_AT_decl_file   : 5
    <a4c9e>   DW_AT_decl_line   : 802
    <a4ca0>   DW_AT_decl_column : 11
    <a4ca1>   DW_AT_type        : <0x79ba2>
    <a4ca5>   DW_AT_data_member_location: 84
 <2><a4ca6>: Abbrev Number: 10 (DW_TAG_member)
    <a4ca7>   DW_AT_name        : (indirect string, offset: 0x611ab): dst_z3
    <a4cab>   DW_AT_decl_file   : 5
    <a4cac>   DW_AT_decl_line   : 803
    <a4cae>   DW_AT_decl_column : 11
    <a4caf>   DW_AT_type        : <0x79ba2>
    <a4cb3>   DW_AT_data_member_location: 88
 <2><a4cb4>: Abbrev Number: 10 (DW_TAG_member)
    <a4cb5>   DW_AT_name        : (indirect string, offset: 0x819ad): smooth
    <a4cb9>   DW_AT_decl_file   : 5
    <a4cba>   DW_AT_decl_line   : 804
    <a4cbc>   DW_AT_decl_column : 11
    <a4cbd>   DW_AT_type        : <0x7999f>
    <a4cc1>   DW_AT_data_member_location: 92
 <2><a4cc2>: Abbrev Number: 10 (DW_TAG_member)
    <a4cc3>   DW_AT_name        : (indirect string, offset: 0x7c8ad): cull_mode
    <a4cc7>   DW_AT_decl_file   : 5
    <a4cc8>   DW_AT_decl_line   : 805
    <a4cca>   DW_AT_decl_column : 11
    <a4ccb>   DW_AT_type        : <0x7999f>
    <a4ccf>   DW_AT_data_member_location: 96
 <2><a4cd0>: Abbrev Number: 10 (DW_TAG_member)
    <a4cd1>   DW_AT_name        : (indirect string, offset: 0x613cd): depthbuffer_mode
    <a4cd5>   DW_AT_decl_file   : 5
    <a4cd6>   DW_AT_decl_line   : 806
    <a4cd8>   DW_AT_decl_column : 11
    <a4cd9>   DW_AT_type        : <0x7999f>
    <a4cdd>   DW_AT_data_member_location: 100
 <2><a4cde>: Abbrev Number: 10 (DW_TAG_member)
    <a4cdf>   DW_AT_name        : (indirect string, offset: 0x8d659): use_alpha
    <a4ce3>   DW_AT_decl_file   : 5
    <a4ce4>   DW_AT_decl_line   : 807
    <a4ce6>   DW_AT_decl_column : 11
    <a4ce7>   DW_AT_type        : <0x7999f>
    <a4ceb>   DW_AT_data_member_location: 104
 <2><a4cec>: Abbrev Number: 10 (DW_TAG_member)
    <a4ced>   DW_AT_name        : (indirect string, offset: 0x6ed27): remove
    <a4cf1>   DW_AT_decl_file   : 5
    <a4cf2>   DW_AT_decl_line   : 808
    <a4cf4>   DW_AT_decl_column : 11
    <a4cf5>   DW_AT_type        : <0x7999f>
    <a4cf9>   DW_AT_data_member_location: 108
 <2><a4cfa>: Abbrev Number: 0
 <1><a4cfb>: Abbrev Number: 11 (DW_TAG_variable)
    <a4cfc>   DW_AT_name        : (indirect string, offset: 0x8a253): hardware_graphics_command_handles
    <a4d00>   DW_AT_decl_file   : 5
    <a4d01>   DW_AT_decl_line   : 810
    <a4d03>   DW_AT_decl_column : 7
    <a4d04>   DW_AT_type        : <0xa483d>
    <a4d08>   DW_AT_external    : 1
    <a4d08>   DW_AT_location    : 9 byte block: 3 88 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e88)
 <1><a4d12>: Abbrev Number: 11 (DW_TAG_variable)
    <a4d13>   DW_AT_name        : (indirect string, offset: 0x5e573): SOFTWARE_IMG_HANDLE_MIN
    <a4d17>   DW_AT_decl_file   : 5
    <a4d18>   DW_AT_decl_line   : 818
    <a4d1a>   DW_AT_decl_column : 7
    <a4d1b>   DW_AT_type        : <0x7999f>
    <a4d1f>   DW_AT_external    : 1
    <a4d1f>   DW_AT_location    : 9 byte block: 3 50 89 a7 0 0 0 0 0 	(DW_OP_addr: a78950)
 <1><a4d29>: Abbrev Number: 11 (DW_TAG_variable)
    <a4d2a>   DW_AT_name        : (indirect string, offset: 0x7d337): HARDWARE_IMG_HANDLE_OFFSET
    <a4d2e>   DW_AT_decl_file   : 5
    <a4d2f>   DW_AT_decl_line   : 819
    <a4d31>   DW_AT_decl_column : 7
    <a4d32>   DW_AT_type        : <0x7999f>
    <a4d36>   DW_AT_external    : 1
    <a4d36>   DW_AT_location    : 9 byte block: 3 54 89 a7 0 0 0 0 0 	(DW_OP_addr: a78954)
 <1><a4d40>: Abbrev Number: 49 (DW_TAG_variable)
    <a4d41>   DW_AT_name        : (indirect string, offset: 0xc299): requestedKeyboardOverlayImage
    <a4d45>   DW_AT_decl_file   : 6
    <a4d46>   DW_AT_decl_line   : 2
    <a4d47>   DW_AT_decl_column : 7
    <a4d48>   DW_AT_type        : <0x7999f>
    <a4d4c>   DW_AT_external    : 1
    <a4d4c>   DW_AT_location    : 9 byte block: 3 90 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e90)
 <1><a4d56>: Abbrev Number: 49 (DW_TAG_variable)
    <a4d57>   DW_AT_name        : (indirect string, offset: 0x6b3b4): force_NPO2_fix
    <a4d5b>   DW_AT_decl_file   : 6
    <a4d5c>   DW_AT_decl_line   : 56
    <a4d5d>   DW_AT_decl_column : 11
    <a4d5e>   DW_AT_type        : <0x7999f>
    <a4d62>   DW_AT_external    : 1
    <a4d62>   DW_AT_location    : 9 byte block: 3 94 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e94)
 <1><a4d6c>: Abbrev Number: 49 (DW_TAG_variable)
    <a4d6d>   DW_AT_name        : (indirect string, offset: 0x71ee6): NPO2_buffer
    <a4d71>   DW_AT_decl_file   : 6
    <a4d72>   DW_AT_decl_line   : 58
    <a4d73>   DW_AT_decl_column : 13
    <a4d74>   DW_AT_type        : <0x93492>
    <a4d78>   DW_AT_external    : 1
    <a4d78>   DW_AT_location    : 9 byte block: 3 98 7e b9 0 0 0 0 0 	(DW_OP_addr: b97e98)
 <1><a4d82>: Abbrev Number: 49 (DW_TAG_variable)
    <a4d83>   DW_AT_name        : (indirect string, offset: 0x74f63): NPO2_buffer_size_in_pixels
    <a4d87>   DW_AT_decl_file   : 6
    <a4d88>   DW_AT_decl_line   : 59
    <a4d89>   DW_AT_decl_column : 11
    <a4d8a>   DW_AT_type        : <0x7999f>
    <a4d8e>   DW_AT_external    : 1
    <a4d8e>   DW_AT_location    : 9 byte block: 3 58 89 a7 0 0 0 0 0 	(DW_OP_addr: a78958)
 <1><a4d98>: Abbrev Number: 11 (DW_TAG_variable)
    <a4d99>   DW_AT_name        : (indirect string, offset: 0x37ef): display_lock_request
    <a4d9d>   DW_AT_decl_file   : 5
    <a4d9e>   DW_AT_decl_line   : 828
    <a4da0>   DW_AT_decl_column : 7
    <a4da1>   DW_AT_type        : <0x799b0>
    <a4da5>   DW_AT_external    : 1
    <a4da5>   DW_AT_location    : 9 byte block: 3 a0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ea0)
 <1><a4daf>: Abbrev Number: 11 (DW_TAG_variable)
    <a4db0>   DW_AT_name        : (indirect string, offset: 0xaebc): display_lock_confirmed
    <a4db4>   DW_AT_decl_file   : 5
    <a4db5>   DW_AT_decl_line   : 829
    <a4db7>   DW_AT_decl_column : 7
    <a4db8>   DW_AT_type        : <0x799b0>
    <a4dbc>   DW_AT_external    : 1
    <a4dbc>   DW_AT_location    : 9 byte block: 3 a8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ea8)
 <1><a4dc6>: Abbrev Number: 11 (DW_TAG_variable)
    <a4dc7>   DW_AT_name        : (indirect string, offset: 0x130e5): display_lock_released
    <a4dcb>   DW_AT_decl_file   : 5
    <a4dcc>   DW_AT_decl_line   : 830
    <a4dce>   DW_AT_decl_column : 7
    <a4dcf>   DW_AT_type        : <0x799b0>
    <a4dd3>   DW_AT_external    : 1
    <a4dd3>   DW_AT_location    : 9 byte block: 3 b0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97eb0)
 <1><a4ddd>: Abbrev Number: 30 (DW_TAG_array_type)
    <a4dde>   DW_AT_type        : <0x799cd>
    <a4de2>   DW_AT_sibling     : <0xa4ded>
 <2><a4de6>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <a4de7>   DW_AT_type        : <0x79786>
    <a4deb>   DW_AT_upper_bound : 255
 <2><a4dec>: Abbrev Number: 0
 <1><a4ded>: Abbrev Number: 7 (DW_TAG_variable)
    <a4dee>   DW_AT_name        : (indirect string, offset: 0x726e8): codepage437_to_unicode16
    <a4df2>   DW_AT_decl_file   : 5
    <a4df3>   DW_AT_decl_line   : 868
    <a4df5>   DW_AT_decl_column : 15
    <a4df6>   DW_AT_type        : <0xa4ddd>
    <a4dfa>   DW_AT_location    : 9 byte block: 3 60 89 a7 0 0 0 0 0 	(DW_OP_addr: a78960)
 <1><a4e04>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4e05>   DW_AT_name        : (indirect string, offset: 0x7fc88): FT_Int32
    <a4e09>   DW_AT_decl_file   : 84
    <a4e0a>   DW_AT_decl_line   : 1991
    <a4e0c>   DW_AT_decl_column : 27
    <a4e0d>   DW_AT_type        : <0x7980a>
 <1><a4e11>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4e12>   DW_AT_name        : (indirect string, offset: 0x6caff): FT_UInt32
    <a4e16>   DW_AT_decl_file   : 84
    <a4e17>   DW_AT_decl_line   : 1992
    <a4e19>   DW_AT_decl_column : 27
    <a4e1a>   DW_AT_type        : <0x797b4>
 <1><a4e1e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4e1f>   DW_AT_name        : (indirect string, offset: 0x8989d): FT_Memory
    <a4e23>   DW_AT_decl_file   : 84
    <a4e24>   DW_AT_decl_line   : 2996
    <a4e26>   DW_AT_decl_column : 34
    <a4e27>   DW_AT_type        : <0xa4e2b>
 <1><a4e2b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4e2c>   DW_AT_byte_size   : 8
    <a4e2c>   DW_AT_type        : <0xa4e30>
 <1><a4e30>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4e31>   DW_AT_name        : (indirect string, offset: 0x68cad): FT_MemoryRec_
    <a4e35>   DW_AT_byte_size   : 32
    <a4e36>   DW_AT_decl_file   : 84
    <a4e37>   DW_AT_decl_line   : 3097
    <a4e39>   DW_AT_decl_column : 11
    <a4e3a>   DW_AT_sibling     : <0xa4e77>
 <2><a4e3e>: Abbrev Number: 10 (DW_TAG_member)
    <a4e3f>   DW_AT_name        : (indirect string, offset: 0x8d384): user
    <a4e43>   DW_AT_decl_file   : 84
    <a4e44>   DW_AT_decl_line   : 3099
    <a4e46>   DW_AT_decl_column : 22
    <a4e47>   DW_AT_type        : <0x79937>
    <a4e4b>   DW_AT_data_member_location: 0
 <2><a4e4c>: Abbrev Number: 10 (DW_TAG_member)
    <a4e4d>   DW_AT_name        : (indirect string, offset: 0x8eb67): alloc
    <a4e51>   DW_AT_decl_file   : 84
    <a4e52>   DW_AT_decl_line   : 3100
    <a4e54>   DW_AT_decl_column : 22
    <a4e55>   DW_AT_type        : <0xa4e77>
    <a4e59>   DW_AT_data_member_location: 8
 <2><a4e5a>: Abbrev Number: 10 (DW_TAG_member)
    <a4e5b>   DW_AT_name        : (indirect string, offset: 0x4ca28): free
    <a4e5f>   DW_AT_decl_file   : 84
    <a4e60>   DW_AT_decl_line   : 3101
    <a4e62>   DW_AT_decl_column : 22
    <a4e63>   DW_AT_type        : <0xa4e9d>
    <a4e67>   DW_AT_data_member_location: 16
 <2><a4e68>: Abbrev Number: 10 (DW_TAG_member)
    <a4e69>   DW_AT_name        : (indirect string, offset: 0x1b933): realloc
    <a4e6d>   DW_AT_decl_file   : 84
    <a4e6e>   DW_AT_decl_line   : 3102
    <a4e70>   DW_AT_decl_column : 22
    <a4e71>   DW_AT_type        : <0xa4ebf>
    <a4e75>   DW_AT_data_member_location: 24
 <2><a4e76>: Abbrev Number: 0
 <1><a4e77>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4e78>   DW_AT_name        : (indirect string, offset: 0x8c774): FT_Alloc_Func
    <a4e7c>   DW_AT_decl_file   : 84
    <a4e7d>   DW_AT_decl_line   : 3018
    <a4e7f>   DW_AT_decl_column : 5
    <a4e80>   DW_AT_type        : <0xa4e84>
 <1><a4e84>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4e85>   DW_AT_byte_size   : 8
    <a4e85>   DW_AT_type        : <0xa4e89>
 <1><a4e89>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <a4e8a>   DW_AT_type        : <0x79937>
    <a4e8e>   DW_AT_sibling     : <0xa4e9d>
 <2><a4e92>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4e93>   DW_AT_type        : <0xa4e1e>
 <2><a4e97>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4e98>   DW_AT_type        : <0x79773>
 <2><a4e9c>: Abbrev Number: 0
 <1><a4e9d>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4e9e>   DW_AT_name        : (indirect string, offset: 0x6a51f): FT_Free_Func
    <a4ea2>   DW_AT_decl_file   : 84
    <a4ea3>   DW_AT_decl_line   : 3038
    <a4ea5>   DW_AT_decl_column : 5
    <a4ea6>   DW_AT_type        : <0xa4eaa>
 <1><a4eaa>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4eab>   DW_AT_byte_size   : 8
    <a4eab>   DW_AT_type        : <0xa4eaf>
 <1><a4eaf>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a4eb0>   DW_AT_sibling     : <0xa4ebf>
 <2><a4eb4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4eb5>   DW_AT_type        : <0xa4e1e>
 <2><a4eb9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4eba>   DW_AT_type        : <0x79937>
 <2><a4ebe>: Abbrev Number: 0
 <1><a4ebf>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4ec0>   DW_AT_name        : (indirect string, offset: 0x62389): FT_Realloc_Func
    <a4ec4>   DW_AT_decl_file   : 84
    <a4ec5>   DW_AT_decl_line   : 3070
    <a4ec7>   DW_AT_decl_column : 5
    <a4ec8>   DW_AT_type        : <0xa4ecc>
 <1><a4ecc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4ecd>   DW_AT_byte_size   : 8
    <a4ecd>   DW_AT_type        : <0xa4ed1>
 <1><a4ed1>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <a4ed2>   DW_AT_type        : <0x79937>
    <a4ed6>   DW_AT_sibling     : <0xa4eef>
 <2><a4eda>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4edb>   DW_AT_type        : <0xa4e1e>
 <2><a4edf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4ee0>   DW_AT_type        : <0x79773>
 <2><a4ee4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4ee5>   DW_AT_type        : <0x79773>
 <2><a4ee9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4eea>   DW_AT_type        : <0x79937>
 <2><a4eee>: Abbrev Number: 0
 <1><a4eef>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4ef0>   DW_AT_name        : (indirect string, offset: 0x8b54b): FT_Stream
    <a4ef4>   DW_AT_decl_file   : 84
    <a4ef5>   DW_AT_decl_line   : 3120
    <a4ef7>   DW_AT_decl_column : 34
    <a4ef8>   DW_AT_type        : <0xa4efc>
 <1><a4efc>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4efd>   DW_AT_byte_size   : 8
    <a4efd>   DW_AT_type        : <0xa4f01>
 <1><a4f01>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a4f02>   DW_AT_name        : (indirect string, offset: 0x60de7): FT_StreamRec_
    <a4f06>   DW_AT_byte_size   : 80
    <a4f07>   DW_AT_decl_file   : 84
    <a4f08>   DW_AT_decl_line   : 3241
    <a4f0a>   DW_AT_decl_column : 19
    <a4f0b>   DW_AT_sibling     : <0xa4f9c>
 <2><a4f0f>: Abbrev Number: 10 (DW_TAG_member)
    <a4f10>   DW_AT_name        : (indirect string, offset: 0x1cb76): base
    <a4f14>   DW_AT_decl_file   : 84
    <a4f15>   DW_AT_decl_line   : 3243
    <a4f17>   DW_AT_decl_column : 26
    <a4f18>   DW_AT_type        : <0x94fd8>
    <a4f1c>   DW_AT_data_member_location: 0
 <2><a4f1d>: Abbrev Number: 10 (DW_TAG_member)
    <a4f1e>   DW_AT_name        : (indirect string, offset: 0x7c563): size
    <a4f22>   DW_AT_decl_file   : 84
    <a4f23>   DW_AT_decl_line   : 3244
    <a4f25>   DW_AT_decl_column : 26
    <a4f26>   DW_AT_type        : <0x79786>
    <a4f2a>   DW_AT_data_member_location: 8
 <2><a4f2b>: Abbrev Number: 31 (DW_TAG_member)
    <a4f2c>   DW_AT_name        : pos
    <a4f30>   DW_AT_decl_file   : 84
    <a4f31>   DW_AT_decl_line   : 3245
    <a4f33>   DW_AT_decl_column : 26
    <a4f34>   DW_AT_type        : <0x79786>
    <a4f38>   DW_AT_data_member_location: 16
 <2><a4f39>: Abbrev Number: 10 (DW_TAG_member)
    <a4f3a>   DW_AT_name        : (indirect string, offset: 0x7f0eb): descriptor
    <a4f3e>   DW_AT_decl_file   : 84
    <a4f3f>   DW_AT_decl_line   : 3247
    <a4f41>   DW_AT_decl_column : 26
    <a4f42>   DW_AT_type        : <0xa4fc6>
    <a4f46>   DW_AT_data_member_location: 24
 <2><a4f47>: Abbrev Number: 10 (DW_TAG_member)
    <a4f48>   DW_AT_name        : (indirect string, offset: 0x603a3): pathname
    <a4f4c>   DW_AT_decl_file   : 84
    <a4f4d>   DW_AT_decl_line   : 3248
    <a4f4f>   DW_AT_decl_column : 26
    <a4f50>   DW_AT_type        : <0xa4fc6>
    <a4f54>   DW_AT_data_member_location: 32
 <2><a4f55>: Abbrev Number: 10 (DW_TAG_member)
    <a4f56>   DW_AT_name        : (indirect string, offset: 0x67895): read
    <a4f5a>   DW_AT_decl_file   : 84
    <a4f5b>   DW_AT_decl_line   : 3249
    <a4f5d>   DW_AT_decl_column : 26
    <a4f5e>   DW_AT_type        : <0xa4fd3>
    <a4f62>   DW_AT_data_member_location: 40
 <2><a4f63>: Abbrev Number: 10 (DW_TAG_member)
    <a4f64>   DW_AT_name        : (indirect string, offset: 0x489ae): close
    <a4f68>   DW_AT_decl_file   : 84
    <a4f69>   DW_AT_decl_line   : 3250
    <a4f6b>   DW_AT_decl_column : 26
    <a4f6c>   DW_AT_type        : <0xa5003>
    <a4f70>   DW_AT_data_member_location: 48
 <2><a4f71>: Abbrev Number: 10 (DW_TAG_member)
    <a4f72>   DW_AT_name        : (indirect string, offset: 0x67ea8): memory
    <a4f76>   DW_AT_decl_file   : 84
    <a4f77>   DW_AT_decl_line   : 3252
    <a4f79>   DW_AT_decl_column : 26
    <a4f7a>   DW_AT_type        : <0xa4e1e>
    <a4f7e>   DW_AT_data_member_location: 56
 <2><a4f7f>: Abbrev Number: 10 (DW_TAG_member)
    <a4f80>   DW_AT_name        : (indirect string, offset: 0x7d4c3): cursor
    <a4f84>   DW_AT_decl_file   : 84
    <a4f85>   DW_AT_decl_line   : 3253
    <a4f87>   DW_AT_decl_column : 26
    <a4f88>   DW_AT_type        : <0x94fd8>
    <a4f8c>   DW_AT_data_member_location: 64
 <2><a4f8d>: Abbrev Number: 10 (DW_TAG_member)
    <a4f8e>   DW_AT_name        : (indirect string, offset: 0x2ed5d): limit
    <a4f92>   DW_AT_decl_file   : 84
    <a4f93>   DW_AT_decl_line   : 3254
    <a4f95>   DW_AT_decl_column : 26
    <a4f96>   DW_AT_type        : <0x94fd8>
    <a4f9a>   DW_AT_data_member_location: 72
 <2><a4f9b>: Abbrev Number: 0
 <1><a4f9c>: Abbrev Number: 131 (DW_TAG_union_type)
    <a4f9e>   DW_AT_name        : (indirect string, offset: 0x71516): FT_StreamDesc_
    <a4fa2>   DW_AT_byte_size   : 8
    <a4fa3>   DW_AT_decl_file   : 84
    <a4fa4>   DW_AT_decl_line   : 3132
    <a4fa6>   DW_AT_decl_column : 18
    <a4fa7>   DW_AT_sibling     : <0xa4fc6>
 <2><a4fab>: Abbrev Number: 25 (DW_TAG_member)
    <a4fac>   DW_AT_name        : (indirect string, offset: 0x655de): value
    <a4fb0>   DW_AT_decl_file   : 84
    <a4fb1>   DW_AT_decl_line   : 3134
    <a4fb3>   DW_AT_decl_column : 12
    <a4fb4>   DW_AT_type        : <0x79773>
 <2><a4fb8>: Abbrev Number: 25 (DW_TAG_member)
    <a4fb9>   DW_AT_name        : (indirect string, offset: 0x1b042): pointer
    <a4fbd>   DW_AT_decl_file   : 84
    <a4fbe>   DW_AT_decl_line   : 3135
    <a4fc0>   DW_AT_decl_column : 12
    <a4fc1>   DW_AT_type        : <0x79937>
 <2><a4fc5>: Abbrev Number: 0
 <1><a4fc6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4fc7>   DW_AT_name        : (indirect string, offset: 0x770f0): FT_StreamDesc
    <a4fcb>   DW_AT_decl_file   : 84
    <a4fcc>   DW_AT_decl_line   : 3137
    <a4fce>   DW_AT_decl_column : 5
    <a4fcf>   DW_AT_type        : <0xa4f9c>
 <1><a4fd3>: Abbrev Number: 4 (DW_TAG_typedef)
    <a4fd4>   DW_AT_name        : (indirect string, offset: 0x660ef): FT_Stream_IoFunc
    <a4fd8>   DW_AT_decl_file   : 84
    <a4fd9>   DW_AT_decl_line   : 3170
    <a4fdb>   DW_AT_decl_column : 5
    <a4fdc>   DW_AT_type        : <0xa4fe0>
 <1><a4fe0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a4fe1>   DW_AT_byte_size   : 8
    <a4fe1>   DW_AT_type        : <0xa4fe5>
 <1><a4fe5>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <a4fe6>   DW_AT_type        : <0x79786>
    <a4fea>   DW_AT_sibling     : <0xa5003>
 <2><a4fee>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4fef>   DW_AT_type        : <0xa4eef>
 <2><a4ff3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4ff4>   DW_AT_type        : <0x79786>
 <2><a4ff8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4ff9>   DW_AT_type        : <0x94fd8>
 <2><a4ffd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a4ffe>   DW_AT_type        : <0x79786>
 <2><a5002>: Abbrev Number: 0
 <1><a5003>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5004>   DW_AT_name        : (indirect string, offset: 0x7323a): FT_Stream_CloseFunc
    <a5008>   DW_AT_decl_file   : 84
    <a5009>   DW_AT_decl_line   : 3189
    <a500b>   DW_AT_decl_column : 5
    <a500c>   DW_AT_type        : <0xa5010>
 <1><a5010>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5011>   DW_AT_byte_size   : 8
    <a5011>   DW_AT_type        : <0xa5015>
 <1><a5015>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <a5016>   DW_AT_sibling     : <0xa5020>
 <2><a501a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <a501b>   DW_AT_type        : <0xa4eef>
 <2><a501f>: Abbrev Number: 0
 <1><a5020>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5021>   DW_AT_name        : (indirect string, offset: 0x5e42e): FT_Pos
    <a5025>   DW_AT_decl_file   : 84
    <a5026>   DW_AT_decl_line   : 3322
    <a5028>   DW_AT_decl_column : 24
    <a5029>   DW_AT_type        : <0x79773>
 <1><a502d>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a502e>   DW_AT_name        : (indirect string, offset: 0x7594d): FT_Vector_
    <a5032>   DW_AT_byte_size   : 16
    <a5033>   DW_AT_decl_file   : 84
    <a5034>   DW_AT_decl_line   : 3337
    <a5036>   DW_AT_decl_column : 19
    <a5037>   DW_AT_sibling     : <0xa5054>
 <2><a503b>: Abbrev Number: 31 (DW_TAG_member)
    <a503c>   DW_AT_name        : x
    <a503e>   DW_AT_decl_file   : 84
    <a503f>   DW_AT_decl_line   : 3339
    <a5041>   DW_AT_decl_column : 13
    <a5042>   DW_AT_type        : <0xa5020>
    <a5046>   DW_AT_data_member_location: 0
 <2><a5047>: Abbrev Number: 31 (DW_TAG_member)
    <a5048>   DW_AT_name        : y
    <a504a>   DW_AT_decl_file   : 84
    <a504b>   DW_AT_decl_line   : 3340
    <a504d>   DW_AT_decl_column : 13
    <a504e>   DW_AT_type        : <0xa5020>
    <a5052>   DW_AT_data_member_location: 8
 <2><a5053>: Abbrev Number: 0
 <1><a5054>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5055>   DW_AT_name        : (indirect string, offset: 0x793b2): FT_Vector
    <a5059>   DW_AT_decl_file   : 84
    <a505a>   DW_AT_decl_line   : 3342
    <a505c>   DW_AT_decl_column : 5
    <a505d>   DW_AT_type        : <0xa502d>
 <1><a5061>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a5062>   DW_AT_name        : (indirect string, offset: 0x85e9a): FT_BBox_
    <a5066>   DW_AT_byte_size   : 32
    <a5067>   DW_AT_decl_file   : 84
    <a5068>   DW_AT_decl_line   : 3377
    <a506a>   DW_AT_decl_column : 19
    <a506b>   DW_AT_sibling     : <0xa50a8>
 <2><a506f>: Abbrev Number: 10 (DW_TAG_member)
    <a5070>   DW_AT_name        : (indirect string, offset: 0x6de9e): xMin
    <a5074>   DW_AT_decl_file   : 84
    <a5075>   DW_AT_decl_line   : 3379
    <a5077>   DW_AT_decl_column : 13
    <a5078>   DW_AT_type        : <0xa5020>
    <a507c>   DW_AT_data_member_location: 0
 <2><a507d>: Abbrev Number: 10 (DW_TAG_member)
    <a507e>   DW_AT_name        : (indirect string, offset: 0x76a13): yMin
    <a5082>   DW_AT_decl_file   : 84
    <a5083>   DW_AT_decl_line   : 3379
    <a5085>   DW_AT_decl_column : 19
    <a5086>   DW_AT_type        : <0xa5020>
    <a508a>   DW_AT_data_member_location: 8
 <2><a508b>: Abbrev Number: 10 (DW_TAG_member)
    <a508c>   DW_AT_name        : (indirect string, offset: 0x7c9a1): xMax
    <a5090>   DW_AT_decl_file   : 84
    <a5091>   DW_AT_decl_line   : 3380
    <a5093>   DW_AT_decl_column : 13
    <a5094>   DW_AT_type        : <0xa5020>
    <a5098>   DW_AT_data_member_location: 16
 <2><a5099>: Abbrev Number: 10 (DW_TAG_member)
    <a509a>   DW_AT_name        : (indirect string, offset: 0x75e98): yMax
    <a509e>   DW_AT_decl_file   : 84
    <a509f>   DW_AT_decl_line   : 3380
    <a50a1>   DW_AT_decl_column : 19
    <a50a2>   DW_AT_type        : <0xa5020>
    <a50a6>   DW_AT_data_member_location: 24
 <2><a50a7>: Abbrev Number: 0
 <1><a50a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <a50a9>   DW_AT_name        : (indirect string, offset: 0x7448a): FT_BBox
    <a50ad>   DW_AT_decl_file   : 84
    <a50ae>   DW_AT_decl_line   : 3382
    <a50b0>   DW_AT_decl_column : 5
    <a50b1>   DW_AT_type        : <0xa5061>
 <1><a50b5>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a50b6>   DW_AT_name        : (indirect string, offset: 0x80203): FT_Bitmap_
    <a50ba>   DW_AT_byte_size   : 40
    <a50bb>   DW_AT_decl_file   : 84
    <a50bc>   DW_AT_decl_line   : 3568
    <a50be>   DW_AT_decl_column : 19
    <a50bf>   DW_AT_sibling     : <0xa5134>
 <2><a50c3>: Abbrev Number: 10 (DW_TAG_member)
    <a50c4>   DW_AT_name        : (indirect string, offset: 0x60bc4): rows
    <a50c8>   DW_AT_decl_file   : 84
    <a50c9>   DW_AT_decl_line   : 3570
    <a50cb>   DW_AT_decl_column : 21
    <a50cc>   DW_AT_type        : <0x7980a>
    <a50d0>   DW_AT_data_member_location: 0
 <2><a50d1>: Abbrev Number: 10 (DW_TAG_member)
    <a50d2>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <a50d6>   DW_AT_decl_file   : 84
    <a50d7>   DW_AT_decl_line   : 3571
    <a50d9>   DW_AT_decl_column : 21
    <a50da>   DW_AT_type        : <0x7980a>
    <a50de>   DW_AT_data_member_location: 4
 <2><a50df>: Abbrev Number: 10 (DW_TAG_member)
    <a50e0>   DW_AT_name        : (indirect string, offset: 0x6377d): pitch
    <a50e4>   DW_AT_decl_file   : 84
    <a50e5>   DW_AT_decl_line   : 3572
    <a50e7>   DW_AT_decl_column : 21
    <a50e8>   DW_AT_type        : <0x7980a>
    <a50ec>   DW_AT_data_member_location: 8
 <2><a50ed>: Abbrev Number: 10 (DW_TAG_member)
    <a50ee>   DW_AT_name        : (indirect string, offset: 0x63575): buffer
    <a50f2>   DW_AT_decl_file   : 84
    <a50f3>   DW_AT_decl_line   : 3573
    <a50f5>   DW_AT_decl_column : 21
    <a50f6>   DW_AT_type        : <0x94fd8>
    <a50fa>   DW_AT_data_member_location: 16
 <2><a50fb>: Abbrev Number: 10 (DW_TAG_member)
    <a50fc>   DW_AT_name        : (indirect string, offset: 0x86c88): num_grays
    <a5100>   DW_AT_decl_file   : 84
    <a5101>   DW_AT_decl_line   : 3574
    <a5103>   DW_AT_decl_column : 21
    <a5104>   DW_AT_type        : <0x797e6>
    <a5108>   DW_AT_data_member_location: 24
 <2><a5109>: Abbrev Number: 10 (DW_TAG_member)
    <a510a>   DW_AT_name        : (indirect string, offset: 0x7f947): pixel_mode
    <a510e>   DW_AT_decl_file   : 84
    <a510f>   DW_AT_decl_line   : 3575
    <a5111>   DW_AT_decl_column : 21
    <a5112>   DW_AT_type        : <0x7996f>
    <a5116>   DW_AT_data_member_location: 26
 <2><a5117>: Abbrev Number: 10 (DW_TAG_member)
    <a5118>   DW_AT_name        : (indirect string, offset: 0x78ba1): palette_mode
    <a511c>   DW_AT_decl_file   : 84
    <a511d>   DW_AT_decl_line   : 3576
    <a511f>   DW_AT_decl_column : 21
    <a5120>   DW_AT_type        : <0x7996f>
    <a5124>   DW_AT_data_member_location: 27
 <2><a5125>: Abbrev Number: 10 (DW_TAG_member)
    <a5126>   DW_AT_name        : (indirect string, offset: 0x65a49): palette
    <a512a>   DW_AT_decl_file   : 84
    <a512b>   DW_AT_decl_line   : 3577
    <a512d>   DW_AT_decl_column : 21
    <a512e>   DW_AT_type        : <0x79937>
    <a5132>   DW_AT_data_member_location: 32
 <2><a5133>: Abbrev Number: 0
 <1><a5134>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5135>   DW_AT_name        : (indirect string, offset: 0x73da1): FT_Bitmap
    <a5139>   DW_AT_decl_file   : 84
    <a513a>   DW_AT_decl_line   : 3579
    <a513c>   DW_AT_decl_column : 5
    <a513d>   DW_AT_type        : <0xa50b5>
 <1><a5141>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a5142>   DW_AT_name        : (indirect string, offset: 0x73583): FT_Outline_
    <a5146>   DW_AT_byte_size   : 40
    <a5147>   DW_AT_decl_file   : 84
    <a5148>   DW_AT_decl_line   : 3639
    <a514a>   DW_AT_decl_column : 19
    <a514b>   DW_AT_sibling     : <0xa51a4>
 <2><a514f>: Abbrev Number: 10 (DW_TAG_member)
    <a5150>   DW_AT_name        : (indirect string, offset: 0x6fc94): n_contours
    <a5154>   DW_AT_decl_file   : 84
    <a5155>   DW_AT_decl_line   : 3641
    <a5157>   DW_AT_decl_column : 17
    <a5158>   DW_AT_type        : <0x797e6>
    <a515c>   DW_AT_data_member_location: 0
 <2><a515d>: Abbrev Number: 10 (DW_TAG_member)
    <a515e>   DW_AT_name        : (indirect string, offset: 0x55c6d): n_points
    <a5162>   DW_AT_decl_file   : 84
    <a5163>   DW_AT_decl_line   : 3642
    <a5165>   DW_AT_decl_column : 17
    <a5166>   DW_AT_type        : <0x797e6>
    <a516a>   DW_AT_data_member_location: 2
 <2><a516b>: Abbrev Number: 10 (DW_TAG_member)
    <a516c>   DW_AT_name        : (indirect string, offset: 0x55c6f): points
    <a5170>   DW_AT_decl_file   : 84
    <a5171>   DW_AT_decl_line   : 3644
    <a5173>   DW_AT_decl_column : 17
    <a5174>   DW_AT_type        : <0xa51a4>
    <a5178>   DW_AT_data_member_location: 8
 <2><a5179>: Abbrev Number: 10 (DW_TAG_member)
    <a517a>   DW_AT_name        : (indirect string, offset: 0x6df9c): tags
    <a517e>   DW_AT_decl_file   : 84
    <a517f>   DW_AT_decl_line   : 3645
    <a5181>   DW_AT_decl_column : 17
    <a5182>   DW_AT_type        : <0x7996a>
    <a5186>   DW_AT_data_member_location: 16
 <2><a5187>: Abbrev Number: 10 (DW_TAG_member)
    <a5188>   DW_AT_name        : (indirect string, offset: 0x6fc96): contours
    <a518c>   DW_AT_decl_file   : 84
    <a518d>   DW_AT_decl_line   : 3646
    <a518f>   DW_AT_decl_column : 17
    <a5190>   DW_AT_type        : <0xa51a9>
    <a5194>   DW_AT_data_member_location: 24
 <2><a5195>: Abbrev Number: 10 (DW_TAG_member)
    <a5196>   DW_AT_name        : (indirect string, offset: 0x4e5df): flags
    <a519a>   DW_AT_decl_file   : 84
    <a519b>   DW_AT_decl_line   : 3648
    <a519d>   DW_AT_decl_column : 17
    <a519e>   DW_AT_type        : <0x7980a>
    <a51a2>   DW_AT_data_member_location: 32
 <2><a51a3>: Abbrev Number: 0
 <1><a51a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a51a5>   DW_AT_byte_size   : 8
    <a51a5>   DW_AT_type        : <0xa5054>
 <1><a51a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a51aa>   DW_AT_byte_size   : 8
    <a51aa>   DW_AT_type        : <0x797e6>
 <1><a51ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <a51af>   DW_AT_name        : (indirect string, offset: 0x6ea68): FT_Outline
    <a51b3>   DW_AT_decl_file   : 84
    <a51b4>   DW_AT_decl_line   : 3650
    <a51b6>   DW_AT_decl_column : 5
    <a51b7>   DW_AT_type        : <0xa5141>
 <1><a51bb>: Abbrev Number: 93 (DW_TAG_enumeration_type)
    <a51bc>   DW_AT_name        : (indirect string, offset: 0x84a48): FT_Glyph_Format_
    <a51c0>   DW_AT_encoding    : 7	(void)
    <a51c0>   DW_AT_byte_size   : 4
    <a51c0>   DW_AT_type        : <0x797b4>
    <a51c4>   DW_AT_decl_file   : 84
    <a51c5>   DW_AT_decl_line   : 4024
    <a51c7>   DW_AT_decl_column : 17
    <a51c8>   DW_AT_sibling     : <0xa51f7>
 <2><a51cc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a51cd>   DW_AT_name        : (indirect string, offset: 0x81052): FT_GLYPH_FORMAT_NONE
    <a51d1>   DW_AT_const_value : 0
 <2><a51d2>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a51d3>   DW_AT_name        : (indirect string, offset: 0x81418): FT_GLYPH_FORMAT_COMPOSITE
    <a51d7>   DW_AT_const_value : 0x636f6d70
 <2><a51db>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a51dc>   DW_AT_name        : (indirect string, offset: 0x6b91c): FT_GLYPH_FORMAT_BITMAP
    <a51e0>   DW_AT_const_value : 0x62697473
 <2><a51e4>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a51e5>   DW_AT_name        : (indirect string, offset: 0x67dbd): FT_GLYPH_FORMAT_OUTLINE
    <a51e9>   DW_AT_const_value : 0x6f75746c
 <2><a51ed>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a51ee>   DW_AT_name        : (indirect string, offset: 0x5fd13): FT_GLYPH_FORMAT_PLOTTER
    <a51f2>   DW_AT_const_value : 0x706c6f74
 <2><a51f6>: Abbrev Number: 0
 <1><a51f7>: Abbrev Number: 4 (DW_TAG_typedef)
    <a51f8>   DW_AT_name        : (indirect string, offset: 0x76392): FT_Glyph_Format
    <a51fc>   DW_AT_decl_file   : 84
    <a51fd>   DW_AT_decl_line   : 4033
    <a51ff>   DW_AT_decl_column : 5
    <a5200>   DW_AT_type        : <0xa51bb>
 <1><a5204>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5205>   DW_AT_name        : (indirect string, offset: 0x5e23c): FT_Byte
    <a5209>   DW_AT_decl_file   : 84
    <a520a>   DW_AT_decl_line   : 4657
    <a520c>   DW_AT_decl_column : 26
    <a520d>   DW_AT_type        : <0x797a1>
 <1><a5211>: Abbrev Number: 27 (DW_TAG_const_type)
    <a5212>   DW_AT_type        : <0xa5204>
 <1><a5216>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5217>   DW_AT_byte_size   : 8
    <a5217>   DW_AT_type        : <0xa5211>
 <1><a521b>: Abbrev Number: 4 (DW_TAG_typedef)
    <a521c>   DW_AT_name        : (indirect string, offset: 0x76f5e): FT_String
    <a5220>   DW_AT_decl_file   : 84
    <a5221>   DW_AT_decl_line   : 4687
    <a5223>   DW_AT_decl_column : 17
    <a5224>   DW_AT_type        : <0x7996f>
 <1><a5228>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5229>   DW_AT_name        : (indirect string, offset: 0x6a11d): FT_Short
    <a522d>   DW_AT_decl_file   : 84
    <a522e>   DW_AT_decl_line   : 4697
    <a5230>   DW_AT_decl_column : 25
    <a5231>   DW_AT_type        : <0x797e6>
 <1><a5235>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5236>   DW_AT_name        : (indirect string, offset: 0x86d69): FT_UShort
    <a523a>   DW_AT_decl_file   : 84
    <a523b>   DW_AT_decl_line   : 4707
    <a523d>   DW_AT_decl_column : 27
    <a523e>   DW_AT_type        : <0x797ad>
 <1><a5242>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5243>   DW_AT_name        : (indirect string, offset: 0x60509): FT_Int
    <a5247>   DW_AT_decl_file   : 84
    <a5248>   DW_AT_decl_line   : 4717
    <a524a>   DW_AT_decl_column : 23
    <a524b>   DW_AT_type        : <0x7980a>
 <1><a524f>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5250>   DW_AT_name        : (indirect string, offset: 0x60c01): FT_UInt
    <a5254>   DW_AT_decl_file   : 84
    <a5255>   DW_AT_decl_line   : 4727
    <a5257>   DW_AT_decl_column : 25
    <a5258>   DW_AT_type        : <0x797b4>
 <1><a525c>: Abbrev Number: 4 (DW_TAG_typedef)
    <a525d>   DW_AT_name        : (indirect string, offset: 0x74756): FT_Long
    <a5261>   DW_AT_decl_file   : 84
    <a5262>   DW_AT_decl_line   : 4737
    <a5264>   DW_AT_decl_column : 24
    <a5265>   DW_AT_type        : <0x79773>
 <1><a5269>: Abbrev Number: 4 (DW_TAG_typedef)
    <a526a>   DW_AT_name        : (indirect string, offset: 0x811ad): FT_ULong
    <a526e>   DW_AT_decl_file   : 84
    <a526f>   DW_AT_decl_line   : 4747
    <a5271>   DW_AT_decl_column : 26
    <a5272>   DW_AT_type        : <0x79786>
 <1><a5276>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5277>   DW_AT_name        : (indirect string, offset: 0x74f9f): FT_Fixed
    <a527b>   DW_AT_decl_file   : 84
    <a527c>   DW_AT_decl_line   : 4779
    <a527e>   DW_AT_decl_column : 24
    <a527f>   DW_AT_type        : <0x79773>
 <1><a5283>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5284>   DW_AT_name        : (indirect string, offset: 0x83810): FT_Error
    <a5288>   DW_AT_decl_file   : 84
    <a5289>   DW_AT_decl_line   : 4790
    <a528b>   DW_AT_decl_column : 16
    <a528c>   DW_AT_type        : <0x7980a>
 <1><a5290>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5291>   DW_AT_name        : (indirect string, offset: 0x6cdc1): FT_Generic_Finalizer
    <a5295>   DW_AT_decl_file   : 84
    <a5296>   DW_AT_decl_line   : 4911
    <a5298>   DW_AT_decl_column : 19
    <a5299>   DW_AT_type        : <0x92776>
 <1><a529d>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a529e>   DW_AT_name        : (indirect string, offset: 0x5dc7e): FT_Generic_
    <a52a2>   DW_AT_byte_size   : 16
    <a52a3>   DW_AT_decl_file   : 84
    <a52a4>   DW_AT_decl_line   : 4941
    <a52a6>   DW_AT_decl_column : 19
    <a52a7>   DW_AT_sibling     : <0xa52c8>
 <2><a52ab>: Abbrev Number: 10 (DW_TAG_member)
    <a52ac>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <a52b0>   DW_AT_decl_file   : 84
    <a52b1>   DW_AT_decl_line   : 4943
    <a52b3>   DW_AT_decl_column : 27
    <a52b4>   DW_AT_type        : <0x79937>
    <a52b8>   DW_AT_data_member_location: 0
 <2><a52b9>: Abbrev Number: 10 (DW_TAG_member)
    <a52ba>   DW_AT_name        : (indirect string, offset: 0x76220): finalizer
    <a52be>   DW_AT_decl_file   : 84
    <a52bf>   DW_AT_decl_line   : 4944
    <a52c1>   DW_AT_decl_column : 27
    <a52c2>   DW_AT_type        : <0xa5290>
    <a52c6>   DW_AT_data_member_location: 8
 <2><a52c7>: Abbrev Number: 0
 <1><a52c8>: Abbrev Number: 4 (DW_TAG_typedef)
    <a52c9>   DW_AT_name        : (indirect string, offset: 0x8cb35): FT_Generic
    <a52cd>   DW_AT_decl_file   : 84
    <a52ce>   DW_AT_decl_line   : 4946
    <a52d0>   DW_AT_decl_column : 5
    <a52d1>   DW_AT_type        : <0xa529d>
 <1><a52d5>: Abbrev Number: 4 (DW_TAG_typedef)
    <a52d6>   DW_AT_name        : (indirect string, offset: 0x84864): FT_ListNode
    <a52da>   DW_AT_decl_file   : 84
    <a52db>   DW_AT_decl_line   : 4993
    <a52dd>   DW_AT_decl_column : 36
    <a52de>   DW_AT_type        : <0xa52e2>
 <1><a52e2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a52e3>   DW_AT_byte_size   : 8
    <a52e3>   DW_AT_type        : <0xa52e7>
 <1><a52e7>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a52e8>   DW_AT_name        : (indirect string, offset: 0x74446): FT_ListNodeRec_
    <a52ec>   DW_AT_byte_size   : 24
    <a52ed>   DW_AT_decl_file   : 84
    <a52ee>   DW_AT_decl_line   : 5020
    <a52f0>   DW_AT_decl_column : 19
    <a52f1>   DW_AT_sibling     : <0xa5320>
 <2><a52f5>: Abbrev Number: 10 (DW_TAG_member)
    <a52f6>   DW_AT_name        : (indirect string, offset: 0x6b000): prev
    <a52fa>   DW_AT_decl_file   : 84
    <a52fb>   DW_AT_decl_line   : 5022
    <a52fd>   DW_AT_decl_column : 18
    <a52fe>   DW_AT_type        : <0xa52d5>
    <a5302>   DW_AT_data_member_location: 0
 <2><a5303>: Abbrev Number: 10 (DW_TAG_member)
    <a5304>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <a5308>   DW_AT_decl_file   : 84
    <a5309>   DW_AT_decl_line   : 5023
    <a530b>   DW_AT_decl_column : 18
    <a530c>   DW_AT_type        : <0xa52d5>
    <a5310>   DW_AT_data_member_location: 8
 <2><a5311>: Abbrev Number: 10 (DW_TAG_member)
    <a5312>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <a5316>   DW_AT_decl_file   : 84
    <a5317>   DW_AT_decl_line   : 5024
    <a5319>   DW_AT_decl_column : 18
    <a531a>   DW_AT_type        : <0x79937>
    <a531e>   DW_AT_data_member_location: 16
 <2><a531f>: Abbrev Number: 0
 <1><a5320>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a5321>   DW_AT_name        : (indirect string, offset: 0x65d5e): FT_ListRec_
    <a5325>   DW_AT_byte_size   : 16
    <a5326>   DW_AT_decl_file   : 84
    <a5327>   DW_AT_decl_line   : 5042
    <a5329>   DW_AT_decl_column : 19
    <a532a>   DW_AT_sibling     : <0xa534b>
 <2><a532e>: Abbrev Number: 10 (DW_TAG_member)
    <a532f>   DW_AT_name        : (indirect string, offset: 0x7faad): head
    <a5333>   DW_AT_decl_file   : 84
    <a5334>   DW_AT_decl_line   : 5044
    <a5336>   DW_AT_decl_column : 18
    <a5337>   DW_AT_type        : <0xa52d5>
    <a533b>   DW_AT_data_member_location: 0
 <2><a533c>: Abbrev Number: 10 (DW_TAG_member)
    <a533d>   DW_AT_name        : (indirect string, offset: 0x2bf5a): tail
    <a5341>   DW_AT_decl_file   : 84
    <a5342>   DW_AT_decl_line   : 5045
    <a5344>   DW_AT_decl_column : 18
    <a5345>   DW_AT_type        : <0xa52d5>
    <a5349>   DW_AT_data_member_location: 8
 <2><a534a>: Abbrev Number: 0
 <1><a534b>: Abbrev Number: 4 (DW_TAG_typedef)
    <a534c>   DW_AT_name        : (indirect string, offset: 0x84a3d): FT_ListRec
    <a5350>   DW_AT_decl_file   : 84
    <a5351>   DW_AT_decl_line   : 5047
    <a5353>   DW_AT_decl_column : 5
    <a5354>   DW_AT_type        : <0xa5320>
 <1><a5358>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a5359>   DW_AT_name        : (indirect string, offset: 0x7be90): FT_Glyph_Metrics_
    <a535d>   DW_AT_byte_size   : 64
    <a535e>   DW_AT_decl_file   : 84
    <a535f>   DW_AT_decl_line   : 5265
    <a5361>   DW_AT_decl_column : 19
    <a5362>   DW_AT_sibling     : <0xa53d7>
 <2><a5366>: Abbrev Number: 10 (DW_TAG_member)
    <a5367>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <a536b>   DW_AT_decl_file   : 84
    <a536c>   DW_AT_decl_line   : 5267
    <a536e>   DW_AT_decl_column : 13
    <a536f>   DW_AT_type        : <0xa5020>
    <a5373>   DW_AT_data_member_location: 0
 <2><a5374>: Abbrev Number: 10 (DW_TAG_member)
    <a5375>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <a5379>   DW_AT_decl_file   : 84
    <a537a>   DW_AT_decl_line   : 5268
    <a537c>   DW_AT_decl_column : 13
    <a537d>   DW_AT_type        : <0xa5020>
    <a5381>   DW_AT_data_member_location: 8
 <2><a5382>: Abbrev Number: 10 (DW_TAG_member)
    <a5383>   DW_AT_name        : (indirect string, offset: 0x74ed8): horiBearingX
    <a5387>   DW_AT_decl_file   : 84
    <a5388>   DW_AT_decl_line   : 5270
    <a538a>   DW_AT_decl_column : 13
    <a538b>   DW_AT_type        : <0xa5020>
    <a538f>   DW_AT_data_member_location: 16
 <2><a5390>: Abbrev Number: 10 (DW_TAG_member)
    <a5391>   DW_AT_name        : (indirect string, offset: 0x74ee5): horiBearingY
    <a5395>   DW_AT_decl_file   : 84
    <a5396>   DW_AT_decl_line   : 5271
    <a5398>   DW_AT_decl_column : 13
    <a5399>   DW_AT_type        : <0xa5020>
    <a539d>   DW_AT_data_member_location: 24
 <2><a539e>: Abbrev Number: 10 (DW_TAG_member)
    <a539f>   DW_AT_name        : (indirect string, offset: 0x70af5): horiAdvance
    <a53a3>   DW_AT_decl_file   : 84
    <a53a4>   DW_AT_decl_line   : 5272
    <a53a6>   DW_AT_decl_column : 13
    <a53a7>   DW_AT_type        : <0xa5020>
    <a53ab>   DW_AT_data_member_location: 32
 <2><a53ac>: Abbrev Number: 10 (DW_TAG_member)
    <a53ad>   DW_AT_name        : (indirect string, offset: 0x77d75): vertBearingX
    <a53b1>   DW_AT_decl_file   : 84
    <a53b2>   DW_AT_decl_line   : 5274
    <a53b4>   DW_AT_decl_column : 13
    <a53b5>   DW_AT_type        : <0xa5020>
    <a53b9>   DW_AT_data_member_location: 40
 <2><a53ba>: Abbrev Number: 10 (DW_TAG_member)
    <a53bb>   DW_AT_name        : (indirect string, offset: 0x6210e): vertBearingY
    <a53bf>   DW_AT_decl_file   : 84
    <a53c0>   DW_AT_decl_line   : 5275
    <a53c2>   DW_AT_decl_column : 13
    <a53c3>   DW_AT_type        : <0xa5020>
    <a53c7>   DW_AT_data_member_location: 48
 <2><a53c8>: Abbrev Number: 10 (DW_TAG_member)
    <a53c9>   DW_AT_name        : (indirect string, offset: 0x81d4f): vertAdvance
    <a53cd>   DW_AT_decl_file   : 84
    <a53ce>   DW_AT_decl_line   : 5276
    <a53d0>   DW_AT_decl_column : 13
    <a53d1>   DW_AT_type        : <0xa5020>
    <a53d5>   DW_AT_data_member_location: 56
 <2><a53d6>: Abbrev Number: 0
 <1><a53d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <a53d8>   DW_AT_name        : (indirect string, offset: 0x8cdb3): FT_Glyph_Metrics
    <a53dc>   DW_AT_decl_file   : 84
    <a53dd>   DW_AT_decl_line   : 5278
    <a53df>   DW_AT_decl_column : 5
    <a53e0>   DW_AT_type        : <0xa5358>
 <1><a53e4>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a53e5>   DW_AT_name        : (indirect string, offset: 0x723f3): FT_Bitmap_Size_
    <a53e9>   DW_AT_byte_size   : 32
    <a53ea>   DW_AT_decl_file   : 84
    <a53eb>   DW_AT_decl_line   : 5318
    <a53ed>   DW_AT_decl_column : 19
    <a53ee>   DW_AT_sibling     : <0xa5439>
 <2><a53f2>: Abbrev Number: 10 (DW_TAG_member)
    <a53f3>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <a53f7>   DW_AT_decl_file   : 84
    <a53f8>   DW_AT_decl_line   : 5320
    <a53fa>   DW_AT_decl_column : 15
    <a53fb>   DW_AT_type        : <0xa5228>
    <a53ff>   DW_AT_data_member_location: 0
 <2><a5400>: Abbrev Number: 10 (DW_TAG_member)
    <a5401>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <a5405>   DW_AT_decl_file   : 84
    <a5406>   DW_AT_decl_line   : 5321
    <a5408>   DW_AT_decl_column : 15
    <a5409>   DW_AT_type        : <0xa5228>
    <a540d>   DW_AT_data_member_location: 2
 <2><a540e>: Abbrev Number: 10 (DW_TAG_member)
    <a540f>   DW_AT_name        : (indirect string, offset: 0x7c563): size
    <a5413>   DW_AT_decl_file   : 84
    <a5414>   DW_AT_decl_line   : 5323
    <a5416>   DW_AT_decl_column : 15
    <a5417>   DW_AT_type        : <0xa5020>
    <a541b>   DW_AT_data_member_location: 8
 <2><a541c>: Abbrev Number: 10 (DW_TAG_member)
    <a541d>   DW_AT_name        : (indirect string, offset: 0x8c7bb): x_ppem
    <a5421>   DW_AT_decl_file   : 84
    <a5422>   DW_AT_decl_line   : 5325
    <a5424>   DW_AT_decl_column : 15
    <a5425>   DW_AT_type        : <0xa5020>
    <a5429>   DW_AT_data_member_location: 16
 <2><a542a>: Abbrev Number: 10 (DW_TAG_member)
    <a542b>   DW_AT_name        : (indirect string, offset: 0x72467): y_ppem
    <a542f>   DW_AT_decl_file   : 84
    <a5430>   DW_AT_decl_line   : 5326
    <a5432>   DW_AT_decl_column : 15
    <a5433>   DW_AT_type        : <0xa5020>
    <a5437>   DW_AT_data_member_location: 24
 <2><a5438>: Abbrev Number: 0
 <1><a5439>: Abbrev Number: 4 (DW_TAG_typedef)
    <a543a>   DW_AT_name        : (indirect string, offset: 0x8c8e2): FT_Bitmap_Size
    <a543e>   DW_AT_decl_file   : 84
    <a543f>   DW_AT_decl_line   : 5328
    <a5441>   DW_AT_decl_column : 5
    <a5442>   DW_AT_type        : <0xa53e4>
 <1><a5446>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5447>   DW_AT_name        : (indirect string, offset: 0x61a17): FT_Library
    <a544b>   DW_AT_decl_file   : 84
    <a544c>   DW_AT_decl_line   : 5358
    <a544e>   DW_AT_decl_column : 35
    <a544f>   DW_AT_type        : <0xa5453>
 <1><a5453>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5454>   DW_AT_byte_size   : 8
    <a5454>   DW_AT_type        : <0xa5458>
 <1><a5458>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a5459>   DW_AT_name        : (indirect string, offset: 0x870fa): FT_LibraryRec_
    <a545d>   DW_AT_declaration : 1
 <1><a545d>: Abbrev Number: 4 (DW_TAG_typedef)
    <a545e>   DW_AT_name        : (indirect string, offset: 0x82c5c): FT_Driver
    <a5462>   DW_AT_decl_file   : 84
    <a5463>   DW_AT_decl_line   : 5381
    <a5465>   DW_AT_decl_column : 34
    <a5466>   DW_AT_type        : <0xa546a>
 <1><a546a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a546b>   DW_AT_byte_size   : 8
    <a546b>   DW_AT_type        : <0xa546f>
 <1><a546f>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a5470>   DW_AT_name        : (indirect string, offset: 0x79adb): FT_DriverRec_
    <a5474>   DW_AT_declaration : 1
 <1><a5474>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5475>   DW_AT_name        : (indirect string, offset: 0x724b0): FT_Face
    <a5479>   DW_AT_decl_file   : 84
    <a547a>   DW_AT_decl_line   : 5418
    <a547c>   DW_AT_decl_column : 32
    <a547d>   DW_AT_type        : <0xa5481>
 <1><a5481>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5482>   DW_AT_byte_size   : 8
    <a5482>   DW_AT_type        : <0xa5486>
 <1><a5486>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a5487>   DW_AT_name        : (indirect string, offset: 0x62864): FT_FaceRec_
    <a548b>   DW_AT_byte_size   : 248
    <a548c>   DW_AT_decl_file   : 84
    <a548d>   DW_AT_decl_line   : 5921
    <a548f>   DW_AT_decl_column : 19
    <a5490>   DW_AT_sibling     : <0xa5647>
 <2><a5494>: Abbrev Number: 10 (DW_TAG_member)
    <a5495>   DW_AT_name        : (indirect string, offset: 0x7c98a): num_faces
    <a5499>   DW_AT_decl_file   : 84
    <a549a>   DW_AT_decl_line   : 5923
    <a549c>   DW_AT_decl_column : 23
    <a549d>   DW_AT_type        : <0xa525c>
    <a54a1>   DW_AT_data_member_location: 0
 <2><a54a2>: Abbrev Number: 10 (DW_TAG_member)
    <a54a3>   DW_AT_name        : (indirect string, offset: 0x714f1): face_index
    <a54a7>   DW_AT_decl_file   : 84
    <a54a8>   DW_AT_decl_line   : 5924
    <a54aa>   DW_AT_decl_column : 23
    <a54ab>   DW_AT_type        : <0xa525c>
    <a54af>   DW_AT_data_member_location: 8
 <2><a54b0>: Abbrev Number: 10 (DW_TAG_member)
    <a54b1>   DW_AT_name        : (indirect string, offset: 0x78e78): face_flags
    <a54b5>   DW_AT_decl_file   : 84
    <a54b6>   DW_AT_decl_line   : 5926
    <a54b8>   DW_AT_decl_column : 23
    <a54b9>   DW_AT_type        : <0xa525c>
    <a54bd>   DW_AT_data_member_location: 16
 <2><a54be>: Abbrev Number: 10 (DW_TAG_member)
    <a54bf>   DW_AT_name        : (indirect string, offset: 0x7c765): style_flags
    <a54c3>   DW_AT_decl_file   : 84
    <a54c4>   DW_AT_decl_line   : 5927
    <a54c6>   DW_AT_decl_column : 23
    <a54c7>   DW_AT_type        : <0xa525c>
    <a54cb>   DW_AT_data_member_location: 24
 <2><a54cc>: Abbrev Number: 10 (DW_TAG_member)
    <a54cd>   DW_AT_name        : (indirect string, offset: 0x6bae6): num_glyphs
    <a54d1>   DW_AT_decl_file   : 84
    <a54d2>   DW_AT_decl_line   : 5929
    <a54d4>   DW_AT_decl_column : 23
    <a54d5>   DW_AT_type        : <0xa525c>
    <a54d9>   DW_AT_data_member_location: 32
 <2><a54da>: Abbrev Number: 10 (DW_TAG_member)
    <a54db>   DW_AT_name        : (indirect string, offset: 0x6fb36): family_name
    <a54df>   DW_AT_decl_file   : 84
    <a54e0>   DW_AT_decl_line   : 5931
    <a54e2>   DW_AT_decl_column : 23
    <a54e3>   DW_AT_type        : <0xa5934>
    <a54e7>   DW_AT_data_member_location: 40
 <2><a54e8>: Abbrev Number: 10 (DW_TAG_member)
    <a54e9>   DW_AT_name        : (indirect string, offset: 0x82480): style_name
    <a54ed>   DW_AT_decl_file   : 84
    <a54ee>   DW_AT_decl_line   : 5932
    <a54f0>   DW_AT_decl_column : 23
    <a54f1>   DW_AT_type        : <0xa5934>
    <a54f5>   DW_AT_data_member_location: 48
 <2><a54f6>: Abbrev Number: 10 (DW_TAG_member)
    <a54f7>   DW_AT_name        : (indirect string, offset: 0x8a14f): num_fixed_sizes
    <a54fb>   DW_AT_decl_file   : 84
    <a54fc>   DW_AT_decl_line   : 5934
    <a54fe>   DW_AT_decl_column : 23
    <a54ff>   DW_AT_type        : <0xa5242>
    <a5503>   DW_AT_data_member_location: 56
 <2><a5504>: Abbrev Number: 10 (DW_TAG_member)
    <a5505>   DW_AT_name        : (indirect string, offset: 0x76c5d): available_sizes
    <a5509>   DW_AT_decl_file   : 84
    <a550a>   DW_AT_decl_line   : 5935
    <a550c>   DW_AT_decl_column : 23
    <a550d>   DW_AT_type        : <0xa5939>
    <a5511>   DW_AT_data_member_location: 64
 <2><a5512>: Abbrev Number: 10 (DW_TAG_member)
    <a5513>   DW_AT_name        : (indirect string, offset: 0x6b36c): num_charmaps
    <a5517>   DW_AT_decl_file   : 84
    <a5518>   DW_AT_decl_line   : 5937
    <a551a>   DW_AT_decl_column : 23
    <a551b>   DW_AT_type        : <0xa5242>
    <a551f>   DW_AT_data_member_location: 72
 <2><a5520>: Abbrev Number: 10 (DW_TAG_member)
    <a5521>   DW_AT_name        : (indirect string, offset: 0x6b370): charmaps
    <a5525>   DW_AT_decl_file   : 84
    <a5526>   DW_AT_decl_line   : 5938
    <a5528>   DW_AT_decl_column : 23
    <a5529>   DW_AT_type        : <0xa593e>
    <a552d>   DW_AT_data_member_location: 80
 <2><a552e>: Abbrev Number: 10 (DW_TAG_member)
    <a552f>   DW_AT_name        : (indirect string, offset: 0x70ee6): generic
    <a5533>   DW_AT_decl_file   : 84
    <a5534>   DW_AT_decl_line   : 5940
    <a5536>   DW_AT_decl_column : 23
    <a5537>   DW_AT_type        : <0xa52c8>
    <a553b>   DW_AT_data_member_location: 88
 <2><a553c>: Abbrev Number: 10 (DW_TAG_member)
    <a553d>   DW_AT_name        : (indirect string, offset: 0x7398d): bbox
    <a5541>   DW_AT_decl_file   : 84
    <a5542>   DW_AT_decl_line   : 5945
    <a5544>   DW_AT_decl_column : 23
    <a5545>   DW_AT_type        : <0xa50a8>
    <a5549>   DW_AT_data_member_location: 104
 <2><a554a>: Abbrev Number: 10 (DW_TAG_member)
    <a554b>   DW_AT_name        : (indirect string, offset: 0x8cc28): units_per_EM
    <a554f>   DW_AT_decl_file   : 84
    <a5550>   DW_AT_decl_line   : 5947
    <a5552>   DW_AT_decl_column : 23
    <a5553>   DW_AT_type        : <0xa5235>
    <a5557>   DW_AT_data_member_location: 136
 <2><a5558>: Abbrev Number: 10 (DW_TAG_member)
    <a5559>   DW_AT_name        : (indirect string, offset: 0x84d81): ascender
    <a555d>   DW_AT_decl_file   : 84
    <a555e>   DW_AT_decl_line   : 5948
    <a5560>   DW_AT_decl_column : 23
    <a5561>   DW_AT_type        : <0xa5228>
    <a5565>   DW_AT_data_member_location: 138
 <2><a5566>: Abbrev Number: 10 (DW_TAG_member)
    <a5567>   DW_AT_name        : (indirect string, offset: 0x7c3cc): descender
    <a556b>   DW_AT_decl_file   : 84
    <a556c>   DW_AT_decl_line   : 5949
    <a556e>   DW_AT_decl_column : 23
    <a556f>   DW_AT_type        : <0xa5228>
    <a5573>   DW_AT_data_member_location: 140
 <2><a5574>: Abbrev Number: 10 (DW_TAG_member)
    <a5575>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <a5579>   DW_AT_decl_file   : 84
    <a557a>   DW_AT_decl_line   : 5950
    <a557c>   DW_AT_decl_column : 23
    <a557d>   DW_AT_type        : <0xa5228>
    <a5581>   DW_AT_data_member_location: 142
 <2><a5582>: Abbrev Number: 10 (DW_TAG_member)
    <a5583>   DW_AT_name        : (indirect string, offset: 0x78eb1): max_advance_width
    <a5587>   DW_AT_decl_file   : 84
    <a5588>   DW_AT_decl_line   : 5952
    <a558a>   DW_AT_decl_column : 23
    <a558b>   DW_AT_type        : <0xa5228>
    <a558f>   DW_AT_data_member_location: 144
 <2><a5590>: Abbrev Number: 10 (DW_TAG_member)
    <a5591>   DW_AT_name        : (indirect string, offset: 0x69870): max_advance_height
    <a5595>   DW_AT_decl_file   : 84
    <a5596>   DW_AT_decl_line   : 5953
    <a5598>   DW_AT_decl_column : 23
    <a5599>   DW_AT_type        : <0xa5228>
    <a559d>   DW_AT_data_member_location: 146
 <2><a559e>: Abbrev Number: 10 (DW_TAG_member)
    <a559f>   DW_AT_name        : (indirect string, offset: 0x62423): underline_position
    <a55a3>   DW_AT_decl_file   : 84
    <a55a4>   DW_AT_decl_line   : 5955
    <a55a6>   DW_AT_decl_column : 23
    <a55a7>   DW_AT_type        : <0xa5228>
    <a55ab>   DW_AT_data_member_location: 148
 <2><a55ac>: Abbrev Number: 10 (DW_TAG_member)
    <a55ad>   DW_AT_name        : (indirect string, offset: 0x655e4): underline_thickness
    <a55b1>   DW_AT_decl_file   : 84
    <a55b2>   DW_AT_decl_line   : 5956
    <a55b4>   DW_AT_decl_column : 23
    <a55b5>   DW_AT_type        : <0xa5228>
    <a55b9>   DW_AT_data_member_location: 150
 <2><a55ba>: Abbrev Number: 10 (DW_TAG_member)
    <a55bb>   DW_AT_name        : (indirect string, offset: 0x74264): glyph
    <a55bf>   DW_AT_decl_file   : 84
    <a55c0>   DW_AT_decl_line   : 5958
    <a55c2>   DW_AT_decl_column : 23
    <a55c3>   DW_AT_type        : <0xa56a0>
    <a55c7>   DW_AT_data_member_location: 152
 <2><a55c8>: Abbrev Number: 10 (DW_TAG_member)
    <a55c9>   DW_AT_name        : (indirect string, offset: 0x7c563): size
    <a55cd>   DW_AT_decl_file   : 84
    <a55ce>   DW_AT_decl_line   : 5959
    <a55d0>   DW_AT_decl_column : 23
    <a55d1>   DW_AT_type        : <0xa5647>
    <a55d5>   DW_AT_data_member_location: 160
 <2><a55d6>: Abbrev Number: 10 (DW_TAG_member)
    <a55d7>   DW_AT_name        : (indirect string, offset: 0x7f040): charmap
    <a55db>   DW_AT_decl_file   : 84
    <a55dc>   DW_AT_decl_line   : 5960
    <a55de>   DW_AT_decl_column : 23
    <a55df>   DW_AT_type        : <0xa57fd>
    <a55e3>   DW_AT_data_member_location: 168
 <2><a55e4>: Abbrev Number: 10 (DW_TAG_member)
    <a55e5>   DW_AT_name        : (indirect string, offset: 0x861ff): driver
    <a55e9>   DW_AT_decl_file   : 84
    <a55ea>   DW_AT_decl_line   : 5964
    <a55ec>   DW_AT_decl_column : 23
    <a55ed>   DW_AT_type        : <0xa545d>
    <a55f1>   DW_AT_data_member_location: 176
 <2><a55f2>: Abbrev Number: 10 (DW_TAG_member)
    <a55f3>   DW_AT_name        : (indirect string, offset: 0x67ea8): memory
    <a55f7>   DW_AT_decl_file   : 84
    <a55f8>   DW_AT_decl_line   : 5965
    <a55fa>   DW_AT_decl_column : 23
    <a55fb>   DW_AT_type        : <0xa4e1e>
    <a55ff>   DW_AT_data_member_location: 184
 <2><a5600>: Abbrev Number: 10 (DW_TAG_member)
    <a5601>   DW_AT_name        : (indirect string, offset: 0x7a7c8): stream
    <a5605>   DW_AT_decl_file   : 84
    <a5606>   DW_AT_decl_line   : 5966
    <a5608>   DW_AT_decl_column : 23
    <a5609>   DW_AT_type        : <0xa4eef>
    <a560d>   DW_AT_data_member_location: 192
 <2><a560e>: Abbrev Number: 10 (DW_TAG_member)
    <a560f>   DW_AT_name        : (indirect string, offset: 0x7f997): sizes_list
    <a5613>   DW_AT_decl_file   : 84
    <a5614>   DW_AT_decl_line   : 5968
    <a5616>   DW_AT_decl_column : 23
    <a5617>   DW_AT_type        : <0xa534b>
    <a561b>   DW_AT_data_member_location: 200
 <2><a561c>: Abbrev Number: 10 (DW_TAG_member)
    <a561d>   DW_AT_name        : (indirect string, offset: 0x88c08): autohint
    <a5621>   DW_AT_decl_file   : 84
    <a5622>   DW_AT_decl_line   : 5970
    <a5624>   DW_AT_decl_column : 23
    <a5625>   DW_AT_type        : <0xa52c8>
    <a5629>   DW_AT_data_member_location: 216
 <2><a562a>: Abbrev Number: 10 (DW_TAG_member)
    <a562b>   DW_AT_name        : (indirect string, offset: 0x6964c): extensions
