    <e3279>   DW_AT_name        : (indirect string, offset: 0x90975): glutPostWindowOverlayRedisplay
    <e327d>   DW_AT_decl_file   : 8
    <e327e>   DW_AT_decl_line   : 441
    <e3280>   DW_AT_decl_column : 26
    <e3281>   DW_AT_prototyped  : 1
    <e3281>   DW_AT_declaration : 1
    <e3281>   DW_AT_sibling     : <0xe328b>
 <2><e3285>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e3286>   DW_AT_type        : <0xe23df>
 <2><e328a>: Abbrev Number: 0
 <1><e328b>: Abbrev Number: 7 (DW_TAG_subprogram)
    <e328c>   DW_AT_external    : 1
    <e328c>   DW_AT_name        : (indirect string, offset: 0x907c7): glutPostOverlayRedisplay
    <e3290>   DW_AT_decl_file   : 8
    <e3290>   DW_AT_decl_line   : 440
    <e3292>   DW_AT_decl_column : 26
    <e3292>   DW_AT_prototyped  : 1
    <e3292>   DW_AT_declaration : 1
 <1><e3292>: Abbrev Number: 4 (DW_TAG_subprogram)
    <e3293>   DW_AT_external    : 1
    <e3293>   DW_AT_name        : (indirect string, offset: 0x9068f): glutUseLayer
    <e3297>   DW_AT_decl_file   : 8
    <e3298>   DW_AT_decl_line   : 439
    <e329a>   DW_AT_decl_column : 26
    <e329b>   DW_AT_prototyped  : 1
    <e329b>   DW_AT_declaration : 1
    <e329b>   DW_AT_sibling     : <0xe32a5>
 <2><e329f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <e32a0>   DW_AT_type        : <0xe239a>
 <2><e32a4>: Abbrev Number: 0
 <1><e32a5>: Abbrev Number: 7 (DW_TAG_subprogram)
    <e32a6>   DW_AT_external    : 1

    <e4e20>   DW_AT_name        : (indirect string, offset: 0x75b45): GLfloat
    <e4e24>   DW_AT_decl_file   : 2
    <e4e25>   DW_AT_decl_line   : 127
    <e4e26>   DW_AT_decl_column : 16
    <e4e27>   DW_AT_type        : <0xe4d90>
 <1><e4e2b>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4e2c>   DW_AT_byte_size   : 8
    <e4e2d>   DW_AT_encoding    : 4	(float)
    <e4e2e>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><e4e32>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4e33>   DW_AT_byte_size   : 8
    <e4e34>   DW_AT_encoding    : 7	(unsigned)
    <e4e35>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><e4e39>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4e3a>   DW_AT_byte_size   : 8
    <e4e3b>   DW_AT_encoding    : 5	(signed)
    <e4e3c>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><e4e40>: Abbrev Number: 40 (DW_TAG_pointer_type)
    <e4e41>   DW_AT_byte_size   : 8
 <1><e4e42>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4e43>   DW_AT_byte_size   : 8
    <e4e43>   DW_AT_type        : <0xe4e47>
 <1><e4e47>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4e48>   DW_AT_byte_size   : 1
    <e4e49>   DW_AT_encoding    : 6	(signed char)
    <e4e4a>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><e4e4e>: Abbrev Number: 18 (DW_TAG_const_type)
    <e4e4f>   DW_AT_type        : <0xe4e47>
 <1><e4e53>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4e54>   DW_AT_byte_size   : 8
    <e4e54>   DW_AT_type        : <0xe4dfb>
 <1><e4e58>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4e59>   DW_AT_byte_size   : 8
    <e4e59>   DW_AT_type        : <0xe4e5d>
 <1><e4e5d>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <e4e5e>   DW_AT_prototyped  : 1
 <1><e4e5e>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e5f>   DW_AT_name        : (indirect string, offset: 0x90c25): glutStrokeRoman
    <e4e63>   DW_AT_decl_file   : 3
    <e4e64>   DW_AT_decl_line   : 208
    <e4e65>   DW_AT_decl_column : 18
    <e4e66>   DW_AT_type        : <0xe4e40>
    <e4e6a>   DW_AT_external    : 1
    <e4e6a>   DW_AT_declaration : 1
 <1><e4e6a>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e6b>   DW_AT_name        : (indirect string, offset: 0x90be1): glutStrokeMonoRoman
    <e4e6f>   DW_AT_decl_file   : 3
    <e4e70>   DW_AT_decl_line   : 209
    <e4e71>   DW_AT_decl_column : 18
    <e4e72>   DW_AT_type        : <0xe4e40>
    <e4e76>   DW_AT_external    : 1
    <e4e76>   DW_AT_declaration : 1
 <1><e4e76>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e77>   DW_AT_name        : (indirect string, offset: 0x90b12): glutBitmap9By15
    <e4e7b>   DW_AT_decl_file   : 3
    <e4e7c>   DW_AT_decl_line   : 210
    <e4e7d>   DW_AT_decl_column : 18
    <e4e7e>   DW_AT_type        : <0xe4e40>
    <e4e82>   DW_AT_external    : 1
    <e4e82>   DW_AT_declaration : 1
 <1><e4e82>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e83>   DW_AT_name        : (indirect string, offset: 0x90b9b): glutBitmap8By13
    <e4e87>   DW_AT_decl_file   : 3
    <e4e88>   DW_AT_decl_line   : 211
    <e4e89>   DW_AT_decl_column : 18
    <e4e8a>   DW_AT_type        : <0xe4e40>
    <e4e8e>   DW_AT_external    : 1
    <e4e8e>   DW_AT_declaration : 1
 <1><e4e8e>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e8f>   DW_AT_name        : (indirect string, offset: 0x90ae3): glutBitmapTimesRoman10
    <e4e93>   DW_AT_decl_file   : 3
    <e4e94>   DW_AT_decl_line   : 212
    <e4e95>   DW_AT_decl_column : 18
    <e4e96>   DW_AT_type        : <0xe4e40>
    <e4e9a>   DW_AT_external    : 1
    <e4e9a>   DW_AT_declaration : 1
 <1><e4e9a>: Abbrev Number: 6 (DW_TAG_variable)
    <e4e9b>   DW_AT_name        : (indirect string, offset: 0x90bca): glutBitmapTimesRoman24
    <e4e9f>   DW_AT_decl_file   : 3
    <e4ea0>   DW_AT_decl_line   : 213
    <e4ea1>   DW_AT_decl_column : 18
    <e4ea2>   DW_AT_type        : <0xe4e40>
    <e4ea6>   DW_AT_external    : 1
    <e4ea6>   DW_AT_declaration : 1
 <1><e4ea6>: Abbrev Number: 6 (DW_TAG_variable)
    <e4ea7>   DW_AT_name        : (indirect string, offset: 0x90a58): glutBitmapHelvetica10
    <e4eab>   DW_AT_decl_file   : 3
    <e4eac>   DW_AT_decl_line   : 214
    <e4ead>   DW_AT_decl_column : 18
    <e4eae>   DW_AT_type        : <0xe4e40>
    <e4eb2>   DW_AT_external    : 1
    <e4eb2>   DW_AT_declaration : 1
 <1><e4eb2>: Abbrev Number: 6 (DW_TAG_variable)
    <e4eb3>   DW_AT_name        : (indirect string, offset: 0x90a81): glutBitmapHelvetica12
    <e4eb7>   DW_AT_decl_file   : 3
    <e4eb8>   DW_AT_decl_line   : 215
    <e4eb9>   DW_AT_decl_column : 18
    <e4eba>   DW_AT_type        : <0xe4e40>
    <e4ebe>   DW_AT_external    : 1
    <e4ebe>   DW_AT_declaration : 1
 <1><e4ebe>: Abbrev Number: 6 (DW_TAG_variable)
    <e4ebf>   DW_AT_name        : (indirect string, offset: 0x8f967): glutBitmapHelvetica18
    <e4ec3>   DW_AT_decl_file   : 3
    <e4ec4>   DW_AT_decl_line   : 216
    <e4ec5>   DW_AT_decl_column : 18
    <e4ec6>   DW_AT_type        : <0xe4e40>
    <e4eca>   DW_AT_external    : 1
    <e4eca>   DW_AT_declaration : 1
 <1><e4eca>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4ecb>   DW_AT_byte_size   : 8
    <e4ecc>   DW_AT_encoding    : 5	(signed)
    <e4ecd>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><e4ed1>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4ed2>   DW_AT_byte_size   : 8
    <e4ed3>   DW_AT_encoding    : 7	(unsigned)
    <e4ed4>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><e4ed8>: Abbrev Number: 42 (DW_TAG_structure_type)
    <e4ed9>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <e4edd>   DW_AT_byte_size   : 24
    <e4ede>   DW_AT_decl_file   : 4
    <e4edf>   DW_AT_decl_line   : 0
    <e4ee0>   DW_AT_sibling     : <0xe4f0d>
 <2><e4ee4>: Abbrev Number: 24 (DW_TAG_member)
    <e4ee5>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <e4ee9>   DW_AT_decl_file   : 4
    <e4ee9>   DW_AT_decl_line   : 0
    <e4ee9>   DW_AT_type        : <0xe4da3>
    <e4eed>   DW_AT_data_member_location: 0
 <2><e4eee>: Abbrev Number: 24 (DW_TAG_member)
    <e4eef>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <e4ef3>   DW_AT_decl_file   : 4
    <e4ef3>   DW_AT_decl_line   : 0
    <e4ef3>   DW_AT_type        : <0xe4da3>
    <e4ef7>   DW_AT_data_member_location: 4
 <2><e4ef8>: Abbrev Number: 24 (DW_TAG_member)
    <e4ef9>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <e4efd>   DW_AT_decl_file   : 4
    <e4efd>   DW_AT_decl_line   : 0
    <e4efd>   DW_AT_type        : <0xe4e40>
    <e4f01>   DW_AT_data_member_location: 8
 <2><e4f02>: Abbrev Number: 24 (DW_TAG_member)
    <e4f03>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <e4f07>   DW_AT_decl_file   : 4
    <e4f07>   DW_AT_decl_line   : 0
    <e4f07>   DW_AT_type        : <0xe4e40>
    <e4f0b>   DW_AT_data_member_location: 16
 <2><e4f0c>: Abbrev Number: 0
 <1><e4f0d>: Abbrev Number: 9 (DW_TAG_base_type)
    <e4f0e>   DW_AT_byte_size   : 16
    <e4f0f>   DW_AT_encoding    : 4	(float)
    <e4f10>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><e4f14>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4f15>   DW_AT_byte_size   : 8
    <e4f15>   DW_AT_type        : <0xe4e4e>
 <1><e4f19>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4f1a>   DW_AT_byte_size   : 8
    <e4f1a>   DW_AT_type        : <0xe4f1e>
 <1><e4f1e>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <e4f1f>   DW_AT_prototyped  : 1
    <e4f1f>   DW_AT_sibling     : <0xe4f29>
 <2><e4f23>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f24>   DW_AT_type        : <0xe4de8>
 <2><e4f28>: Abbrev Number: 0
 <1><e4f29>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4f2a>   DW_AT_byte_size   : 8
    <e4f2a>   DW_AT_type        : <0xe4f2e>
 <1><e4f2e>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <e4f2f>   DW_AT_prototyped  : 1
    <e4f2f>   DW_AT_sibling     : <0xe4f43>
 <2><e4f33>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f34>   DW_AT_type        : <0xe4de8>
 <2><e4f38>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f39>   DW_AT_type        : <0xe4de8>
 <2><e4f3d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f3e>   DW_AT_type        : <0xe4de8>
 <2><e4f42>: Abbrev Number: 0
 <1><e4f43>: Abbrev Number: 11 (DW_TAG_typedef)
    <e4f44>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <e4f48>   DW_AT_decl_file   : 5
    <e4f49>   DW_AT_decl_line   : 247
    <e4f4a>   DW_AT_decl_column : 17
    <e4f4b>   DW_AT_type        : <0xe4e58>
 <1><e4f4f>: Abbrev Number: 11 (DW_TAG_typedef)
    <e4f50>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <e4f54>   DW_AT_decl_file   : 5
    <e4f55>   DW_AT_decl_line   : 249
    <e4f56>   DW_AT_decl_column : 17
    <e4f57>   DW_AT_type        : <0xe4f19>
 <1><e4f5b>: Abbrev Number: 11 (DW_TAG_typedef)
    <e4f5c>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <e4f60>   DW_AT_decl_file   : 5
    <e4f61>   DW_AT_decl_line   : 250
    <e4f62>   DW_AT_decl_column : 17
    <e4f63>   DW_AT_type        : <0xe4f29>
 <1><e4f67>: Abbrev Number: 12 (DW_TAG_typedef)
    <e4f68>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <e4f6c>   DW_AT_decl_file   : 5
    <e4f6c>   DW_AT_decl_line   : 256
    <e4f6e>   DW_AT_decl_column : 17
    <e4f6f>   DW_AT_type        : <0xe4f73>
 <1><e4f73>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4f74>   DW_AT_byte_size   : 8
    <e4f74>   DW_AT_type        : <0xe4f78>
 <1><e4f78>: Abbrev Number: 27 (DW_TAG_subroutine_type)
    <e4f79>   DW_AT_prototyped  : 1
    <e4f79>   DW_AT_sibling     : <0xe4f88>
 <2><e4f7d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f7e>   DW_AT_type        : <0xe4f14>
 <2><e4f82>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e4f83>   DW_AT_type        : <0xe4f88>
 <2><e4f87>: Abbrev Number: 0
 <1><e4f88>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e4f89>   DW_AT_byte_size   : 8
    <e4f89>   DW_AT_type        : <0xe4ed8>
 <1><e4f8d>: Abbrev Number: 12 (DW_TAG_typedef)
    <e4f8e>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <e4f92>   DW_AT_decl_file   : 5
    <e4f92>   DW_AT_decl_line   : 257
    <e4f94>   DW_AT_decl_column : 17
    <e4f95>   DW_AT_type        : <0xe4f73>
 <1><e4f99>: Abbrev Number: 12 (DW_TAG_typedef)
    <e4f9a>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <e4f9e>   DW_AT_decl_file   : 5
    <e4f9e>   DW_AT_decl_line   : 261
    <e4fa0>   DW_AT_decl_column : 28
    <e4fa1>   DW_AT_type        : <0xe4fa5>
 <1><e4fa5>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e4fa6>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <e4faa>   DW_AT_byte_size   : 16
    <e4fab>   DW_AT_decl_file   : 5
    <e4fab>   DW_AT_decl_line   : 262
    <e4fad>   DW_AT_decl_column : 8
    <e4fad>   DW_AT_sibling     : <0xe4fcc>
 <2><e4fb1>: Abbrev Number: 2 (DW_TAG_member)
    <e4fb2>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <e4fb6>   DW_AT_decl_file   : 5
    <e4fb6>   DW_AT_decl_line   : 264
    <e4fb8>   DW_AT_decl_column : 11
    <e4fb9>   DW_AT_type        : <0xe4e40>
    <e4fbd>   DW_AT_data_member_location: 0
 <2><e4fbe>: Abbrev Number: 2 (DW_TAG_member)
    <e4fbf>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <e4fc3>   DW_AT_decl_file   : 5
    <e4fc3>   DW_AT_decl_line   : 265
    <e4fc5>   DW_AT_decl_column : 11
    <e4fc6>   DW_AT_type        : <0xe4e40>
    <e4fca>   DW_AT_data_member_location: 8
 <2><e4fcb>: Abbrev Number: 0
 <1><e4fcc>: Abbrev Number: 12 (DW_TAG_typedef)
    <e4fcd>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <e4fd1>   DW_AT_decl_file   : 5
    <e4fd1>   DW_AT_decl_line   : 277
    <e4fd3>   DW_AT_decl_column : 29
    <e4fd4>   DW_AT_type        : <0xe4fd8>
 <1><e4fd8>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e4fd9>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <e4fdd>   DW_AT_byte_size   : 12
    <e4fde>   DW_AT_decl_file   : 5
    <e4fde>   DW_AT_decl_line   : 278
    <e4fe0>   DW_AT_decl_column : 8
    <e4fe0>   DW_AT_sibling     : <0xe5008>
 <2><e4fe4>: Abbrev Number: 21 (DW_TAG_member)
    <e4fe5>   DW_AT_name        : X
    <e4fe7>   DW_AT_decl_file   : 5
    <e4fe7>   DW_AT_decl_line   : 280
    <e4fe9>   DW_AT_decl_column : 21
    <e4fea>   DW_AT_type        : <0xe4ddc>
    <e4fee>   DW_AT_data_member_location: 0
 <2><e4fef>: Abbrev Number: 21 (DW_TAG_member)
    <e4ff0>   DW_AT_name        : Y
    <e4ff2>   DW_AT_decl_file   : 5
    <e4ff2>   DW_AT_decl_line   : 280
    <e4ff4>   DW_AT_decl_column : 24
    <e4ff5>   DW_AT_type        : <0xe4ddc>
    <e4ff9>   DW_AT_data_member_location: 4
 <2><e4ffa>: Abbrev Number: 21 (DW_TAG_member)
    <e4ffb>   DW_AT_name        : Use
    <e4fff>   DW_AT_decl_file   : 5
    <e4fff>   DW_AT_decl_line   : 281
    <e5001>   DW_AT_decl_column : 21
    <e5002>   DW_AT_type        : <0xe4daa>
    <e5006>   DW_AT_data_member_location: 8
 <2><e5007>: Abbrev Number: 0
 <1><e5008>: Abbrev Number: 43 (DW_TAG_enumeration_type)
    <e5009>   DW_AT_encoding    : 7	(unsigned)
    <e500a>   DW_AT_byte_size   : 4
    <e500b>   DW_AT_type        : <0xe4da3>
    <e500f>   DW_AT_decl_file   : 5
    <e5010>   DW_AT_decl_line   : 289
    <e5012>   DW_AT_decl_column : 1
    <e5013>   DW_AT_sibling     : <0xe502a>
 <2><e5017>: Abbrev Number: 28 (DW_TAG_enumerator)
    <e5018>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <e501c>   DW_AT_const_value : 0
 <2><e501d>: Abbrev Number: 28 (DW_TAG_enumerator)
    <e501e>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <e5022>   DW_AT_const_value : 1
 <2><e5023>: Abbrev Number: 28 (DW_TAG_enumerator)
    <e5024>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <e5028>   DW_AT_const_value : 2
 <2><e5029>: Abbrev Number: 0
 <1><e502a>: Abbrev Number: 12 (DW_TAG_typedef)
    <e502b>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <e502f>   DW_AT_decl_file   : 5
    <e502f>   DW_AT_decl_line   : 293
    <e5031>   DW_AT_decl_column : 3
    <e5032>   DW_AT_type        : <0xe5008>
 <1><e5036>: Abbrev Number: 12 (DW_TAG_typedef)
    <e5037>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <e503b>   DW_AT_decl_file   : 5
    <e503b>   DW_AT_decl_line   : 296
    <e503d>   DW_AT_decl_column : 29
    <e503e>   DW_AT_type        : <0xe5042>
 <1><e5042>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e5043>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <e5047>   DW_AT_byte_size   : 232
    <e5048>   DW_AT_decl_file   : 5
    <e5048>   DW_AT_decl_line   : 297
    <e504a>   DW_AT_decl_column : 8
    <e504a>   DW_AT_sibling     : <0xe524a>
 <2><e504e>: Abbrev Number: 2 (DW_TAG_member)
    <e504f>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <e5053>   DW_AT_decl_file   : 5
    <e5053>   DW_AT_decl_line   : 299
    <e5055>   DW_AT_decl_column : 22
    <e5056>   DW_AT_type        : <0xe4fcc>
    <e505a>   DW_AT_data_member_location: 0
 <2><e505b>: Abbrev Number: 2 (DW_TAG_member)
    <e505c>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <e5060>   DW_AT_decl_file   : 5
    <e5060>   DW_AT_decl_line   : 300
    <e5062>   DW_AT_decl_column : 22
    <e5063>   DW_AT_type        : <0xe4fcc>
    <e5067>   DW_AT_data_member_location: 12
 <2><e5068>: Abbrev Number: 2 (DW_TAG_member)
    <e5069>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <e506d>   DW_AT_decl_file   : 5
    <e506d>   DW_AT_decl_line   : 301
    <e506f>   DW_AT_decl_column : 22
    <e5070>   DW_AT_type        : <0xe4da3>
    <e5074>   DW_AT_data_member_location: 24
 <2><e5075>: Abbrev Number: 2 (DW_TAG_member)
    <e5076>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <e507a>   DW_AT_decl_file   : 5
    <e507a>   DW_AT_decl_line   : 303
    <e507c>   DW_AT_decl_column : 22
    <e507d>   DW_AT_type        : <0xe4daa>
    <e5081>   DW_AT_data_member_location: 28
 <2><e5082>: Abbrev Number: 2 (DW_TAG_member)
    <e5083>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <e5087>   DW_AT_decl_file   : 5
    <e5087>   DW_AT_decl_line   : 305
    <e5089>   DW_AT_decl_column : 22
    <e508a>   DW_AT_type        : <0xe4de8>
    <e508e>   DW_AT_data_member_location: 32
 <2><e508f>: Abbrev Number: 2 (DW_TAG_member)
    <e5090>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <e5094>   DW_AT_decl_file   : 5
    <e5094>   DW_AT_decl_line   : 307
    <e5096>   DW_AT_decl_column : 22
    <e5097>   DW_AT_type        : <0xe4daa>
    <e509b>   DW_AT_data_member_location: 36
 <2><e509c>: Abbrev Number: 2 (DW_TAG_member)
    <e509d>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <e50a1>   DW_AT_decl_file   : 5
    <e50a1>   DW_AT_decl_line   : 308
    <e50a3>   DW_AT_decl_column : 22
    <e50a4>   DW_AT_type        : <0xe4daa>
    <e50a8>   DW_AT_data_member_location: 37
 <2><e50a9>: Abbrev Number: 2 (DW_TAG_member)
    <e50aa>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <e50ae>   DW_AT_decl_file   : 5
    <e50ae>   DW_AT_decl_line   : 310
    <e50b0>   DW_AT_decl_column : 22
    <e50b1>   DW_AT_type        : <0xe4daa>
    <e50b5>   DW_AT_data_member_location: 38
 <2><e50b6>: Abbrev Number: 2 (DW_TAG_member)
    <e50b7>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <e50bb>   DW_AT_decl_file   : 5
    <e50bb>   DW_AT_decl_line   : 311
    <e50bd>   DW_AT_decl_column : 22
    <e50be>   DW_AT_type        : <0xe4daa>
    <e50c2>   DW_AT_data_member_location: 39
 <2><e50c3>: Abbrev Number: 2 (DW_TAG_member)
    <e50c4>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <e50c8>   DW_AT_decl_file   : 5
    <e50c8>   DW_AT_decl_line   : 313
    <e50ca>   DW_AT_decl_column : 22
    <e50cb>   DW_AT_type        : <0xe4de8>
    <e50cf>   DW_AT_data_member_location: 40
 <2><e50d0>: Abbrev Number: 2 (DW_TAG_member)
    <e50d1>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <e50d5>   DW_AT_decl_file   : 5
    <e50d5>   DW_AT_decl_line   : 314
    <e50d7>   DW_AT_decl_column : 22
    <e50d8>   DW_AT_type        : <0xe4de8>
    <e50dc>   DW_AT_data_member_location: 44
 <2><e50dd>: Abbrev Number: 2 (DW_TAG_member)
    <e50de>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <e50e2>   DW_AT_decl_file   : 5
    <e50e2>   DW_AT_decl_line   : 316
    <e50e4>   DW_AT_decl_column : 22
    <e50e5>   DW_AT_type        : <0xe4e07>
    <e50e9>   DW_AT_data_member_location: 48
 <2><e50ea>: Abbrev Number: 2 (DW_TAG_member)
    <e50eb>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <e50ef>   DW_AT_decl_file   : 5
    <e50ef>   DW_AT_decl_line   : 317
    <e50f1>   DW_AT_decl_column : 22
    <e50f2>   DW_AT_type        : <0xe4e07>
    <e50f6>   DW_AT_data_member_location: 52
 <2><e50f7>: Abbrev Number: 2 (DW_TAG_member)
    <e50f8>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <e50fc>   DW_AT_decl_file   : 5
    <e50fc>   DW_AT_decl_line   : 318
    <e50fe>   DW_AT_decl_column : 22
    <e50ff>   DW_AT_type        : <0xe4e07>
    <e5103>   DW_AT_data_member_location: 56
 <2><e5104>: Abbrev Number: 2 (DW_TAG_member)
    <e5105>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <e5109>   DW_AT_decl_file   : 5
    <e5109>   DW_AT_decl_line   : 320
    <e510b>   DW_AT_decl_column : 22
    <e510c>   DW_AT_type        : <0xe4e32>
    <e5110>   DW_AT_data_member_location: 64
 <2><e5111>: Abbrev Number: 2 (DW_TAG_member)
    <e5112>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <e5116>   DW_AT_decl_file   : 5
    <e5116>   DW_AT_decl_line   : 321
    <e5118>   DW_AT_decl_column : 22
    <e5119>   DW_AT_type        : <0xe4f99>
    <e511d>   DW_AT_data_member_location: 72
 <2><e511e>: Abbrev Number: 2 (DW_TAG_member)
    <e511f>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <e5123>   DW_AT_decl_file   : 5
    <e5123>   DW_AT_decl_line   : 322
    <e5125>   DW_AT_decl_column : 22
    <e5126>   DW_AT_type        : <0xe4f99>
    <e512a>   DW_AT_data_member_location: 88
 <2><e512b>: Abbrev Number: 2 (DW_TAG_member)
    <e512c>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <e5130>   DW_AT_decl_file   : 5
    <e5130>   DW_AT_decl_line   : 324
    <e5132>   DW_AT_decl_column : 22
    <e5133>   DW_AT_type        : <0xe4f43>
    <e5137>   DW_AT_data_member_location: 104
 <2><e5138>: Abbrev Number: 2 (DW_TAG_member)
    <e5139>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <e513d>   DW_AT_decl_file   : 5
    <e513d>   DW_AT_decl_line   : 326
    <e513f>   DW_AT_decl_column : 22
    <e5140>   DW_AT_type        : <0xe4de8>
    <e5144>   DW_AT_data_member_location: 112
 <2><e5145>: Abbrev Number: 2 (DW_TAG_member)
    <e5146>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <e514a>   DW_AT_decl_file   : 5
    <e514a>   DW_AT_decl_line   : 327
    <e514c>   DW_AT_decl_column : 22
    <e514d>   DW_AT_type        : <0xe4f4f>
    <e5151>   DW_AT_data_member_location: 120
 <2><e5152>: Abbrev Number: 2 (DW_TAG_member)
    <e5153>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <e5157>   DW_AT_decl_file   : 5
    <e5157>   DW_AT_decl_line   : 328
    <e5159>   DW_AT_decl_column : 22
    <e515a>   DW_AT_type        : <0xe4f5b>
    <e515e>   DW_AT_data_member_location: 128
 <2><e515f>: Abbrev Number: 2 (DW_TAG_member)
    <e5160>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <e5164>   DW_AT_decl_file   : 5
    <e5164>   DW_AT_decl_line   : 330
    <e5166>   DW_AT_decl_column : 22
    <e5167>   DW_AT_type        : <0xe4fcc>
    <e516b>   DW_AT_data_member_location: 136
 <2><e516c>: Abbrev Number: 2 (DW_TAG_member)
    <e516d>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <e5171>   DW_AT_decl_file   : 5
    <e5171>   DW_AT_decl_line   : 331
    <e5173>   DW_AT_decl_column : 22
    <e5174>   DW_AT_type        : <0xe4de8>
    <e5178>   DW_AT_data_member_location: 148
 <2><e5179>: Abbrev Number: 2 (DW_TAG_member)
    <e517a>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <e517e>   DW_AT_decl_file   : 5
    <e517e>   DW_AT_decl_line   : 332
    <e5180>   DW_AT_decl_column : 22
    <e5181>   DW_AT_type        : <0xe4de8>
    <e5185>   DW_AT_data_member_location: 152
 <2><e5186>: Abbrev Number: 2 (DW_TAG_member)
    <e5187>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <e518b>   DW_AT_decl_file   : 5
    <e518b>   DW_AT_decl_line   : 334
    <e518d>   DW_AT_decl_column : 22
    <e518e>   DW_AT_type        : <0xe4de8>
    <e5192>   DW_AT_data_member_location: 156
 <2><e5193>: Abbrev Number: 2 (DW_TAG_member)
    <e5194>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <e5198>   DW_AT_decl_file   : 5
    <e5198>   DW_AT_decl_line   : 336
    <e519a>   DW_AT_decl_column : 22
    <e519b>   DW_AT_type        : <0xe502a>
    <e519f>   DW_AT_data_member_location: 160
 <2><e51a0>: Abbrev Number: 2 (DW_TAG_member)
    <e51a1>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <e51a5>   DW_AT_decl_file   : 5
    <e51a5>   DW_AT_decl_line   : 337
    <e51a7>   DW_AT_decl_column : 22
    <e51a8>   DW_AT_type        : <0xe4e42>
    <e51ac>   DW_AT_data_member_location: 168
 <2><e51ad>: Abbrev Number: 2 (DW_TAG_member)
    <e51ae>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <e51b2>   DW_AT_decl_file   : 5
    <e51b2>   DW_AT_decl_line   : 338
    <e51b4>   DW_AT_decl_column : 22
    <e51b5>   DW_AT_type        : <0xe4daa>
    <e51b9>   DW_AT_data_member_location: 176
 <2><e51ba>: Abbrev Number: 2 (DW_TAG_member)
    <e51bb>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <e51bf>   DW_AT_decl_file   : 5
    <e51bf>   DW_AT_decl_line   : 339
    <e51c1>   DW_AT_decl_column : 22
    <e51c2>   DW_AT_type        : <0xe4de8>
    <e51c6>   DW_AT_data_member_location: 180
 <2><e51c7>: Abbrev Number: 2 (DW_TAG_member)
    <e51c8>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <e51cc>   DW_AT_decl_file   : 5
    <e51cc>   DW_AT_decl_line   : 340
    <e51ce>   DW_AT_decl_column : 22
    <e51cf>   DW_AT_type        : <0xe4daa>
    <e51d3>   DW_AT_data_member_location: 184
 <2><e51d4>: Abbrev Number: 2 (DW_TAG_member)
    <e51d5>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <e51d9>   DW_AT_decl_file   : 5
    <e51d9>   DW_AT_decl_line   : 342
    <e51db>   DW_AT_decl_column : 19
    <e51dc>   DW_AT_type        : <0xe4de8>
    <e51e0>   DW_AT_data_member_location: 188
 <2><e51e1>: Abbrev Number: 2 (DW_TAG_member)
    <e51e2>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <e51e6>   DW_AT_decl_file   : 5
    <e51e6>   DW_AT_decl_line   : 344
    <e51e8>   DW_AT_decl_column : 22
    <e51e9>   DW_AT_type        : <0xe4de8>
    <e51ed>   DW_AT_data_member_location: 192
 <2><e51ee>: Abbrev Number: 2 (DW_TAG_member)
    <e51ef>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <e51f3>   DW_AT_decl_file   : 5
    <e51f3>   DW_AT_decl_line   : 345
    <e51f5>   DW_AT_decl_column : 22
    <e51f6>   DW_AT_type        : <0xe4de8>
    <e51fa>   DW_AT_data_member_location: 196
 <2><e51fb>: Abbrev Number: 2 (DW_TAG_member)
    <e51fc>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <e5200>   DW_AT_decl_file   : 5
    <e5200>   DW_AT_decl_line   : 347
    <e5202>   DW_AT_decl_column : 22
    <e5203>   DW_AT_type        : <0xe4de8>
    <e5207>   DW_AT_data_member_location: 200
 <2><e5208>: Abbrev Number: 2 (DW_TAG_member)
    <e5209>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <e520d>   DW_AT_decl_file   : 5
    <e520d>   DW_AT_decl_line   : 348
    <e520f>   DW_AT_decl_column : 22
    <e5210>   DW_AT_type        : <0xe4de8>
    <e5214>   DW_AT_data_member_location: 204
 <2><e5215>: Abbrev Number: 2 (DW_TAG_member)
    <e5216>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <e521a>   DW_AT_decl_file   : 5
    <e521a>   DW_AT_decl_line   : 349
    <e521c>   DW_AT_decl_column : 22
    <e521d>   DW_AT_type        : <0xe4de8>
    <e5221>   DW_AT_data_member_location: 208
 <2><e5222>: Abbrev Number: 2 (DW_TAG_member)
    <e5223>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <e5227>   DW_AT_decl_file   : 5
    <e5227>   DW_AT_decl_line   : 350
    <e5229>   DW_AT_decl_column : 22
    <e522a>   DW_AT_type        : <0xe4de8>
    <e522e>   DW_AT_data_member_location: 212
 <2><e522f>: Abbrev Number: 2 (DW_TAG_member)
    <e5230>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <e5234>   DW_AT_decl_file   : 5
    <e5234>   DW_AT_decl_line   : 351
    <e5236>   DW_AT_decl_column : 22
    <e5237>   DW_AT_type        : <0xe4f67>
    <e523b>   DW_AT_data_member_location: 216
 <2><e523c>: Abbrev Number: 2 (DW_TAG_member)
    <e523d>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <e5241>   DW_AT_decl_file   : 5
    <e5241>   DW_AT_decl_line   : 352
    <e5243>   DW_AT_decl_column : 22
    <e5244>   DW_AT_type        : <0xe4f8d>
    <e5248>   DW_AT_data_member_location: 224
 <2><e5249>: Abbrev Number: 0
 <1><e524a>: Abbrev Number: 12 (DW_TAG_typedef)
    <e524b>   DW_AT_name        : (indirect string, offset: 0x90ab8): SFG_Font
    <e524f>   DW_AT_decl_file   : 5
    <e524f>   DW_AT_decl_line   : 735
    <e5251>   DW_AT_decl_column : 28
    <e5252>   DW_AT_type        : <0xe5256>
 <1><e5256>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e5257>   DW_AT_name        : (indirect string, offset: 0x90ab5): tagSFG_Font
    <e525b>   DW_AT_byte_size   : 32
    <e525c>   DW_AT_decl_file   : 5
    <e525c>   DW_AT_decl_line   : 736
    <e525e>   DW_AT_decl_column : 8
    <e525e>   DW_AT_sibling     : <0xe52b1>
 <2><e5262>: Abbrev Number: 2 (DW_TAG_member)
    <e5263>   DW_AT_name        : (indirect string, offset: 0x8fc0d): Name
    <e5267>   DW_AT_decl_file   : 5
    <e5267>   DW_AT_decl_line   : 738
    <e5269>   DW_AT_decl_column : 21
    <e526a>   DW_AT_type        : <0xe4e42>
    <e526e>   DW_AT_data_member_location: 0
 <2><e526f>: Abbrev Number: 2 (DW_TAG_member)
    <e5270>   DW_AT_name        : (indirect string, offset: 0x90bab): Quantity
    <e5274>   DW_AT_decl_file   : 5
    <e5274>   DW_AT_decl_line   : 739
    <e5276>   DW_AT_decl_column : 21
    <e5277>   DW_AT_type        : <0xe4de8>
    <e527b>   DW_AT_data_member_location: 8
 <2><e527c>: Abbrev Number: 2 (DW_TAG_member)
    <e527d>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <e5281>   DW_AT_decl_file   : 5
    <e5281>   DW_AT_decl_line   : 740
    <e5283>   DW_AT_decl_column : 21
    <e5284>   DW_AT_type        : <0xe4de8>
    <e5288>   DW_AT_data_member_location: 12
 <2><e5289>: Abbrev Number: 2 (DW_TAG_member)
    <e528a>   DW_AT_name        : (indirect string, offset: 0x90c1a): Characters
    <e528e>   DW_AT_decl_file   : 5
    <e528e>   DW_AT_decl_line   : 741
    <e5290>   DW_AT_decl_column : 21
    <e5291>   DW_AT_type        : <0xe52b1>
    <e5295>   DW_AT_data_member_location: 16
 <2><e5296>: Abbrev Number: 2 (DW_TAG_member)
    <e5297>   DW_AT_name        : (indirect string, offset: 0x90b22): xorig
    <e529b>   DW_AT_decl_file   : 5
    <e529b>   DW_AT_decl_line   : 743
    <e529d>   DW_AT_decl_column : 21
    <e529e>   DW_AT_type        : <0xe4d90>
    <e52a2>   DW_AT_data_member_location: 24
 <2><e52a3>: Abbrev Number: 2 (DW_TAG_member)
    <e52a4>   DW_AT_name        : (indirect string, offset: 0x90c9e): yorig
    <e52a8>   DW_AT_decl_file   : 5
    <e52a8>   DW_AT_decl_line   : 743
    <e52aa>   DW_AT_decl_column : 28
    <e52ab>   DW_AT_type        : <0xe4d90>
    <e52af>   DW_AT_data_member_location: 28
 <2><e52b0>: Abbrev Number: 0
 <1><e52b1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e52b2>   DW_AT_byte_size   : 8
    <e52b2>   DW_AT_type        : <0xe4e53>
 <1><e52b6>: Abbrev Number: 12 (DW_TAG_typedef)
    <e52b7>   DW_AT_name        : (indirect string, offset: 0x90ac4): SFG_StrokeVertex
    <e52bb>   DW_AT_decl_file   : 5
    <e52bb>   DW_AT_decl_line   : 748
    <e52bd>   DW_AT_decl_column : 36
    <e52be>   DW_AT_type        : <0xe52c7>
 <1><e52c2>: Abbrev Number: 18 (DW_TAG_const_type)
    <e52c3>   DW_AT_type        : <0xe52b6>
 <1><e52c7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e52c8>   DW_AT_name        : (indirect string, offset: 0x90ac1): tagSFG_StrokeVertex
    <e52cc>   DW_AT_byte_size   : 8
    <e52cd>   DW_AT_decl_file   : 5
    <e52cd>   DW_AT_decl_line   : 749
    <e52cf>   DW_AT_decl_column : 8
    <e52cf>   DW_AT_sibling     : <0xe52ea>
 <2><e52d3>: Abbrev Number: 21 (DW_TAG_member)
    <e52d4>   DW_AT_name        : X
    <e52d6>   DW_AT_decl_file   : 5
    <e52d6>   DW_AT_decl_line   : 751
    <e52d8>   DW_AT_decl_column : 21
    <e52d9>   DW_AT_type        : <0xe4e1f>
    <e52dd>   DW_AT_data_member_location: 0
 <2><e52de>: Abbrev Number: 21 (DW_TAG_member)
    <e52df>   DW_AT_name        : Y
    <e52e1>   DW_AT_decl_file   : 5
    <e52e1>   DW_AT_decl_line   : 751
    <e52e3>   DW_AT_decl_column : 24
    <e52e4>   DW_AT_type        : <0xe4e1f>
    <e52e8>   DW_AT_data_member_location: 4
 <2><e52e9>: Abbrev Number: 0
 <1><e52ea>: Abbrev Number: 12 (DW_TAG_typedef)
    <e52eb>   DW_AT_name        : (indirect string, offset: 0x90b40): SFG_StrokeStrip
    <e52ef>   DW_AT_decl_file   : 5
    <e52ef>   DW_AT_decl_line   : 754
    <e52f1>   DW_AT_decl_column : 35
    <e52f2>   DW_AT_type        : <0xe52fb>
 <1><e52f6>: Abbrev Number: 18 (DW_TAG_const_type)
    <e52f7>   DW_AT_type        : <0xe52ea>
 <1><e52fb>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e52fc>   DW_AT_name        : (indirect string, offset: 0x90b3d): tagSFG_StrokeStrip
    <e5300>   DW_AT_byte_size   : 16
    <e5301>   DW_AT_decl_file   : 5
    <e5301>   DW_AT_decl_line   : 755
    <e5303>   DW_AT_decl_column : 8
    <e5303>   DW_AT_sibling     : <0xe5322>
 <2><e5307>: Abbrev Number: 2 (DW_TAG_member)
    <e5308>   DW_AT_name        : (indirect string, offset: 0x8e321): Number
    <e530c>   DW_AT_decl_file   : 5
    <e530c>   DW_AT_decl_line   : 757
    <e530e>   DW_AT_decl_column : 21
    <e530f>   DW_AT_type        : <0xe4de8>
    <e5313>   DW_AT_data_member_location: 0
 <2><e5314>: Abbrev Number: 2 (DW_TAG_member)
    <e5315>   DW_AT_name        : (indirect string, offset: 0x90b85): Vertices
    <e5319>   DW_AT_decl_file   : 5
    <e5319>   DW_AT_decl_line   : 758
    <e531b>   DW_AT_decl_column : 29
    <e531c>   DW_AT_type        : <0xe5322>
    <e5320>   DW_AT_data_member_location: 8
 <2><e5321>: Abbrev Number: 0
 <1><e5322>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5323>   DW_AT_byte_size   : 8
    <e5323>   DW_AT_type        : <0xe52c2>
 <1><e5327>: Abbrev Number: 12 (DW_TAG_typedef)
    <e5328>   DW_AT_name        : (indirect string, offset: 0x90b64): SFG_StrokeChar
    <e532c>   DW_AT_decl_file   : 5
    <e532c>   DW_AT_decl_line   : 761
    <e532e>   DW_AT_decl_column : 34
    <e532f>   DW_AT_type        : <0xe5338>
 <1><e5333>: Abbrev Number: 18 (DW_TAG_const_type)
    <e5334>   DW_AT_type        : <0xe5327>
 <1><e5338>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e5339>   DW_AT_name        : (indirect string, offset: 0x90b61): tagSFG_StrokeChar
    <e533d>   DW_AT_byte_size   : 16
    <e533e>   DW_AT_decl_file   : 5
    <e533e>   DW_AT_decl_line   : 762
    <e5340>   DW_AT_decl_column : 8
    <e5340>   DW_AT_sibling     : <0xe536c>
 <2><e5344>: Abbrev Number: 2 (DW_TAG_member)
    <e5345>   DW_AT_name        : (indirect string, offset: 0x90bb4): Right
    <e5349>   DW_AT_decl_file   : 5
    <e5349>   DW_AT_decl_line   : 764
    <e534b>   DW_AT_decl_column : 21
    <e534c>   DW_AT_type        : <0xe4e1f>
    <e5350>   DW_AT_data_member_location: 0
 <2><e5351>: Abbrev Number: 2 (DW_TAG_member)
    <e5352>   DW_AT_name        : (indirect string, offset: 0x8e321): Number
    <e5356>   DW_AT_decl_file   : 5
    <e5356>   DW_AT_decl_line   : 765
    <e5358>   DW_AT_decl_column : 21
    <e5359>   DW_AT_type        : <0xe4de8>
    <e535d>   DW_AT_data_member_location: 4
 <2><e535e>: Abbrev Number: 2 (DW_TAG_member)
    <e535f>   DW_AT_name        : (indirect string, offset: 0x90b36): Strips
    <e5363>   DW_AT_decl_file   : 5
    <e5363>   DW_AT_decl_line   : 766
    <e5365>   DW_AT_decl_column : 28
    <e5366>   DW_AT_type        : <0xe536c>
    <e536a>   DW_AT_data_member_location: 8
 <2><e536b>: Abbrev Number: 0
 <1><e536c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e536d>   DW_AT_byte_size   : 8
    <e536d>   DW_AT_type        : <0xe52f6>
 <1><e5371>: Abbrev Number: 12 (DW_TAG_typedef)
    <e5372>   DW_AT_name        : (indirect string, offset: 0x90b76): SFG_StrokeFont
    <e5376>   DW_AT_decl_file   : 5
    <e5376>   DW_AT_decl_line   : 769
    <e5378>   DW_AT_decl_column : 34
    <e5379>   DW_AT_type        : <0xe537d>
 <1><e537d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e537e>   DW_AT_name        : (indirect string, offset: 0x90b73): tagSFG_StrokeFont
    <e5382>   DW_AT_byte_size   : 24
    <e5383>   DW_AT_decl_file   : 5
    <e5383>   DW_AT_decl_line   : 770
    <e5385>   DW_AT_decl_column : 8
    <e5385>   DW_AT_sibling     : <0xe53be>
 <2><e5389>: Abbrev Number: 2 (DW_TAG_member)
    <e538a>   DW_AT_name        : (indirect string, offset: 0x8fc0d): Name
    <e538e>   DW_AT_decl_file   : 5
    <e538e>   DW_AT_decl_line   : 772
    <e5390>   DW_AT_decl_column : 21
    <e5391>   DW_AT_type        : <0xe4e42>
    <e5395>   DW_AT_data_member_location: 0
 <2><e5396>: Abbrev Number: 2 (DW_TAG_member)
    <e5397>   DW_AT_name        : (indirect string, offset: 0x90bab): Quantity
    <e539b>   DW_AT_decl_file   : 5
    <e539b>   DW_AT_decl_line   : 773
    <e539d>   DW_AT_decl_column : 21
    <e539e>   DW_AT_type        : <0xe4de8>
    <e53a2>   DW_AT_data_member_location: 8
 <2><e53a3>: Abbrev Number: 2 (DW_TAG_member)
    <e53a4>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <e53a8>   DW_AT_decl_file   : 5
    <e53a8>   DW_AT_decl_line   : 774
    <e53aa>   DW_AT_decl_column : 21
    <e53ab>   DW_AT_type        : <0xe4e1f>
    <e53af>   DW_AT_data_member_location: 12
 <2><e53b0>: Abbrev Number: 2 (DW_TAG_member)
    <e53b1>   DW_AT_name        : (indirect string, offset: 0x90c1a): Characters
    <e53b5>   DW_AT_decl_file   : 5
    <e53b5>   DW_AT_decl_line   : 775
    <e53b7>   DW_AT_decl_column : 28
    <e53b8>   DW_AT_type        : <0xe53be>
    <e53bc>   DW_AT_data_member_location: 16
 <2><e53bd>: Abbrev Number: 0
 <1><e53be>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e53bf>   DW_AT_byte_size   : 8
    <e53bf>   DW_AT_type        : <0xe53c3>
 <1><e53c3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e53c4>   DW_AT_byte_size   : 8
    <e53c4>   DW_AT_type        : <0xe5333>
 <1><e53c8>: Abbrev Number: 44 (DW_TAG_variable)
    <e53c9>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <e53cd>   DW_AT_decl_file   : 5
    <e53ce>   DW_AT_decl_line   : 787
    <e53d0>   DW_AT_decl_column : 18
    <e53d1>   DW_AT_type        : <0xe5036>
    <e53d5>   DW_AT_external    : 1
    <e53d5>   DW_AT_declaration : 1
 <1><e53d5>: Abbrev Number: 6 (DW_TAG_variable)
    <e53d6>   DW_AT_name        : (indirect string, offset: 0x90bfe): fgFontFixed8x13
    <e53da>   DW_AT_decl_file   : 1
    <e53db>   DW_AT_decl_line   : 45
    <e53dc>   DW_AT_decl_column : 17
    <e53dd>   DW_AT_type        : <0xe524a>
    <e53e1>   DW_AT_external    : 1
    <e53e1>   DW_AT_declaration : 1
 <1><e53e1>: Abbrev Number: 6 (DW_TAG_variable)
    <e53e2>   DW_AT_name        : (indirect string, offset: 0x90bba): fgFontFixed9x15
    <e53e6>   DW_AT_decl_file   : 1
    <e53e7>   DW_AT_decl_line   : 46
    <e53e8>   DW_AT_decl_column : 17
    <e53e9>   DW_AT_type        : <0xe524a>
    <e53ed>   DW_AT_external    : 1
    <e53ed>   DW_AT_declaration : 1
 <1><e53ed>: Abbrev Number: 6 (DW_TAG_variable)
    <e53ee>   DW_AT_name        : (indirect string, offset: 0x90c5a): fgFontHelvetica10
    <e53f2>   DW_AT_decl_file   : 1
    <e53f3>   DW_AT_decl_line   : 47
    <e53f4>   DW_AT_decl_column : 17
    <e53f5>   DW_AT_type        : <0xe524a>
    <e53f9>   DW_AT_external    : 1
    <e53f9>   DW_AT_declaration : 1
 <1><e53f9>: Abbrev Number: 6 (DW_TAG_variable)
    <e53fa>   DW_AT_name        : (indirect string, offset: 0x90c6c): fgFontHelvetica12
    <e53fe>   DW_AT_decl_file   : 1
    <e53ff>   DW_AT_decl_line   : 48
    <e5400>   DW_AT_decl_column : 17
    <e5401>   DW_AT_type        : <0xe524a>
    <e5405>   DW_AT_external    : 1
    <e5405>   DW_AT_declaration : 1
 <1><e5405>: Abbrev Number: 6 (DW_TAG_variable)
    <e5406>   DW_AT_name        : (indirect string, offset: 0x90c7e): fgFontHelvetica18
    <e540a>   DW_AT_decl_file   : 1
    <e540b>   DW_AT_decl_line   : 49
    <e540c>   DW_AT_decl_column : 17
    <e540d>   DW_AT_type        : <0xe524a>
    <e5411>   DW_AT_external    : 1
    <e5411>   DW_AT_declaration : 1
 <1><e5411>: Abbrev Number: 6 (DW_TAG_variable)
    <e5412>   DW_AT_name        : (indirect string, offset: 0x90c35): fgFontTimesRoman10
    <e5416>   DW_AT_decl_file   : 1
    <e5417>   DW_AT_decl_line   : 50
    <e5418>   DW_AT_decl_column : 17
    <e5419>   DW_AT_type        : <0xe524a>
    <e541d>   DW_AT_external    : 1
    <e541d>   DW_AT_declaration : 1
 <1><e541d>: Abbrev Number: 6 (DW_TAG_variable)
    <e541e>   DW_AT_name        : (indirect string, offset: 0x90a97): fgFontTimesRoman24
    <e5422>   DW_AT_decl_file   : 1
    <e5423>   DW_AT_decl_line   : 51
    <e5424>   DW_AT_decl_column : 17
    <e5425>   DW_AT_type        : <0xe524a>
    <e5429>   DW_AT_external    : 1
    <e5429>   DW_AT_declaration : 1
 <1><e5429>: Abbrev Number: 6 (DW_TAG_variable)
    <e542a>   DW_AT_name        : (indirect string, offset: 0x90c90): fgStrokeRoman
    <e542e>   DW_AT_decl_file   : 1
    <e542f>   DW_AT_decl_line   : 52
    <e5430>   DW_AT_decl_column : 23
    <e5431>   DW_AT_type        : <0xe5371>
    <e5435>   DW_AT_external    : 1
    <e5435>   DW_AT_declaration : 1
 <1><e5435>: Abbrev Number: 6 (DW_TAG_variable)
    <e5436>   DW_AT_name        : (indirect string, offset: 0x90afa): fgStrokeMonoRoman
    <e543a>   DW_AT_decl_file   : 1
    <e543b>   DW_AT_decl_line   : 53
    <e543c>   DW_AT_decl_column : 23
    <e543d>   DW_AT_type        : <0xe5371>
    <e5441>   DW_AT_external    : 1
    <e5441>   DW_AT_declaration : 1
 <1><e5441>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e5442>   DW_AT_external    : 1
    <e5442>   DW_AT_name        : (indirect string, offset: 0x63f91): glTranslatef
    <e5446>   DW_AT_decl_file   : 2
    <e5447>   DW_AT_decl_line   : 895
    <e5449>   DW_AT_decl_column : 23
    <e544a>   DW_AT_prototyped  : 1
    <e544a>   DW_AT_declaration : 1
    <e544a>   DW_AT_sibling     : <0xe545e>
 <2><e544e>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e544f>   DW_AT_type        : <0xe4e1f>
 <2><e5453>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5454>   DW_AT_type        : <0xe4e1f>
 <2><e5458>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5459>   DW_AT_type        : <0xe4e1f>
 <2><e545d>: Abbrev Number: 0
 <1><e545e>: Abbrev Number: 33 (DW_TAG_subprogram)
    <e545f>   DW_AT_external    : 1
    <e545f>   DW_AT_name        : (indirect string, offset: 0x8f7b2): glEnd
    <e5463>   DW_AT_decl_file   : 2
    <e5463>   DW_AT_decl_line   : 926
    <e5465>   DW_AT_decl_column : 23
    <e5465>   DW_AT_prototyped  : 1
    <e5465>   DW_AT_declaration : 1
 <1><e5465>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e5466>   DW_AT_external    : 1
    <e5466>   DW_AT_name        : (indirect string, offset: 0x90aaa): glVertex2f
    <e546a>   DW_AT_decl_file   : 2
    <e546b>   DW_AT_decl_line   : 930
    <e546d>   DW_AT_decl_column : 23
    <e546e>   DW_AT_prototyped  : 1
    <e546e>   DW_AT_declaration : 1
    <e546e>   DW_AT_sibling     : <0xe547d>
 <2><e5472>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5473>   DW_AT_type        : <0xe4e1f>
 <2><e5477>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5478>   DW_AT_type        : <0xe4e1f>
 <2><e547c>: Abbrev Number: 0
 <1><e547d>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e547e>   DW_AT_external    : 1
    <e547e>   DW_AT_name        : (indirect string, offset: 0x8f95f): glBegin
    <e5482>   DW_AT_decl_file   : 2
    <e5483>   DW_AT_decl_line   : 924
    <e5485>   DW_AT_decl_column : 23
    <e5486>   DW_AT_prototyped  : 1
    <e5486>   DW_AT_declaration : 1
    <e5486>   DW_AT_sibling     : <0xe5490>
 <2><e548a>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e548b>   DW_AT_type        : <0xe4d97>
 <2><e548f>: Abbrev Number: 0
 <1><e5490>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e5491>   DW_AT_external    : 1
    <e5491>   DW_AT_name        : (indirect string, offset: 0x8ee0b): fgWarning
    <e5495>   DW_AT_decl_file   : 5
    <e5496>   DW_AT_decl_line   : 999
    <e5498>   DW_AT_decl_column : 6
    <e5499>   DW_AT_prototyped  : 1
    <e5499>   DW_AT_declaration : 1
    <e5499>   DW_AT_sibling     : <0xe54a4>
 <2><e549d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e549e>   DW_AT_type        : <0xe4f14>
 <2><e54a2>: Abbrev Number: 34 (DW_TAG_unspecified_parameters)
 <2><e54a3>: Abbrev Number: 0
 <1><e54a4>: Abbrev Number: 33 (DW_TAG_subprogram)
    <e54a5>   DW_AT_external    : 1
    <e54a5>   DW_AT_name        : (indirect string, offset: 0x90c48): glPopClientAttrib
    <e54a9>   DW_AT_decl_file   : 2
    <e54a9>   DW_AT_decl_line   : 819
    <e54ab>   DW_AT_decl_column : 23
    <e54ab>   DW_AT_prototyped  : 1
    <e54ab>   DW_AT_declaration : 1
 <1><e54ab>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e54ac>   DW_AT_external    : 1
    <e54ac>   DW_AT_name        : (indirect string, offset: 0x90bf5): glBitmap
    <e54b0>   DW_AT_decl_file   : 2
    <e54b1>   DW_AT_decl_line   : 1205
    <e54b3>   DW_AT_decl_column : 23
    <e54b4>   DW_AT_prototyped  : 1
    <e54b4>   DW_AT_declaration : 1
    <e54b4>   DW_AT_sibling     : <0xe54dc>
 <2><e54b8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54b9>   DW_AT_type        : <0xe4e13>
 <2><e54bd>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54be>   DW_AT_type        : <0xe4e13>
 <2><e54c2>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54c3>   DW_AT_type        : <0xe4e1f>
 <2><e54c7>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54c8>   DW_AT_type        : <0xe4e1f>
 <2><e54cc>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54cd>   DW_AT_type        : <0xe4e1f>
 <2><e54d1>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54d2>   DW_AT_type        : <0xe4e1f>
 <2><e54d6>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54d7>   DW_AT_type        : <0xe4e53>
 <2><e54db>: Abbrev Number: 0
 <1><e54dc>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e54dd>   DW_AT_external    : 1
    <e54dd>   DW_AT_name        : (indirect string, offset: 0x90b28): glPixelStorei
    <e54e1>   DW_AT_decl_file   : 2
    <e54e2>   DW_AT_decl_line   : 1189
    <e54e4>   DW_AT_decl_column : 23
    <e54e5>   DW_AT_prototyped  : 1
    <e54e5>   DW_AT_declaration : 1
    <e54e5>   DW_AT_sibling     : <0xe54f4>
 <2><e54e9>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54ea>   DW_AT_type        : <0xe4d97>
 <2><e54ee>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e54ef>   DW_AT_type        : <0xe4ddc>
 <2><e54f3>: Abbrev Number: 0
 <1><e54f4>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e54f5>   DW_AT_external    : 1
    <e54f5>   DW_AT_name        : (indirect string, offset: 0x90a6e): glPushClientAttrib
    <e54f9>   DW_AT_decl_file   : 2
    <e54fa>   DW_AT_decl_line   : 817
    <e54fc>   DW_AT_decl_column : 23
    <e54fd>   DW_AT_prototyped  : 1
    <e54fd>   DW_AT_declaration : 1
    <e54fd>   DW_AT_sibling     : <0xe5507>
 <2><e5501>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5502>   DW_AT_type        : <0xe4dc2>
 <2><e5506>: Abbrev Number: 0
 <1><e5507>: Abbrev Number: 16 (DW_TAG_subprogram)
    <e5508>   DW_AT_external    : 1
    <e5508>   DW_AT_name        : (indirect string, offset: 0x8e9c9): fgError
    <e550c>   DW_AT_decl_file   : 5
    <e550d>   DW_AT_decl_line   : 998
    <e550f>   DW_AT_decl_column : 6
    <e5510>   DW_AT_prototyped  : 1
    <e5510>   DW_AT_declaration : 1
    <e5510>   DW_AT_sibling     : <0xe551b>
 <2><e5514>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <e5515>   DW_AT_type        : <0xe4f14>
 <2><e5519>: Abbrev Number: 34 (DW_TAG_unspecified_parameters)
 <2><e551a>: Abbrev Number: 0
 <1><e551b>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e551c>   DW_AT_external    : 1
    <e551c>   DW_AT_name        : (indirect string, offset: 0x9073f): glutStrokeHeight
    <e5520>   DW_AT_decl_file   : 1
    <e5520>   DW_AT_decl_line   : 378
    <e5522>   DW_AT_decl_column : 20
    <e5523>   DW_AT_prototyped  : 1
    <e5523>   DW_AT_type        : <0xe4e1f>
    <e5527>   DW_AT_low_pc      : 0x9d9ba0
    <e552f>   DW_AT_high_pc     : 0x7f
    <e5537>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5539>   DW_AT_call_all_calls: 1
    <e5539>   DW_AT_sibling     : <0xe55d5>
 <2><e553d>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e553e>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5542>   DW_AT_decl_file   : 1
    <e5542>   DW_AT_decl_line   : 378
    <e5544>   DW_AT_decl_column : 44
    <e5545>   DW_AT_type        : <0xe4e40>
    <e5549>   DW_AT_location    : 0x6f08 (location list)
    <e554d>   DW_AT_GNU_locviews: 0x6efa
 <2><e5551>: Abbrev Number: 13 (DW_TAG_variable)
    <e5552>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5556>   DW_AT_decl_file   : 1
    <e5556>   DW_AT_decl_line   : 380
    <e5558>   DW_AT_decl_column : 21
    <e5559>   DW_AT_type        : <0xe55d5>
    <e555d>   DW_AT_location    : 0x6f46 (location list)
    <e5561>   DW_AT_GNU_locviews: 0x6f40
 <2><e5565>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <e5566>   DW_AT_abstract_origin: <0xe626f>
    <e556a>   DW_AT_entry_pc    : 0x9d9bad
    <e5572>   DW_AT_GNU_entry_view: 2
    <e5573>   DW_AT_ranges      : 0x11d1
    <e5577>   DW_AT_call_file   : 1
    <e5577>   DW_AT_call_line   : 382
    <e5579>   DW_AT_call_column : 12
    <e5579>   DW_AT_sibling     : <0xe55ac>
 <3><e557d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e557e>   DW_AT_abstract_origin: <0xe6280>
    <e5582>   DW_AT_location    : 0x6f65 (location list)
    <e5586>   DW_AT_GNU_locviews: 0x6f5d
 <3><e558a>: Abbrev Number: 5 (DW_TAG_call_site)
    <e558b>   DW_AT_call_return_pc: 0x9d9be9
    <e5593>   DW_AT_call_origin : <0xe5490>
 <4><e5597>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5598>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e559a>   DW_AT_call_value  : 9 byte block: 3 cf d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4cf)
 <4><e55a4>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e55a5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e55a7>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><e55aa>: Abbrev Number: 0
 <3><e55ab>: Abbrev Number: 0
 <2><e55ac>: Abbrev Number: 5 (DW_TAG_call_site)
    <e55ad>   DW_AT_call_return_pc: 0x9d9c05
    <e55b5>   DW_AT_call_origin : <0xe5507>
 <3><e55b9>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e55ba>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e55bc>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e55c6>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e55c7>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e55c9>   DW_AT_call_value  : 9 byte block: 3 85 d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d385)
 <3><e55d3>: Abbrev Number: 0
 <2><e55d4>: Abbrev Number: 0
 <1><e55d5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e55d6>   DW_AT_byte_size   : 8
    <e55d6>   DW_AT_type        : <0xe5371>
 <1><e55da>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e55db>   DW_AT_external    : 1
    <e55db>   DW_AT_name        : (indirect string, offset: 0x90790): glutStrokeLength
    <e55df>   DW_AT_decl_file   : 1
    <e55df>   DW_AT_decl_line   : 342
    <e55e1>   DW_AT_decl_column : 16
    <e55e2>   DW_AT_prototyped  : 1
    <e55e2>   DW_AT_type        : <0xe4de8>
    <e55e6>   DW_AT_low_pc      : 0x9d9a40
    <e55ee>   DW_AT_high_pc     : 0x151
    <e55f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e55f8>   DW_AT_call_all_calls: 1
    <e55f8>   DW_AT_sibling     : <0xe570c>
 <2><e55fc>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e55fd>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5601>   DW_AT_decl_file   : 1
    <e5601>   DW_AT_decl_line   : 342
    <e5603>   DW_AT_decl_column : 40
    <e5604>   DW_AT_type        : <0xe4e40>
    <e5608>   DW_AT_location    : 0x6f94 (location list)
    <e560c>   DW_AT_GNU_locviews: 0x6f82
 <2><e5610>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e5611>   DW_AT_name        : (indirect string, offset: 0x8bc8d): string
    <e5615>   DW_AT_decl_file   : 1
    <e5615>   DW_AT_decl_line   : 342
    <e5617>   DW_AT_decl_column : 69
    <e5618>   DW_AT_type        : <0xe570c>
    <e561c>   DW_AT_location    : 0x6ff1 (location list)
    <e5620>   DW_AT_GNU_locviews: 0x6fdd
 <2><e5624>: Abbrev Number: 26 (DW_TAG_variable)
    <e5625>   DW_AT_name        : c
    <e5627>   DW_AT_decl_file   : 1
    <e5627>   DW_AT_decl_line   : 344
    <e5629>   DW_AT_decl_column : 19
    <e562a>   DW_AT_type        : <0xe4db6>
    <e562e>   DW_AT_location    : 0x704a (location list)
    <e5632>   DW_AT_GNU_locviews: 0x7040
 <2><e5636>: Abbrev Number: 13 (DW_TAG_variable)
    <e5637>   DW_AT_name        : (indirect string, offset: 0x7801a): length
    <e563b>   DW_AT_decl_file   : 1
    <e563b>   DW_AT_decl_line   : 345
    <e563d>   DW_AT_decl_column : 11
    <e563e>   DW_AT_type        : <0xe4d90>
    <e5642>   DW_AT_location    : 0x707a (location list)
    <e5646>   DW_AT_GNU_locviews: 0x706e
 <2><e564a>: Abbrev Number: 13 (DW_TAG_variable)
    <e564b>   DW_AT_name        : (indirect string, offset: 0x90b50): this_line_length
    <e564f>   DW_AT_decl_file   : 1
    <e564f>   DW_AT_decl_line   : 346
    <e5651>   DW_AT_decl_column : 11
    <e5652>   DW_AT_type        : <0xe4d90>
    <e5656>   DW_AT_location    : 0x70b7 (location list)
    <e565a>   DW_AT_GNU_locviews: 0x70af
 <2><e565e>: Abbrev Number: 13 (DW_TAG_variable)
    <e565f>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5663>   DW_AT_decl_file   : 1
    <e5663>   DW_AT_decl_line   : 347
    <e5665>   DW_AT_decl_column : 21
    <e5666>   DW_AT_type        : <0xe55d5>
    <e566a>   DW_AT_location    : 0x70e4 (location list)
    <e566e>   DW_AT_GNU_locviews: 0x70de
 <2><e5672>: Abbrev Number: 45 (DW_TAG_lexical_block)
    <e5673>   DW_AT_low_pc      : 0x9d9aa8
    <e567b>   DW_AT_high_pc     : 0x11
    <e5683>   DW_AT_sibling     : <0xe569c>
 <3><e5687>: Abbrev Number: 13 (DW_TAG_variable)
    <e5688>   DW_AT_name        : (indirect string, offset: 0x90b0c): schar
    <e568c>   DW_AT_decl_file   : 1
    <e568c>   DW_AT_decl_line   : 365
    <e568e>   DW_AT_decl_column : 39
    <e568f>   DW_AT_type        : <0xe53c3>
    <e5693>   DW_AT_location    : 0x70fd (location list)
    <e5697>   DW_AT_GNU_locviews: 0x70fb
 <3><e569b>: Abbrev Number: 0
 <2><e569c>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <e569d>   DW_AT_abstract_origin: <0xe626f>
    <e56a1>   DW_AT_entry_pc    : 0x9d9a59
    <e56a9>   DW_AT_GNU_entry_view: 2
    <e56aa>   DW_AT_ranges      : 0x11c1
    <e56ae>   DW_AT_call_file   : 1
    <e56ae>   DW_AT_call_line   : 349
    <e56b0>   DW_AT_call_column : 12
    <e56b0>   DW_AT_sibling     : <0xe56e3>
 <3><e56b4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e56b5>   DW_AT_abstract_origin: <0xe6280>
    <e56b9>   DW_AT_location    : 0x710d (location list)
    <e56bd>   DW_AT_GNU_locviews: 0x7105
 <3><e56c1>: Abbrev Number: 5 (DW_TAG_call_site)
    <e56c2>   DW_AT_call_return_pc: 0x9d9b29
    <e56ca>   DW_AT_call_origin : <0xe5490>
 <4><e56ce>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e56cf>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e56d1>   DW_AT_call_value  : 9 byte block: 3 cf d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4cf)
 <4><e56db>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e56dc>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e56de>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><e56e1>: Abbrev Number: 0
 <3><e56e2>: Abbrev Number: 0
 <2><e56e3>: Abbrev Number: 5 (DW_TAG_call_site)
    <e56e4>   DW_AT_call_return_pc: 0x9d9b55
    <e56ec>   DW_AT_call_origin : <0xe5507>
 <3><e56f0>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e56f1>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e56f3>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e56fd>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e56fe>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5700>   DW_AT_call_value  : 9 byte block: 3 49 d1 a3 0 0 0 0 0 	(DW_OP_addr: a3d149)
 <3><e570a>: Abbrev Number: 0
 <2><e570b>: Abbrev Number: 0
 <1><e570c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e570d>   DW_AT_byte_size   : 8
    <e570d>   DW_AT_type        : <0xe4dbd>
 <1><e5711>: Abbrev Number: 29 (DW_TAG_subprogram)
    <e5712>   DW_AT_external    : 1
    <e5712>   DW_AT_name        : (indirect string, offset: 0x906d8): glutStrokeWidth
    <e5716>   DW_AT_decl_file   : 1
    <e5716>   DW_AT_decl_line   : 322
    <e5718>   DW_AT_decl_column : 16
    <e5719>   DW_AT_prototyped  : 1
    <e5719>   DW_AT_type        : <0xe4de8>
    <e571d>   DW_AT_low_pc      : 0x9d9990
    <e5725>   DW_AT_high_pc     : 0xaa
    <e572d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e572f>   DW_AT_call_all_calls: 1
    <e572f>   DW_AT_sibling     : <0xe57f3>
 <2><e5733>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e5734>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5738>   DW_AT_decl_file   : 1
    <e5738>   DW_AT_decl_line   : 322
    <e573a>   DW_AT_decl_column : 39
    <e573b>   DW_AT_type        : <0xe4e40>
    <e573f>   DW_AT_location    : 0x7136 (location list)
    <e5743>   DW_AT_GNU_locviews: 0x712a
 <2><e5747>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e5748>   DW_AT_name        : (indirect string, offset: 0x685d8): character
    <e574c>   DW_AT_decl_file   : 1
    <e574c>   DW_AT_decl_line   : 322
    <e574e>   DW_AT_decl_column : 51
    <e574f>   DW_AT_type        : <0xe4de8>
    <e5753>   DW_AT_location    : 0x716e (location list)
    <e5757>   DW_AT_GNU_locviews: 0x7164
 <2><e575b>: Abbrev Number: 13 (DW_TAG_variable)
    <e575c>   DW_AT_name        : (indirect string, offset: 0x90b0c): schar
    <e5760>   DW_AT_decl_file   : 1
    <e5760>   DW_AT_decl_line   : 324
    <e5762>   DW_AT_decl_column : 27
    <e5763>   DW_AT_type        : <0xe53c3>
    <e5767>   DW_AT_location    : 0x7197 (location list)
    <e576b>   DW_AT_GNU_locviews: 0x7195
 <2><e576f>: Abbrev Number: 13 (DW_TAG_variable)
    <e5770>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5774>   DW_AT_decl_file   : 1
    <e5774>   DW_AT_decl_line   : 325
    <e5776>   DW_AT_decl_column : 21
    <e5777>   DW_AT_type        : <0xe55d5>
    <e577b>   DW_AT_location    : 0x71a1 (location list)
    <e577f>   DW_AT_GNU_locviews: 0x719f
 <2><e5783>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <e5784>   DW_AT_abstract_origin: <0xe626f>
    <e5788>   DW_AT_entry_pc    : 0x9d99a5
    <e5790>   DW_AT_GNU_entry_view: 2
    <e5791>   DW_AT_ranges      : 0x11b6
    <e5795>   DW_AT_call_file   : 1
    <e5795>   DW_AT_call_line   : 327
    <e5797>   DW_AT_call_column : 12
    <e5797>   DW_AT_sibling     : <0xe57ca>
 <3><e579b>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e579c>   DW_AT_abstract_origin: <0xe6280>
    <e57a0>   DW_AT_location    : 0x71ad (location list)
    <e57a4>   DW_AT_GNU_locviews: 0x71a9
 <3><e57a8>: Abbrev Number: 5 (DW_TAG_call_site)
    <e57a9>   DW_AT_call_return_pc: 0x9d9a19
    <e57b1>   DW_AT_call_origin : <0xe5490>
 <4><e57b5>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e57b6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e57b8>   DW_AT_call_value  : 9 byte block: 3 cf d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4cf)
 <4><e57c2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e57c3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e57c5>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><e57c8>: Abbrev Number: 0
 <3><e57c9>: Abbrev Number: 0
 <2><e57ca>: Abbrev Number: 5 (DW_TAG_call_site)
    <e57cb>   DW_AT_call_return_pc: 0x9d9a35
    <e57d3>   DW_AT_call_origin : <0xe5507>
 <3><e57d7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e57d8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e57da>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e57e4>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e57e5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e57e7>   DW_AT_call_value  : 9 byte block: 3 28 d1 a3 0 0 0 0 0 	(DW_OP_addr: a3d128)
 <3><e57f1>: Abbrev Number: 0
 <2><e57f2>: Abbrev Number: 0
 <1><e57f3>: Abbrev Number: 46 (DW_TAG_subprogram)
    <e57f4>   DW_AT_external    : 1
    <e57f4>   DW_AT_name        : (indirect string, offset: 0x906c7): glutStrokeString
    <e57f8>   DW_AT_decl_file   : 1
    <e57f9>   DW_AT_decl_line   : 270
    <e57fb>   DW_AT_decl_column : 17
    <e57fc>   DW_AT_prototyped  : 1
    <e57fc>   DW_AT_low_pc      : 0x9d97d0
    <e5804>   DW_AT_high_pc     : 0x1bc
    <e580c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e580e>   DW_AT_call_all_calls: 1
    <e580e>   DW_AT_sibling     : <0xe59b3>
 <2><e5812>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e5813>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5817>   DW_AT_decl_file   : 1
    <e5817>   DW_AT_decl_line   : 270
    <e5819>   DW_AT_decl_column : 41
    <e581a>   DW_AT_type        : <0xe4e40>
    <e581e>   DW_AT_location    : 0x71cc (location list)
    <e5822>   DW_AT_GNU_locviews: 0x71bc
 <2><e5826>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <e5827>   DW_AT_name        : (indirect string, offset: 0x8bc8d): string
    <e582b>   DW_AT_decl_file   : 1
    <e582b>   DW_AT_decl_line   : 270
    <e582d>   DW_AT_decl_column : 70
    <e582e>   DW_AT_type        : <0xe570c>
    <e5832>   DW_AT_location    : 0x721d (location list)
    <e5836>   DW_AT_GNU_locviews: 0x720b
 <2><e583a>: Abbrev Number: 26 (DW_TAG_variable)
    <e583b>   DW_AT_name        : c
    <e583d>   DW_AT_decl_file   : 1
    <e583d>   DW_AT_decl_line   : 272
    <e583f>   DW_AT_decl_column : 19
    <e5840>   DW_AT_type        : <0xe4db6>
    <e5844>   DW_AT_location    : 0x726a (location list)
    <e5848>   DW_AT_GNU_locviews: 0x7262
 <2><e584c>: Abbrev Number: 26 (DW_TAG_variable)
    <e584d>   DW_AT_name        : i
    <e584f>   DW_AT_decl_file   : 1
    <e584f>   DW_AT_decl_line   : 273
    <e5851>   DW_AT_decl_column : 9
    <e5852>   DW_AT_type        : <0xe4de8>
    <e5856>   DW_AT_location    : 0x728b (location list)
    <e585a>   DW_AT_GNU_locviews: 0x7287
 <2><e585e>: Abbrev Number: 26 (DW_TAG_variable)
    <e585f>   DW_AT_name        : j
    <e5861>   DW_AT_decl_file   : 1
    <e5861>   DW_AT_decl_line   : 273
    <e5863>   DW_AT_decl_column : 12
    <e5864>   DW_AT_type        : <0xe4de8>
    <e5868>   DW_AT_location    : 0x729f (location list)
    <e586c>   DW_AT_GNU_locviews: 0x729b
 <2><e5870>: Abbrev Number: 13 (DW_TAG_variable)
    <e5871>   DW_AT_name        : (indirect string, offset: 0x7801a): length
    <e5875>   DW_AT_decl_file   : 1
    <e5875>   DW_AT_decl_line   : 274
    <e5877>   DW_AT_decl_column : 11
    <e5878>   DW_AT_type        : <0xe4d90>
    <e587c>   DW_AT_location    : 0x72bd (location list)
    <e5880>   DW_AT_GNU_locviews: 0x72af
 <2><e5884>: Abbrev Number: 13 (DW_TAG_variable)
    <e5885>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5889>   DW_AT_decl_file   : 1
    <e5889>   DW_AT_decl_line   : 275
    <e588b>   DW_AT_decl_column : 21
    <e588c>   DW_AT_type        : <0xe55d5>
    <e5890>   DW_AT_location    : 0x7308 (location list)
    <e5894>   DW_AT_GNU_locviews: 0x7304
 <2><e5898>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <e5899>   DW_AT_ranges      : 0x11a0
    <e589d>   DW_AT_sibling     : <0xe5925>
 <3><e58a1>: Abbrev Number: 13 (DW_TAG_variable)
    <e58a2>   DW_AT_name        : (indirect string, offset: 0x90b0c): schar
    <e58a6>   DW_AT_decl_file   : 1
    <e58a6>   DW_AT_decl_line   : 297
    <e58a8>   DW_AT_decl_column : 39
    <e58a9>   DW_AT_type        : <0xe53c3>
    <e58ad>   DW_AT_location    : 0x7319 (location list)
    <e58b1>   DW_AT_GNU_locviews: 0x7317
 <3><e58b5>: Abbrev Number: 47 (DW_TAG_lexical_block)
    <e58b6>   DW_AT_ranges      : 0x11ab
 <4><e58ba>: Abbrev Number: 13 (DW_TAG_variable)
    <e58bb>   DW_AT_name        : (indirect string, offset: 0x90b95): strip
    <e58bf>   DW_AT_decl_file   : 1
    <e58bf>   DW_AT_decl_line   : 300
    <e58c1>   DW_AT_decl_column : 44
    <e58c2>   DW_AT_type        : <0xe536c>
    <e58c6>   DW_AT_location    : 0x7323 (location list)
    <e58ca>   DW_AT_GNU_locviews: 0x7321
 <4><e58ce>: Abbrev Number: 4 (DW_TAG_call_site)
    <e58cf>   DW_AT_call_return_pc: 0x9d988a
    <e58d7>   DW_AT_call_origin : <0xe547d>
    <e58db>   DW_AT_sibling     : <0xe58e5>
 <5><e58df>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e58e0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e58e2>   DW_AT_call_value  : 1 byte block: 33 	(DW_OP_lit3)
 <5><e58e4>: Abbrev Number: 0
 <4><e58e5>: Abbrev Number: 19 (DW_TAG_call_site)
    <e58e6>   DW_AT_call_return_pc: 0x9d98b2
    <e58ee>   DW_AT_call_origin : <0xe5465>
 <4><e58f2>: Abbrev Number: 19 (DW_TAG_call_site)
    <e58f3>   DW_AT_call_return_pc: 0x9d98bc
    <e58fb>   DW_AT_call_origin : <0xe545e>
 <4><e58ff>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5900>   DW_AT_call_return_pc: 0x9d98ef
    <e5908>   DW_AT_call_origin : <0xe5441>
 <5><e590c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e590d>   DW_AT_location    : 1 byte block: 62 	(DW_OP_reg18 (xmm1))
    <e590f>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <5><e5917>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5918>   DW_AT_location    : 1 byte block: 63 	(DW_OP_reg19 (xmm2))
    <e591a>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <5><e5922>: Abbrev Number: 0
 <4><e5923>: Abbrev Number: 0
 <3><e5924>: Abbrev Number: 0
 <2><e5925>: Abbrev Number: 25 (DW_TAG_inlined_subroutine)
    <e5926>   DW_AT_abstract_origin: <0xe626f>
    <e592a>   DW_AT_entry_pc    : 0x9d97f1
    <e5932>   DW_AT_GNU_entry_view: 2
    <e5933>   DW_AT_ranges      : 0x1186
    <e5937>   DW_AT_call_file   : 1
    <e5937>   DW_AT_call_line   : 277
    <e5939>   DW_AT_call_column : 12
    <e5939>   DW_AT_sibling     : <0xe596d>
 <3><e593d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e593e>   DW_AT_abstract_origin: <0xe6280>
    <e5942>   DW_AT_location    : 0x7337 (location list)
    <e5946>   DW_AT_GNU_locviews: 0x732b
 <3><e594a>: Abbrev Number: 30 (DW_TAG_call_site)
    <e594b>   DW_AT_call_return_pc: 0x9d992b
    <e5953>   DW_AT_call_tail_call: 1
    <e5953>   DW_AT_call_origin : <0xe5490>
 <4><e5957>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5958>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e595a>   DW_AT_call_value  : 9 byte block: 3 cf d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4cf)
 <4><e5964>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5965>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5967>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <4><e596b>: Abbrev Number: 0
 <3><e596c>: Abbrev Number: 0
 <2><e596d>: Abbrev Number: 4 (DW_TAG_call_site)
    <e596e>   DW_AT_call_return_pc: 0x9d994e
    <e5976>   DW_AT_call_origin : <0xe5441>
    <e597a>   DW_AT_sibling     : <0xe598a>
 <3><e597e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e597f>   DW_AT_location    : 1 byte block: 63 	(DW_OP_reg19 (xmm2))
    <e5981>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <3><e5989>: Abbrev Number: 0
 <2><e598a>: Abbrev Number: 5 (DW_TAG_call_site)
    <e598b>   DW_AT_call_return_pc: 0x9d9970
    <e5993>   DW_AT_call_origin : <0xe5507>
 <3><e5997>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5998>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e599a>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e59a4>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e59a5>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e59a7>   DW_AT_call_value  : 9 byte block: 3 a7 d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d3a7)
 <3><e59b1>: Abbrev Number: 0
 <2><e59b2>: Abbrev Number: 0
 <1><e59b3>: Abbrev Number: 31 (DW_TAG_subprogram)
    <e59b4>   DW_AT_external    : 1
    <e59b4>   DW_AT_name        : (indirect string, offset: 0x90a14): glutStrokeCharacter
    <e59b8>   DW_AT_decl_file   : 1
    <e59b8>   DW_AT_decl_line   : 240
    <e59b9>   DW_AT_decl_column : 17
    <e59b9>   DW_AT_prototyped  : 1
    <e59b9>   DW_AT_low_pc      : 0x9d9660
    <e59c1>   DW_AT_high_pc     : 0x16a
    <e59c9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e59cb>   DW_AT_call_all_calls: 1
    <e59cb>   DW_AT_sibling     : <0xe5b49>
 <2><e59cf>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e59d0>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e59d4>   DW_AT_decl_file   : 1
    <e59d4>   DW_AT_decl_line   : 240
    <e59d5>   DW_AT_decl_column : 44
    <e59d6>   DW_AT_type        : <0xe4e40>
    <e59da>   DW_AT_location    : 0x7375 (location list)
    <e59de>   DW_AT_GNU_locviews: 0x7365
 <2><e59e2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e59e3>   DW_AT_name        : (indirect string, offset: 0x685d8): character
    <e59e7>   DW_AT_decl_file   : 1
    <e59e7>   DW_AT_decl_line   : 240
    <e59e8>   DW_AT_decl_column : 56
    <e59e9>   DW_AT_type        : <0xe4de8>
    <e59ed>   DW_AT_location    : 0x73be (location list)
    <e59f1>   DW_AT_GNU_locviews: 0x73b4
 <2><e59f5>: Abbrev Number: 10 (DW_TAG_variable)
    <e59f6>   DW_AT_name        : (indirect string, offset: 0x90b0c): schar
    <e59fa>   DW_AT_decl_file   : 1
    <e59fa>   DW_AT_decl_line   : 242
    <e59fb>   DW_AT_decl_column : 27
    <e59fc>   DW_AT_type        : <0xe53c3>
    <e5a00>   DW_AT_location    : 0x73e7 (location list)
    <e5a04>   DW_AT_GNU_locviews: 0x73e5
 <2><e5a08>: Abbrev Number: 10 (DW_TAG_variable)
    <e5a09>   DW_AT_name        : (indirect string, offset: 0x90b95): strip
    <e5a0d>   DW_AT_decl_file   : 1
    <e5a0d>   DW_AT_decl_line   : 243
    <e5a0e>   DW_AT_decl_column : 28
    <e5a0f>   DW_AT_type        : <0xe536c>
    <e5a13>   DW_AT_location    : 0x73f1 (location list)
    <e5a17>   DW_AT_GNU_locviews: 0x73ef
 <2><e5a1b>: Abbrev Number: 22 (DW_TAG_variable)
    <e5a1c>   DW_AT_name        : i
    <e5a1e>   DW_AT_decl_file   : 1
    <e5a1e>   DW_AT_decl_line   : 244
    <e5a1f>   DW_AT_decl_column : 9
    <e5a20>   DW_AT_type        : <0xe4de8>
    <e5a24>   DW_AT_location    : 0x73fd (location list)
    <e5a28>   DW_AT_GNU_locviews: 0x73f9
 <2><e5a2c>: Abbrev Number: 22 (DW_TAG_variable)
    <e5a2d>   DW_AT_name        : j
    <e5a2f>   DW_AT_decl_file   : 1
    <e5a2f>   DW_AT_decl_line   : 244
    <e5a30>   DW_AT_decl_column : 12
    <e5a31>   DW_AT_type        : <0xe4de8>
    <e5a35>   DW_AT_location    : 0x7415 (location list)
    <e5a39>   DW_AT_GNU_locviews: 0x740d
 <2><e5a3d>: Abbrev Number: 10 (DW_TAG_variable)
    <e5a3e>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5a42>   DW_AT_decl_file   : 1
    <e5a42>   DW_AT_decl_line   : 245
    <e5a43>   DW_AT_decl_column : 21
    <e5a44>   DW_AT_type        : <0xe55d5>
    <e5a48>   DW_AT_location    : 0x7436 (location list)
    <e5a4c>   DW_AT_GNU_locviews: 0x7434
 <2><e5a50>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <e5a51>   DW_AT_abstract_origin: <0xe626f>
    <e5a55>   DW_AT_entry_pc    : 0x9d967d
    <e5a5d>   DW_AT_GNU_entry_view: 2
    <e5a5e>   DW_AT_ranges      : 0x117b
    <e5a62>   DW_AT_call_file   : 1
    <e5a62>   DW_AT_call_line   : 247
    <e5a63>   DW_AT_call_column : 12
    <e5a63>   DW_AT_sibling     : <0xe5a96>
 <3><e5a67>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5a68>   DW_AT_abstract_origin: <0xe6280>
    <e5a6c>   DW_AT_location    : 0x7442 (location list)
    <e5a70>   DW_AT_GNU_locviews: 0x743e
 <3><e5a74>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5a75>   DW_AT_call_return_pc: 0x9d97a9
    <e5a7d>   DW_AT_call_origin : <0xe5490>
 <4><e5a81>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5a82>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5a84>   DW_AT_call_value  : 9 byte block: 3 cf d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4cf)
 <4><e5a8e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5a8f>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5a91>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <4><e5a94>: Abbrev Number: 0
 <3><e5a95>: Abbrev Number: 0
 <2><e5a96>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5a97>   DW_AT_call_return_pc: 0x9d96ea
    <e5a9f>   DW_AT_call_origin : <0xe547d>
    <e5aa3>   DW_AT_sibling     : <0xe5aad>
 <3><e5aa7>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5aa8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5aaa>   DW_AT_call_value  : 1 byte block: 33 	(DW_OP_lit3)
 <3><e5aac>: Abbrev Number: 0
 <2><e5aad>: Abbrev Number: 19 (DW_TAG_call_site)
    <e5aae>   DW_AT_call_return_pc: 0x9d9712
    <e5ab6>   DW_AT_call_origin : <0xe5465>
 <2><e5aba>: Abbrev Number: 19 (DW_TAG_call_site)
    <e5abb>   DW_AT_call_return_pc: 0x9d971b
    <e5ac3>   DW_AT_call_origin : <0xe545e>
 <2><e5ac7>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5ac8>   DW_AT_call_return_pc: 0x9d9722
    <e5ad0>   DW_AT_call_origin : <0xe547d>
    <e5ad4>   DW_AT_sibling     : <0xe5ade>
 <3><e5ad8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5ad9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5adb>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5add>: Abbrev Number: 0
 <2><e5ade>: Abbrev Number: 19 (DW_TAG_call_site)
    <e5adf>   DW_AT_call_return_pc: 0x9d974a
    <e5ae7>   DW_AT_call_origin : <0xe5465>
 <2><e5aeb>: Abbrev Number: 19 (DW_TAG_call_site)
    <e5aec>   DW_AT_call_return_pc: 0x9d9753
    <e5af4>   DW_AT_call_origin : <0xe545e>
 <2><e5af8>: Abbrev Number: 48 (DW_TAG_call_site)
    <e5af9>   DW_AT_call_return_pc: 0x9d9781
    <e5b01>   DW_AT_call_tail_call: 1
    <e5b01>   DW_AT_call_origin : <0xe5441>
    <e5b05>   DW_AT_sibling     : <0xe5b20>
 <3><e5b09>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5b0a>   DW_AT_location    : 1 byte block: 62 	(DW_OP_reg18 (xmm1))
    <e5b0c>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <3><e5b14>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5b15>   DW_AT_location    : 1 byte block: 63 	(DW_OP_reg19 (xmm2))
    <e5b17>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <3><e5b1f>: Abbrev Number: 0
 <2><e5b20>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5b21>   DW_AT_call_return_pc: 0x9d97c5
    <e5b29>   DW_AT_call_origin : <0xe5507>
 <3><e5b2d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5b2e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5b30>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e5b3a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5b3b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5b3d>   DW_AT_call_value  : 9 byte block: 3 14 d1 a3 0 0 0 0 0 	(DW_OP_addr: a3d114)
 <3><e5b47>: Abbrev Number: 0
 <2><e5b48>: Abbrev Number: 0
 <1><e5b49>: Abbrev Number: 32 (DW_TAG_subprogram)
    <e5b4a>   DW_AT_external    : 1
    <e5b4a>   DW_AT_name        : (indirect string, offset: 0x8fa00): glutBitmapHeight
    <e5b4e>   DW_AT_decl_file   : 1
    <e5b4e>   DW_AT_decl_line   : 228
    <e5b4f>   DW_AT_decl_column : 16
    <e5b4f>   DW_AT_prototyped  : 1
    <e5b4f>   DW_AT_type        : <0xe4de8>
    <e5b53>   DW_AT_low_pc      : 0x9d9530
    <e5b5b>   DW_AT_high_pc     : 0x12c
    <e5b63>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5b65>   DW_AT_call_all_calls: 1
    <e5b65>   DW_AT_sibling     : <0xe5c1e>
 <2><e5b69>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5b6a>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5b6e>   DW_AT_decl_file   : 1
    <e5b6e>   DW_AT_decl_line   : 228
    <e5b6f>   DW_AT_decl_column : 40
    <e5b70>   DW_AT_type        : <0xe4e40>
    <e5b74>   DW_AT_location    : 0x745f (location list)
    <e5b78>   DW_AT_GNU_locviews: 0x7451
 <2><e5b7c>: Abbrev Number: 10 (DW_TAG_variable)
    <e5b7d>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5b81>   DW_AT_decl_file   : 1
    <e5b81>   DW_AT_decl_line   : 230
    <e5b82>   DW_AT_decl_column : 15
    <e5b83>   DW_AT_type        : <0xe5c1e>
    <e5b87>   DW_AT_location    : 0x74a1 (location list)
    <e5b8b>   DW_AT_GNU_locviews: 0x7497
 <2><e5b8f>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <e5b90>   DW_AT_abstract_origin: <0xe628c>
    <e5b94>   DW_AT_entry_pc    : 0x9d953d
    <e5b9c>   DW_AT_GNU_entry_view: 2
    <e5b9d>   DW_AT_ranges      : 0x1151
    <e5ba1>   DW_AT_call_file   : 1
    <e5ba1>   DW_AT_call_line   : 232
    <e5ba2>   DW_AT_call_column : 12
    <e5ba2>   DW_AT_sibling     : <0xe5bf5>
 <3><e5ba6>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5ba7>   DW_AT_abstract_origin: <0xe6299>
    <e5bab>   DW_AT_location    : 0x74d4 (location list)
    <e5baf>   DW_AT_GNU_locviews: 0x74c6
 <3><e5bb3>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <e5bb4>   DW_AT_abstract_origin: <0xe628c>
    <e5bb8>   DW_AT_entry_pc    : 0x9d959d
    <e5bc0>   DW_AT_GNU_entry_view: 0
    <e5bc1>   DW_AT_ranges      : 0x1170
    <e5bc5>   DW_AT_call_file   : 1
    <e5bc5>   DW_AT_call_line   : 62
    <e5bc5>   DW_AT_call_column : 18
 <4><e5bc5>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5bc6>   DW_AT_abstract_origin: <0xe6299>
    <e5bca>   DW_AT_location    : 0x750a (location list)
    <e5bce>   DW_AT_GNU_locviews: 0x7506
 <4><e5bd2>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5bd3>   DW_AT_call_return_pc: 0x9d9601
    <e5bdb>   DW_AT_call_origin : <0xe5490>
 <5><e5bdf>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5be0>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5be2>   DW_AT_call_value  : 9 byte block: 3 d6 d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4d6)
 <5><e5bec>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5bed>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5bef>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <5><e5bf2>: Abbrev Number: 0
 <4><e5bf3>: Abbrev Number: 0
 <3><e5bf4>: Abbrev Number: 0
 <2><e5bf5>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5bf6>   DW_AT_call_return_pc: 0x9d95cd
    <e5bfe>   DW_AT_call_origin : <0xe5507>
 <3><e5c02>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5c03>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5c05>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e5c0f>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5c10>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5c12>   DW_AT_call_value  : 9 byte block: 3 74 d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d374)
 <3><e5c1c>: Abbrev Number: 0
 <2><e5c1d>: Abbrev Number: 0
 <1><e5c1e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <e5c1f>   DW_AT_byte_size   : 8
    <e5c1f>   DW_AT_type        : <0xe524a>
 <1><e5c23>: Abbrev Number: 32 (DW_TAG_subprogram)
    <e5c24>   DW_AT_external    : 1
    <e5c24>   DW_AT_name        : (indirect string, offset: 0x8fa8b): glutBitmapLength
    <e5c28>   DW_AT_decl_file   : 1
    <e5c28>   DW_AT_decl_line   : 197
    <e5c29>   DW_AT_decl_column : 16
    <e5c29>   DW_AT_prototyped  : 1
    <e5c29>   DW_AT_type        : <0xe4de8>
    <e5c2d>   DW_AT_low_pc      : 0x9d9390
    <e5c35>   DW_AT_high_pc     : 0x19c
    <e5c3d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5c3f>   DW_AT_call_all_calls: 1
    <e5c3f>   DW_AT_sibling     : <0xe5d42>
 <2><e5c43>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5c44>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5c48>   DW_AT_decl_file   : 1
    <e5c48>   DW_AT_decl_line   : 197
    <e5c49>   DW_AT_decl_column : 40
    <e5c4a>   DW_AT_type        : <0xe4e40>
    <e5c4e>   DW_AT_location    : 0x752b (location list)
    <e5c52>   DW_AT_GNU_locviews: 0x7519
 <2><e5c56>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5c57>   DW_AT_name        : (indirect string, offset: 0x8bc8d): string
    <e5c5b>   DW_AT_decl_file   : 1
    <e5c5b>   DW_AT_decl_line   : 197
    <e5c5c>   DW_AT_decl_column : 69
    <e5c5d>   DW_AT_type        : <0xe570c>
    <e5c61>   DW_AT_location    : 0x758c (location list)
    <e5c65>   DW_AT_GNU_locviews: 0x7574
 <2><e5c69>: Abbrev Number: 22 (DW_TAG_variable)
    <e5c6a>   DW_AT_name        : c
    <e5c6c>   DW_AT_decl_file   : 1
    <e5c6c>   DW_AT_decl_line   : 199
    <e5c6d>   DW_AT_decl_column : 19
    <e5c6e>   DW_AT_type        : <0xe4db6>
    <e5c72>   DW_AT_location    : 0x75f1 (location list)
    <e5c76>   DW_AT_GNU_locviews: 0x75eb
 <2><e5c7a>: Abbrev Number: 10 (DW_TAG_variable)
    <e5c7b>   DW_AT_name        : (indirect string, offset: 0x7801a): length
    <e5c7f>   DW_AT_decl_file   : 1
    <e5c7f>   DW_AT_decl_line   : 200
    <e5c80>   DW_AT_decl_column : 9
    <e5c81>   DW_AT_type        : <0xe4de8>
    <e5c85>   DW_AT_location    : 0x7611 (location list)
    <e5c89>   DW_AT_GNU_locviews: 0x7607
 <2><e5c8d>: Abbrev Number: 10 (DW_TAG_variable)
    <e5c8e>   DW_AT_name        : (indirect string, offset: 0x90b50): this_line_length
    <e5c92>   DW_AT_decl_file   : 1
    <e5c92>   DW_AT_decl_line   : 200
    <e5c93>   DW_AT_decl_column : 21
    <e5c94>   DW_AT_type        : <0xe4de8>
    <e5c98>   DW_AT_location    : 0x763e (location list)
    <e5c9c>   DW_AT_GNU_locviews: 0x7638
 <2><e5ca0>: Abbrev Number: 10 (DW_TAG_variable)
    <e5ca1>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5ca5>   DW_AT_decl_file   : 1
    <e5ca5>   DW_AT_decl_line   : 201
    <e5ca6>   DW_AT_decl_column : 15
    <e5ca7>   DW_AT_type        : <0xe5c1e>
    <e5cab>   DW_AT_location    : 0x765c (location list)
    <e5caf>   DW_AT_GNU_locviews: 0x7656
 <2><e5cb3>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <e5cb4>   DW_AT_abstract_origin: <0xe628c>
    <e5cb8>   DW_AT_entry_pc    : 0x9d93a9
    <e5cc0>   DW_AT_GNU_entry_view: 2
    <e5cc1>   DW_AT_ranges      : 0x1131
    <e5cc5>   DW_AT_call_file   : 1
    <e5cc5>   DW_AT_call_line   : 203
    <e5cc6>   DW_AT_call_column : 12
    <e5cc6>   DW_AT_sibling     : <0xe5d19>
 <3><e5cca>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5ccb>   DW_AT_abstract_origin: <0xe6299>
    <e5ccf>   DW_AT_location    : 0x767d (location list)
    <e5cd3>   DW_AT_GNU_locviews: 0x7673
 <3><e5cd7>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <e5cd8>   DW_AT_abstract_origin: <0xe628c>
    <e5cdc>   DW_AT_entry_pc    : 0x9d9409
    <e5ce4>   DW_AT_GNU_entry_view: 0
    <e5ce5>   DW_AT_ranges      : 0x1146
    <e5ce9>   DW_AT_call_file   : 1
    <e5ce9>   DW_AT_call_line   : 62
    <e5ce9>   DW_AT_call_column : 18
 <4><e5ce9>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5cea>   DW_AT_abstract_origin: <0xe6299>
    <e5cee>   DW_AT_location    : 0x76a5 (location list)
    <e5cf2>   DW_AT_GNU_locviews: 0x76a1
 <4><e5cf6>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5cf7>   DW_AT_call_return_pc: 0x9d94d1
    <e5cff>   DW_AT_call_origin : <0xe5490>
 <5><e5d03>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5d04>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5d06>   DW_AT_call_value  : 9 byte block: 3 d6 d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4d6)
 <5><e5d10>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5d11>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5d13>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <5><e5d16>: Abbrev Number: 0
 <4><e5d17>: Abbrev Number: 0
 <3><e5d18>: Abbrev Number: 0
 <2><e5d19>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5d1a>   DW_AT_call_return_pc: 0x9d9495
    <e5d22>   DW_AT_call_origin : <0xe5507>
 <3><e5d26>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5d27>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5d29>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e5d33>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5d34>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5d36>   DW_AT_call_value  : 9 byte block: 3 38 d1 a3 0 0 0 0 0 	(DW_OP_addr: a3d138)
 <3><e5d40>: Abbrev Number: 0
 <2><e5d41>: Abbrev Number: 0
 <1><e5d42>: Abbrev Number: 32 (DW_TAG_subprogram)
    <e5d43>   DW_AT_external    : 1
    <e5d43>   DW_AT_name        : (indirect string, offset: 0x8f926): glutBitmapWidth
    <e5d47>   DW_AT_decl_file   : 1
    <e5d47>   DW_AT_decl_line   : 184
    <e5d48>   DW_AT_decl_column : 16
    <e5d48>   DW_AT_prototyped  : 1
    <e5d48>   DW_AT_type        : <0xe4de8>
    <e5d4c>   DW_AT_low_pc      : 0x9d9230
    <e5d54>   DW_AT_high_pc     : 0x15c
    <e5d5c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5d5e>   DW_AT_call_all_calls: 1
    <e5d5e>   DW_AT_sibling     : <0xe5e2a>
 <2><e5d62>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5d63>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5d67>   DW_AT_decl_file   : 1
    <e5d67>   DW_AT_decl_line   : 184
    <e5d68>   DW_AT_decl_column : 39
    <e5d69>   DW_AT_type        : <0xe4e40>
    <e5d6d>   DW_AT_location    : 0x76c2 (location list)
    <e5d71>   DW_AT_GNU_locviews: 0x76b4
 <2><e5d75>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5d76>   DW_AT_name        : (indirect string, offset: 0x685d8): character
    <e5d7a>   DW_AT_decl_file   : 1
    <e5d7a>   DW_AT_decl_line   : 184
    <e5d7b>   DW_AT_decl_column : 51
    <e5d7c>   DW_AT_type        : <0xe4de8>
    <e5d80>   DW_AT_location    : 0x7706 (location list)
    <e5d84>   DW_AT_GNU_locviews: 0x76fa
 <2><e5d88>: Abbrev Number: 10 (DW_TAG_variable)
    <e5d89>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5d8d>   DW_AT_decl_file   : 1
    <e5d8d>   DW_AT_decl_line   : 186
    <e5d8e>   DW_AT_decl_column : 15
    <e5d8f>   DW_AT_type        : <0xe5c1e>
    <e5d93>   DW_AT_location    : 0x773a (location list)
    <e5d97>   DW_AT_GNU_locviews: 0x7736
 <2><e5d9b>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <e5d9c>   DW_AT_abstract_origin: <0xe628c>
    <e5da0>   DW_AT_entry_pc    : 0x9d9248
    <e5da8>   DW_AT_GNU_entry_view: 2
    <e5da9>   DW_AT_ranges      : 0x1116
    <e5dad>   DW_AT_call_file   : 1
    <e5dad>   DW_AT_call_line   : 188
    <e5dae>   DW_AT_call_column : 12
    <e5dae>   DW_AT_sibling     : <0xe5e01>
 <3><e5db2>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5db3>   DW_AT_abstract_origin: <0xe6299>
    <e5db7>   DW_AT_location    : 0x7752 (location list)
    <e5dbb>   DW_AT_GNU_locviews: 0x774a
 <3><e5dbf>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <e5dc0>   DW_AT_abstract_origin: <0xe628c>
    <e5dc4>   DW_AT_entry_pc    : 0x9d92a8
    <e5dcc>   DW_AT_GNU_entry_view: 0
    <e5dcd>   DW_AT_ranges      : 0x1126
    <e5dd1>   DW_AT_call_file   : 1
    <e5dd1>   DW_AT_call_line   : 62
    <e5dd1>   DW_AT_call_column : 18
 <4><e5dd1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5dd2>   DW_AT_abstract_origin: <0xe6299>
    <e5dd6>   DW_AT_location    : 0x7773 (location list)
    <e5dda>   DW_AT_GNU_locviews: 0x776f
 <4><e5dde>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5ddf>   DW_AT_call_return_pc: 0x9d9331
    <e5de7>   DW_AT_call_origin : <0xe5490>
 <5><e5deb>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5dec>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5dee>   DW_AT_call_value  : 9 byte block: 3 d6 d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4d6)
 <5><e5df8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5df9>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5dfb>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <5><e5dfe>: Abbrev Number: 0
 <4><e5dff>: Abbrev Number: 0
 <3><e5e00>: Abbrev Number: 0
 <2><e5e01>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5e02>   DW_AT_call_return_pc: 0x9d92fd
    <e5e0a>   DW_AT_call_origin : <0xe5507>
 <3><e5e0e>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5e0f>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5e11>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><e5e1b>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5e1c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5e1e>   DW_AT_call_value  : 9 byte block: 3 4 d1 a3 0 0 0 0 0 	(DW_OP_addr: a3d104)
 <3><e5e28>: Abbrev Number: 0
 <2><e5e29>: Abbrev Number: 0
 <1><e5e2a>: Abbrev Number: 31 (DW_TAG_subprogram)
    <e5e2b>   DW_AT_external    : 1
    <e5e2b>   DW_AT_name        : (indirect string, offset: 0x8f905): glutBitmapString
    <e5e2f>   DW_AT_decl_file   : 1
    <e5e2f>   DW_AT_decl_line   : 134
    <e5e30>   DW_AT_decl_column : 17
    <e5e30>   DW_AT_prototyped  : 1
    <e5e30>   DW_AT_low_pc      : 0x9d8fb0
    <e5e38>   DW_AT_high_pc     : 0x27c
    <e5e40>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e5e42>   DW_AT_call_all_calls: 1
    <e5e42>   DW_AT_sibling     : <0xe607c>
 <2><e5e46>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5e47>   DW_AT_name        : (indirect string, offset: 0x90b8e): fontID
    <e5e4b>   DW_AT_decl_file   : 1
    <e5e4b>   DW_AT_decl_line   : 134
    <e5e4c>   DW_AT_decl_column : 41
    <e5e4d>   DW_AT_type        : <0xe4e40>
    <e5e51>   DW_AT_location    : 0x7796 (location list)
    <e5e55>   DW_AT_GNU_locviews: 0x7782
 <2><e5e59>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <e5e5a>   DW_AT_name        : (indirect string, offset: 0x8bc8d): string
    <e5e5e>   DW_AT_decl_file   : 1
    <e5e5e>   DW_AT_decl_line   : 134
    <e5e5f>   DW_AT_decl_column : 70
    <e5e60>   DW_AT_type        : <0xe570c>
    <e5e64>   DW_AT_location    : 0x7800 (location list)
    <e5e68>   DW_AT_GNU_locviews: 0x77e6
 <2><e5e6c>: Abbrev Number: 22 (DW_TAG_variable)
    <e5e6d>   DW_AT_name        : c
    <e5e6f>   DW_AT_decl_file   : 1
    <e5e6f>   DW_AT_decl_line   : 136
    <e5e70>   DW_AT_decl_column : 19
    <e5e71>   DW_AT_type        : <0xe4db6>
    <e5e75>   DW_AT_location    : 0x786c (location list)
    <e5e79>   DW_AT_GNU_locviews: 0x7866
 <2><e5e7d>: Abbrev Number: 22 (DW_TAG_variable)
    <e5e7e>   DW_AT_name        : x
    <e5e80>   DW_AT_decl_file   : 1
    <e5e80>   DW_AT_decl_line   : 137
    <e5e81>   DW_AT_decl_column : 11
    <e5e82>   DW_AT_type        : <0xe4d90>
    <e5e86>   DW_AT_location    : 0x788e (location list)
    <e5e8a>   DW_AT_GNU_locviews: 0x7882
 <2><e5e8e>: Abbrev Number: 10 (DW_TAG_variable)
    <e5e8f>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <e5e93>   DW_AT_decl_file   : 1
    <e5e93>   DW_AT_decl_line   : 138
    <e5e94>   DW_AT_decl_column : 15
    <e5e95>   DW_AT_type        : <0xe5c1e>
    <e5e99>   DW_AT_location    : 0x78cd (location list)
    <e5e9d>   DW_AT_GNU_locviews: 0x78c9
 <2><e5ea1>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <e5ea2>   DW_AT_ranges      : 0x1106
    <e5ea6>   DW_AT_sibling     : <0xe5edd>
 <3><e5eaa>: Abbrev Number: 10 (DW_TAG_variable)
    <e5eab>   DW_AT_name        : (indirect string, offset: 0x841b9): face
    <e5eaf>   DW_AT_decl_file   : 1
    <e5eaf>   DW_AT_decl_line   : 166
    <e5eb0>   DW_AT_decl_column : 28
    <e5eb1>   DW_AT_type        : <0xe4e53>
    <e5eb5>   DW_AT_location    : 0x78de (location list)
    <e5eb9>   DW_AT_GNU_locviews: 0x78dc
 <3><e5ebd>: Abbrev Number: 5 (DW_TAG_call_site)
    <e5ebe>   DW_AT_call_return_pc: 0x9d9106
    <e5ec6>   DW_AT_call_origin : <0xe54ab>
 <4><e5eca>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5ecb>   DW_AT_location    : 1 byte block: 64 	(DW_OP_reg20 (xmm3))
    <e5ecd>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
 <4><e5ed5>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5ed6>   DW_AT_location    : 1 byte block: 51 	(DW_OP_reg1 (rdx))
    <e5ed8>   DW_AT_call_value  : 2 byte block: 7c 1 	(DW_OP_breg12 (r12): 1)
 <4><e5edb>: Abbrev Number: 0
 <3><e5edc>: Abbrev Number: 0
 <2><e5edd>: Abbrev Number: 20 (DW_TAG_inlined_subroutine)
    <e5ede>   DW_AT_abstract_origin: <0xe628c>
    <e5ee2>   DW_AT_entry_pc    : 0x9d8fcb
    <e5eea>   DW_AT_GNU_entry_view: 2
    <e5eeb>   DW_AT_ranges      : 0x10dc
    <e5eef>   DW_AT_call_file   : 1
    <e5eef>   DW_AT_call_line   : 140
    <e5ef0>   DW_AT_call_column : 12
    <e5ef0>   DW_AT_sibling     : <0xe5f44>
 <3><e5ef4>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5ef5>   DW_AT_abstract_origin: <0xe6299>
    <e5ef9>   DW_AT_location    : 0x78f2 (location list)
    <e5efd>   DW_AT_GNU_locviews: 0x78e6
 <3><e5f01>: Abbrev Number: 23 (DW_TAG_inlined_subroutine)
    <e5f02>   DW_AT_abstract_origin: <0xe628c>
    <e5f06>   DW_AT_entry_pc    : 0x9d902b
    <e5f0e>   DW_AT_GNU_entry_view: 0
    <e5f0f>   DW_AT_ranges      : 0x10f1
    <e5f13>   DW_AT_call_file   : 1
    <e5f13>   DW_AT_call_line   : 62
    <e5f13>   DW_AT_call_column : 18
 <4><e5f13>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <e5f14>   DW_AT_abstract_origin: <0xe6299>
    <e5f18>   DW_AT_location    : 0x7928 (location list)
    <e5f1c>   DW_AT_GNU_locviews: 0x7920
 <4><e5f20>: Abbrev Number: 30 (DW_TAG_call_site)
    <e5f21>   DW_AT_call_return_pc: 0x9d91d9
    <e5f29>   DW_AT_call_tail_call: 1
    <e5f29>   DW_AT_call_origin : <0xe5490>
 <5><e5f2d>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f2e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5f30>   DW_AT_call_value  : 9 byte block: 3 d6 d4 a3 0 0 0 0 0 	(DW_OP_addr: a3d4d6)
 <5><e5f3a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f3b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5f3d>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <5><e5f41>: Abbrev Number: 0
 <4><e5f42>: Abbrev Number: 0
 <3><e5f43>: Abbrev Number: 0
 <2><e5f44>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5f45>   DW_AT_call_return_pc: 0x9d906b
    <e5f4d>   DW_AT_call_origin : <0xe54f4>
    <e5f51>   DW_AT_sibling     : <0xe5f5b>
 <3><e5f55>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f56>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5f58>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><e5f5a>: Abbrev Number: 0
 <2><e5f5b>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5f5c>   DW_AT_call_return_pc: 0x9d9077
    <e5f64>   DW_AT_call_origin : <0xe54dc>
    <e5f68>   DW_AT_sibling     : <0xe5f79>
 <3><e5f6c>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f6d>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5f6f>   DW_AT_call_value  : 3 byte block: a f0 c 	(DW_OP_const2u: 3312)
 <3><e5f73>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f74>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5f76>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5f78>: Abbrev Number: 0
 <2><e5f79>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5f7a>   DW_AT_call_return_pc: 0x9d9083
    <e5f82>   DW_AT_call_origin : <0xe54dc>
    <e5f86>   DW_AT_sibling     : <0xe5f97>
 <3><e5f8a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f8b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5f8d>   DW_AT_call_value  : 3 byte block: a f1 c 	(DW_OP_const2u: 3313)
 <3><e5f91>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5f92>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5f94>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5f96>: Abbrev Number: 0
 <2><e5f97>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5f98>   DW_AT_call_return_pc: 0x9d908f
    <e5fa0>   DW_AT_call_origin : <0xe54dc>
    <e5fa4>   DW_AT_sibling     : <0xe5fb5>
 <3><e5fa8>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fa9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5fab>   DW_AT_call_value  : 3 byte block: a f2 c 	(DW_OP_const2u: 3314)
 <3><e5faf>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fb0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5fb2>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5fb4>: Abbrev Number: 0
 <2><e5fb5>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5fb6>   DW_AT_call_return_pc: 0x9d909b
    <e5fbe>   DW_AT_call_origin : <0xe54dc>
    <e5fc2>   DW_AT_sibling     : <0xe5fd3>
 <3><e5fc6>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fc7>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5fc9>   DW_AT_call_value  : 3 byte block: a f3 c 	(DW_OP_const2u: 3315)
 <3><e5fcd>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fce>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5fd0>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5fd2>: Abbrev Number: 0
 <2><e5fd3>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5fd4>   DW_AT_call_return_pc: 0x9d90a7
    <e5fdc>   DW_AT_call_origin : <0xe54dc>
    <e5fe0>   DW_AT_sibling     : <0xe5ff1>
 <3><e5fe4>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fe5>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e5fe7>   DW_AT_call_value  : 3 byte block: a f4 c 	(DW_OP_const2u: 3316)
 <3><e5feb>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e5fec>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e5fee>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e5ff0>: Abbrev Number: 0
 <2><e5ff1>: Abbrev Number: 4 (DW_TAG_call_site)
    <e5ff2>   DW_AT_call_return_pc: 0x9d90b6
    <e5ffa>   DW_AT_call_origin : <0xe54dc>
    <e5ffe>   DW_AT_sibling     : <0xe600f>
 <3><e6002>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e6003>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e6005>   DW_AT_call_value  : 3 byte block: a f5 c 	(DW_OP_const2u: 3317)
 <3><e6009>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e600a>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e600c>   DW_AT_call_value  : 1 byte block: 31 	(DW_OP_lit1)
 <3><e600e>: Abbrev Number: 0
 <2><e600f>: Abbrev Number: 4 (DW_TAG_call_site)
    <e6010>   DW_AT_call_return_pc: 0x9d9159
    <e6018>   DW_AT_call_origin : <0xe54ab>
    <e601c>   DW_AT_sibling     : <0xe6046>
 <3><e6020>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e6021>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <e6023>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e6025>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e6026>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <e6028>   DW_AT_call_value  : 1 byte block: 30 	(DW_OP_lit0)
 <3><e602a>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <e602b>   DW_AT_location    : 1 byte block: 61 	(DW_OP_reg17 (xmm0))
    <e602d>   DW_AT_call_value  : 7 byte block: a4 2e 4 0 0 0 0 	(DW_OP_const_type: <0xe4d90>  4 byte block: 0 0 0 0 )
