    <a583f>   DW_AT_decl_line   : 5752
    <a5841>   DW_AT_decl_column : 18
    <a5842>   DW_AT_type        : <0xa5235>
    <a5846>   DW_AT_data_member_location: 12
 <2><a5847>: Abbrev Number: 10 (DW_TAG_member)
    <a5848>   DW_AT_name        : (indirect string, offset: 0x7d352): encoding_id
    <a584c>   DW_AT_decl_file   : 84
    <a584d>   DW_AT_decl_line   : 5753
    <a584f>   DW_AT_decl_column : 18
    <a5850>   DW_AT_type        : <0xa5235>
    <a5854>   DW_AT_data_member_location: 14
 <2><a5855>: Abbrev Number: 0
 <1><a5856>: Abbrev Number: 93 (DW_TAG_enumeration_type)
    <a5857>   DW_AT_name        : (indirect string, offset: 0x798d0): FT_Encoding_
    <a585b>   DW_AT_encoding    : 7	(void)
    <a585b>   DW_AT_byte_size   : 4
    <a585b>   DW_AT_type        : <0x797b4>
    <a585f>   DW_AT_decl_file   : 84
    <a5860>   DW_AT_decl_line   : 5669
    <a5862>   DW_AT_decl_column : 17
    <a5863>   DW_AT_sibling     : <0xa5910>
 <2><a5867>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5868>   DW_AT_name        : (indirect string, offset: 0x71022): FT_ENCODING_NONE
    <a586c>   DW_AT_const_value : 0
 <2><a586d>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a586e>   DW_AT_name        : (indirect string, offset: 0x7f685): FT_ENCODING_MS_SYMBOL
    <a5872>   DW_AT_const_value : 0x73796d62
 <2><a5876>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a5877>   DW_AT_name        : (indirect string, offset: 0x84e0c): FT_ENCODING_UNICODE
    <a587b>   DW_AT_const_value : 0x756e6963
 <2><a587f>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a5880>   DW_AT_name        : (indirect string, offset: 0x6594a): FT_ENCODING_SJIS
    <a5884>   DW_AT_const_value : 0x736a6973
 <2><a5888>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a5889>   DW_AT_name        : (indirect string, offset: 0x818a0): FT_ENCODING_GB2312
    <a588d>   DW_AT_const_value : 0x67622020
 <2><a5891>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a5892>   DW_AT_name        : (indirect string, offset: 0x88f06): FT_ENCODING_BIG5
    <a5896>   DW_AT_const_value : 0x62696735
 <2><a589a>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a589b>   DW_AT_name        : (indirect string, offset: 0x6db53): FT_ENCODING_WANSUNG
    <a589f>   DW_AT_const_value : 0x77616e73
 <2><a58a3>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58a4>   DW_AT_name        : (indirect string, offset: 0x87369): FT_ENCODING_JOHAB
    <a58a8>   DW_AT_const_value : 0x6a6f6861
 <2><a58ac>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58ad>   DW_AT_name        : (indirect string, offset: 0x8d43b): FT_ENCODING_MS_SJIS
    <a58b1>   DW_AT_const_value : 0x736a6973
 <2><a58b5>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58b6>   DW_AT_name        : (indirect string, offset: 0x8dca7): FT_ENCODING_MS_GB2312
    <a58ba>   DW_AT_const_value : 0x67622020
 <2><a58be>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58bf>   DW_AT_name        : (indirect string, offset: 0x800de): FT_ENCODING_MS_BIG5
    <a58c3>   DW_AT_const_value : 0x62696735
 <2><a58c7>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58c8>   DW_AT_name        : (indirect string, offset: 0x73dc4): FT_ENCODING_MS_WANSUNG
    <a58cc>   DW_AT_const_value : 0x77616e73
 <2><a58d0>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58d1>   DW_AT_name        : (indirect string, offset: 0x65a51): FT_ENCODING_MS_JOHAB
    <a58d5>   DW_AT_const_value : 0x6a6f6861
 <2><a58d9>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58da>   DW_AT_name        : (indirect string, offset: 0x70e88): FT_ENCODING_ADOBE_STANDARD
    <a58de>   DW_AT_const_value : 0x41444f42
 <2><a58e2>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58e3>   DW_AT_name        : (indirect string, offset: 0x7e669): FT_ENCODING_ADOBE_EXPERT
    <a58e7>   DW_AT_const_value : 0x41444245
 <2><a58eb>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58ec>   DW_AT_name        : (indirect string, offset: 0x73f3f): FT_ENCODING_ADOBE_CUSTOM
    <a58f0>   DW_AT_const_value : 0x41444243
 <2><a58f4>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58f5>   DW_AT_name        : (indirect string, offset: 0x7505f): FT_ENCODING_ADOBE_LATIN_1
    <a58f9>   DW_AT_const_value : 0x6c617431
 <2><a58fd>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a58fe>   DW_AT_name        : (indirect string, offset: 0x6398c): FT_ENCODING_OLD_LATIN_2
    <a5902>   DW_AT_const_value : 0x6c617432
 <2><a5906>: Abbrev Number: 42 (DW_TAG_enumerator)
    <a5907>   DW_AT_name        : (indirect string, offset: 0x88eab): FT_ENCODING_APPLE_ROMAN
    <a590b>   DW_AT_const_value : 0x61726d6e
 <2><a590f>: Abbrev Number: 0
 <1><a5910>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5911>   DW_AT_name        : (indirect string, offset: 0x7b555): FT_Encoding
    <a5915>   DW_AT_decl_file   : 84
    <a5916>   DW_AT_decl_line   : 5698
    <a5918>   DW_AT_decl_column : 5
    <a5919>   DW_AT_type        : <0xa5856>
 <1><a591d>: Abbrev Number: 4 (DW_TAG_typedef)
    <a591e>   DW_AT_name        : (indirect string, offset: 0x7b862): FT_Face_Internal
    <a5922>   DW_AT_decl_file   : 84
    <a5923>   DW_AT_decl_line   : 5777
    <a5925>   DW_AT_decl_column : 41
    <a5926>   DW_AT_type        : <0xa592a>
 <1><a592a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a592b>   DW_AT_byte_size   : 8
    <a592b>   DW_AT_type        : <0xa592f>
 <1><a592f>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a5930>   DW_AT_name        : (indirect string, offset: 0x8b0fd): FT_Face_InternalRec_
    <a5934>   DW_AT_declaration : 1
 <1><a5934>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5935>   DW_AT_byte_size   : 8
    <a5935>   DW_AT_type        : <0xa521b>
 <1><a5939>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a593a>   DW_AT_byte_size   : 8
    <a593a>   DW_AT_type        : <0xa5439>
 <1><a593e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a593f>   DW_AT_byte_size   : 8
    <a593f>   DW_AT_type        : <0xa57fd>
 <1><a5943>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5944>   DW_AT_name        : (indirect string, offset: 0x8b335): FT_Size_Internal
    <a5948>   DW_AT_decl_file   : 84
    <a5949>   DW_AT_decl_line   : 6296
    <a594b>   DW_AT_decl_column : 41
    <a594c>   DW_AT_type        : <0xa5950>
 <1><a5950>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5951>   DW_AT_byte_size   : 8
    <a5951>   DW_AT_type        : <0xa5955>
 <1><a5955>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a5956>   DW_AT_name        : (indirect string, offset: 0x7d25c): FT_Size_InternalRec_
    <a595a>   DW_AT_declaration : 1
 <1><a595a>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a595b>   DW_AT_name        : (indirect string, offset: 0x64c02): FT_Size_Metrics_
    <a595f>   DW_AT_byte_size   : 56
    <a5960>   DW_AT_decl_file   : 84
    <a5961>   DW_AT_decl_line   : 6353
    <a5963>   DW_AT_decl_column : 19
    <a5964>   DW_AT_sibling     : <0xa59d9>
 <2><a5968>: Abbrev Number: 10 (DW_TAG_member)
    <a5969>   DW_AT_name        : (indirect string, offset: 0x8c7bb): x_ppem
    <a596d>   DW_AT_decl_file   : 84
    <a596e>   DW_AT_decl_line   : 6355
    <a5970>   DW_AT_decl_column : 16
    <a5971>   DW_AT_type        : <0xa5235>
    <a5975>   DW_AT_data_member_location: 0
 <2><a5976>: Abbrev Number: 10 (DW_TAG_member)
    <a5977>   DW_AT_name        : (indirect string, offset: 0x72467): y_ppem
    <a597b>   DW_AT_decl_file   : 84
    <a597c>   DW_AT_decl_line   : 6356
    <a597e>   DW_AT_decl_column : 16
    <a597f>   DW_AT_type        : <0xa5235>
    <a5983>   DW_AT_data_member_location: 2
 <2><a5984>: Abbrev Number: 10 (DW_TAG_member)
    <a5985>   DW_AT_name        : (indirect string, offset: 0x73c3d): x_scale
    <a5989>   DW_AT_decl_file   : 84
    <a598a>   DW_AT_decl_line   : 6358
    <a598c>   DW_AT_decl_column : 16
    <a598d>   DW_AT_type        : <0xa5276>
    <a5991>   DW_AT_data_member_location: 8
 <2><a5992>: Abbrev Number: 10 (DW_TAG_member)
    <a5993>   DW_AT_name        : (indirect string, offset: 0x8949f): y_scale
    <a5997>   DW_AT_decl_file   : 84
    <a5998>   DW_AT_decl_line   : 6359
    <a599a>   DW_AT_decl_column : 16
    <a599b>   DW_AT_type        : <0xa5276>
    <a599f>   DW_AT_data_member_location: 16
 <2><a59a0>: Abbrev Number: 10 (DW_TAG_member)
    <a59a1>   DW_AT_name        : (indirect string, offset: 0x84d81): ascender
    <a59a5>   DW_AT_decl_file   : 84
    <a59a6>   DW_AT_decl_line   : 6361
    <a59a8>   DW_AT_decl_column : 16
    <a59a9>   DW_AT_type        : <0xa5020>
    <a59ad>   DW_AT_data_member_location: 24
 <2><a59ae>: Abbrev Number: 10 (DW_TAG_member)
    <a59af>   DW_AT_name        : (indirect string, offset: 0x7c3cc): descender
    <a59b3>   DW_AT_decl_file   : 84
    <a59b4>   DW_AT_decl_line   : 6362
    <a59b6>   DW_AT_decl_column : 16
    <a59b7>   DW_AT_type        : <0xa5020>
    <a59bb>   DW_AT_data_member_location: 32
 <2><a59bc>: Abbrev Number: 10 (DW_TAG_member)
    <a59bd>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <a59c1>   DW_AT_decl_file   : 84
    <a59c2>   DW_AT_decl_line   : 6363
    <a59c4>   DW_AT_decl_column : 16
    <a59c5>   DW_AT_type        : <0xa5020>
    <a59c9>   DW_AT_data_member_location: 40
 <2><a59ca>: Abbrev Number: 10 (DW_TAG_member)
    <a59cb>   DW_AT_name        : (indirect string, offset: 0x67014): max_advance
    <a59cf>   DW_AT_decl_file   : 84
    <a59d0>   DW_AT_decl_line   : 6364
    <a59d2>   DW_AT_decl_column : 16
    <a59d3>   DW_AT_type        : <0xa5020>
    <a59d7>   DW_AT_data_member_location: 48
 <2><a59d8>: Abbrev Number: 0
 <1><a59d9>: Abbrev Number: 4 (DW_TAG_typedef)
    <a59da>   DW_AT_name        : (indirect string, offset: 0x63fbf): FT_Size_Metrics
    <a59de>   DW_AT_decl_file   : 84
    <a59df>   DW_AT_decl_line   : 6366
    <a59e1>   DW_AT_decl_column : 5
    <a59e2>   DW_AT_type        : <0xa595a>
 <1><a59e6>: Abbrev Number: 4 (DW_TAG_typedef)
    <a59e7>   DW_AT_name        : (indirect string, offset: 0x81332): FT_SubGlyph
    <a59eb>   DW_AT_decl_file   : 84
    <a59ec>   DW_AT_decl_line   : 6412
    <a59ee>   DW_AT_decl_column : 36
    <a59ef>   DW_AT_type        : <0xa59f3>
 <1><a59f3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a59f4>   DW_AT_byte_size   : 8
    <a59f4>   DW_AT_type        : <0xa59f8>
 <1><a59f8>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a59f9>   DW_AT_name        : (indirect string, offset: 0x75611): FT_SubGlyphRec_
    <a59fd>   DW_AT_declaration : 1
 <1><a59fd>: Abbrev Number: 4 (DW_TAG_typedef)
    <a59fe>   DW_AT_name        : (indirect string, offset: 0x6661f): FT_Slot_Internal
    <a5a02>   DW_AT_decl_file   : 84
    <a5a03>   DW_AT_decl_line   : 6423
    <a5a05>   DW_AT_decl_column : 41
    <a5a06>   DW_AT_type        : <0xa5a0a>
 <1><a5a0a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5a0b>   DW_AT_byte_size   : 8
    <a5a0b>   DW_AT_type        : <0xa5a0f>
 <1><a5a0f>: Abbrev Number: 58 (DW_TAG_structure_type)
    <a5a10>   DW_AT_name        : (indirect string, offset: 0x832d2): FT_Slot_InternalRec_
    <a5a14>   DW_AT_declaration : 1
 <1><a5a14>: Abbrev Number: 93 (DW_TAG_enumeration_type)
    <a5a15>   DW_AT_name        : (indirect string, offset: 0x7c755): FT_Render_Mode_
    <a5a19>   DW_AT_encoding    : 7	(void)
    <a5a19>   DW_AT_byte_size   : 4
    <a5a19>   DW_AT_type        : <0x797b4>
    <a5a1d>   DW_AT_decl_file   : 84
    <a5a1e>   DW_AT_decl_line   : 7672
    <a5a20>   DW_AT_decl_column : 17
    <a5a21>   DW_AT_sibling     : <0xa5a4a>
 <2><a5a25>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a26>   DW_AT_name        : (indirect string, offset: 0x65ec7): FT_RENDER_MODE_NORMAL
    <a5a2a>   DW_AT_const_value : 0
 <2><a5a2b>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a2c>   DW_AT_name        : (indirect string, offset: 0x84d42): FT_RENDER_MODE_LIGHT
    <a5a30>   DW_AT_const_value : 1
 <2><a5a31>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a32>   DW_AT_name        : (indirect string, offset: 0x67081): FT_RENDER_MODE_MONO
    <a5a36>   DW_AT_const_value : 2
 <2><a5a37>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a38>   DW_AT_name        : (indirect string, offset: 0x86952): FT_RENDER_MODE_LCD
    <a5a3c>   DW_AT_const_value : 3
 <2><a5a3d>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a3e>   DW_AT_name        : (indirect string, offset: 0x6e7cf): FT_RENDER_MODE_LCD_V
    <a5a42>   DW_AT_const_value : 4
 <2><a5a43>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a44>   DW_AT_name        : (indirect string, offset: 0x8d391): FT_RENDER_MODE_MAX
    <a5a48>   DW_AT_const_value : 5
 <2><a5a49>: Abbrev Number: 0
 <1><a5a4a>: Abbrev Number: 4 (DW_TAG_typedef)
    <a5a4b>   DW_AT_name        : (indirect string, offset: 0x5e050): FT_Render_Mode
    <a5a4f>   DW_AT_decl_file   : 84
    <a5a50>   DW_AT_decl_line   : 7682
    <a5a52>   DW_AT_decl_column : 5
    <a5a53>   DW_AT_type        : <0xa5a14>
 <1><a5a57>: Abbrev Number: 93 (DW_TAG_enumeration_type)
    <a5a58>   DW_AT_name        : (indirect string, offset: 0x6b933): FT_Orientation_
    <a5a5c>   DW_AT_encoding    : 7	(void)
    <a5a5c>   DW_AT_byte_size   : 4
    <a5a5c>   DW_AT_type        : <0x797b4>
    <a5a60>   DW_AT_decl_file   : 84
    <a5a61>   DW_AT_decl_line   : 10063
    <a5a63>   DW_AT_decl_column : 17
    <a5a64>   DW_AT_sibling     : <0xa5a87>
 <2><a5a68>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a69>   DW_AT_name        : (indirect string, offset: 0x5e7b4): FT_ORIENTATION_TRUETYPE
    <a5a6d>   DW_AT_const_value : 0
 <2><a5a6e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a6f>   DW_AT_name        : (indirect string, offset: 0x89b2f): FT_ORIENTATION_POSTSCRIPT
    <a5a73>   DW_AT_const_value : 1
 <2><a5a74>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a75>   DW_AT_name        : (indirect string, offset: 0x84ae5): FT_ORIENTATION_FILL_RIGHT
    <a5a79>   DW_AT_const_value : 0
 <2><a5a7a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a7b>   DW_AT_name        : (indirect string, offset: 0x71fe5): FT_ORIENTATION_FILL_LEFT
    <a5a7f>   DW_AT_const_value : 1
 <2><a5a80>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5a81>   DW_AT_name        : (indirect string, offset: 0x7d849): FT_ORIENTATION_NONE
    <a5a85>   DW_AT_const_value : 2
 <2><a5a86>: Abbrev Number: 0
 <1><a5a87>: Abbrev Number: 49 (DW_TAG_variable)
    <a5a88>   DW_AT_name        : (indirect string, offset: 0x77ac8): ft_library
    <a5a8c>   DW_AT_decl_file   : 7
    <a5a8d>   DW_AT_decl_line   : 24
    <a5a8e>   DW_AT_decl_column : 12
    <a5a8f>   DW_AT_type        : <0xa5446>
    <a5a93>   DW_AT_external    : 1
    <a5a93>   DW_AT_location    : 9 byte block: 3 b8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97eb8)
 <1><a5a9d>: Abbrev Number: 53 (DW_TAG_structure_type)
    <a5a9e>   DW_AT_name        : (indirect string, offset: 0x74fc7): fonts_struct
    <a5aa2>   DW_AT_byte_size   : 48
    <a5aa3>   DW_AT_decl_file   : 7
    <a5aa4>   DW_AT_decl_line   : 26
    <a5aa5>   DW_AT_decl_column : 8
    <a5aa6>   DW_AT_sibling     : <0xa5b47>
 <2><a5aaa>: Abbrev Number: 18 (DW_TAG_member)
    <a5aab>   DW_AT_name        : (indirect string, offset: 0x8396f): in_use
    <a5aaf>   DW_AT_decl_file   : 7
    <a5ab0>   DW_AT_decl_line   : 27
    <a5ab1>   DW_AT_decl_column : 7
    <a5ab2>   DW_AT_type        : <0x799bc>
    <a5ab6>   DW_AT_data_member_location: 0
 <2><a5ab7>: Abbrev Number: 18 (DW_TAG_member)
    <a5ab8>   DW_AT_name        : (indirect string, offset: 0x650c6): ttf_data
    <a5abc>   DW_AT_decl_file   : 7
    <a5abd>   DW_AT_decl_line   : 28
    <a5abe>   DW_AT_decl_column : 8
    <a5abf>   DW_AT_type        : <0x931d3>
    <a5ac3>   DW_AT_data_member_location: 8
 <2><a5ac4>: Abbrev Number: 18 (DW_TAG_member)
    <a5ac5>   DW_AT_name        : (indirect string, offset: 0x72cd4): default_pixel_height
    <a5ac9>   DW_AT_decl_file   : 7
    <a5aca>   DW_AT_decl_line   : 29
    <a5acb>   DW_AT_decl_column : 7
    <a5acc>   DW_AT_type        : <0x7999f>
    <a5ad0>   DW_AT_data_member_location: 16
 <2><a5ad1>: Abbrev Number: 18 (DW_TAG_member)
    <a5ad2>   DW_AT_name        : (indirect string, offset: 0x5d782): bold
    <a5ad6>   DW_AT_decl_file   : 7
    <a5ad7>   DW_AT_decl_line   : 30
    <a5ad8>   DW_AT_decl_column : 7
    <a5ad9>   DW_AT_type        : <0x799bc>
    <a5add>   DW_AT_data_member_location: 20
 <2><a5ade>: Abbrev Number: 18 (DW_TAG_member)
    <a5adf>   DW_AT_name        : (indirect string, offset: 0x854ac): italic
    <a5ae3>   DW_AT_decl_file   : 7
    <a5ae4>   DW_AT_decl_line   : 31
    <a5ae5>   DW_AT_decl_column : 7
    <a5ae6>   DW_AT_type        : <0x799bc>
    <a5aea>   DW_AT_data_member_location: 21
 <2><a5aeb>: Abbrev Number: 18 (DW_TAG_member)
    <a5aec>   DW_AT_name        : (indirect string, offset: 0x8231d): underline
    <a5af0>   DW_AT_decl_file   : 7
    <a5af1>   DW_AT_decl_line   : 32
    <a5af2>   DW_AT_decl_column : 7
    <a5af3>   DW_AT_type        : <0x799bc>
    <a5af7>   DW_AT_data_member_location: 22
 <2><a5af8>: Abbrev Number: 18 (DW_TAG_member)
    <a5af9>   DW_AT_name        : (indirect string, offset: 0x87347): monospace
    <a5afd>   DW_AT_decl_file   : 7
    <a5afe>   DW_AT_decl_line   : 33
    <a5aff>   DW_AT_decl_column : 7
    <a5b00>   DW_AT_type        : <0x799bc>
    <a5b04>   DW_AT_data_member_location: 23
 <2><a5b05>: Abbrev Number: 18 (DW_TAG_member)
    <a5b06>   DW_AT_name        : (indirect string, offset: 0x8a07e): monospace_width
    <a5b0a>   DW_AT_decl_file   : 7
    <a5b0b>   DW_AT_decl_line   : 34
    <a5b0c>   DW_AT_decl_column : 7
    <a5b0d>   DW_AT_type        : <0x7999f>
    <a5b11>   DW_AT_data_member_location: 24
 <2><a5b12>: Abbrev Number: 18 (DW_TAG_member)
    <a5b13>   DW_AT_name        : (indirect string, offset: 0x72d5f): unicode
    <a5b17>   DW_AT_decl_file   : 7
    <a5b18>   DW_AT_decl_line   : 35
    <a5b19>   DW_AT_decl_column : 7
    <a5b1a>   DW_AT_type        : <0x799bc>
    <a5b1e>   DW_AT_data_member_location: 28
 <2><a5b1f>: Abbrev Number: 18 (DW_TAG_member)
    <a5b20>   DW_AT_name        : (indirect string, offset: 0x8694b): handle
    <a5b24>   DW_AT_decl_file   : 7
    <a5b25>   DW_AT_decl_line   : 37
    <a5b26>   DW_AT_decl_column : 9
    <a5b27>   DW_AT_type        : <0xa5474>
    <a5b2b>   DW_AT_data_member_location: 32
 <2><a5b2c>: Abbrev Number: 18 (DW_TAG_member)
    <a5b2d>   DW_AT_name        : (indirect string, offset: 0x7c93f): baseline
    <a5b31>   DW_AT_decl_file   : 7
    <a5b32>   DW_AT_decl_line   : 38
    <a5b33>   DW_AT_decl_column : 7
    <a5b34>   DW_AT_type        : <0x7999f>
    <a5b38>   DW_AT_data_member_location: 40
 <2><a5b39>: Abbrev Number: 18 (DW_TAG_member)
    <a5b3a>   DW_AT_name        : (indirect string, offset: 0x6af90): default_pixel_height_scale
    <a5b3e>   DW_AT_decl_file   : 7
    <a5b3f>   DW_AT_decl_line   : 39
    <a5b40>   DW_AT_decl_column : 7
    <a5b41>   DW_AT_type        : <0x79ba2>
    <a5b45>   DW_AT_data_member_location: 44
 <2><a5b46>: Abbrev Number: 0
 <1><a5b47>: Abbrev Number: 49 (DW_TAG_variable)
    <a5b48>   DW_AT_name        : (indirect string, offset: 0x819d8): fonts
    <a5b4c>   DW_AT_decl_file   : 7
    <a5b4d>   DW_AT_decl_line   : 41
    <a5b4e>   DW_AT_decl_column : 15
    <a5b4f>   DW_AT_type        : <0xa5b5d>
    <a5b53>   DW_AT_external    : 1
    <a5b53>   DW_AT_location    : 9 byte block: 3 c0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ec0)
 <1><a5b5d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a5b5e>   DW_AT_byte_size   : 8
    <a5b5e>   DW_AT_type        : <0xa5a9d>
 <1><a5b62>: Abbrev Number: 49 (DW_TAG_variable)
    <a5b63>   DW_AT_name        : (indirect string, offset: 0x76f53): fonts_last
    <a5b67>   DW_AT_decl_file   : 7
    <a5b68>   DW_AT_decl_line   : 42
    <a5b69>   DW_AT_decl_column : 7
    <a5b6a>   DW_AT_type        : <0x7999f>
    <a5b6e>   DW_AT_external    : 1
    <a5b6e>   DW_AT_location    : 9 byte block: 3 c8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ec8)
 <1><a5b78>: Abbrev Number: 53 (DW_TAG_structure_type)
    <a5b79>   DW_AT_name        : (indirect string, offset: 0x60ccb): fonts_render_struct
    <a5b7d>   DW_AT_byte_size   : 16
    <a5b7e>   DW_AT_decl_file   : 7
    <a5b7f>   DW_AT_decl_line   : 44
    <a5b80>   DW_AT_decl_column : 8
    <a5b81>   DW_AT_sibling     : <0xa5baa>
 <2><a5b85>: Abbrev Number: 18 (DW_TAG_member)
    <a5b86>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <a5b8a>   DW_AT_decl_file   : 7
    <a5b8b>   DW_AT_decl_line   : 45
    <a5b8c>   DW_AT_decl_column : 8
    <a5b8d>   DW_AT_type        : <0x931d3>
    <a5b91>   DW_AT_data_member_location: 0
 <2><a5b92>: Abbrev Number: 63 (DW_TAG_member)
    <a5b93>   DW_AT_name        : w
    <a5b95>   DW_AT_decl_file   : 7
    <a5b96>   DW_AT_decl_line   : 46
    <a5b97>   DW_AT_decl_column : 7
    <a5b98>   DW_AT_type        : <0x7999f>
    <a5b9c>   DW_AT_data_member_location: 8
 <2><a5b9d>: Abbrev Number: 63 (DW_TAG_member)
    <a5b9e>   DW_AT_name        : ox
    <a5ba1>   DW_AT_decl_file   : 7
    <a5ba2>   DW_AT_decl_line   : 47
    <a5ba3>   DW_AT_decl_column : 7
    <a5ba4>   DW_AT_type        : <0x7999f>
    <a5ba8>   DW_AT_data_member_location: 12
 <2><a5ba9>: Abbrev Number: 0
 <1><a5baa>: Abbrev Number: 174 (DW_TAG_enumeration_type)
    <a5bac>   DW_AT_encoding    : 7	(unsigned)
    <a5bad>   DW_AT_byte_size   : 4
    <a5bae>   DW_AT_type        : <0x797b4>
    <a5bb2>   DW_AT_decl_file   : 5
    <a5bb3>   DW_AT_decl_line   : 955
    <a5bb5>   DW_AT_decl_column : 14
    <a5bb6>   DW_AT_linkage_name: (indirect string, offset: 0x5f514): 5QBVKs
    <a5bba>   DW_AT_sibling     : <0xa617c>
 <2><a5bbe>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bbf>   DW_AT_name        : (indirect string, offset: 0x5f77a): QBVK_UNKNOWN
    <a5bc3>   DW_AT_const_value : 0
 <2><a5bc4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bc5>   DW_AT_name        : (indirect string, offset: 0x79e8f): QBVK_FIRST
    <a5bc9>   DW_AT_const_value : 0
 <2><a5bca>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bcb>   DW_AT_name        : (indirect string, offset: 0x8637a): QBVK_BACKSPACE
    <a5bcf>   DW_AT_const_value : 8
 <2><a5bd0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bd1>   DW_AT_name        : (indirect string, offset: 0x79b78): QBVK_TAB
    <a5bd5>   DW_AT_const_value : 9
 <2><a5bd6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bd7>   DW_AT_name        : (indirect string, offset: 0x6f0a0): QBVK_CLEAR
    <a5bdb>   DW_AT_const_value : 12
 <2><a5bdc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bdd>   DW_AT_name        : (indirect string, offset: 0x8dc9b): QBVK_RETURN
    <a5be1>   DW_AT_const_value : 13
 <2><a5be2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5be3>   DW_AT_name        : (indirect string, offset: 0x80a19): QBVK_PAUSE
    <a5be7>   DW_AT_const_value : 19
 <2><a5be8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5be9>   DW_AT_name        : (indirect string, offset: 0x88dc0): QBVK_ESCAPE
    <a5bed>   DW_AT_const_value : 27
 <2><a5bee>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bef>   DW_AT_name        : (indirect string, offset: 0x7e461): QBVK_SPACE
    <a5bf3>   DW_AT_const_value : 32
 <2><a5bf4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bf5>   DW_AT_name        : (indirect string, offset: 0x8802c): QBVK_EXCLAIM
    <a5bf9>   DW_AT_const_value : 33
 <2><a5bfa>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5bfb>   DW_AT_name        : (indirect string, offset: 0x718a7): QBVK_QUOTEDBL
    <a5bff>   DW_AT_const_value : 34
 <2><a5c00>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c01>   DW_AT_name        : (indirect string, offset: 0x6bdf9): QBVK_HASH
    <a5c05>   DW_AT_const_value : 35
 <2><a5c06>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c07>   DW_AT_name        : (indirect string, offset: 0x6bcf7): QBVK_DOLLAR
    <a5c0b>   DW_AT_const_value : 36
 <2><a5c0c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c0d>   DW_AT_name        : (indirect string, offset: 0x62e10): QBVK_AMPERSAND
    <a5c11>   DW_AT_const_value : 38
 <2><a5c12>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c13>   DW_AT_name        : (indirect string, offset: 0x8959d): QBVK_QUOTE
    <a5c17>   DW_AT_const_value : 39
 <2><a5c18>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c19>   DW_AT_name        : (indirect string, offset: 0x6f861): QBVK_LEFTPAREN
    <a5c1d>   DW_AT_const_value : 40
 <2><a5c1e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c1f>   DW_AT_name        : (indirect string, offset: 0x6f207): QBVK_RIGHTPAREN
    <a5c23>   DW_AT_const_value : 41
 <2><a5c24>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c25>   DW_AT_name        : (indirect string, offset: 0x6ea73): QBVK_ASTERISK
    <a5c29>   DW_AT_const_value : 42
 <2><a5c2a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c2b>   DW_AT_name        : (indirect string, offset: 0x64bc0): QBVK_PLUS
    <a5c2f>   DW_AT_const_value : 43
 <2><a5c30>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c31>   DW_AT_name        : (indirect string, offset: 0x5f075): QBVK_COMMA
    <a5c35>   DW_AT_const_value : 44
 <2><a5c36>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c37>   DW_AT_name        : (indirect string, offset: 0x6b6b8): QBVK_MINUS
    <a5c3b>   DW_AT_const_value : 45
 <2><a5c3c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c3d>   DW_AT_name        : (indirect string, offset: 0x6338b): QBVK_PERIOD
    <a5c41>   DW_AT_const_value : 46
 <2><a5c42>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c43>   DW_AT_name        : (indirect string, offset: 0x8c609): QBVK_SLASH
    <a5c47>   DW_AT_const_value : 47
 <2><a5c48>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c49>   DW_AT_name        : (indirect string, offset: 0x80a24): QBVK_0
    <a5c4d>   DW_AT_const_value : 48
 <2><a5c4e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c4f>   DW_AT_name        : (indirect string, offset: 0x80a2b): QBVK_1
    <a5c53>   DW_AT_const_value : 49
 <2><a5c54>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c55>   DW_AT_name        : (indirect string, offset: 0x80a32): QBVK_2
    <a5c59>   DW_AT_const_value : 50
 <2><a5c5a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c5b>   DW_AT_name        : (indirect string, offset: 0x67eaf): QBVK_3
    <a5c5f>   DW_AT_const_value : 51
 <2><a5c60>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c61>   DW_AT_name        : (indirect string, offset: 0x67ed1): QBVK_4
    <a5c65>   DW_AT_const_value : 52
 <2><a5c66>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c67>   DW_AT_name        : (indirect string, offset: 0x80a6b): QBVK_5
    <a5c6b>   DW_AT_const_value : 53
 <2><a5c6c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c6d>   DW_AT_name        : (indirect string, offset: 0x80a72): QBVK_6
    <a5c71>   DW_AT_const_value : 54
 <2><a5c72>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c73>   DW_AT_name        : (indirect string, offset: 0x80a79): QBVK_7
    <a5c77>   DW_AT_const_value : 55
 <2><a5c78>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c79>   DW_AT_name        : (indirect string, offset: 0x80a80): QBVK_8
    <a5c7d>   DW_AT_const_value : 56
 <2><a5c7e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c7f>   DW_AT_name        : (indirect string, offset: 0x67f2d): QBVK_9
    <a5c83>   DW_AT_const_value : 57
 <2><a5c84>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c85>   DW_AT_name        : (indirect string, offset: 0x88ff6): QBVK_COLON
    <a5c89>   DW_AT_const_value : 58
 <2><a5c8a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c8b>   DW_AT_name        : (indirect string, offset: 0x74437): QBVK_SEMICOLON
    <a5c8f>   DW_AT_const_value : 59
 <2><a5c90>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c91>   DW_AT_name        : (indirect string, offset: 0x736b1): QBVK_LESS
    <a5c95>   DW_AT_const_value : 60
 <2><a5c96>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c97>   DW_AT_name        : (indirect string, offset: 0x78901): QBVK_EQUALS
    <a5c9b>   DW_AT_const_value : 61
 <2><a5c9c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5c9d>   DW_AT_name        : (indirect string, offset: 0x6c432): QBVK_GREATER
    <a5ca1>   DW_AT_const_value : 62
 <2><a5ca2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ca3>   DW_AT_name        : (indirect string, offset: 0x80e6a): QBVK_QUESTION
    <a5ca7>   DW_AT_const_value : 63
 <2><a5ca8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ca9>   DW_AT_name        : (indirect string, offset: 0x84a20): QBVK_AT
    <a5cad>   DW_AT_const_value : 64
 <2><a5cae>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5caf>   DW_AT_name        : (indirect string, offset: 0x70e6b): QBVK_LEFTBRACKET
    <a5cb3>   DW_AT_const_value : 91
 <2><a5cb4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cb5>   DW_AT_name        : (indirect string, offset: 0x644ed): QBVK_BACKSLASH
    <a5cb9>   DW_AT_const_value : 92
 <2><a5cba>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cbb>   DW_AT_name        : (indirect string, offset: 0x69d5c): QBVK_RIGHTBRACKET
    <a5cbf>   DW_AT_const_value : 93
 <2><a5cc0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cc1>   DW_AT_name        : (indirect string, offset: 0x63acc): QBVK_CARET
    <a5cc5>   DW_AT_const_value : 94
 <2><a5cc6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cc7>   DW_AT_name        : (indirect string, offset: 0x89965): QBVK_UNDERSCORE
    <a5ccb>   DW_AT_const_value : 95
 <2><a5ccc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ccd>   DW_AT_name        : (indirect string, offset: 0x613a0): QBVK_BACKQUOTE
    <a5cd1>   DW_AT_const_value : 96
 <2><a5cd2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cd3>   DW_AT_name        : (indirect string, offset: 0x80b1a): QBVK_a
    <a5cd7>   DW_AT_const_value : 97
 <2><a5cd8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cd9>   DW_AT_name        : (indirect string, offset: 0x80b21): QBVK_b
    <a5cdd>   DW_AT_const_value : 98
 <2><a5cde>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cdf>   DW_AT_name        : (indirect string, offset: 0x80b28): QBVK_c
    <a5ce3>   DW_AT_const_value : 99
 <2><a5ce4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ce5>   DW_AT_name        : (indirect string, offset: 0x80b2f): QBVK_d
    <a5ce9>   DW_AT_const_value : 100
 <2><a5cea>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ceb>   DW_AT_name        : (indirect string, offset: 0x80b36): QBVK_e
    <a5cef>   DW_AT_const_value : 101
 <2><a5cf0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cf1>   DW_AT_name        : (indirect string, offset: 0x68137): QBVK_f
    <a5cf5>   DW_AT_const_value : 102
 <2><a5cf6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cf7>   DW_AT_name        : (indirect string, offset: 0x6813e): QBVK_g
    <a5cfb>   DW_AT_const_value : 103
 <2><a5cfc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5cfd>   DW_AT_name        : (indirect string, offset: 0x7f54c): QBVK_h
    <a5d01>   DW_AT_const_value : 104
 <2><a5d02>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d03>   DW_AT_name        : (indirect string, offset: 0x80b78): QBVK_i
    <a5d07>   DW_AT_const_value : 105
 <2><a5d08>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d09>   DW_AT_name        : (indirect string, offset: 0x80b7f): QBVK_j
    <a5d0d>   DW_AT_const_value : 106
 <2><a5d0e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d0f>   DW_AT_name        : (indirect string, offset: 0x80b86): QBVK_k
    <a5d13>   DW_AT_const_value : 107
 <2><a5d14>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d15>   DW_AT_name        : (indirect string, offset: 0x80b8d): QBVK_l
    <a5d19>   DW_AT_const_value : 108
 <2><a5d1a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d1b>   DW_AT_name        : (indirect string, offset: 0x80b94): QBVK_m
    <a5d1f>   DW_AT_const_value : 109
 <2><a5d20>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d21>   DW_AT_name        : (indirect string, offset: 0x80b9b): QBVK_n
    <a5d25>   DW_AT_const_value : 110
 <2><a5d26>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d27>   DW_AT_name        : (indirect string, offset: 0x80ba2): QBVK_o
    <a5d2b>   DW_AT_const_value : 111
 <2><a5d2c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d2d>   DW_AT_name        : (indirect string, offset: 0x80ba9): QBVK_p
    <a5d31>   DW_AT_const_value : 112
 <2><a5d32>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d33>   DW_AT_name        : (indirect string, offset: 0x80bb0): QBVK_q
    <a5d37>   DW_AT_const_value : 113
 <2><a5d38>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d39>   DW_AT_name        : (indirect string, offset: 0x80bb7): QBVK_r
    <a5d3d>   DW_AT_const_value : 114
 <2><a5d3e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d3f>   DW_AT_name        : (indirect string, offset: 0x80bbe): QBVK_s
    <a5d43>   DW_AT_const_value : 115
 <2><a5d44>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d45>   DW_AT_name        : (indirect string, offset: 0x6824e): QBVK_t
    <a5d49>   DW_AT_const_value : 116
 <2><a5d4a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d4b>   DW_AT_name        : (indirect string, offset: 0x68267): QBVK_u
    <a5d4f>   DW_AT_const_value : 117
 <2><a5d50>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d51>   DW_AT_name        : (indirect string, offset: 0x80bef): QBVK_v
    <a5d55>   DW_AT_const_value : 118
 <2><a5d56>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d57>   DW_AT_name        : (indirect string, offset: 0x7f619): QBVK_w
    <a5d5b>   DW_AT_const_value : 119
 <2><a5d5c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d5d>   DW_AT_name        : (indirect string, offset: 0x80c0f): QBVK_x
    <a5d61>   DW_AT_const_value : 120
 <2><a5d62>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d63>   DW_AT_name        : (indirect string, offset: 0x80c16): QBVK_y
    <a5d67>   DW_AT_const_value : 121
 <2><a5d68>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d69>   DW_AT_name        : (indirect string, offset: 0x80c1d): QBVK_z
    <a5d6d>   DW_AT_const_value : 122
 <2><a5d6e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d6f>   DW_AT_name        : (indirect string, offset: 0x62abf): QBVK_DELETE
    <a5d73>   DW_AT_const_value : 127
 <2><a5d74>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d75>   DW_AT_name        : (indirect string, offset: 0x8a529): QBVK_WORLD_0
    <a5d79>   DW_AT_const_value : 160
 <2><a5d7a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d7b>   DW_AT_name        : (indirect string, offset: 0x7ff6b): QBVK_WORLD_1
    <a5d7f>   DW_AT_const_value : 161
 <2><a5d80>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d81>   DW_AT_name        : (indirect string, offset: 0x7ff78): QBVK_WORLD_2
    <a5d85>   DW_AT_const_value : 162
 <2><a5d86>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d87>   DW_AT_name        : (indirect string, offset: 0x6e9ed): QBVK_WORLD_3
    <a5d8b>   DW_AT_const_value : 163
 <2><a5d8c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d8d>   DW_AT_name        : (indirect string, offset: 0x7ffa0): QBVK_WORLD_4
    <a5d91>   DW_AT_const_value : 164
 <2><a5d92>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d93>   DW_AT_name        : (indirect string, offset: 0x7ffad): QBVK_WORLD_5
    <a5d97>   DW_AT_const_value : 165
 <2><a5d98>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d99>   DW_AT_name        : (indirect string, offset: 0x7ffba): QBVK_WORLD_6
    <a5d9d>   DW_AT_const_value : 166
 <2><a5d9e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5d9f>   DW_AT_name        : (indirect string, offset: 0x8a593): QBVK_WORLD_7
    <a5da3>   DW_AT_const_value : 167
 <2><a5da4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5da5>   DW_AT_name        : (indirect string, offset: 0x7ffd1): QBVK_WORLD_8
    <a5da9>   DW_AT_const_value : 168
 <2><a5daa>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dab>   DW_AT_name        : (indirect string, offset: 0x7ffde): QBVK_WORLD_9
    <a5daf>   DW_AT_const_value : 169
 <2><a5db0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5db1>   DW_AT_name        : (indirect string, offset: 0x82d99): QBVK_WORLD_10
    <a5db5>   DW_AT_const_value : 170
 <2><a5db6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5db7>   DW_AT_name        : (indirect string, offset: 0x5fb64): QBVK_WORLD_11
    <a5dbb>   DW_AT_const_value : 171
 <2><a5dbc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dbd>   DW_AT_name        : (indirect string, offset: 0x5fb72): QBVK_WORLD_12
    <a5dc1>   DW_AT_const_value : 172
 <2><a5dc2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dc3>   DW_AT_name        : (indirect string, offset: 0x5fb80): QBVK_WORLD_13
    <a5dc7>   DW_AT_const_value : 173
 <2><a5dc8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dc9>   DW_AT_name        : (indirect string, offset: 0x5fb8e): QBVK_WORLD_14
    <a5dcd>   DW_AT_const_value : 174
 <2><a5dce>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dcf>   DW_AT_name        : (indirect string, offset: 0x5fb9c): QBVK_WORLD_15
    <a5dd3>   DW_AT_const_value : 175
 <2><a5dd4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dd5>   DW_AT_name        : (indirect string, offset: 0x5fbaa): QBVK_WORLD_16
    <a5dd9>   DW_AT_const_value : 176
 <2><a5dda>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ddb>   DW_AT_name        : (indirect string, offset: 0x5fbb8): QBVK_WORLD_17
    <a5ddf>   DW_AT_const_value : 177
 <2><a5de0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5de1>   DW_AT_name        : (indirect string, offset: 0x5fbc6): QBVK_WORLD_18
    <a5de5>   DW_AT_const_value : 178
 <2><a5de6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5de7>   DW_AT_name        : (indirect string, offset: 0x82dfb): QBVK_WORLD_19
    <a5deb>   DW_AT_const_value : 179
 <2><a5dec>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ded>   DW_AT_name        : (indirect string, offset: 0x5fd2b): QBVK_WORLD_20
    <a5df1>   DW_AT_const_value : 180
 <2><a5df2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5df3>   DW_AT_name        : (indirect string, offset: 0x5fd39): QBVK_WORLD_21
    <a5df7>   DW_AT_const_value : 181
 <2><a5df8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5df9>   DW_AT_name        : (indirect string, offset: 0x5fd47): QBVK_WORLD_22
    <a5dfd>   DW_AT_const_value : 182
 <2><a5dfe>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5dff>   DW_AT_name        : (indirect string, offset: 0x5fd55): QBVK_WORLD_23
    <a5e03>   DW_AT_const_value : 183
 <2><a5e04>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e05>   DW_AT_name        : (indirect string, offset: 0x5fd63): QBVK_WORLD_24
    <a5e09>   DW_AT_const_value : 184
 <2><a5e0a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e0b>   DW_AT_name        : (indirect string, offset: 0x5fd71): QBVK_WORLD_25
    <a5e0f>   DW_AT_const_value : 185
 <2><a5e10>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e11>   DW_AT_name        : (indirect string, offset: 0x5fd7f): QBVK_WORLD_26
    <a5e15>   DW_AT_const_value : 186
 <2><a5e16>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e17>   DW_AT_name        : (indirect string, offset: 0x5fd8d): QBVK_WORLD_27
    <a5e1b>   DW_AT_const_value : 187
 <2><a5e1c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e1d>   DW_AT_name        : (indirect string, offset: 0x5fd9b): QBVK_WORLD_28
    <a5e21>   DW_AT_const_value : 188
 <2><a5e22>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e23>   DW_AT_name        : (indirect string, offset: 0x5fda9): QBVK_WORLD_29
    <a5e27>   DW_AT_const_value : 189
 <2><a5e28>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e29>   DW_AT_name        : (indirect string, offset: 0x5ffdd): QBVK_WORLD_30
    <a5e2d>   DW_AT_const_value : 190
 <2><a5e2e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e2f>   DW_AT_name        : (indirect string, offset: 0x5ffeb): QBVK_WORLD_31
    <a5e33>   DW_AT_const_value : 191
 <2><a5e34>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e35>   DW_AT_name        : (indirect string, offset: 0x5fff9): QBVK_WORLD_32
    <a5e39>   DW_AT_const_value : 192
 <2><a5e3a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e3b>   DW_AT_name        : (indirect string, offset: 0x60007): QBVK_WORLD_33
    <a5e3f>   DW_AT_const_value : 193
 <2><a5e40>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e41>   DW_AT_name        : (indirect string, offset: 0x60015): QBVK_WORLD_34
    <a5e45>   DW_AT_const_value : 194
 <2><a5e46>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e47>   DW_AT_name        : (indirect string, offset: 0x60023): QBVK_WORLD_35
    <a5e4b>   DW_AT_const_value : 195
 <2><a5e4c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e4d>   DW_AT_name        : (indirect string, offset: 0x60031): QBVK_WORLD_36
    <a5e51>   DW_AT_const_value : 196
 <2><a5e52>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e53>   DW_AT_name        : (indirect string, offset: 0x6003f): QBVK_WORLD_37
    <a5e57>   DW_AT_const_value : 197
 <2><a5e58>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e59>   DW_AT_name        : (indirect string, offset: 0x6004d): QBVK_WORLD_38
    <a5e5d>   DW_AT_const_value : 198
 <2><a5e5e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e5f>   DW_AT_name        : (indirect string, offset: 0x6005b): QBVK_WORLD_39
    <a5e63>   DW_AT_const_value : 199
 <2><a5e64>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e65>   DW_AT_name        : (indirect string, offset: 0x6014a): QBVK_WORLD_40
    <a5e69>   DW_AT_const_value : 200
 <2><a5e6a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e6b>   DW_AT_name        : (indirect string, offset: 0x60158): QBVK_WORLD_41
    <a5e6f>   DW_AT_const_value : 201
 <2><a5e70>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e71>   DW_AT_name        : (indirect string, offset: 0x60166): QBVK_WORLD_42
    <a5e75>   DW_AT_const_value : 202
 <2><a5e76>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e77>   DW_AT_name        : (indirect string, offset: 0x60174): QBVK_WORLD_43
    <a5e7b>   DW_AT_const_value : 203
 <2><a5e7c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e7d>   DW_AT_name        : (indirect string, offset: 0x60182): QBVK_WORLD_44
    <a5e81>   DW_AT_const_value : 204
 <2><a5e82>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e83>   DW_AT_name        : (indirect string, offset: 0x60190): QBVK_WORLD_45
    <a5e87>   DW_AT_const_value : 205
 <2><a5e88>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e89>   DW_AT_name        : (indirect string, offset: 0x6019e): QBVK_WORLD_46
    <a5e8d>   DW_AT_const_value : 206
 <2><a5e8e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e8f>   DW_AT_name        : (indirect string, offset: 0x837be): QBVK_WORLD_47
    <a5e93>   DW_AT_const_value : 207
 <2><a5e94>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e95>   DW_AT_name        : (indirect string, offset: 0x601c7): QBVK_WORLD_48
    <a5e99>   DW_AT_const_value : 208
 <2><a5e9a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5e9b>   DW_AT_name        : (indirect string, offset: 0x601d5): QBVK_WORLD_49
    <a5e9f>   DW_AT_const_value : 209
 <2><a5ea0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ea1>   DW_AT_name        : (indirect string, offset: 0x83a6c): QBVK_WORLD_50
    <a5ea5>   DW_AT_const_value : 210
 <2><a5ea6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ea7>   DW_AT_name        : (indirect string, offset: 0x83a7a): QBVK_WORLD_51
    <a5eab>   DW_AT_const_value : 211
 <2><a5eac>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ead>   DW_AT_name        : (indirect string, offset: 0x60333): QBVK_WORLD_52
    <a5eb1>   DW_AT_const_value : 212
 <2><a5eb2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5eb3>   DW_AT_name        : (indirect string, offset: 0x60341): QBVK_WORLD_53
    <a5eb7>   DW_AT_const_value : 213
 <2><a5eb8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5eb9>   DW_AT_name        : (indirect string, offset: 0x6034f): QBVK_WORLD_54
    <a5ebd>   DW_AT_const_value : 214
 <2><a5ebe>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ebf>   DW_AT_name        : (indirect string, offset: 0x6035d): QBVK_WORLD_55
    <a5ec3>   DW_AT_const_value : 215
 <2><a5ec4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ec5>   DW_AT_name        : (indirect string, offset: 0x6036b): QBVK_WORLD_56
    <a5ec9>   DW_AT_const_value : 216
 <2><a5eca>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ecb>   DW_AT_name        : (indirect string, offset: 0x60379): QBVK_WORLD_57
    <a5ecf>   DW_AT_const_value : 217
 <2><a5ed0>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ed1>   DW_AT_name        : (indirect string, offset: 0x60387): QBVK_WORLD_58
    <a5ed5>   DW_AT_const_value : 218
 <2><a5ed6>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ed7>   DW_AT_name        : (indirect string, offset: 0x60395): QBVK_WORLD_59
    <a5edb>   DW_AT_const_value : 219
 <2><a5edc>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5edd>   DW_AT_name        : (indirect string, offset: 0x83e01): QBVK_WORLD_60
    <a5ee1>   DW_AT_const_value : 220
 <2><a5ee2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ee3>   DW_AT_name        : (indirect string, offset: 0x60510): QBVK_WORLD_61
    <a5ee7>   DW_AT_const_value : 221
 <2><a5ee8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ee9>   DW_AT_name        : (indirect string, offset: 0x6051e): QBVK_WORLD_62
    <a5eed>   DW_AT_const_value : 222
 <2><a5eee>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5eef>   DW_AT_name        : (indirect string, offset: 0x6052c): QBVK_WORLD_63
    <a5ef3>   DW_AT_const_value : 223
 <2><a5ef4>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5ef5>   DW_AT_name        : (indirect string, offset: 0x6053a): QBVK_WORLD_64
    <a5ef9>   DW_AT_const_value : 224
 <2><a5efa>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5efb>   DW_AT_name        : (indirect string, offset: 0x60548): QBVK_WORLD_65
    <a5eff>   DW_AT_const_value : 225
 <2><a5f00>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f01>   DW_AT_name        : (indirect string, offset: 0x60556): QBVK_WORLD_66
    <a5f05>   DW_AT_const_value : 226
 <2><a5f06>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f07>   DW_AT_name        : (indirect string, offset: 0x60564): QBVK_WORLD_67
    <a5f0b>   DW_AT_const_value : 227
 <2><a5f0c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f0d>   DW_AT_name        : (indirect string, offset: 0x60572): QBVK_WORLD_68
    <a5f11>   DW_AT_const_value : 228
 <2><a5f12>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f13>   DW_AT_name        : (indirect string, offset: 0x60580): QBVK_WORLD_69
    <a5f17>   DW_AT_const_value : 229
 <2><a5f18>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f19>   DW_AT_name        : (indirect string, offset: 0x606c8): QBVK_WORLD_70
    <a5f1d>   DW_AT_const_value : 230
 <2><a5f1e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f1f>   DW_AT_name        : (indirect string, offset: 0x606d6): QBVK_WORLD_71
    <a5f23>   DW_AT_const_value : 231
 <2><a5f24>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f25>   DW_AT_name        : (indirect string, offset: 0x606e4): QBVK_WORLD_72
    <a5f29>   DW_AT_const_value : 232
 <2><a5f2a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f2b>   DW_AT_name        : (indirect string, offset: 0x606f2): QBVK_WORLD_73
    <a5f2f>   DW_AT_const_value : 233
 <2><a5f30>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f31>   DW_AT_name        : (indirect string, offset: 0x60700): QBVK_WORLD_74
    <a5f35>   DW_AT_const_value : 234
 <2><a5f36>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f37>   DW_AT_name        : (indirect string, offset: 0x6070e): QBVK_WORLD_75
    <a5f3b>   DW_AT_const_value : 235
 <2><a5f3c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f3d>   DW_AT_name        : (indirect string, offset: 0x6071c): QBVK_WORLD_76
    <a5f41>   DW_AT_const_value : 236
 <2><a5f42>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f43>   DW_AT_name        : (indirect string, offset: 0x84202): QBVK_WORLD_77
    <a5f47>   DW_AT_const_value : 237
 <2><a5f48>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f49>   DW_AT_name        : (indirect string, offset: 0x84210): QBVK_WORLD_78
    <a5f4d>   DW_AT_const_value : 238
 <2><a5f4e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f4f>   DW_AT_name        : (indirect string, offset: 0x6073e): QBVK_WORLD_79
    <a5f53>   DW_AT_const_value : 239
 <2><a5f54>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f55>   DW_AT_name        : (indirect string, offset: 0x60872): QBVK_WORLD_80
    <a5f59>   DW_AT_const_value : 240
 <2><a5f5a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f5b>   DW_AT_name        : (indirect string, offset: 0x8448d): QBVK_WORLD_81
    <a5f5f>   DW_AT_const_value : 241
 <2><a5f60>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f61>   DW_AT_name        : (indirect string, offset: 0x77e48): QBVK_WORLD_82
    <a5f65>   DW_AT_const_value : 242
 <2><a5f66>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f67>   DW_AT_name        : (indirect string, offset: 0x608ae): QBVK_WORLD_83
    <a5f6b>   DW_AT_const_value : 243
 <2><a5f6c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f6d>   DW_AT_name        : (indirect string, offset: 0x608bc): QBVK_WORLD_84
    <a5f71>   DW_AT_const_value : 244
 <2><a5f72>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f73>   DW_AT_name        : (indirect string, offset: 0x608ca): QBVK_WORLD_85
    <a5f77>   DW_AT_const_value : 245
 <2><a5f78>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f79>   DW_AT_name        : (indirect string, offset: 0x608d8): QBVK_WORLD_86
    <a5f7d>   DW_AT_const_value : 246
 <2><a5f7e>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f7f>   DW_AT_name        : (indirect string, offset: 0x77ea7): QBVK_WORLD_87
    <a5f83>   DW_AT_const_value : 247
 <2><a5f84>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f85>   DW_AT_name        : (indirect string, offset: 0x60901): QBVK_WORLD_88
    <a5f89>   DW_AT_const_value : 248
 <2><a5f8a>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f8b>   DW_AT_name        : (indirect string, offset: 0x8450f): QBVK_WORLD_89
    <a5f8f>   DW_AT_const_value : 249
 <2><a5f90>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f91>   DW_AT_name        : (indirect string, offset: 0x609c5): QBVK_WORLD_90
    <a5f95>   DW_AT_const_value : 250
 <2><a5f96>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f97>   DW_AT_name        : (indirect string, offset: 0x609d3): QBVK_WORLD_91
    <a5f9b>   DW_AT_const_value : 251
 <2><a5f9c>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5f9d>   DW_AT_name        : (indirect string, offset: 0x609e1): QBVK_WORLD_92
    <a5fa1>   DW_AT_const_value : 252
 <2><a5fa2>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5fa3>   DW_AT_name        : (indirect string, offset: 0x609ef): QBVK_WORLD_93
    <a5fa7>   DW_AT_const_value : 253
 <2><a5fa8>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5fa9>   DW_AT_name        : (indirect string, offset: 0x609fd): QBVK_WORLD_94
    <a5fad>   DW_AT_const_value : 254
 <2><a5fae>: Abbrev Number: 13 (DW_TAG_enumerator)
    <a5faf>   DW_AT_name        : (indirect string, offset: 0x60a0b): QBVK_WORLD_95
    <a5fb3>   DW_AT_const_value : 255
 <2><a5fb4>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fb5>   DW_AT_name        : (indirect string, offset: 0x700e0): QBVK_KP0
    <a5fb9>   DW_AT_const_value : 256
 <2><a5fbb>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fbc>   DW_AT_name        : (indirect string, offset: 0x700e9): QBVK_KP1
    <a5fc0>   DW_AT_const_value : 257
 <2><a5fc2>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fc3>   DW_AT_name        : (indirect string, offset: 0x700f2): QBVK_KP2
    <a5fc7>   DW_AT_const_value : 258
 <2><a5fc9>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fca>   DW_AT_name        : (indirect string, offset: 0x700fb): QBVK_KP3
    <a5fce>   DW_AT_const_value : 259
 <2><a5fd0>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fd1>   DW_AT_name        : (indirect string, offset: 0x70104): QBVK_KP4
    <a5fd5>   DW_AT_const_value : 260
 <2><a5fd7>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fd8>   DW_AT_name        : (indirect string, offset: 0x7010d): QBVK_KP5
    <a5fdc>   DW_AT_const_value : 261
 <2><a5fde>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fdf>   DW_AT_name        : (indirect string, offset: 0x70116): QBVK_KP6
    <a5fe3>   DW_AT_const_value : 262
 <2><a5fe5>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fe6>   DW_AT_name        : (indirect string, offset: 0x7011f): QBVK_KP7
    <a5fea>   DW_AT_const_value : 263
 <2><a5fec>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5fed>   DW_AT_name        : (indirect string, offset: 0x70128): QBVK_KP8
    <a5ff1>   DW_AT_const_value : 264
 <2><a5ff3>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5ff4>   DW_AT_name        : (indirect string, offset: 0x70131): QBVK_KP9
    <a5ff8>   DW_AT_const_value : 265
 <2><a5ffa>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a5ffb>   DW_AT_name        : (indirect string, offset: 0x73742): QBVK_KP_PERIOD
    <a5fff>   DW_AT_const_value : 266
 <2><a6001>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6002>   DW_AT_name        : (indirect string, offset: 0x666a6): QBVK_KP_DIVIDE
    <a6006>   DW_AT_const_value : 267
 <2><a6008>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6009>   DW_AT_name        : (indirect string, offset: 0x6f67c): QBVK_KP_MULTIPLY
    <a600d>   DW_AT_const_value : 268
 <2><a600f>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6010>   DW_AT_name        : (indirect string, offset: 0x6f2ce): QBVK_KP_MINUS
    <a6014>   DW_AT_const_value : 269
 <2><a6016>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6017>   DW_AT_name        : (indirect string, offset: 0x6278b): QBVK_KP_PLUS
    <a601b>   DW_AT_const_value : 270
 <2><a601d>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a601e>   DW_AT_name        : (indirect string, offset: 0x76338): QBVK_KP_ENTER
    <a6022>   DW_AT_const_value : 271
 <2><a6024>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6025>   DW_AT_name        : (indirect string, offset: 0x889a1): QBVK_KP_EQUALS
    <a6029>   DW_AT_const_value : 272
 <2><a602b>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a602c>   DW_AT_name        : (indirect string, offset: 0x869db): QBVK_UP
    <a6030>   DW_AT_const_value : 273
 <2><a6032>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6033>   DW_AT_name        : (indirect string, offset: 0x7b0a1): QBVK_DOWN
    <a6037>   DW_AT_const_value : 274
 <2><a6039>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a603a>   DW_AT_name        : (indirect string, offset: 0x89019): QBVK_RIGHT
    <a603e>   DW_AT_const_value : 275
 <2><a6040>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6041>   DW_AT_name        : (indirect string, offset: 0x720d5): QBVK_LEFT
    <a6045>   DW_AT_const_value : 276
 <2><a6047>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6048>   DW_AT_name        : (indirect string, offset: 0x788eb): QBVK_INSERT
    <a604c>   DW_AT_const_value : 277
 <2><a604e>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a604f>   DW_AT_name        : (indirect string, offset: 0x60fc2): QBVK_HOME
    <a6053>   DW_AT_const_value : 278
 <2><a6055>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6056>   DW_AT_name        : (indirect string, offset: 0x785c4): QBVK_END
    <a605a>   DW_AT_const_value : 279
 <2><a605c>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a605d>   DW_AT_name        : (indirect string, offset: 0x6b041): QBVK_PAGEUP
    <a6061>   DW_AT_const_value : 280
 <2><a6063>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6064>   DW_AT_name        : (indirect string, offset: 0x6408d): QBVK_PAGEDOWN
    <a6068>   DW_AT_const_value : 281
 <2><a606a>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a606b>   DW_AT_name        : (indirect string, offset: 0x85098): QBVK_F1
    <a606f>   DW_AT_const_value : 282
 <2><a6071>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6072>   DW_AT_name        : (indirect string, offset: 0x850a0): QBVK_F2
    <a6076>   DW_AT_const_value : 283
 <2><a6078>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6079>   DW_AT_name        : (indirect string, offset: 0x7de40): QBVK_F3
    <a607d>   DW_AT_const_value : 284
 <2><a607f>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6080>   DW_AT_name        : (indirect string, offset: 0x850bf): QBVK_F4
    <a6084>   DW_AT_const_value : 285
 <2><a6086>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6087>   DW_AT_name        : (indirect string, offset: 0x850c7): QBVK_F5
    <a608b>   DW_AT_const_value : 286
 <2><a608d>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a608e>   DW_AT_name        : (indirect string, offset: 0x850cf): QBVK_F6
    <a6092>   DW_AT_const_value : 287
 <2><a6094>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6095>   DW_AT_name        : (indirect string, offset: 0x850d7): QBVK_F7
    <a6099>   DW_AT_const_value : 288
 <2><a609b>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a609c>   DW_AT_name        : (indirect string, offset: 0x7dea6): QBVK_F8
    <a60a0>   DW_AT_const_value : 289
 <2><a60a2>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60a3>   DW_AT_name        : (indirect string, offset: 0x850fb): QBVK_F9
    <a60a7>   DW_AT_const_value : 290
 <2><a60a9>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60aa>   DW_AT_name        : (indirect string, offset: 0x7c06d): QBVK_F10
    <a60ae>   DW_AT_const_value : 291
 <2><a60b0>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60b1>   DW_AT_name        : (indirect string, offset: 0x7c076): QBVK_F11
    <a60b5>   DW_AT_const_value : 292
 <2><a60b7>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60b8>   DW_AT_name        : (indirect string, offset: 0x7c07f): QBVK_F12
    <a60bc>   DW_AT_const_value : 293
 <2><a60be>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60bf>   DW_AT_name        : (indirect string, offset: 0x69eda): QBVK_F13
    <a60c3>   DW_AT_const_value : 294
 <2><a60c5>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60c6>   DW_AT_name        : (indirect string, offset: 0x7c0a8): QBVK_F14
    <a60ca>   DW_AT_const_value : 295
 <2><a60cc>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60cd>   DW_AT_name        : (indirect string, offset: 0x7c0b1): QBVK_F15
    <a60d1>   DW_AT_const_value : 296
 <2><a60d3>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60d4>   DW_AT_name        : (indirect string, offset: 0x73d31): QBVK_NUMLOCK
    <a60d8>   DW_AT_const_value : 300
 <2><a60da>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60db>   DW_AT_name        : (indirect string, offset: 0x67711): QBVK_CAPSLOCK
    <a60df>   DW_AT_const_value : 301
 <2><a60e1>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60e2>   DW_AT_name        : (indirect string, offset: 0x8c9a3): QBVK_SCROLLOCK
    <a60e6>   DW_AT_const_value : 302
 <2><a60e8>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60e9>   DW_AT_name        : (indirect string, offset: 0x7ab6f): QBVK_RSHIFT
    <a60ed>   DW_AT_const_value : 303
 <2><a60ef>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60f0>   DW_AT_name        : (indirect string, offset: 0x8c945): QBVK_LSHIFT
    <a60f4>   DW_AT_const_value : 304
 <2><a60f6>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60f7>   DW_AT_name        : (indirect string, offset: 0x6f73d): QBVK_RCTRL
    <a60fb>   DW_AT_const_value : 305
 <2><a60fd>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a60fe>   DW_AT_name        : (indirect string, offset: 0x7e35d): QBVK_LCTRL
    <a6102>   DW_AT_const_value : 306
 <2><a6104>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6105>   DW_AT_name        : (indirect string, offset: 0x8d64a): QBVK_RALT
    <a6109>   DW_AT_const_value : 307
 <2><a610b>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a610c>   DW_AT_name        : (indirect string, offset: 0x88589): QBVK_LALT
    <a6110>   DW_AT_const_value : 308
 <2><a6112>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6113>   DW_AT_name        : (indirect string, offset: 0x7046f): QBVK_RMETA
    <a6117>   DW_AT_const_value : 309
 <2><a6119>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a611a>   DW_AT_name        : (indirect string, offset: 0x8d97d): QBVK_LMETA
    <a611e>   DW_AT_const_value : 310
 <2><a6120>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6121>   DW_AT_name        : (indirect string, offset: 0x6d33f): QBVK_LSUPER
    <a6125>   DW_AT_const_value : 311
 <2><a6127>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6128>   DW_AT_name        : (indirect string, offset: 0x8b6ad): QBVK_RSUPER
    <a612c>   DW_AT_const_value : 312
 <2><a612e>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a612f>   DW_AT_name        : (indirect string, offset: 0x8c6ed): QBVK_MODE
    <a6133>   DW_AT_const_value : 313
 <2><a6135>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6136>   DW_AT_name        : (indirect string, offset: 0x8c6f7): QBVK_COMPOSE
    <a613a>   DW_AT_const_value : 314
 <2><a613c>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a613d>   DW_AT_name        : (indirect string, offset: 0x7f2c6): QBVK_HELP
    <a6141>   DW_AT_const_value : 315
 <2><a6143>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6144>   DW_AT_name        : (indirect string, offset: 0x67472): QBVK_PRINT
    <a6148>   DW_AT_const_value : 316
 <2><a614a>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a614b>   DW_AT_name        : (indirect string, offset: 0x7f952): QBVK_SYSREQ
    <a614f>   DW_AT_const_value : 317
 <2><a6151>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6152>   DW_AT_name        : (indirect string, offset: 0x64789): QBVK_BREAK
    <a6156>   DW_AT_const_value : 318
 <2><a6158>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6159>   DW_AT_name        : (indirect string, offset: 0x64c9c): QBVK_MENU
    <a615d>   DW_AT_const_value : 319
 <2><a615f>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6160>   DW_AT_name        : (indirect string, offset: 0x781ad): QBVK_POWER
    <a6164>   DW_AT_const_value : 320
 <2><a6166>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6167>   DW_AT_name        : (indirect string, offset: 0x6eae8): QBVK_EURO
    <a616b>   DW_AT_const_value : 321
 <2><a616d>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a616e>   DW_AT_name        : (indirect string, offset: 0x6c4cb): QBVK_UNDO
    <a6172>   DW_AT_const_value : 322
 <2><a6174>: Abbrev Number: 24 (DW_TAG_enumerator)
    <a6175>   DW_AT_name        : (indirect string, offset: 0x8906f): QBVK_LAST
    <a6179>   DW_AT_const_value : 323
 <2><a617b>: Abbrev Number: 0
 <1><a617c>: Abbrev Number: 4 (DW_TAG_typedef)
    <a617d>   DW_AT_name        : (indirect string, offset: 0x5f515): QBVKs
    <a6181>   DW_AT_decl_file   : 5
    <a6182>   DW_AT_decl_line   : 1199
    <a6184>   DW_AT_decl_column : 2
    <a6185>   DW_AT_type        : <0xa5baa>
 <1><a6189>: Abbrev Number: 11 (DW_TAG_variable)
    <a618a>   DW_AT_name        : (indirect string, offset: 0x1ddff): mem_lock_id
    <a618e>   DW_AT_decl_file   : 5
    <a618f>   DW_AT_decl_line   : 1257
    <a6191>   DW_AT_decl_column : 8
    <a6192>   DW_AT_type        : <0x799e5>
    <a6196>   DW_AT_external    : 1
    <a6196>   DW_AT_location    : 9 byte block: 3 60 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b60)
 <1><a61a0>: Abbrev Number: 11 (DW_TAG_variable)
    <a61a1>   DW_AT_name        : (indirect string, offset: 0x6bea5): mem_lock_max
    <a61a5>   DW_AT_decl_file   : 5
    <a61a6>   DW_AT_decl_line   : 1258
    <a61a8>   DW_AT_decl_column : 7
    <a61a9>   DW_AT_type        : <0x7999f>
    <a61ad>   DW_AT_external    : 1
    <a61ad>   DW_AT_location    : 9 byte block: 3 68 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b68)
 <1><a61b7>: Abbrev Number: 11 (DW_TAG_variable)
    <a61b8>   DW_AT_name        : (indirect string, offset: 0x82992): mem_lock_next
    <a61bc>   DW_AT_decl_file   : 5
    <a61bd>   DW_AT_decl_line   : 1259
    <a61bf>   DW_AT_decl_column : 7
    <a61c0>   DW_AT_type        : <0x7999f>
    <a61c4>   DW_AT_external    : 1
    <a61c4>   DW_AT_location    : 9 byte block: 3 cc 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ecc)
 <1><a61ce>: Abbrev Number: 11 (DW_TAG_variable)
    <a61cf>   DW_AT_name        : (indirect string, offset: 0x5d8ab): mem_lock_base
    <a61d3>   DW_AT_decl_file   : 5
    <a61d4>   DW_AT_decl_line   : 1260
    <a61d6>   DW_AT_decl_column : 11
    <a61d7>   DW_AT_type        : <0xa61e5>
    <a61db>   DW_AT_external    : 1
    <a61db>   DW_AT_location    : 9 byte block: 3 d0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ed0)
 <1><a61e5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a61e6>   DW_AT_byte_size   : 8
    <a61e6>   DW_AT_type        : <0x93755>
 <1><a61ea>: Abbrev Number: 11 (DW_TAG_variable)
    <a61eb>   DW_AT_name        : (indirect string, offset: 0x4066e): mem_lock_tmp
    <a61ef>   DW_AT_decl_file   : 5
    <a61f0>   DW_AT_decl_line   : 1261
    <a61f2>   DW_AT_decl_column : 11
    <a61f3>   DW_AT_type        : <0xa61e5>
    <a61f7>   DW_AT_external    : 1
    <a61f7>   DW_AT_location    : 9 byte block: 3 d8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ed8)
 <1><a6201>: Abbrev Number: 11 (DW_TAG_variable)
    <a6202>   DW_AT_name        : (indirect string, offset: 0x7622a): mem_lock_freed_max
    <a6206>   DW_AT_decl_file   : 5
    <a6207>   DW_AT_decl_line   : 1263
    <a6209>   DW_AT_decl_column : 7
    <a620a>   DW_AT_type        : <0x7999f>
    <a620e>   DW_AT_external    : 1
    <a620e>   DW_AT_location    : 9 byte block: 3 6c 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b6c)
 <1><a6218>: Abbrev Number: 11 (DW_TAG_variable)
    <a6219>   DW_AT_name        : (indirect string, offset: 0x6c3c1): mem_lock_freed_n
    <a621d>   DW_AT_decl_file   : 5
    <a621e>   DW_AT_decl_line   : 1264
    <a6220>   DW_AT_decl_column : 7
    <a6221>   DW_AT_type        : <0x7999f>
    <a6225>   DW_AT_external    : 1
    <a6225>   DW_AT_location    : 9 byte block: 3 e0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ee0)
 <1><a622f>: Abbrev Number: 11 (DW_TAG_variable)
    <a6230>   DW_AT_name        : (indirect string, offset: 0x5db14): mem_lock_freed
    <a6234>   DW_AT_decl_file   : 5
    <a6235>   DW_AT_decl_line   : 1265
    <a6237>   DW_AT_decl_column : 11
    <a6238>   DW_AT_type        : <0x95c1e>
    <a623c>   DW_AT_external    : 1
    <a623c>   DW_AT_location    : 9 byte block: 3 e8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ee8)
 <1><a6246>: Abbrev Number: 11 (DW_TAG_variable)
    <a6247>   DW_AT_name        : (indirect string, offset: 0x21f9c): device_event_index
    <a624b>   DW_AT_decl_file   : 5
    <a624c>   DW_AT_decl_line   : 1306
    <a624e>   DW_AT_decl_column : 7
    <a624f>   DW_AT_type        : <0x799b0>
    <a6253>   DW_AT_external    : 1
    <a6253>   DW_AT_location    : 9 byte block: 3 f0 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ef0)
 <1><a625d>: Abbrev Number: 11 (DW_TAG_variable)
    <a625e>   DW_AT_name        : (indirect string, offset: 0x6d1ce): device_mouse_relative
    <a6262>   DW_AT_decl_file   : 5
    <a6263>   DW_AT_decl_line   : 1307
    <a6265>   DW_AT_decl_column : 7
    <a6266>   DW_AT_type        : <0x7999f>
    <a626a>   DW_AT_external    : 1
    <a626a>   DW_AT_location    : 9 byte block: 3 f8 7e b9 0 0 0 0 0 	(DW_OP_addr: b97ef8)
 <1><a6274>: Abbrev Number: 11 (DW_TAG_variable)
    <a6275>   DW_AT_name        : (indirect string, offset: 0x773e0): lock_mainloop
    <a6279>   DW_AT_decl_file   : 5
    <a627a>   DW_AT_decl_line   : 1309
    <a627c>   DW_AT_decl_column : 7
    <a627d>   DW_AT_type        : <0x7999f>
    <a6281>   DW_AT_external    : 1
    <a6281>   DW_AT_location    : 9 byte block: 3 fc 7e b9 0 0 0 0 0 	(DW_OP_addr: b97efc)
 <1><a628b>: Abbrev Number: 11 (DW_TAG_variable)
    <a628c>   DW_AT_name        : (indirect string, offset: 0x8dc3c): lpos
    <a6290>   DW_AT_decl_file   : 5
    <a6291>   DW_AT_decl_line   : 1311
    <a6293>   DW_AT_decl_column : 7
    <a6294>   DW_AT_type        : <0x7999f>
    <a6298>   DW_AT_external    : 1
    <a6298>   DW_AT_location    : 9 byte block: 3 70 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b70)
 <1><a62a2>: Abbrev Number: 11 (DW_TAG_variable)
    <a62a3>   DW_AT_name        : (indirect string, offset: 0x6f8de): width_lprint
    <a62a7>   DW_AT_decl_file   : 5
    <a62a8>   DW_AT_decl_line   : 1312
    <a62aa>   DW_AT_decl_column : 7
    <a62ab>   DW_AT_type        : <0x7999f>
    <a62af>   DW_AT_external    : 1
    <a62af>   DW_AT_location    : 9 byte block: 3 74 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b74)
 <1><a62b9>: Abbrev Number: 3 (DW_TAG_variable)
    <a62ba>   DW_AT_specification: <0x937d5>
    <a62be>   DW_AT_decl_file   : 5
    <a62bf>   DW_AT_decl_line   : 1337
    <a62c1>   DW_AT_decl_column : 7
    <a62c2>   DW_AT_location    : 9 byte block: 3 78 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b78)
 <1><a62cc>: Abbrev Number: 11 (DW_TAG_variable)
    <a62cd>   DW_AT_name        : (indirect string, offset: 0x7b765): key_display_state
    <a62d1>   DW_AT_decl_file   : 5
    <a62d2>   DW_AT_decl_line   : 1364
    <a62d4>   DW_AT_decl_column : 7
    <a62d5>   DW_AT_type        : <0x7999f>
    <a62d9>   DW_AT_external    : 1
    <a62d9>   DW_AT_location    : 9 byte block: 3 0 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f00)
 <1><a62e3>: Abbrev Number: 11 (DW_TAG_variable)
    <a62e4>   DW_AT_name        : (indirect string, offset: 0x8ab8f): key_display
    <a62e8>   DW_AT_decl_file   : 5
    <a62e9>   DW_AT_decl_line   : 1365
    <a62eb>   DW_AT_decl_column : 7
    <a62ec>   DW_AT_type        : <0x7999f>
    <a62f0>   DW_AT_external    : 1
    <a62f0>   DW_AT_location    : 9 byte block: 3 4 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f04)
 <1><a62fa>: Abbrev Number: 11 (DW_TAG_variable)
    <a62fb>   DW_AT_name        : (indirect string, offset: 0x7597b): key_display_redraw
    <a62ff>   DW_AT_decl_file   : 5
    <a6300>   DW_AT_decl_line   : 1366
    <a6302>   DW_AT_decl_column : 7
    <a6303>   DW_AT_type        : <0x7999f>
    <a6307>   DW_AT_external    : 1
    <a6307>   DW_AT_location    : 9 byte block: 3 8 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f08)
 <1><a6311>: Abbrev Number: 2 (DW_TAG_variable)
    <a6312>   DW_AT_name        : (indirect string, offset: 0x443e8): device_last
    <a6316>   DW_AT_decl_file   : 5
    <a6317>   DW_AT_decl_line   : 1368
    <a6319>   DW_AT_decl_column : 14
    <a631a>   DW_AT_type        : <0x7999f>
    <a631e>   DW_AT_external    : 1
    <a631e>   DW_AT_declaration : 1
 <1><a631e>: Abbrev Number: 2 (DW_TAG_variable)
    <a631f>   DW_AT_name        : (indirect string, offset: 0x51f7a): devices
    <a6323>   DW_AT_decl_file   : 5
    <a6324>   DW_AT_decl_line   : 1370
    <a6326>   DW_AT_decl_column : 23
    <a6327>   DW_AT_type        : <0xa632b>
    <a632b>   DW_AT_external    : 1
    <a632b>   DW_AT_declaration : 1
 <1><a632b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a632c>   DW_AT_byte_size   : 8
    <a632c>   DW_AT_type        : <0x935ae>
 <1><a6330>: Abbrev Number: 2 (DW_TAG_variable)
    <a6331>   DW_AT_name        : (indirect string, offset: 0x8b12): ontimer
    <a6335>   DW_AT_decl_file   : 5
    <a6336>   DW_AT_decl_line   : 1384
    <a6338>   DW_AT_decl_column : 24
    <a6339>   DW_AT_type        : <0xa633d>
    <a633d>   DW_AT_external    : 1
    <a633d>   DW_AT_declaration : 1
 <1><a633d>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a633e>   DW_AT_byte_size   : 8
    <a633e>   DW_AT_type        : <0x93497>
 <1><a6342>: Abbrev Number: 2 (DW_TAG_variable)
    <a6343>   DW_AT_name        : (indirect string, offset: 0x7b4d7): onkey
    <a6347>   DW_AT_decl_file   : 5
    <a6348>   DW_AT_decl_line   : 1385
    <a634a>   DW_AT_decl_column : 22
    <a634b>   DW_AT_type        : <0xa634f>
    <a634f>   DW_AT_external    : 1
    <a634f>   DW_AT_declaration : 1
 <1><a634f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a6350>   DW_AT_byte_size   : 8
    <a6350>   DW_AT_type        : <0x934ff>
 <1><a6354>: Abbrev Number: 2 (DW_TAG_variable)
    <a6355>   DW_AT_name        : (indirect string, offset: 0x13a72): onkey_inprogress
    <a6359>   DW_AT_decl_file   : 5
    <a635a>   DW_AT_decl_line   : 1386
    <a635c>   DW_AT_decl_column : 14
    <a635d>   DW_AT_type        : <0x7999f>
    <a6361>   DW_AT_external    : 1
    <a6361>   DW_AT_declaration : 1
 <1><a6361>: Abbrev Number: 2 (DW_TAG_variable)
    <a6362>   DW_AT_name        : (indirect string, offset: 0x3e36f): qbevent
    <a6366>   DW_AT_decl_file   : 5
    <a6367>   DW_AT_decl_line   : 1390
    <a6369>   DW_AT_decl_column : 15
    <a636a>   DW_AT_type        : <0x799d9>
    <a636e>   DW_AT_external    : 1
    <a636e>   DW_AT_declaration : 1
 <1><a636e>: Abbrev Number: 2 (DW_TAG_variable)
    <a636f>   DW_AT_name        : (indirect string, offset: 0x3bd2d): console
    <a6373>   DW_AT_decl_file   : 5
    <a6374>   DW_AT_decl_line   : 1396
    <a6376>   DW_AT_decl_column : 14
    <a6377>   DW_AT_type        : <0x7999f>
    <a637b>   DW_AT_external    : 1
    <a637b>   DW_AT_declaration : 1
 <1><a637b>: Abbrev Number: 2 (DW_TAG_variable)
    <a637c>   DW_AT_name        : (indirect string, offset: 0x151a3): screen_hide_startup
    <a6380>   DW_AT_decl_file   : 5
    <a6381>   DW_AT_decl_line   : 1397
    <a6383>   DW_AT_decl_column : 14
    <a6384>   DW_AT_type        : <0x7999f>
    <a6388>   DW_AT_external    : 1
    <a6388>   DW_AT_declaration : 1
 <1><a6388>: Abbrev Number: 2 (DW_TAG_variable)
    <a6389>   DW_AT_name        : (indirect string, offset: 0x21ea2): asserts
    <a638d>   DW_AT_decl_file   : 5
    <a638e>   DW_AT_decl_line   : 1398
    <a6390>   DW_AT_decl_column : 14
    <a6391>   DW_AT_type        : <0x7999f>
    <a6395>   DW_AT_external    : 1
    <a6395>   DW_AT_declaration : 1
 <1><a6395>: Abbrev Number: 11 (DW_TAG_variable)
    <a6396>   DW_AT_name        : (indirect string, offset: 0x2c872): exit_code
    <a639a>   DW_AT_decl_file   : 5
    <a639b>   DW_AT_decl_line   : 1401
    <a639d>   DW_AT_decl_column : 7
    <a639e>   DW_AT_type        : <0x799b0>
    <a63a2>   DW_AT_external    : 1
    <a63a2>   DW_AT_location    : 9 byte block: 3 10 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f10)
 <1><a63ac>: Abbrev Number: 11 (DW_TAG_variable)
    <a63ad>   DW_AT_name        : (indirect string, offset: 0x5df55): console_active
    <a63b1>   DW_AT_decl_file   : 5
    <a63b2>   DW_AT_decl_line   : 1403
    <a63b4>   DW_AT_decl_column : 7
    <a63b5>   DW_AT_type        : <0x7999f>
    <a63b9>   DW_AT_external    : 1
    <a63b9>   DW_AT_location    : 9 byte block: 3 7c 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b7c)
 <1><a63c3>: Abbrev Number: 11 (DW_TAG_variable)
    <a63c4>   DW_AT_name        : (indirect string, offset: 0x84267): console_child
    <a63c8>   DW_AT_decl_file   : 5
    <a63c9>   DW_AT_decl_line   : 1404
    <a63cb>   DW_AT_decl_column : 7
    <a63cc>   DW_AT_type        : <0x7999f>
    <a63d0>   DW_AT_external    : 1
    <a63d0>   DW_AT_location    : 9 byte block: 3 18 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f18)
 <1><a63da>: Abbrev Number: 11 (DW_TAG_variable)
    <a63db>   DW_AT_name        : (indirect string, offset: 0x76685): console_image
    <a63df>   DW_AT_decl_file   : 5
    <a63e0>   DW_AT_decl_line   : 1405
    <a63e2>   DW_AT_decl_column : 7
    <a63e3>   DW_AT_type        : <0x7999f>
    <a63e7>   DW_AT_external    : 1
    <a63e7>   DW_AT_location    : 9 byte block: 3 80 8b a7 0 0 0 0 0 	(DW_OP_addr: a78b80)
 <1><a63f1>: Abbrev Number: 11 (DW_TAG_variable)
    <a63f2>   DW_AT_name        : (indirect string, offset: 0x6ffd8): screen_hide
    <a63f6>   DW_AT_decl_file   : 5
    <a63f7>   DW_AT_decl_line   : 1406
    <a63f9>   DW_AT_decl_column : 7
    <a63fa>   DW_AT_type        : <0x7999f>
    <a63fe>   DW_AT_external    : 1
    <a63fe>   DW_AT_location    : 9 byte block: 3 1c 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f1c)
 <1><a6408>: Abbrev Number: 30 (DW_TAG_array_type)
    <a6409>   DW_AT_type        : <0x799cd>
    <a640d>   DW_AT_sibling     : <0xa6419>
 <2><a6411>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a6412>   DW_AT_type        : <0x79786>
    <a6416>   DW_AT_upper_bound : 258
 <2><a6418>: Abbrev Number: 0
 <1><a6419>: Abbrev Number: 7 (DW_TAG_variable)
    <a641a>   DW_AT_name        : (indirect string, offset: 0x73c8c): deadchar_lookup
    <a641e>   DW_AT_decl_file   : 5
    <a641f>   DW_AT_decl_line   : 1409
    <a6421>   DW_AT_decl_column : 15
    <a6422>   DW_AT_type        : <0xa6408>
    <a6426>   DW_AT_location    : 9 byte block: 3 a0 8b a7 0 0 0 0 0 	(DW_OP_addr: a78ba0)
 <1><a6430>: Abbrev Number: 11 (DW_TAG_variable)
    <a6431>   DW_AT_name        : (indirect string, offset: 0x7425c): keydown_glyph
    <a6435>   DW_AT_decl_file   : 5
    <a6436>   DW_AT_decl_line   : 1414
    <a6438>   DW_AT_decl_column : 7
    <a6439>   DW_AT_type        : <0x7999f>
    <a643d>   DW_AT_external    : 1
    <a643d>   DW_AT_location    : 9 byte block: 3 20 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f20)
 <1><a6447>: Abbrev Number: 11 (DW_TAG_variable)
    <a6448>   DW_AT_name        : (indirect string, offset: 0x8b316): lastfont
    <a644c>   DW_AT_decl_file   : 5
    <a644d>   DW_AT_decl_line   : 1521
    <a644f>   DW_AT_decl_column : 7
    <a6450>   DW_AT_type        : <0x7999f>
    <a6454>   DW_AT_external    : 1
    <a6454>   DW_AT_location    : 9 byte block: 3 a8 8d a7 0 0 0 0 0 	(DW_OP_addr: a78da8)
 <1><a645e>: Abbrev Number: 11 (DW_TAG_variable)
    <a645f>   DW_AT_name        : (indirect string, offset: 0x1684): font
    <a6463>   DW_AT_decl_file   : 5
    <a6464>   DW_AT_decl_line   : 1522
    <a6466>   DW_AT_decl_column : 8
    <a6467>   DW_AT_type        : <0x90051>
    <a646b>   DW_AT_external    : 1
    <a646b>   DW_AT_location    : 9 byte block: 3 28 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f28)
 <1><a6475>: Abbrev Number: 11 (DW_TAG_variable)
    <a6476>   DW_AT_name        : (indirect string, offset: 0x2b480): fontheight
    <a647a>   DW_AT_decl_file   : 5
    <a647b>   DW_AT_decl_line   : 1523
    <a647d>   DW_AT_decl_column : 8
    <a647e>   DW_AT_type        : <0x90051>
    <a6482>   DW_AT_external    : 1
    <a6482>   DW_AT_location    : 9 byte block: 3 30 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f30)
 <1><a648c>: Abbrev Number: 11 (DW_TAG_variable)
    <a648d>   DW_AT_name        : (indirect string, offset: 0x5d021): fontwidth
    <a6491>   DW_AT_decl_file   : 5
    <a6492>   DW_AT_decl_line   : 1524
    <a6494>   DW_AT_decl_column : 8
    <a6495>   DW_AT_type        : <0x90051>
    <a6499>   DW_AT_external    : 1
    <a6499>   DW_AT_location    : 9 byte block: 3 38 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f38)
 <1><a64a3>: Abbrev Number: 11 (DW_TAG_variable)
    <a64a4>   DW_AT_name        : (indirect string, offset: 0x8ab03): fontflags
    <a64a8>   DW_AT_decl_file   : 5
    <a64a9>   DW_AT_decl_line   : 1525
    <a64ab>   DW_AT_decl_column : 8
    <a64ac>   DW_AT_type        : <0x90051>
    <a64b0>   DW_AT_external    : 1
    <a64b0>   DW_AT_location    : 9 byte block: 3 40 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f40)
 <1><a64ba>: Abbrev Number: 3 (DW_TAG_variable)
    <a64bb>   DW_AT_specification: <0x93811>
    <a64bf>   DW_AT_decl_file   : 5
    <a64c0>   DW_AT_decl_line   : 1528
    <a64c2>   DW_AT_decl_column : 7
    <a64c3>   DW_AT_location    : 9 byte block: 3 60 7f b9 0 0 0 0 0 	(DW_OP_addr: b97f60)
 <1><a64cd>: Abbrev Number: 3 (DW_TAG_variable)
    <a64ce>   DW_AT_specification: <0x9381d>
    <a64d2>   DW_AT_decl_file   : 5
    <a64d3>   DW_AT_decl_line   : 1531
    <a64d5>   DW_AT_decl_column : 7
    <a64d6>   DW_AT_location    : 9 byte block: 3 60 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f60)
 <1><a64e0>: Abbrev Number: 3 (DW_TAG_variable)
    <a64e1>   DW_AT_specification: <0x93829>
    <a64e5>   DW_AT_decl_file   : 5
    <a64e6>   DW_AT_decl_line   : 1532
    <a64e8>   DW_AT_decl_column : 7
    <a64e9>   DW_AT_location    : 9 byte block: 3 64 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f64)
 <1><a64f3>: Abbrev Number: 11 (DW_TAG_variable)
    <a64f4>   DW_AT_name        : (indirect string, offset: 0x8a4ad): bindkey
    <a64f8>   DW_AT_decl_file   : 5
    <a64f9>   DW_AT_decl_line   : 1543
    <a64fb>   DW_AT_decl_column : 8
    <a64fc>   DW_AT_type        : <0x799d9>
    <a6500>   DW_AT_external    : 1
    <a6500>   DW_AT_location    : 9 byte block: 3 68 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f68)
 <1><a650a>: Abbrev Number: 30 (DW_TAG_array_type)
    <a650b>   DW_AT_type        : <0x799ab>
    <a650f>   DW_AT_sibling     : <0xa651b>
 <2><a6513>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a6514>   DW_AT_type        : <0x79786>
    <a6518>   DW_AT_upper_bound : 5359
 <2><a651a>: Abbrev Number: 0
 <1><a651b>: Abbrev Number: 27 (DW_TAG_const_type)
    <a651c>   DW_AT_type        : <0xa650a>
 <1><a6520>: Abbrev Number: 7 (DW_TAG_variable)
    <a6521>   DW_AT_name        : (indirect string, offset: 0x6addd): scancode_lookup
    <a6525>   DW_AT_decl_file   : 5
    <a6526>   DW_AT_decl_line   : 1571
    <a6528>   DW_AT_decl_column : 20
    <a6529>   DW_AT_type        : <0xa651b>
    <a652d>   DW_AT_location    : 9 byte block: 3 c0 33 a1 0 0 0 0 0 	(DW_OP_addr: a133c0)
 <1><a6537>: Abbrev Number: 11 (DW_TAG_variable)
    <a6538>   DW_AT_name        : (indirect string, offset: 0x88e0d): keyheld_buffer
    <a653c>   DW_AT_decl_file   : 5
    <a653d>   DW_AT_decl_line   : 2128
    <a653f>   DW_AT_decl_column : 9
    <a6540>   DW_AT_type        : <0x93492>
    <a6544>   DW_AT_external    : 1
    <a6544>   DW_AT_location    : 9 byte block: 3 70 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f70)
 <1><a654e>: Abbrev Number: 11 (DW_TAG_variable)
    <a654f>   DW_AT_name        : (indirect string, offset: 0x6fa05): keyheld_bind_buffer
    <a6553>   DW_AT_decl_file   : 5
    <a6554>   DW_AT_decl_line   : 2129
    <a6556>   DW_AT_decl_column : 9
    <a6557>   DW_AT_type        : <0x93492>
    <a655b>   DW_AT_external    : 1
    <a655b>   DW_AT_location    : 9 byte block: 3 78 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f78)
 <1><a6565>: Abbrev Number: 11 (DW_TAG_variable)
    <a6566>   DW_AT_name        : (indirect string, offset: 0x70300): keyheld_n
    <a656a>   DW_AT_decl_file   : 5
    <a656b>   DW_AT_decl_line   : 2130
    <a656d>   DW_AT_decl_column : 7
    <a656e>   DW_AT_type        : <0x7999f>
    <a6572>   DW_AT_external    : 1
    <a6572>   DW_AT_location    : 9 byte block: 3 80 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f80)
 <1><a657c>: Abbrev Number: 11 (DW_TAG_variable)
    <a657d>   DW_AT_name        : (indirect string, offset: 0x6cbee): keyheld_size
    <a6581>   DW_AT_decl_file   : 5
    <a6582>   DW_AT_decl_line   : 2131
    <a6584>   DW_AT_decl_column : 7
    <a6585>   DW_AT_type        : <0x7999f>
    <a6589>   DW_AT_external    : 1
    <a6589>   DW_AT_location    : 9 byte block: 3 84 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f84)
 <1><a6593>: Abbrev Number: 11 (DW_TAG_variable)
    <a6594>   DW_AT_name        : (indirect string, offset: 0x3050c): exit_ok
    <a6598>   DW_AT_decl_file   : 5
    <a6599>   DW_AT_decl_line   : 2237
    <a659b>   DW_AT_decl_column : 7
    <a659c>   DW_AT_type        : <0x7999f>
    <a65a0>   DW_AT_external    : 1
    <a65a0>   DW_AT_location    : 9 byte block: 3 88 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f88)
 <1><a65aa>: Abbrev Number: 11 (DW_TAG_variable)
    <a65ab>   DW_AT_name        : (indirect string, offset: 0x6f8e4): lprint
    <a65af>   DW_AT_decl_file   : 5
    <a65b0>   DW_AT_decl_line   : 2449
    <a65b2>   DW_AT_decl_column : 7
    <a65b3>   DW_AT_type        : <0x7999f>
    <a65b7>   DW_AT_external    : 1
    <a65b7>   DW_AT_location    : 9 byte block: 3 8c 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f8c)
 <1><a65c1>: Abbrev Number: 11 (DW_TAG_variable)
    <a65c2>   DW_AT_name        : (indirect string, offset: 0x6d7f9): lprint_image
    <a65c6>   DW_AT_decl_file   : 5
    <a65c7>   DW_AT_decl_line   : 2450
    <a65c9>   DW_AT_decl_column : 7
    <a65ca>   DW_AT_type        : <0x7999f>
    <a65ce>   DW_AT_external    : 1
    <a65ce>   DW_AT_location    : 9 byte block: 3 90 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f90)
 <1><a65d8>: Abbrev Number: 11 (DW_TAG_variable)
    <a65d9>   DW_AT_name        : (indirect string, offset: 0x88fea): lprint_last
    <a65dd>   DW_AT_decl_file   : 5
    <a65de>   DW_AT_decl_line   : 2451
    <a65e0>   DW_AT_decl_column : 8
    <a65e1>   DW_AT_type        : <0x79bcd>
    <a65e5>   DW_AT_external    : 1
    <a65e5>   DW_AT_location    : 9 byte block: 3 98 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7f98)
 <1><a65ef>: Abbrev Number: 11 (DW_TAG_variable)
    <a65f0>   DW_AT_name        : (indirect string, offset: 0x7ccd3): lprint_buffered
    <a65f4>   DW_AT_decl_file   : 5
    <a65f5>   DW_AT_decl_line   : 2452
    <a65f7>   DW_AT_decl_column : 7
    <a65f8>   DW_AT_type        : <0x7999f>
    <a65fc>   DW_AT_external    : 1
    <a65fc>   DW_AT_location    : 9 byte block: 3 a0 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fa0)
 <1><a6606>: Abbrev Number: 11 (DW_TAG_variable)
    <a6607>   DW_AT_name        : (indirect string, offset: 0x7935e): lprint_locked
    <a660b>   DW_AT_decl_file   : 5
    <a660c>   DW_AT_decl_line   : 2453
    <a660e>   DW_AT_decl_column : 7
    <a660f>   DW_AT_type        : <0x7999f>
    <a6613>   DW_AT_external    : 1
    <a6613>   DW_AT_location    : 9 byte block: 3 a4 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fa4)
 <1><a661d>: Abbrev Number: 39 (DW_TAG_structure_type)
    <a661e>   DW_AT_name        : (indirect string, offset: 0x7d165): gfs_file_struct
    <a6622>   DW_AT_byte_size   : 136
    <a6623>   DW_AT_decl_file   : 5
    <a6624>   DW_AT_decl_line   : 2483
    <a6626>   DW_AT_decl_column : 8
    <a6627>   DW_AT_sibling     : <0xa67dd>
 <2><a662b>: Abbrev Number: 31 (DW_TAG_member)
    <a662c>   DW_AT_name        : id
    <a662f>   DW_AT_decl_file   : 5
    <a6630>   DW_AT_decl_line   : 2484
    <a6632>   DW_AT_decl_column : 11
    <a6633>   DW_AT_type        : <0x799b0>
    <a6637>   DW_AT_data_member_location: 0
 <2><a6638>: Abbrev Number: 10 (DW_TAG_member)
    <a6639>   DW_AT_name        : (indirect string, offset: 0x8fb98): open
    <a663d>   DW_AT_decl_file   : 5
    <a663e>   DW_AT_decl_line   : 2485
    <a6640>   DW_AT_decl_column : 11
    <a6641>   DW_AT_type        : <0x799bc>
    <a6645>   DW_AT_data_member_location: 8
 <2><a6646>: Abbrev Number: 10 (DW_TAG_member)
    <a6647>   DW_AT_name        : (indirect string, offset: 0x67895): read
    <a664b>   DW_AT_decl_file   : 5
    <a664c>   DW_AT_decl_line   : 2486
    <a664e>   DW_AT_decl_column : 11
    <a664f>   DW_AT_type        : <0x799bc>
    <a6653>   DW_AT_data_member_location: 9
 <2><a6654>: Abbrev Number: 10 (DW_TAG_member)
    <a6655>   DW_AT_name        : (indirect string, offset: 0x73d03): write
    <a6659>   DW_AT_decl_file   : 5
    <a665a>   DW_AT_decl_line   : 2487
    <a665c>   DW_AT_decl_column : 11
    <a665d>   DW_AT_type        : <0x799bc>
    <a6661>   DW_AT_data_member_location: 10
 <2><a6662>: Abbrev Number: 10 (DW_TAG_member)
    <a6663>   DW_AT_name        : (indirect string, offset: 0x740ce): lock_read
    <a6667>   DW_AT_decl_file   : 5
    <a6668>   DW_AT_decl_line   : 2488
    <a666a>   DW_AT_decl_column : 11
    <a666b>   DW_AT_type        : <0x799bc>
    <a666f>   DW_AT_data_member_location: 11
 <2><a6670>: Abbrev Number: 10 (DW_TAG_member)
    <a6671>   DW_AT_name        : (indirect string, offset: 0x73cfe): lock_write
    <a6675>   DW_AT_decl_file   : 5
    <a6676>   DW_AT_decl_line   : 2489
    <a6678>   DW_AT_decl_column : 11
    <a6679>   DW_AT_type        : <0x799bc>
    <a667d>   DW_AT_data_member_location: 12
 <2><a667e>: Abbrev Number: 31 (DW_TAG_member)
    <a667f>   DW_AT_name        : pos
    <a6683>   DW_AT_decl_file   : 5
    <a6684>   DW_AT_decl_line   : 2490
    <a6686>   DW_AT_decl_column : 11
    <a6687>   DW_AT_type        : <0x799b0>
    <a668b>   DW_AT_data_member_location: 16
 <2><a668c>: Abbrev Number: 10 (DW_TAG_member)
    <a668d>   DW_AT_name        : (indirect string, offset: 0x6ab18): eof_reached
    <a6691>   DW_AT_decl_file   : 5
    <a6692>   DW_AT_decl_line   : 2491
    <a6694>   DW_AT_decl_column : 11
    <a6695>   DW_AT_type        : <0x799bc>
    <a6699>   DW_AT_data_member_location: 24
 <2><a669a>: Abbrev Number: 10 (DW_TAG_member)
    <a669b>   DW_AT_name        : (indirect string, offset: 0x5f02c): eof_passed
    <a669f>   DW_AT_decl_file   : 5
    <a66a0>   DW_AT_decl_line   : 2492
    <a66a2>   DW_AT_decl_column : 11
    <a66a3>   DW_AT_type        : <0x799bc>
    <a66a7>   DW_AT_data_member_location: 25
 <2><a66a8>: Abbrev Number: 10 (DW_TAG_member)
    <a66a9>   DW_AT_name        : (indirect string, offset: 0x8ec7): fileno
    <a66ad>   DW_AT_decl_file   : 5
    <a66ae>   DW_AT_decl_line   : 2493
    <a66b0>   DW_AT_decl_column : 11
    <a66b1>   DW_AT_type        : <0x7999f>
    <a66b5>   DW_AT_data_member_location: 28
 <2><a66b6>: Abbrev Number: 10 (DW_TAG_member)
    <a66b7>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <a66bb>   DW_AT_decl_file   : 5
    <a66bc>   DW_AT_decl_line   : 2494
    <a66be>   DW_AT_decl_column : 11
    <a66bf>   DW_AT_type        : <0x799bc>
    <a66c3>   DW_AT_data_member_location: 32
 <2><a66c4>: Abbrev Number: 10 (DW_TAG_member)
    <a66c5>   DW_AT_name        : (indirect string, offset: 0x78013): record_length
    <a66c9>   DW_AT_decl_file   : 5
    <a66ca>   DW_AT_decl_line   : 2495
    <a66cc>   DW_AT_decl_column : 11
    <a66cd>   DW_AT_type        : <0x799b0>
    <a66d1>   DW_AT_data_member_location: 40
 <2><a66d2>: Abbrev Number: 10 (DW_TAG_member)
    <a66d3>   DW_AT_name        : (indirect string, offset: 0x7cba1): field_buffer
    <a66d7>   DW_AT_decl_file   : 5
    <a66d8>   DW_AT_decl_line   : 2496
    <a66da>   DW_AT_decl_column : 12
    <a66db>   DW_AT_type        : <0x931d3>
    <a66df>   DW_AT_data_member_location: 48
 <2><a66e0>: Abbrev Number: 10 (DW_TAG_member)
    <a66e1>   DW_AT_name        : (indirect string, offset: 0x7229d): field_strings
    <a66e5>   DW_AT_decl_file   : 5
    <a66e6>   DW_AT_decl_line   : 2497
    <a66e8>   DW_AT_decl_column : 11
    <a66e9>   DW_AT_type        : <0xa67dd>
    <a66ed>   DW_AT_data_member_location: 56
 <2><a66ee>: Abbrev Number: 10 (DW_TAG_member)
    <a66ef>   DW_AT_name        : (indirect string, offset: 0x7075c): field_strings_n
    <a66f3>   DW_AT_decl_file   : 5
    <a66f4>   DW_AT_decl_line   : 2498
    <a66f6>   DW_AT_decl_column : 11
    <a66f7>   DW_AT_type        : <0x7999f>
    <a66fb>   DW_AT_data_member_location: 64
 <2><a66fc>: Abbrev Number: 10 (DW_TAG_member)
    <a66fd>   DW_AT_name        : (indirect string, offset: 0x455ef): column
    <a6701>   DW_AT_decl_file   : 5
    <a6702>   DW_AT_decl_line   : 2499
    <a6704>   DW_AT_decl_column : 11
    <a6705>   DW_AT_type        : <0x799b0>
    <a6709>   DW_AT_data_member_location: 72
 <2><a670a>: Abbrev Number: 10 (DW_TAG_member)
    <a670b>   DW_AT_name        : (indirect string, offset: 0x8c951): file_handle
    <a670f>   DW_AT_decl_file   : 5
    <a6710>   DW_AT_decl_line   : 2501
    <a6712>   DW_AT_decl_column : 14
    <a6713>   DW_AT_type        : <0xa67e2>
    <a6717>   DW_AT_data_member_location: 80
 <2><a6718>: Abbrev Number: 10 (DW_TAG_member)
    <a6719>   DW_AT_name        : (indirect string, offset: 0x67668): file_handle_o
    <a671d>   DW_AT_decl_file   : 5
    <a671e>   DW_AT_decl_line   : 2502
    <a6720>   DW_AT_decl_column : 15
    <a6721>   DW_AT_type        : <0xa67e7>
    <a6725>   DW_AT_data_member_location: 88
 <2><a6726>: Abbrev Number: 10 (DW_TAG_member)
    <a6727>   DW_AT_name        : (indirect string, offset: 0x75114): com_port
    <a672b>   DW_AT_decl_file   : 5
    <a672c>   DW_AT_decl_line   : 2504
    <a672e>   DW_AT_decl_column : 11
    <a672f>   DW_AT_type        : <0x799bc>
    <a6733>   DW_AT_data_member_location: 96
 <2><a6734>: Abbrev Number: 10 (DW_TAG_member)
    <a6735>   DW_AT_name        : (indirect string, offset: 0x6c9bd): com_baud_rate
    <a6739>   DW_AT_decl_file   : 5
    <a673a>   DW_AT_decl_line   : 2505
    <a673c>   DW_AT_decl_column : 11
    <a673d>   DW_AT_type        : <0x7999f>
    <a6741>   DW_AT_data_member_location: 100
 <2><a6742>: Abbrev Number: 10 (DW_TAG_member)
    <a6743>   DW_AT_name        : (indirect string, offset: 0x878de): com_parity
    <a6747>   DW_AT_decl_file   : 5
    <a6748>   DW_AT_decl_line   : 2506
    <a674a>   DW_AT_decl_column : 10
    <a674b>   DW_AT_type        : <0x79987>
    <a674f>   DW_AT_data_member_location: 104
 <2><a6750>: Abbrev Number: 10 (DW_TAG_member)
    <a6751>   DW_AT_name        : (indirect string, offset: 0x60baa): com_data_bits_per_byte
    <a6755>   DW_AT_decl_file   : 5
    <a6756>   DW_AT_decl_line   : 2507
    <a6758>   DW_AT_decl_column : 10
    <a6759>   DW_AT_type        : <0x79987>
    <a675d>   DW_AT_data_member_location: 105
 <2><a675e>: Abbrev Number: 10 (DW_TAG_member)
    <a675f>   DW_AT_name        : (indirect string, offset: 0x78466): com_stop_bits
    <a6763>   DW_AT_decl_file   : 5
    <a6764>   DW_AT_decl_line   : 2508
    <a6766>   DW_AT_decl_column : 10
    <a6767>   DW_AT_type        : <0x79987>
    <a676b>   DW_AT_data_member_location: 106
 <2><a676c>: Abbrev Number: 10 (DW_TAG_member)
    <a676d>   DW_AT_name        : (indirect string, offset: 0x8103a): com_bin_asc
    <a6771>   DW_AT_decl_file   : 5
    <a6772>   DW_AT_decl_line   : 2512
    <a6774>   DW_AT_decl_column : 10
    <a6775>   DW_AT_type        : <0x79987>
    <a6779>   DW_AT_data_member_location: 107
 <2><a677a>: Abbrev Number: 10 (DW_TAG_member)
    <a677b>   DW_AT_name        : (indirect string, offset: 0x76f68): com_asc_lf
    <a677f>   DW_AT_decl_file   : 5
    <a6780>   DW_AT_decl_line   : 2513
    <a6782>   DW_AT_decl_column : 10
    <a6783>   DW_AT_type        : <0x79987>
    <a6787>   DW_AT_data_member_location: 108
 <2><a6788>: Abbrev Number: 10 (DW_TAG_member)
    <a6789>   DW_AT_name        : (indirect string, offset: 0x5f49f): com_rs
    <a678d>   DW_AT_decl_file   : 5
    <a678e>   DW_AT_decl_line   : 2515
    <a6790>   DW_AT_decl_column : 10
    <a6791>   DW_AT_type        : <0x79987>
    <a6795>   DW_AT_data_member_location: 109
 <2><a6796>: Abbrev Number: 10 (DW_TAG_member)
    <a6797>   DW_AT_name        : (indirect string, offset: 0x7817f): com_cd_x
    <a679b>   DW_AT_decl_file   : 5
    <a679c>   DW_AT_decl_line   : 2516
    <a679e>   DW_AT_decl_column : 11
    <a679f>   DW_AT_type        : <0x7999f>
    <a67a3>   DW_AT_data_member_location: 112
 <2><a67a4>: Abbrev Number: 10 (DW_TAG_member)
    <a67a5>   DW_AT_name        : (indirect string, offset: 0x636fa): com_cs_x
    <a67a9>   DW_AT_decl_file   : 5
    <a67aa>   DW_AT_decl_line   : 2517
    <a67ac>   DW_AT_decl_column : 11
    <a67ad>   DW_AT_type        : <0x7999f>
    <a67b1>   DW_AT_data_member_location: 116
 <2><a67b2>: Abbrev Number: 10 (DW_TAG_member)
    <a67b3>   DW_AT_name        : (indirect string, offset: 0x8390a): com_ds_x
    <a67b7>   DW_AT_decl_file   : 5
    <a67b8>   DW_AT_decl_line   : 2518
    <a67ba>   DW_AT_decl_column : 11
    <a67bb>   DW_AT_type        : <0x7999f>
    <a67bf>   DW_AT_data_member_location: 120
 <2><a67c0>: Abbrev Number: 10 (DW_TAG_member)
    <a67c1>   DW_AT_name        : (indirect string, offset: 0x7100a): com_op_x
    <a67c5>   DW_AT_decl_file   : 5
    <a67c6>   DW_AT_decl_line   : 2519
    <a67c8>   DW_AT_decl_column : 11
    <a67c9>   DW_AT_type        : <0x7999f>
    <a67cd>   DW_AT_data_member_location: 124
 <2><a67ce>: Abbrev Number: 10 (DW_TAG_member)
    <a67cf>   DW_AT_name        : (indirect string, offset: 0x737ce): scrn
    <a67d3>   DW_AT_decl_file   : 5
    <a67d4>   DW_AT_decl_line   : 2526
    <a67d6>   DW_AT_decl_column : 11
    <a67d7>   DW_AT_type        : <0x799bc>
    <a67db>   DW_AT_data_member_location: 128
 <2><a67dc>: Abbrev Number: 0
 <1><a67dd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a67de>   DW_AT_byte_size   : 8
    <a67de>   DW_AT_type        : <0x93581>
 <1><a67e2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a67e3>   DW_AT_byte_size   : 8
    <a67e3>   DW_AT_type        : <0x911b4>
 <1><a67e7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a67e8>   DW_AT_byte_size   : 8
    <a67e8>   DW_AT_type        : <0x910e7>
 <1><a67ec>: Abbrev Number: 11 (DW_TAG_variable)
    <a67ed>   DW_AT_name        : (indirect string, offset: 0x7fc2f): gfs_nextid
    <a67f1>   DW_AT_decl_file   : 5
    <a67f2>   DW_AT_decl_line   : 2536
    <a67f4>   DW_AT_decl_column : 7
    <a67f5>   DW_AT_type        : <0x799b0>
    <a67f9>   DW_AT_external    : 1
    <a67f9>   DW_AT_location    : 9 byte block: 3 b0 8d a7 0 0 0 0 0 	(DW_OP_addr: a78db0)
 <1><a6803>: Abbrev Number: 11 (DW_TAG_variable)
    <a6804>   DW_AT_name        : (indirect string, offset: 0x7ace2): gfs_file
    <a6808>   DW_AT_decl_file   : 5
    <a6809>   DW_AT_decl_line   : 2538
    <a680b>   DW_AT_decl_column : 18
    <a680c>   DW_AT_type        : <0xa681a>
    <a6810>   DW_AT_external    : 1
    <a6810>   DW_AT_location    : 9 byte block: 3 a8 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fa8)
 <1><a681a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <a681b>   DW_AT_byte_size   : 8
    <a681b>   DW_AT_type        : <0xa661d>
 <1><a681f>: Abbrev Number: 11 (DW_TAG_variable)
    <a6820>   DW_AT_name        : (indirect string, offset: 0x604c4): gfs_n
    <a6824>   DW_AT_decl_file   : 5
    <a6825>   DW_AT_decl_line   : 2540
    <a6827>   DW_AT_decl_column : 7
    <a6828>   DW_AT_type        : <0x7999f>
    <a682c>   DW_AT_external    : 1
    <a682c>   DW_AT_location    : 9 byte block: 3 b0 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fb0)
 <1><a6836>: Abbrev Number: 11 (DW_TAG_variable)
    <a6837>   DW_AT_name        : (indirect string, offset: 0x7b777): gfs_freed_n
    <a683b>   DW_AT_decl_file   : 5
    <a683c>   DW_AT_decl_line   : 2541
    <a683e>   DW_AT_decl_column : 7
    <a683f>   DW_AT_type        : <0x7999f>
    <a6843>   DW_AT_external    : 1
    <a6843>   DW_AT_location    : 9 byte block: 3 b4 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fb4)
 <1><a684d>: Abbrev Number: 11 (DW_TAG_variable)
    <a684e>   DW_AT_name        : (indirect string, offset: 0x6fb88): gfs_freed
    <a6852>   DW_AT_decl_file   : 5
    <a6853>   DW_AT_decl_line   : 2542
    <a6855>   DW_AT_decl_column : 8
    <a6856>   DW_AT_type        : <0x90051>
    <a685a>   DW_AT_external    : 1
    <a685a>   DW_AT_location    : 9 byte block: 3 b8 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fb8)
 <1><a6864>: Abbrev Number: 11 (DW_TAG_variable)
    <a6865>   DW_AT_name        : (indirect string, offset: 0x748c1): gfs_freed_size
    <a6869>   DW_AT_decl_file   : 5
    <a686a>   DW_AT_decl_line   : 2543
    <a686c>   DW_AT_decl_column : 7
    <a686d>   DW_AT_type        : <0x7999f>
    <a6871>   DW_AT_external    : 1
    <a6871>   DW_AT_location    : 9 byte block: 3 c0 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fc0)
 <1><a687b>: Abbrev Number: 11 (DW_TAG_variable)
    <a687c>   DW_AT_name        : (indirect string, offset: 0x6777a): gfs_fileno
    <a6880>   DW_AT_decl_file   : 5
    <a6881>   DW_AT_decl_line   : 2545
    <a6883>   DW_AT_decl_column : 8
    <a6884>   DW_AT_type        : <0x90051>
    <a6888>   DW_AT_external    : 1
    <a6888>   DW_AT_location    : 9 byte block: 3 c8 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fc8)
 <1><a6892>: Abbrev Number: 11 (DW_TAG_variable)
    <a6893>   DW_AT_name        : (indirect string, offset: 0x651c9): gfs_fileno_n
    <a6897>   DW_AT_decl_file   : 5
    <a6898>   DW_AT_decl_line   : 2546
    <a689a>   DW_AT_decl_column : 7
    <a689b>   DW_AT_type        : <0x7999f>
    <a689f>   DW_AT_external    : 1
    <a689f>   DW_AT_location    : 9 byte block: 3 d0 7f ba 0 0 0 0 0 	(DW_OP_addr: ba7fd0)
 <1><a68a9>: Abbrev Number: 7 (DW_TAG_variable)
    <a68aa>   DW_AT_name        : (indirect string, offset: 0x8ca6f): file_charset8_raw_len
    <a68ae>   DW_AT_decl_file   : 5
    <a68af>   DW_AT_decl_line   : 2548
    <a68b1>   DW_AT_decl_column : 14
    <a68b2>   DW_AT_type        : <0x7999f>
    <a68b6>   DW_AT_location    : 9 byte block: 3 b8 8d a7 0 0 0 0 0 	(DW_OP_addr: a78db8)
 <1><a68c0>: Abbrev Number: 30 (DW_TAG_array_type)
    <a68c1>   DW_AT_type        : <0x799c8>
    <a68c5>   DW_AT_sibling     : <0xa68d1>
 <2><a68c9>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a68ca>   DW_AT_type        : <0x79786>
    <a68ce>   DW_AT_upper_bound : 16383
 <2><a68d0>: Abbrev Number: 0
 <1><a68d1>: Abbrev Number: 27 (DW_TAG_const_type)
    <a68d2>   DW_AT_type        : <0xa68c0>
 <1><a68d6>: Abbrev Number: 7 (DW_TAG_variable)
    <a68d7>   DW_AT_name        : (indirect string, offset: 0x851f4): file_charset8_raw
    <a68db>   DW_AT_decl_file   : 5
    <a68dc>   DW_AT_decl_line   : 2549
    <a68de>   DW_AT_decl_column : 20
    <a68df>   DW_AT_type        : <0xa68d1>
    <a68e3>   DW_AT_location    : 9 byte block: 3 0 88 a1 0 0 0 0 0 	(DW_OP_addr: a18800)
 <1><a68ed>: Abbrev Number: 7 (DW_TAG_variable)
    <a68ee>   DW_AT_name        : (indirect string, offset: 0x6e2f3): file_chrset16_raw_len
    <a68f2>   DW_AT_decl_file   : 5
    <a68f3>   DW_AT_decl_line   : 2597
    <a68f5>   DW_AT_decl_column : 14
    <a68f6>   DW_AT_type        : <0x7999f>
    <a68fa>   DW_AT_location    : 9 byte block: 3 bc 8d a7 0 0 0 0 0 	(DW_OP_addr: a78dbc)
 <1><a6904>: Abbrev Number: 30 (DW_TAG_array_type)
    <a6905>   DW_AT_type        : <0x799c8>
    <a6909>   DW_AT_sibling     : <0xa6915>
 <2><a690d>: Abbrev Number: 54 (DW_TAG_subrange_type)
    <a690e>   DW_AT_type        : <0x79786>
    <a6912>   DW_AT_upper_bound : 32767
 <2><a6914>: Abbrev Number: 0
 <1><a6915>: Abbrev Number: 27 (DW_TAG_const_type)
    <a6916>   DW_AT_type        : <0xa6904>
 <1><a691a>: Abbrev Number: 7 (DW_TAG_variable)
