    <91416>   DW_AT_type        : <0xaaddf>
    <9141a>   DW_AT_artificial  : 1
 <4><9141a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9141b>   DW_AT_type        : <0x7980a>
 <4><9141f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91420>   DW_AT_type        : <0x83ba6>
 <4><91424>: Abbrev Number: 0
 <3><91425>: Abbrev Number: 75 (DW_TAG_subprogram)
    <91426>   DW_AT_external    : 1
    <91426>   DW_AT_name        : (indirect string, offset: 0x7740f): basic_ifstream
    <9142a>   DW_AT_decl_file   : 53
    <9142a>   DW_AT_decl_line   : 523
    <9142c>   DW_AT_decl_column : 7
    <9142c>   DW_AT_linkage_name: (indirect string, offset: 0x6b20a): _ZNSt14basic_ifstreamIcSt11char_traitsIcEEC4Ev
    <91430>   DW_AT_accessibility: 1	(unknown accessibility)
    <91430>   DW_AT_declaration : 1
    <91430>   DW_AT_object_pointer: <0x91438>
    <91434>   DW_AT_sibling     : <0x91448>
 <4><91438>: Abbrev Number: 26 (DW_TAG_formal_parameter)
    <91439>   DW_AT_type        : <0xaaddf>
    <9143d>   DW_AT_artificial  : 1
 <4><9143d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9143e>   DW_AT_type        : <0x7980a>
 <4><91442>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91443>   DW_AT_type        : <0x83ba6>
 <4><91447>: Abbrev Number: 0
 <3><91448>: Abbrev Number: 62 (DW_TAG_template_type_param)
    <91449>   DW_AT_name        : (indirect string, offset: 0x77731): _CharT
    <9144d>   DW_AT_type        : <0x7996f>

    <9197f>   DW_AT_import      : <0x90220>	[Abbrev Number: 70 (DW_TAG_subprogram)]
 <1><91983>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91984>   DW_AT_decl_file   : 58
    <91985>   DW_AT_decl_line   : 55
    <91986>   DW_AT_decl_column : 12
    <91987>   DW_AT_import      : <0x9159d>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><9198b>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <9198c>   DW_AT_decl_file   : 58
    <9198d>   DW_AT_decl_line   : 56
    <9198e>   DW_AT_decl_column : 12
    <9198f>   DW_AT_import      : <0x915b3>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><91993>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91994>   DW_AT_decl_file   : 58
    <91995>   DW_AT_decl_line   : 57
    <91996>   DW_AT_decl_column : 12
    <91997>   DW_AT_import      : <0x915c9>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><9199b>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <9199c>   DW_AT_decl_file   : 58
    <9199d>   DW_AT_decl_line   : 58
    <9199e>   DW_AT_decl_column : 12
    <9199f>   DW_AT_import      : <0x915df>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919a3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919a4>   DW_AT_decl_file   : 58
    <919a5>   DW_AT_decl_line   : 60
    <919a6>   DW_AT_decl_column : 12
    <919a7>   DW_AT_import      : <0x9181c>	[Abbrev Number: 70 (DW_TAG_subprogram)]
 <1><919ab>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919ac>   DW_AT_decl_file   : 58
    <919ad>   DW_AT_decl_line   : 60
    <919ae>   DW_AT_decl_column : 12
    <919af>   DW_AT_import      : <0x90239>	[Abbrev Number: 70 (DW_TAG_subprogram)]
 <1><919b3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919b4>   DW_AT_decl_file   : 58
    <919b5>   DW_AT_decl_line   : 60
    <919b6>   DW_AT_decl_column : 12
    <919b7>   DW_AT_import      : <0x9160a>	[Abbrev Number: 166 (DW_TAG_subprogram)]
 <1><919bb>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919bc>   DW_AT_decl_file   : 58
    <919bd>   DW_AT_decl_line   : 62
    <919be>   DW_AT_decl_column : 12
    <919bf>   DW_AT_import      : <0x91627>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919c3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919c4>   DW_AT_decl_file   : 58
    <919c5>   DW_AT_decl_line   : 64
    <919c6>   DW_AT_decl_column : 12
    <919c7>   DW_AT_import      : <0x9163e>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919cb>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919cc>   DW_AT_decl_file   : 58
    <919cd>   DW_AT_decl_line   : 67
    <919ce>   DW_AT_decl_column : 12
    <919cf>   DW_AT_import      : <0x9165a>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919d3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919d4>   DW_AT_decl_file   : 58
    <919d5>   DW_AT_decl_line   : 68
    <919d6>   DW_AT_decl_column : 12
    <919d7>   DW_AT_import      : <0x91676>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919db>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919dc>   DW_AT_decl_file   : 58
    <919dd>   DW_AT_decl_line   : 69
    <919de>   DW_AT_decl_column : 12
    <919df>   DW_AT_import      : <0x916a8>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><919e3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919e4>   DW_AT_decl_file   : 58
    <919e5>   DW_AT_decl_line   : 71
    <919e6>   DW_AT_decl_column : 12
    <919e7>   DW_AT_import      : <0x916c9>	[Abbrev Number: 32 (DW_TAG_subprogram)]
 <1><919eb>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919ec>   DW_AT_decl_file   : 58
    <919ed>   DW_AT_decl_line   : 72
    <919ee>   DW_AT_decl_column : 12
    <919ef>   DW_AT_import      : <0x916fd>	[Abbrev Number: 89 (DW_TAG_subprogram)]
 <1><919f3>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919f4>   DW_AT_decl_file   : 58
    <919f5>   DW_AT_decl_line   : 74
    <919f6>   DW_AT_decl_column : 12
    <919f7>   DW_AT_import      : <0x9170a>	[Abbrev Number: 32 (DW_TAG_subprogram)]
 <1><919fb>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <919fc>   DW_AT_decl_file   : 58
    <919fd>   DW_AT_decl_line   : 75
    <919fe>   DW_AT_decl_column : 12
    <919ff>   DW_AT_import      : <0x9171d>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><91a03>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91a04>   DW_AT_decl_file   : 58
    <91a05>   DW_AT_decl_line   : 76
    <91a06>   DW_AT_decl_column : 12
    <91a07>   DW_AT_import      : <0x9173d>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><91a0b>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91a0c>   DW_AT_decl_file   : 58
    <91a0d>   DW_AT_decl_line   : 77
    <91a0e>   DW_AT_decl_column : 12
    <91a0f>   DW_AT_import      : <0x9175d>	[Abbrev Number: 29 (DW_TAG_subprogram)]
 <1><91a13>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91a14>   DW_AT_decl_file   : 58
    <91a15>   DW_AT_decl_line   : 78
    <91a16>   DW_AT_decl_column : 12
    <91a17>   DW_AT_import      : <0x9177d>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><91a1b>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91a1c>   DW_AT_decl_file   : 58
    <91a1d>   DW_AT_decl_line   : 80
    <91a1e>   DW_AT_decl_column : 12
    <91a1f>   DW_AT_import      : <0x91794>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><91a23>: Abbrev Number: 19 (DW_TAG_imported_declaration)
    <91a24>   DW_AT_decl_file   : 58
    <91a25>   DW_AT_decl_line   : 81
    <91a26>   DW_AT_decl_column : 12
    <91a27>   DW_AT_import      : <0x917ba>	[Abbrev Number: 23 (DW_TAG_subprogram)]
 <1><91a2b>: Abbrev Number: 169 (DW_TAG_structure_type)
    <91a2d>   DW_AT_name        : (indirect string, offset: 0x52c51): typedef __va_list_tag __va_list_tag
    <91a31>   DW_AT_byte_size   : 24
    <91a32>   DW_AT_decl_file   : 59
    <91a33>   DW_AT_decl_line   : 0
    <91a34>   DW_AT_sibling     : <0x91a61>
 <2><91a38>: Abbrev Number: 106 (DW_TAG_member)
    <91a39>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <91a3d>   DW_AT_decl_file   : 59
    <91a3d>   DW_AT_decl_line   : 0
    <91a3d>   DW_AT_type        : <0x797b4>
    <91a41>   DW_AT_data_member_location: 0
 <2><91a42>: Abbrev Number: 106 (DW_TAG_member)
    <91a43>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <91a47>   DW_AT_decl_file   : 59
    <91a47>   DW_AT_decl_line   : 0
    <91a47>   DW_AT_type        : <0x797b4>
    <91a4b>   DW_AT_data_member_location: 4
 <2><91a4c>: Abbrev Number: 106 (DW_TAG_member)
    <91a4d>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <91a51>   DW_AT_decl_file   : 59
    <91a51>   DW_AT_decl_line   : 0
    <91a51>   DW_AT_type        : <0x79937>
    <91a55>   DW_AT_data_member_location: 8
 <2><91a56>: Abbrev Number: 106 (DW_TAG_member)
    <91a57>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <91a5b>   DW_AT_decl_file   : 59
    <91a5b>   DW_AT_decl_line   : 0
    <91a5b>   DW_AT_type        : <0x79937>
    <91a5f>   DW_AT_data_member_location: 16
 <2><91a60>: Abbrev Number: 0
 <1><91a61>: Abbrev Number: 91 (DW_TAG_structure_type)
    <91a62>   DW_AT_byte_size   : 8
    <91a63>   DW_AT_decl_file   : 60
    <91a64>   DW_AT_decl_line   : 14
    <91a65>   DW_AT_decl_column : 1
    <91a66>   DW_AT_linkage_name: (indirect string, offset: 0x28a9f): 11__mbstate_t
    <91a6a>   DW_AT_sibling     : <0x91aac>
 <2><91a6e>: Abbrev Number: 128 (DW_TAG_union_type)
    <91a70>   DW_AT_byte_size   : 4
    <91a71>   DW_AT_decl_file   : 60
    <91a72>   DW_AT_decl_line   : 17
    <91a73>   DW_AT_decl_column : 3
    <91a74>   DW_AT_sibling     : <0x91a91>
 <3><91a78>: Abbrev Number: 68 (DW_TAG_member)
    <91a79>   DW_AT_name        : (indirect string, offset: 0x4e68d): __wch
    <91a7d>   DW_AT_decl_file   : 60
    <91a7e>   DW_AT_decl_line   : 18
    <91a7f>   DW_AT_decl_column : 19
    <91a80>   DW_AT_type        : <0x797b4>
 <3><91a84>: Abbrev Number: 68 (DW_TAG_member)
    <91a85>   DW_AT_name        : (indirect string, offset: 0x4d8c7): __wchb
    <91a89>   DW_AT_decl_file   : 60
    <91a8a>   DW_AT_decl_line   : 19
    <91a8b>   DW_AT_decl_column : 10
    <91a8c>   DW_AT_type        : <0x8ff8c>
 <3><91a90>: Abbrev Number: 0
 <2><91a91>: Abbrev Number: 18 (DW_TAG_member)
    <91a92>   DW_AT_name        : (indirect string, offset: 0x17222): __count
    <91a96>   DW_AT_decl_file   : 60
    <91a97>   DW_AT_decl_line   : 15
    <91a98>   DW_AT_decl_column : 7
    <91a99>   DW_AT_type        : <0x7980a>
    <91a9d>   DW_AT_data_member_location: 0
 <2><91a9e>: Abbrev Number: 18 (DW_TAG_member)
    <91a9f>   DW_AT_name        : (indirect string, offset: 0x50fcc): __value
    <91aa3>   DW_AT_decl_file   : 60
    <91aa4>   DW_AT_decl_line   : 20
    <91aa5>   DW_AT_decl_column : 5
    <91aa6>   DW_AT_type        : <0x91a6e>
    <91aaa>   DW_AT_data_member_location: 4
 <2><91aab>: Abbrev Number: 0
 <1><91aac>: Abbrev Number: 22 (DW_TAG_typedef)
    <91aad>   DW_AT_name        : (indirect string, offset: 0x28aa1): __mbstate_t
    <91ab1>   DW_AT_decl_file   : 60
    <91ab2>   DW_AT_decl_line   : 21
    <91ab3>   DW_AT_decl_column : 3
    <91ab4>   DW_AT_type        : <0x91a61>
 <1><91ab8>: Abbrev Number: 53 (DW_TAG_structure_type)
    <91ab9>   DW_AT_name        : (indirect string, offset: 0x25edd): _G_fpos_t
    <91abd>   DW_AT_byte_size   : 16
    <91abe>   DW_AT_decl_file   : 61
    <91abf>   DW_AT_decl_line   : 10
    <91ac0>   DW_AT_decl_column : 16
    <91ac1>   DW_AT_sibling     : <0x91ae0>
 <2><91ac5>: Abbrev Number: 18 (DW_TAG_member)
    <91ac6>   DW_AT_name        : (indirect string, offset: 0x22e36): __pos
    <91aca>   DW_AT_decl_file   : 61
    <91acb>   DW_AT_decl_line   : 12
    <91acc>   DW_AT_decl_column : 11
    <91acd>   DW_AT_type        : <0x798fb>
    <91ad1>   DW_AT_data_member_location: 0
 <2><91ad2>: Abbrev Number: 18 (DW_TAG_member)
    <91ad3>   DW_AT_name        : (indirect string, offset: 0x3ed48): __state
    <91ad7>   DW_AT_decl_file   : 61
    <91ad8>   DW_AT_decl_line   : 13
    <91ad9>   DW_AT_decl_column : 15
    <91ada>   DW_AT_type        : <0x91aac>
    <91ade>   DW_AT_data_member_location: 8
 <2><91adf>: Abbrev Number: 0
 <1><91ae0>: Abbrev Number: 22 (DW_TAG_typedef)
    <91ae1>   DW_AT_name        : (indirect string, offset: 0x4a342): __fpos_t
    <91ae5>   DW_AT_decl_file   : 61
    <91ae6>   DW_AT_decl_line   : 14
    <91ae7>   DW_AT_decl_column : 3
    <91ae8>   DW_AT_type        : <0x91ab8>
 <1><91aec>: Abbrev Number: 22 (DW_TAG_typedef)
    <91aed>   DW_AT_name        : (indirect string, offset: 0x868d): __FILE
    <91af1>   DW_AT_decl_file   : 62
    <91af2>   DW_AT_decl_line   : 5
    <91af3>   DW_AT_decl_column : 25
    <91af4>   DW_AT_type        : <0x91af8>
 <1><91af8>: Abbrev Number: 53 (DW_TAG_structure_type)
    <91af9>   DW_AT_name        : (indirect string, offset: 0x59af): _IO_FILE
    <91afd>   DW_AT_byte_size   : 216
    <91afe>   DW_AT_decl_file   : 63
    <91aff>   DW_AT_decl_line   : 49
    <91b00>   DW_AT_decl_column : 8
    <91b01>   DW_AT_sibling     : <0x91c7f>
 <2><91b05>: Abbrev Number: 18 (DW_TAG_member)
    <91b06>   DW_AT_name        : (indirect string, offset: 0x4e5de): _flags
    <91b0a>   DW_AT_decl_file   : 63
    <91b0b>   DW_AT_decl_line   : 51
    <91b0c>   DW_AT_decl_column : 7
    <91b0d>   DW_AT_type        : <0x7980a>
    <91b11>   DW_AT_data_member_location: 0
 <2><91b12>: Abbrev Number: 18 (DW_TAG_member)
    <91b13>   DW_AT_name        : (indirect string, offset: 0x3570a): _IO_read_ptr
    <91b17>   DW_AT_decl_file   : 63
    <91b18>   DW_AT_decl_line   : 54
    <91b19>   DW_AT_decl_column : 9
    <91b1a>   DW_AT_type        : <0x7996a>
    <91b1e>   DW_AT_data_member_location: 8
 <2><91b1f>: Abbrev Number: 18 (DW_TAG_member)
    <91b20>   DW_AT_name        : (indirect string, offset: 0x4c222): _IO_read_end
    <91b24>   DW_AT_decl_file   : 63
    <91b25>   DW_AT_decl_line   : 55
    <91b26>   DW_AT_decl_column : 9
    <91b27>   DW_AT_type        : <0x7996a>
    <91b2b>   DW_AT_data_member_location: 16
 <2><91b2c>: Abbrev Number: 18 (DW_TAG_member)
    <91b2d>   DW_AT_name        : (indirect string, offset: 0x31ac7): _IO_read_base
    <91b31>   DW_AT_decl_file   : 63
    <91b32>   DW_AT_decl_line   : 56
    <91b33>   DW_AT_decl_column : 9
    <91b34>   DW_AT_type        : <0x7996a>
    <91b38>   DW_AT_data_member_location: 24
 <2><91b39>: Abbrev Number: 18 (DW_TAG_member)
    <91b3a>   DW_AT_name        : (indirect string, offset: 0x42c55): _IO_write_base
    <91b3e>   DW_AT_decl_file   : 63
    <91b3f>   DW_AT_decl_line   : 57
    <91b40>   DW_AT_decl_column : 9
    <91b41>   DW_AT_type        : <0x7996a>
    <91b45>   DW_AT_data_member_location: 32
 <2><91b46>: Abbrev Number: 18 (DW_TAG_member)
    <91b47>   DW_AT_name        : (indirect string, offset: 0x34886): _IO_write_ptr
    <91b4b>   DW_AT_decl_file   : 63
    <91b4c>   DW_AT_decl_line   : 58
    <91b4d>   DW_AT_decl_column : 9
    <91b4e>   DW_AT_type        : <0x7996a>
    <91b52>   DW_AT_data_member_location: 40
 <2><91b53>: Abbrev Number: 18 (DW_TAG_member)
    <91b54>   DW_AT_name        : (indirect string, offset: 0x4ae61): _IO_write_end
    <91b58>   DW_AT_decl_file   : 63
    <91b59>   DW_AT_decl_line   : 59
    <91b5a>   DW_AT_decl_column : 9
    <91b5b>   DW_AT_type        : <0x7996a>
    <91b5f>   DW_AT_data_member_location: 48
 <2><91b60>: Abbrev Number: 18 (DW_TAG_member)
    <91b61>   DW_AT_name        : (indirect string, offset: 0x1ba0b): _IO_buf_base
    <91b65>   DW_AT_decl_file   : 63
    <91b66>   DW_AT_decl_line   : 60
    <91b67>   DW_AT_decl_column : 9
    <91b68>   DW_AT_type        : <0x7996a>
    <91b6c>   DW_AT_data_member_location: 56
 <2><91b6d>: Abbrev Number: 18 (DW_TAG_member)
    <91b6e>   DW_AT_name        : (indirect string, offset: 0x256c0): _IO_buf_end
    <91b72>   DW_AT_decl_file   : 63
    <91b73>   DW_AT_decl_line   : 61
    <91b74>   DW_AT_decl_column : 9
    <91b75>   DW_AT_type        : <0x7996a>
    <91b79>   DW_AT_data_member_location: 64
 <2><91b7a>: Abbrev Number: 18 (DW_TAG_member)
    <91b7b>   DW_AT_name        : (indirect string, offset: 0x3c689): _IO_save_base
    <91b7f>   DW_AT_decl_file   : 63
    <91b80>   DW_AT_decl_line   : 64
    <91b81>   DW_AT_decl_column : 9
    <91b82>   DW_AT_type        : <0x7996a>
    <91b86>   DW_AT_data_member_location: 72
 <2><91b87>: Abbrev Number: 18 (DW_TAG_member)
    <91b88>   DW_AT_name        : (indirect string, offset: 0x3ce9e): _IO_backup_base
    <91b8c>   DW_AT_decl_file   : 63
    <91b8d>   DW_AT_decl_line   : 65
    <91b8e>   DW_AT_decl_column : 9
    <91b8f>   DW_AT_type        : <0x7996a>
    <91b93>   DW_AT_data_member_location: 80
 <2><91b94>: Abbrev Number: 18 (DW_TAG_member)
    <91b95>   DW_AT_name        : (indirect string, offset: 0x42ac8): _IO_save_end
    <91b99>   DW_AT_decl_file   : 63
    <91b9a>   DW_AT_decl_line   : 66
    <91b9b>   DW_AT_decl_column : 9
    <91b9c>   DW_AT_type        : <0x7996a>
    <91ba0>   DW_AT_data_member_location: 88
 <2><91ba1>: Abbrev Number: 18 (DW_TAG_member)
    <91ba2>   DW_AT_name        : (indirect string, offset: 0x489b4): _markers
    <91ba6>   DW_AT_decl_file   : 63
    <91ba7>   DW_AT_decl_line   : 68
    <91ba8>   DW_AT_decl_column : 22
    <91ba9>   DW_AT_type        : <0x91c99>
    <91bad>   DW_AT_data_member_location: 96
 <2><91bae>: Abbrev Number: 18 (DW_TAG_member)
    <91baf>   DW_AT_name        : (indirect string, offset: 0x299f0): _chain
    <91bb3>   DW_AT_decl_file   : 63
    <91bb4>   DW_AT_decl_line   : 70
    <91bb5>   DW_AT_decl_column : 20
    <91bb6>   DW_AT_type        : <0x91c9e>
    <91bba>   DW_AT_data_member_location: 104
 <2><91bbb>: Abbrev Number: 18 (DW_TAG_member)
    <91bbc>   DW_AT_name        : (indirect string, offset: 0x8ec6): _fileno
    <91bc0>   DW_AT_decl_file   : 63
    <91bc1>   DW_AT_decl_line   : 72
    <91bc2>   DW_AT_decl_column : 7
    <91bc3>   DW_AT_type        : <0x7980a>
    <91bc7>   DW_AT_data_member_location: 112
 <2><91bc8>: Abbrev Number: 18 (DW_TAG_member)
    <91bc9>   DW_AT_name        : (indirect string, offset: 0x569c1): _flags2
    <91bcd>   DW_AT_decl_file   : 63
    <91bce>   DW_AT_decl_line   : 73
    <91bcf>   DW_AT_decl_column : 7
    <91bd0>   DW_AT_type        : <0x7980a>
    <91bd4>   DW_AT_data_member_location: 116
 <2><91bd5>: Abbrev Number: 18 (DW_TAG_member)
    <91bd6>   DW_AT_name        : (indirect string, offset: 0x356da): _old_offset
    <91bda>   DW_AT_decl_file   : 63
    <91bdb>   DW_AT_decl_line   : 74
    <91bdc>   DW_AT_decl_column : 11
    <91bdd>   DW_AT_type        : <0x798fb>
    <91be1>   DW_AT_data_member_location: 120
 <2><91be2>: Abbrev Number: 18 (DW_TAG_member)
    <91be3>   DW_AT_name        : (indirect string, offset: 0x455ea): _cur_column
    <91be7>   DW_AT_decl_file   : 63
    <91be8>   DW_AT_decl_line   : 77
    <91be9>   DW_AT_decl_column : 18
    <91bea>   DW_AT_type        : <0x797ad>
    <91bee>   DW_AT_data_member_location: 128
 <2><91bef>: Abbrev Number: 18 (DW_TAG_member)
    <91bf0>   DW_AT_name        : (indirect string, offset: 0xda5b): _vtable_offset
    <91bf4>   DW_AT_decl_file   : 63
    <91bf5>   DW_AT_decl_line   : 78
    <91bf6>   DW_AT_decl_column : 15
    <91bf7>   DW_AT_type        : <0x797c7>
    <91bfb>   DW_AT_data_member_location: 130
 <2><91bfc>: Abbrev Number: 18 (DW_TAG_member)
    <91bfd>   DW_AT_name        : (indirect string, offset: 0x3d7c2): _shortbuf
    <91c01>   DW_AT_decl_file   : 63
    <91c02>   DW_AT_decl_line   : 79
    <91c03>   DW_AT_decl_column : 8
    <91c04>   DW_AT_type        : <0x91ca3>
    <91c08>   DW_AT_data_member_location: 131
 <2><91c09>: Abbrev Number: 18 (DW_TAG_member)
    <91c0a>   DW_AT_name        : (indirect string, offset: 0x61f5e): _lock
    <91c0e>   DW_AT_decl_file   : 63
    <91c0f>   DW_AT_decl_line   : 81
    <91c10>   DW_AT_decl_column : 15
    <91c11>   DW_AT_type        : <0x91cb3>
    <91c15>   DW_AT_data_member_location: 136
 <2><91c16>: Abbrev Number: 18 (DW_TAG_member)
    <91c17>   DW_AT_name        : (indirect string, offset: 0x7c0cf): _offset
    <91c1b>   DW_AT_decl_file   : 63
    <91c1c>   DW_AT_decl_line   : 89
    <91c1d>   DW_AT_decl_column : 13
    <91c1e>   DW_AT_type        : <0x79907>
    <91c22>   DW_AT_data_member_location: 144
 <2><91c23>: Abbrev Number: 18 (DW_TAG_member)
    <91c24>   DW_AT_name        : (indirect string, offset: 0x522dd): _codecvt
    <91c28>   DW_AT_decl_file   : 63
    <91c29>   DW_AT_decl_line   : 91
    <91c2a>   DW_AT_decl_column : 23
    <91c2b>   DW_AT_type        : <0x91cbd>
    <91c2f>   DW_AT_data_member_location: 152
 <2><91c30>: Abbrev Number: 18 (DW_TAG_member)
    <91c31>   DW_AT_name        : (indirect string, offset: 0xdef4): _wide_data
    <91c35>   DW_AT_decl_file   : 63
    <91c36>   DW_AT_decl_line   : 92
    <91c37>   DW_AT_decl_column : 25
    <91c38>   DW_AT_type        : <0x91cc7>
    <91c3c>   DW_AT_data_member_location: 160
 <2><91c3d>: Abbrev Number: 18 (DW_TAG_member)
    <91c3e>   DW_AT_name        : (indirect string, offset: 0x57dac): _freeres_list
    <91c42>   DW_AT_decl_file   : 63
    <91c43>   DW_AT_decl_line   : 93
    <91c44>   DW_AT_decl_column : 20
    <91c45>   DW_AT_type        : <0x91c9e>
    <91c49>   DW_AT_data_member_location: 168
 <2><91c4a>: Abbrev Number: 18 (DW_TAG_member)
    <91c4b>   DW_AT_name        : (indirect string, offset: 0x591d6): _freeres_buf
    <91c4f>   DW_AT_decl_file   : 63
    <91c50>   DW_AT_decl_line   : 94
    <91c51>   DW_AT_decl_column : 9
    <91c52>   DW_AT_type        : <0x79937>
    <91c56>   DW_AT_data_member_location: 176
 <2><91c57>: Abbrev Number: 18 (DW_TAG_member)
    <91c58>   DW_AT_name        : (indirect string, offset: 0x34234): __pad5
    <91c5c>   DW_AT_decl_file   : 63
    <91c5d>   DW_AT_decl_line   : 95
    <91c5e>   DW_AT_decl_column : 10
    <91c5f>   DW_AT_type        : <0x7977a>
    <91c63>   DW_AT_data_member_location: 184
 <2><91c64>: Abbrev Number: 18 (DW_TAG_member)
    <91c65>   DW_AT_name        : (indirect string, offset: 0x7e617): _mode
    <91c69>   DW_AT_decl_file   : 63
    <91c6a>   DW_AT_decl_line   : 96
    <91c6b>   DW_AT_decl_column : 7
    <91c6c>   DW_AT_type        : <0x7980a>
    <91c70>   DW_AT_data_member_location: 192
 <2><91c71>: Abbrev Number: 18 (DW_TAG_member)
    <91c72>   DW_AT_name        : (indirect string, offset: 0x217fe): _unused2
    <91c76>   DW_AT_decl_file   : 63
    <91c77>   DW_AT_decl_line   : 98
    <91c78>   DW_AT_decl_column : 8
    <91c79>   DW_AT_type        : <0x91ccc>
    <91c7d>   DW_AT_data_member_location: 196
 <2><91c7e>: Abbrev Number: 0
 <1><91c7f>: Abbrev Number: 22 (DW_TAG_typedef)
    <91c80>   DW_AT_name        : (indirect string, offset: 0x5ccf1): FILE
    <91c84>   DW_AT_decl_file   : 64
    <91c85>   DW_AT_decl_line   : 7
    <91c86>   DW_AT_decl_column : 25
    <91c87>   DW_AT_type        : <0x91af8>
 <1><91c8b>: Abbrev Number: 170 (DW_TAG_typedef)
    <91c8d>   DW_AT_name        : (indirect string, offset: 0x5cafc): _IO_lock_t
    <91c91>   DW_AT_decl_file   : 63
    <91c92>   DW_AT_decl_line   : 43
    <91c93>   DW_AT_decl_column : 14
 <1><91c94>: Abbrev Number: 58 (DW_TAG_structure_type)
    <91c95>   DW_AT_name        : (indirect string, offset: 0xa74b): _IO_marker
    <91c99>   DW_AT_declaration : 1
 <1><91c99>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91c9a>   DW_AT_byte_size   : 8
    <91c9a>   DW_AT_type        : <0x91c94>
 <1><91c9e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91c9f>   DW_AT_byte_size   : 8
    <91c9f>   DW_AT_type        : <0x91af8>
 <1><91ca3>: Abbrev Number: 30 (DW_TAG_array_type)
    <91ca4>   DW_AT_type        : <0x7996f>
    <91ca8>   DW_AT_sibling     : <0x91cb3>
 <2><91cac>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <91cad>   DW_AT_type        : <0x79786>
    <91cb1>   DW_AT_upper_bound : 0
 <2><91cb2>: Abbrev Number: 0
 <1><91cb3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91cb4>   DW_AT_byte_size   : 8
    <91cb4>   DW_AT_type        : <0x91c8b>
 <1><91cb8>: Abbrev Number: 58 (DW_TAG_structure_type)
    <91cb9>   DW_AT_name        : (indirect string, offset: 0x522da): _IO_codecvt
    <91cbd>   DW_AT_declaration : 1
 <1><91cbd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91cbe>   DW_AT_byte_size   : 8
    <91cbe>   DW_AT_type        : <0x91cb8>
 <1><91cc2>: Abbrev Number: 58 (DW_TAG_structure_type)
    <91cc3>   DW_AT_name        : (indirect string, offset: 0xdef1): _IO_wide_data
    <91cc7>   DW_AT_declaration : 1
 <1><91cc7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91cc8>   DW_AT_byte_size   : 8
    <91cc8>   DW_AT_type        : <0x91cc2>
 <1><91ccc>: Abbrev Number: 30 (DW_TAG_array_type)
    <91ccd>   DW_AT_type        : <0x7996f>
    <91cd1>   DW_AT_sibling     : <0x91cdc>
 <2><91cd5>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <91cd6>   DW_AT_type        : <0x79786>
    <91cda>   DW_AT_upper_bound : 19
 <2><91cdb>: Abbrev Number: 0
 <1><91cdc>: Abbrev Number: 22 (DW_TAG_typedef)
    <91cdd>   DW_AT_name        : (indirect string, offset: 0x25ee0): fpos_t
    <91ce1>   DW_AT_decl_file   : 65
    <91ce2>   DW_AT_decl_line   : 84
    <91ce3>   DW_AT_decl_column : 18
    <91ce4>   DW_AT_type        : <0x91ae0>
 <1><91ce8>: Abbrev Number: 27 (DW_TAG_const_type)
    <91ce9>   DW_AT_type        : <0x91cdc>
 <1><91ced>: Abbrev Number: 56 (DW_TAG_variable)
    <91cee>   DW_AT_name        : (indirect string, offset: 0x70a26): stdin
    <91cf2>   DW_AT_decl_file   : 65
    <91cf3>   DW_AT_decl_line   : 137
    <91cf4>   DW_AT_decl_column : 14
    <91cf5>   DW_AT_type        : <0x91cf9>
    <91cf9>   DW_AT_external    : 1
    <91cf9>   DW_AT_declaration : 1
 <1><91cf9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91cfa>   DW_AT_byte_size   : 8
    <91cfa>   DW_AT_type        : <0x91c7f>
 <1><91cfe>: Abbrev Number: 50 (DW_TAG_base_type)
    <91cff>   DW_AT_byte_size   : 1
    <91d00>   DW_AT_encoding    : 2	(boolean)
    <91d01>   DW_AT_name        : (indirect string, offset: 0x23d58): bool
 <1><91d05>: Abbrev Number: 22 (DW_TAG_typedef)
    <91d06>   DW_AT_name        : (indirect string, offset: 0x2ac55): float_t
    <91d0a>   DW_AT_decl_file   : 66
    <91d0b>   DW_AT_decl_line   : 149
    <91d0c>   DW_AT_decl_column : 15
    <91d0d>   DW_AT_type        : <0x79ba2>
 <1><91d11>: Abbrev Number: 22 (DW_TAG_typedef)
    <91d12>   DW_AT_name        : (indirect string, offset: 0x3962f): double_t
    <91d16>   DW_AT_decl_file   : 66
    <91d17>   DW_AT_decl_line   : 150
    <91d18>   DW_AT_decl_column : 16
    <91d19>   DW_AT_type        : <0x79bcd>
 <1><91d1d>: Abbrev Number: 50 (DW_TAG_base_type)
    <91d1e>   DW_AT_byte_size   : 16
    <91d1f>   DW_AT_encoding    : 7	(unsigned)
    <91d20>   DW_AT_name        : (indirect string, offset: 0x2a9fc): __int128 unsigned
 <1><91d24>: Abbrev Number: 50 (DW_TAG_base_type)
    <91d25>   DW_AT_byte_size   : 2
    <91d26>   DW_AT_encoding    : 16	(unicode string)
    <91d27>   DW_AT_name        : (indirect string, offset: 0x8674): char16_t
 <1><91d2b>: Abbrev Number: 50 (DW_TAG_base_type)
    <91d2c>   DW_AT_byte_size   : 4
    <91d2d>   DW_AT_encoding    : 16	(unicode string)
    <91d2e>   DW_AT_name        : (indirect string, offset: 0x425f2): char32_t
 <1><91d32>: Abbrev Number: 121 (DW_TAG_namespace)
    <91d33>   DW_AT_name        : (indirect string, offset: 0x10b8b): __gnu_debug
    <91d37>   DW_AT_decl_file   : 41
    <91d38>   DW_AT_decl_line   : 56
    <91d39>   DW_AT_decl_column : 11
    <91d3a>   DW_AT_sibling     : <0x91d48>
 <2><91d3e>: Abbrev Number: 129 (DW_TAG_imported_module)
    <91d40>   DW_AT_decl_file   : 41
    <91d41>   DW_AT_decl_line   : 58
    <91d42>   DW_AT_decl_column : 24
    <91d43>   DW_AT_import      : <0x902b0>	[Abbrev Number: 120 (DW_TAG_namespace)]
 <2><91d47>: Abbrev Number: 0
 <1><91d48>: Abbrev Number: 130 (DW_TAG_structure_type)
    <91d4a>   DW_AT_name        : tm
    <91d4d>   DW_AT_byte_size   : 56
    <91d4d>   DW_AT_decl_file   : 67
    <91d4e>   DW_AT_decl_line   : 7
    <91d4f>   DW_AT_decl_column : 8
    <91d50>   DW_AT_sibling     : <0x91de4>
 <2><91d54>: Abbrev Number: 18 (DW_TAG_member)
    <91d55>   DW_AT_name        : (indirect string, offset: 0x1878e): tm_sec
    <91d59>   DW_AT_decl_file   : 67
    <91d5a>   DW_AT_decl_line   : 9
    <91d5b>   DW_AT_decl_column : 7
    <91d5c>   DW_AT_type        : <0x7980a>
    <91d60>   DW_AT_data_member_location: 0
 <2><91d61>: Abbrev Number: 18 (DW_TAG_member)
    <91d62>   DW_AT_name        : (indirect string, offset: 0x504c1): tm_min
    <91d66>   DW_AT_decl_file   : 67
    <91d67>   DW_AT_decl_line   : 10
    <91d68>   DW_AT_decl_column : 7
    <91d69>   DW_AT_type        : <0x7980a>
    <91d6d>   DW_AT_data_member_location: 4
 <2><91d6e>: Abbrev Number: 18 (DW_TAG_member)
    <91d6f>   DW_AT_name        : (indirect string, offset: 0x3368c): tm_hour
    <91d73>   DW_AT_decl_file   : 67
    <91d74>   DW_AT_decl_line   : 11
    <91d75>   DW_AT_decl_column : 7
    <91d76>   DW_AT_type        : <0x7980a>
    <91d7a>   DW_AT_data_member_location: 8
 <2><91d7b>: Abbrev Number: 18 (DW_TAG_member)
    <91d7c>   DW_AT_name        : (indirect string, offset: 0x443d0): tm_mday
    <91d80>   DW_AT_decl_file   : 67
    <91d81>   DW_AT_decl_line   : 12
    <91d82>   DW_AT_decl_column : 7
    <91d83>   DW_AT_type        : <0x7980a>
    <91d87>   DW_AT_data_member_location: 12
 <2><91d88>: Abbrev Number: 18 (DW_TAG_member)
    <91d89>   DW_AT_name        : (indirect string, offset: 0x50e2c): tm_mon
    <91d8d>   DW_AT_decl_file   : 67
    <91d8e>   DW_AT_decl_line   : 13
    <91d8f>   DW_AT_decl_column : 7
    <91d90>   DW_AT_type        : <0x7980a>
    <91d94>   DW_AT_data_member_location: 16
 <2><91d95>: Abbrev Number: 18 (DW_TAG_member)
    <91d96>   DW_AT_name        : (indirect string, offset: 0x52300): tm_year
    <91d9a>   DW_AT_decl_file   : 67
    <91d9b>   DW_AT_decl_line   : 14
    <91d9c>   DW_AT_decl_column : 7
    <91d9d>   DW_AT_type        : <0x7980a>
    <91da1>   DW_AT_data_member_location: 20
 <2><91da2>: Abbrev Number: 18 (DW_TAG_member)
    <91da3>   DW_AT_name        : (indirect string, offset: 0x3b00f): tm_wday
    <91da7>   DW_AT_decl_file   : 67
    <91da8>   DW_AT_decl_line   : 15
    <91da9>   DW_AT_decl_column : 7
    <91daa>   DW_AT_type        : <0x7980a>
    <91dae>   DW_AT_data_member_location: 24
 <2><91daf>: Abbrev Number: 18 (DW_TAG_member)
    <91db0>   DW_AT_name        : (indirect string, offset: 0x4bd36): tm_yday
    <91db4>   DW_AT_decl_file   : 67
    <91db5>   DW_AT_decl_line   : 16
    <91db6>   DW_AT_decl_column : 7
    <91db7>   DW_AT_type        : <0x7980a>
    <91dbb>   DW_AT_data_member_location: 28
 <2><91dbc>: Abbrev Number: 18 (DW_TAG_member)
    <91dbd>   DW_AT_name        : (indirect string, offset: 0xb766): tm_isdst
    <91dc1>   DW_AT_decl_file   : 67
    <91dc2>   DW_AT_decl_line   : 17
    <91dc3>   DW_AT_decl_column : 7
    <91dc4>   DW_AT_type        : <0x7980a>
    <91dc8>   DW_AT_data_member_location: 32
 <2><91dc9>: Abbrev Number: 18 (DW_TAG_member)
    <91dca>   DW_AT_name        : (indirect string, offset: 0x5c13b): tm_gmtoff
    <91dce>   DW_AT_decl_file   : 67
    <91dcf>   DW_AT_decl_line   : 20
    <91dd0>   DW_AT_decl_column : 12
    <91dd1>   DW_AT_type        : <0x79773>
    <91dd5>   DW_AT_data_member_location: 40
 <2><91dd6>: Abbrev Number: 18 (DW_TAG_member)
    <91dd7>   DW_AT_name        : (indirect string, offset: 0xf7da): tm_zone
    <91ddb>   DW_AT_decl_file   : 67
    <91ddc>   DW_AT_decl_line   : 21
    <91ddd>   DW_AT_decl_column : 15
    <91dde>   DW_AT_type        : <0x8fe3f>
    <91de2>   DW_AT_data_member_location: 48
 <2><91de3>: Abbrev Number: 0
 <1><91de4>: Abbrev Number: 27 (DW_TAG_const_type)
    <91de5>   DW_AT_type        : <0x91d48>
 <1><91de9>: Abbrev Number: 22 (DW_TAG_typedef)
    <91dea>   DW_AT_name        : (indirect string, offset: 0x57e45): wint_t
    <91dee>   DW_AT_decl_file   : 68
    <91def>   DW_AT_decl_line   : 20
    <91df0>   DW_AT_decl_column : 23
    <91df1>   DW_AT_type        : <0x797b4>
 <1><91df5>: Abbrev Number: 22 (DW_TAG_typedef)
    <91df6>   DW_AT_name        : (indirect string, offset: 0x28aa3): mbstate_t
    <91dfa>   DW_AT_decl_file   : 69
    <91dfb>   DW_AT_decl_line   : 6
    <91dfc>   DW_AT_decl_column : 21
    <91dfd>   DW_AT_type        : <0x91aac>
 <1><91e01>: Abbrev Number: 27 (DW_TAG_const_type)
    <91e02>   DW_AT_type        : <0x91df5>
 <1><91e06>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e07>   DW_AT_external    : 1
    <91e07>   DW_AT_name        : (indirect string, offset: 0x26419): btowc
    <91e0b>   DW_AT_decl_file   : 70
    <91e0c>   DW_AT_decl_line   : 284
    <91e0e>   DW_AT_decl_column : 15
    <91e0f>   DW_AT_type        : <0x91de9>
    <91e13>   DW_AT_declaration : 1
    <91e13>   DW_AT_sibling     : <0x91e1d>
 <2><91e17>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e18>   DW_AT_type        : <0x7980a>
 <2><91e1c>: Abbrev Number: 0
 <1><91e1d>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e1e>   DW_AT_external    : 1
    <91e1e>   DW_AT_name        : (indirect string, offset: 0x444f1): fgetwc
    <91e22>   DW_AT_decl_file   : 70
    <91e23>   DW_AT_decl_line   : 729
    <91e25>   DW_AT_decl_column : 15
    <91e26>   DW_AT_type        : <0x91de9>
    <91e2a>   DW_AT_declaration : 1
    <91e2a>   DW_AT_sibling     : <0x91e34>
 <2><91e2e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e2f>   DW_AT_type        : <0x91e34>
 <2><91e33>: Abbrev Number: 0
 <1><91e34>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91e35>   DW_AT_byte_size   : 8
    <91e35>   DW_AT_type        : <0x91aec>
 <1><91e39>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e3a>   DW_AT_external    : 1
    <91e3a>   DW_AT_name        : (indirect string, offset: 0x44534): fgetws
    <91e3e>   DW_AT_decl_file   : 70
    <91e3f>   DW_AT_decl_line   : 758
    <91e41>   DW_AT_decl_column : 17
    <91e42>   DW_AT_type        : <0x91697>
    <91e46>   DW_AT_declaration : 1
    <91e46>   DW_AT_sibling     : <0x91e5a>
 <2><91e4a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e4b>   DW_AT_type        : <0x91697>
 <2><91e4f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e50>   DW_AT_type        : <0x7980a>
 <2><91e54>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e55>   DW_AT_type        : <0x91e34>
 <2><91e59>: Abbrev Number: 0
 <1><91e5a>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e5b>   DW_AT_external    : 1
    <91e5b>   DW_AT_name        : (indirect string, offset: 0xd07f): fputwc
    <91e5f>   DW_AT_decl_file   : 70
    <91e60>   DW_AT_decl_line   : 743
    <91e62>   DW_AT_decl_column : 15
    <91e63>   DW_AT_type        : <0x91de9>
    <91e67>   DW_AT_declaration : 1
    <91e67>   DW_AT_sibling     : <0x91e76>
 <2><91e6b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e6c>   DW_AT_type        : <0x9169c>
 <2><91e70>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e71>   DW_AT_type        : <0x91e34>
 <2><91e75>: Abbrev Number: 0
 <1><91e76>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e77>   DW_AT_external    : 1
    <91e77>   DW_AT_name        : (indirect string, offset: 0xd0af): fputws
    <91e7b>   DW_AT_decl_file   : 70
    <91e7c>   DW_AT_decl_line   : 765
    <91e7e>   DW_AT_decl_column : 12
    <91e7f>   DW_AT_type        : <0x7980a>
    <91e83>   DW_AT_declaration : 1
    <91e83>   DW_AT_sibling     : <0x91e92>
 <2><91e87>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e88>   DW_AT_type        : <0x917b5>
 <2><91e8c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91e8d>   DW_AT_type        : <0x91e34>
 <2><91e91>: Abbrev Number: 0
 <1><91e92>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91e93>   DW_AT_external    : 1
    <91e93>   DW_AT_name        : (indirect string, offset: 0x55473): fwide
    <91e97>   DW_AT_decl_file   : 70
    <91e98>   DW_AT_decl_line   : 573
    <91e9a>   DW_AT_decl_column : 12
    <91e9b>   DW_AT_type        : <0x7980a>
    <91e9f>   DW_AT_declaration : 1
    <91e9f>   DW_AT_sibling     : <0x91eae>
 <2><91ea3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ea4>   DW_AT_type        : <0x91e34>
 <2><91ea8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ea9>   DW_AT_type        : <0x7980a>
 <2><91ead>: Abbrev Number: 0
 <1><91eae>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91eaf>   DW_AT_external    : 1
    <91eaf>   DW_AT_name        : (indirect string, offset: 0x4af79): fwprintf
    <91eb3>   DW_AT_decl_file   : 70
    <91eb4>   DW_AT_decl_line   : 580
    <91eb6>   DW_AT_decl_column : 12
    <91eb7>   DW_AT_type        : <0x7980a>
    <91ebb>   DW_AT_declaration : 1
    <91ebb>   DW_AT_sibling     : <0x91ecb>
 <2><91ebf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ec0>   DW_AT_type        : <0x91e34>
 <2><91ec4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ec5>   DW_AT_type        : <0x917b5>
 <2><91ec9>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><91eca>: Abbrev Number: 0
 <1><91ecb>: Abbrev Number: 45 (DW_TAG_subprogram)
    <91ecc>   DW_AT_external    : 1
    <91ecc>   DW_AT_name        : (indirect string, offset: 0x3779c): fwscanf
    <91ed0>   DW_AT_decl_file   : 70
    <91ed1>   DW_AT_decl_line   : 642
    <91ed3>   DW_AT_decl_column : 12
    <91ed4>   DW_AT_linkage_name: (indirect string, offset: 0x37793): __isoc99_fwscanf
    <91ed8>   DW_AT_type        : <0x7980a>
    <91edc>   DW_AT_declaration : 1
    <91edc>   DW_AT_sibling     : <0x91eec>
 <2><91ee0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ee1>   DW_AT_type        : <0x91e34>
 <2><91ee5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ee6>   DW_AT_type        : <0x917b5>
 <2><91eea>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><91eeb>: Abbrev Number: 0
 <1><91eec>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91eed>   DW_AT_external    : 1
    <91eed>   DW_AT_name        : (indirect string, offset: 0x444f2): getwc
    <91ef1>   DW_AT_decl_file   : 70
    <91ef2>   DW_AT_decl_line   : 730
    <91ef4>   DW_AT_decl_column : 15
    <91ef5>   DW_AT_type        : <0x91de9>
    <91ef9>   DW_AT_declaration : 1
    <91ef9>   DW_AT_sibling     : <0x91f03>
 <2><91efd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91efe>   DW_AT_type        : <0x91e34>
 <2><91f02>: Abbrev Number: 0
 <1><91f03>: Abbrev Number: 89 (DW_TAG_subprogram)
    <91f04>   DW_AT_external    : 1
    <91f04>   DW_AT_name        : (indirect string, offset: 0x25814): getwchar
    <91f08>   DW_AT_decl_file   : 70
    <91f09>   DW_AT_decl_line   : 736
    <91f0b>   DW_AT_decl_column : 15
    <91f0c>   DW_AT_type        : <0x91de9>
    <91f10>   DW_AT_declaration : 1
 <1><91f10>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91f11>   DW_AT_external    : 1
    <91f11>   DW_AT_name        : (indirect string, offset: 0x5d461): mbrlen
    <91f15>   DW_AT_decl_file   : 70
    <91f16>   DW_AT_decl_line   : 307
    <91f18>   DW_AT_decl_column : 15
    <91f19>   DW_AT_type        : <0x7977a>
    <91f1d>   DW_AT_declaration : 1
    <91f1d>   DW_AT_sibling     : <0x91f31>
 <2><91f21>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f22>   DW_AT_type        : <0x8fe3f>
 <2><91f26>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f27>   DW_AT_type        : <0x7977a>
 <2><91f2b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f2c>   DW_AT_type        : <0x91f31>
 <2><91f30>: Abbrev Number: 0
 <1><91f31>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91f32>   DW_AT_byte_size   : 8
    <91f32>   DW_AT_type        : <0x91df5>
 <1><91f36>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91f37>   DW_AT_external    : 1
    <91f37>   DW_AT_name        : (indirect string, offset: 0x103b6): mbrtowc
    <91f3b>   DW_AT_decl_file   : 70
    <91f3c>   DW_AT_decl_line   : 296
    <91f3e>   DW_AT_decl_column : 15
    <91f3f>   DW_AT_type        : <0x7977a>
    <91f43>   DW_AT_declaration : 1
    <91f43>   DW_AT_sibling     : <0x91f5c>
 <2><91f47>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f48>   DW_AT_type        : <0x91697>
 <2><91f4c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f4d>   DW_AT_type        : <0x8fe3f>
 <2><91f51>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f52>   DW_AT_type        : <0x7977a>
 <2><91f56>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f57>   DW_AT_type        : <0x91f31>
 <2><91f5b>: Abbrev Number: 0
 <1><91f5c>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91f5d>   DW_AT_external    : 1
    <91f5d>   DW_AT_name        : (indirect string, offset: 0xdeff): mbsinit
    <91f61>   DW_AT_decl_file   : 70
    <91f62>   DW_AT_decl_line   : 292
    <91f64>   DW_AT_decl_column : 12
    <91f65>   DW_AT_type        : <0x7980a>
    <91f69>   DW_AT_declaration : 1
    <91f69>   DW_AT_sibling     : <0x91f73>
 <2><91f6d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f6e>   DW_AT_type        : <0x91f73>
 <2><91f72>: Abbrev Number: 0
 <1><91f73>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91f74>   DW_AT_byte_size   : 8
    <91f74>   DW_AT_type        : <0x91e01>
 <1><91f78>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91f79>   DW_AT_external    : 1
    <91f79>   DW_AT_name        : (indirect string, offset: 0x39475): mbsrtowcs
    <91f7d>   DW_AT_decl_file   : 70
    <91f7e>   DW_AT_decl_line   : 337
    <91f80>   DW_AT_decl_column : 15
    <91f81>   DW_AT_type        : <0x7977a>
    <91f85>   DW_AT_declaration : 1
    <91f85>   DW_AT_sibling     : <0x91f9e>
 <2><91f89>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f8a>   DW_AT_type        : <0x91697>
 <2><91f8e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f8f>   DW_AT_type        : <0x91f9e>
 <2><91f93>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f94>   DW_AT_type        : <0x7977a>
 <2><91f98>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91f99>   DW_AT_type        : <0x91f31>
 <2><91f9d>: Abbrev Number: 0
 <1><91f9e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <91f9f>   DW_AT_byte_size   : 8
    <91f9f>   DW_AT_type        : <0x8fe3f>
 <1><91fa3>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91fa4>   DW_AT_external    : 1
    <91fa4>   DW_AT_name        : (indirect string, offset: 0xd080): putwc
    <91fa8>   DW_AT_decl_file   : 70
    <91fa9>   DW_AT_decl_line   : 744
    <91fab>   DW_AT_decl_column : 15
    <91fac>   DW_AT_type        : <0x91de9>
    <91fb0>   DW_AT_declaration : 1
    <91fb0>   DW_AT_sibling     : <0x91fbf>
 <2><91fb4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91fb5>   DW_AT_type        : <0x9169c>
 <2><91fb9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91fba>   DW_AT_type        : <0x91e34>
 <2><91fbe>: Abbrev Number: 0
 <1><91fbf>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91fc0>   DW_AT_external    : 1
    <91fc0>   DW_AT_name        : (indirect string, offset: 0x4cc2b): putwchar
    <91fc4>   DW_AT_decl_file   : 70
    <91fc5>   DW_AT_decl_line   : 750
    <91fc7>   DW_AT_decl_column : 15
    <91fc8>   DW_AT_type        : <0x91de9>
    <91fcc>   DW_AT_declaration : 1
    <91fcc>   DW_AT_sibling     : <0x91fd6>
 <2><91fd0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91fd1>   DW_AT_type        : <0x9169c>
 <2><91fd5>: Abbrev Number: 0
 <1><91fd6>: Abbrev Number: 23 (DW_TAG_subprogram)
    <91fd7>   DW_AT_external    : 1
    <91fd7>   DW_AT_name        : (indirect string, offset: 0x2da63): swprintf
    <91fdb>   DW_AT_decl_file   : 70
    <91fdc>   DW_AT_decl_line   : 590
    <91fde>   DW_AT_decl_column : 12
    <91fdf>   DW_AT_type        : <0x7980a>
    <91fe3>   DW_AT_declaration : 1
    <91fe3>   DW_AT_sibling     : <0x91ff8>
 <2><91fe7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91fe8>   DW_AT_type        : <0x91697>
 <2><91fec>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91fed>   DW_AT_type        : <0x7977a>
 <2><91ff1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <91ff2>   DW_AT_type        : <0x917b5>
 <2><91ff6>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><91ff7>: Abbrev Number: 0
 <1><91ff8>: Abbrev Number: 45 (DW_TAG_subprogram)
    <91ff9>   DW_AT_external    : 1
    <91ff9>   DW_AT_name        : (indirect string, offset: 0x27ca8): swscanf
    <91ffd>   DW_AT_decl_file   : 70
    <91ffe>   DW_AT_decl_line   : 649
    <92000>   DW_AT_decl_column : 12
    <92001>   DW_AT_linkage_name: (indirect string, offset: 0x27c9f): __isoc99_swscanf
    <92005>   DW_AT_type        : <0x7980a>
    <92009>   DW_AT_declaration : 1
    <92009>   DW_AT_sibling     : <0x92019>
 <2><9200d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9200e>   DW_AT_type        : <0x917b5>
 <2><92012>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92013>   DW_AT_type        : <0x917b5>
 <2><92017>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><92018>: Abbrev Number: 0
 <1><92019>: Abbrev Number: 23 (DW_TAG_subprogram)
    <9201a>   DW_AT_external    : 1
    <9201a>   DW_AT_name        : (indirect string, offset: 0x4ccab): ungetwc
    <9201e>   DW_AT_decl_file   : 70
    <9201f>   DW_AT_decl_line   : 773
    <92021>   DW_AT_decl_column : 15
    <92022>   DW_AT_type        : <0x91de9>
    <92026>   DW_AT_declaration : 1
    <92026>   DW_AT_sibling     : <0x92035>
 <2><9202a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9202b>   DW_AT_type        : <0x91de9>
 <2><9202f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92030>   DW_AT_type        : <0x91e34>
 <2><92034>: Abbrev Number: 0
 <1><92035>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92036>   DW_AT_external    : 1
    <92036>   DW_AT_name        : (indirect string, offset: 0x4af78): vfwprintf
    <9203a>   DW_AT_decl_file   : 70
    <9203b>   DW_AT_decl_line   : 598
    <9203d>   DW_AT_decl_column : 12
    <9203e>   DW_AT_type        : <0x7980a>
    <92042>   DW_AT_declaration : 1
    <92042>   DW_AT_sibling     : <0x92056>
 <2><92046>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92047>   DW_AT_type        : <0x91e34>
 <2><9204b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9204c>   DW_AT_type        : <0x917b5>
 <2><92050>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92051>   DW_AT_type        : <0x92056>
 <2><92055>: Abbrev Number: 0
 <1><92056>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <92057>   DW_AT_byte_size   : 8
    <92057>   DW_AT_type        : <0x91a2b>
 <1><9205b>: Abbrev Number: 45 (DW_TAG_subprogram)
    <9205c>   DW_AT_external    : 1
    <9205c>   DW_AT_name        : (indirect string, offset: 0x1a5e9): vfwscanf
    <92060>   DW_AT_decl_file   : 70
    <92061>   DW_AT_decl_line   : 696
    <92063>   DW_AT_decl_column : 12
    <92064>   DW_AT_linkage_name: (indirect string, offset: 0x1a5e0): __isoc99_vfwscanf
    <92068>   DW_AT_type        : <0x7980a>
    <9206c>   DW_AT_declaration : 1
    <9206c>   DW_AT_sibling     : <0x92080>
 <2><92070>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92071>   DW_AT_type        : <0x91e34>
 <2><92075>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92076>   DW_AT_type        : <0x917b5>
 <2><9207a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9207b>   DW_AT_type        : <0x92056>
 <2><9207f>: Abbrev Number: 0
 <1><92080>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92081>   DW_AT_external    : 1
    <92081>   DW_AT_name        : (indirect string, offset: 0x2da62): vswprintf
    <92085>   DW_AT_decl_file   : 70
    <92086>   DW_AT_decl_line   : 611
    <92088>   DW_AT_decl_column : 12
    <92089>   DW_AT_type        : <0x7980a>
    <9208d>   DW_AT_declaration : 1
    <9208d>   DW_AT_sibling     : <0x920a6>
 <2><92091>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92092>   DW_AT_type        : <0x91697>
 <2><92096>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92097>   DW_AT_type        : <0x7977a>
 <2><9209b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9209c>   DW_AT_type        : <0x917b5>
 <2><920a0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920a1>   DW_AT_type        : <0x92056>
 <2><920a5>: Abbrev Number: 0
 <1><920a6>: Abbrev Number: 45 (DW_TAG_subprogram)
    <920a7>   DW_AT_external    : 1
    <920a7>   DW_AT_name        : (indirect string, offset: 0xa75f): vswscanf
    <920ab>   DW_AT_decl_file   : 70
    <920ac>   DW_AT_decl_line   : 703
    <920ae>   DW_AT_decl_column : 12
    <920af>   DW_AT_linkage_name: (indirect string, offset: 0xa756): __isoc99_vswscanf
    <920b3>   DW_AT_type        : <0x7980a>
    <920b7>   DW_AT_declaration : 1
    <920b7>   DW_AT_sibling     : <0x920cb>
 <2><920bb>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920bc>   DW_AT_type        : <0x917b5>
 <2><920c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920c1>   DW_AT_type        : <0x917b5>
 <2><920c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920c6>   DW_AT_type        : <0x92056>
 <2><920ca>: Abbrev Number: 0
 <1><920cb>: Abbrev Number: 23 (DW_TAG_subprogram)
    <920cc>   DW_AT_external    : 1
    <920cc>   DW_AT_name        : (indirect string, offset: 0xc7f4): vwprintf
    <920d0>   DW_AT_decl_file   : 70
    <920d1>   DW_AT_decl_line   : 606
    <920d3>   DW_AT_decl_column : 12
    <920d4>   DW_AT_type        : <0x7980a>
    <920d8>   DW_AT_declaration : 1
    <920d8>   DW_AT_sibling     : <0x920e7>
 <2><920dc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920dd>   DW_AT_type        : <0x917b5>
 <2><920e1>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920e2>   DW_AT_type        : <0x92056>
 <2><920e6>: Abbrev Number: 0
 <1><920e7>: Abbrev Number: 45 (DW_TAG_subprogram)
    <920e8>   DW_AT_external    : 1
    <920e8>   DW_AT_name        : (indirect string, offset: 0x1cb17): vwscanf
    <920ec>   DW_AT_decl_file   : 70
    <920ed>   DW_AT_decl_line   : 700
    <920ef>   DW_AT_decl_column : 12
    <920f0>   DW_AT_linkage_name: (indirect string, offset: 0x1cb0e): __isoc99_vwscanf
    <920f4>   DW_AT_type        : <0x7980a>
    <920f8>   DW_AT_declaration : 1
    <920f8>   DW_AT_sibling     : <0x92107>
 <2><920fc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <920fd>   DW_AT_type        : <0x917b5>
 <2><92101>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92102>   DW_AT_type        : <0x92056>
 <2><92106>: Abbrev Number: 0
 <1><92107>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92108>   DW_AT_external    : 1
    <92108>   DW_AT_name        : (indirect string, offset: 0x9889): wcrtomb
    <9210c>   DW_AT_decl_file   : 70
    <9210d>   DW_AT_decl_line   : 301
    <9210f>   DW_AT_decl_column : 15
    <92110>   DW_AT_type        : <0x7977a>
    <92114>   DW_AT_declaration : 1
    <92114>   DW_AT_sibling     : <0x92128>
 <2><92118>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92119>   DW_AT_type        : <0x7996a>
 <2><9211d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9211e>   DW_AT_type        : <0x9169c>
 <2><92122>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92123>   DW_AT_type        : <0x91f31>
 <2><92127>: Abbrev Number: 0
 <1><92128>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92129>   DW_AT_external    : 1
    <92129>   DW_AT_name        : (indirect string, offset: 0x2774b): wcscat
    <9212d>   DW_AT_decl_file   : 70
    <9212e>   DW_AT_decl_line   : 97
    <9212f>   DW_AT_decl_column : 17
    <92130>   DW_AT_type        : <0x91697>
    <92134>   DW_AT_declaration : 1
    <92134>   DW_AT_sibling     : <0x92143>
 <2><92138>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92139>   DW_AT_type        : <0x91697>
 <2><9213d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9213e>   DW_AT_type        : <0x917b5>
 <2><92142>: Abbrev Number: 0
 <1><92143>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92144>   DW_AT_external    : 1
    <92144>   DW_AT_name        : (indirect string, offset: 0x28a45): wcscmp
    <92148>   DW_AT_decl_file   : 70
    <92149>   DW_AT_decl_line   : 106
    <9214a>   DW_AT_decl_column : 12
    <9214b>   DW_AT_type        : <0x7980a>
    <9214f>   DW_AT_declaration : 1
    <9214f>   DW_AT_sibling     : <0x9215e>
 <2><92153>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92154>   DW_AT_type        : <0x917b5>
 <2><92158>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92159>   DW_AT_type        : <0x917b5>
 <2><9215d>: Abbrev Number: 0
 <1><9215e>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9215f>   DW_AT_external    : 1
    <9215f>   DW_AT_name        : (indirect string, offset: 0x39c5b): wcscoll
    <92163>   DW_AT_decl_file   : 70
    <92164>   DW_AT_decl_line   : 131
    <92165>   DW_AT_decl_column : 12
    <92166>   DW_AT_type        : <0x7980a>
    <9216a>   DW_AT_declaration : 1
    <9216a>   DW_AT_sibling     : <0x92179>
 <2><9216e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9216f>   DW_AT_type        : <0x917b5>
 <2><92173>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92174>   DW_AT_type        : <0x917b5>
 <2><92178>: Abbrev Number: 0
 <1><92179>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9217a>   DW_AT_external    : 1
    <9217a>   DW_AT_name        : (indirect string, offset: 0x28d03): wcscpy
    <9217e>   DW_AT_decl_file   : 70
    <9217f>   DW_AT_decl_line   : 87
    <92180>   DW_AT_decl_column : 17
    <92181>   DW_AT_type        : <0x91697>
    <92185>   DW_AT_declaration : 1
    <92185>   DW_AT_sibling     : <0x92194>
 <2><92189>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9218a>   DW_AT_type        : <0x91697>
 <2><9218e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9218f>   DW_AT_type        : <0x917b5>
 <2><92193>: Abbrev Number: 0
 <1><92194>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92195>   DW_AT_external    : 1
    <92195>   DW_AT_name        : (indirect string, offset: 0x53f3b): wcscspn
    <92199>   DW_AT_decl_file   : 70
    <9219a>   DW_AT_decl_line   : 187
    <9219b>   DW_AT_decl_column : 15
    <9219c>   DW_AT_type        : <0x7977a>
    <921a0>   DW_AT_declaration : 1
    <921a0>   DW_AT_sibling     : <0x921af>
 <2><921a4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921a5>   DW_AT_type        : <0x917b5>
 <2><921a9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921aa>   DW_AT_type        : <0x917b5>
 <2><921ae>: Abbrev Number: 0
 <1><921af>: Abbrev Number: 23 (DW_TAG_subprogram)
    <921b0>   DW_AT_external    : 1
    <921b0>   DW_AT_name        : (indirect string, offset: 0x2ca24): wcsftime
    <921b4>   DW_AT_decl_file   : 70
    <921b5>   DW_AT_decl_line   : 837
    <921b7>   DW_AT_decl_column : 15
    <921b8>   DW_AT_type        : <0x7977a>
    <921bc>   DW_AT_declaration : 1
    <921bc>   DW_AT_sibling     : <0x921d5>
 <2><921c0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921c1>   DW_AT_type        : <0x91697>
 <2><921c5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921c6>   DW_AT_type        : <0x7977a>
 <2><921ca>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921cb>   DW_AT_type        : <0x917b5>
 <2><921cf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921d0>   DW_AT_type        : <0x921d5>
 <2><921d4>: Abbrev Number: 0
 <1><921d5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <921d6>   DW_AT_byte_size   : 8
    <921d6>   DW_AT_type        : <0x91de4>
 <1><921da>: Abbrev Number: 29 (DW_TAG_subprogram)
    <921db>   DW_AT_external    : 1
    <921db>   DW_AT_name        : (indirect string, offset: 0x37c9): wcslen
    <921df>   DW_AT_decl_file   : 70
    <921e0>   DW_AT_decl_line   : 222
    <921e1>   DW_AT_decl_column : 15
    <921e2>   DW_AT_type        : <0x7977a>
    <921e6>   DW_AT_declaration : 1
    <921e6>   DW_AT_sibling     : <0x921f0>
 <2><921ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <921eb>   DW_AT_type        : <0x917b5>
 <2><921ef>: Abbrev Number: 0
 <1><921f0>: Abbrev Number: 29 (DW_TAG_subprogram)
    <921f1>   DW_AT_external    : 1
    <921f1>   DW_AT_name        : (indirect string, offset: 0x1a00f): wcsncat
    <921f5>   DW_AT_decl_file   : 70
    <921f6>   DW_AT_decl_line   : 101
    <921f7>   DW_AT_decl_column : 17
    <921f8>   DW_AT_type        : <0x91697>
    <921fc>   DW_AT_declaration : 1
    <921fc>   DW_AT_sibling     : <0x92210>
 <2><92200>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92201>   DW_AT_type        : <0x91697>
 <2><92205>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92206>   DW_AT_type        : <0x917b5>
 <2><9220a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9220b>   DW_AT_type        : <0x7977a>
 <2><9220f>: Abbrev Number: 0
 <1><92210>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92211>   DW_AT_external    : 1
    <92211>   DW_AT_name        : (indirect string, offset: 0x1b3ff): wcsncmp
    <92215>   DW_AT_decl_file   : 70
    <92216>   DW_AT_decl_line   : 109
    <92217>   DW_AT_decl_column : 12
    <92218>   DW_AT_type        : <0x7980a>
    <9221c>   DW_AT_declaration : 1
    <9221c>   DW_AT_sibling     : <0x92230>
 <2><92220>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92221>   DW_AT_type        : <0x917b5>
 <2><92225>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92226>   DW_AT_type        : <0x917b5>
 <2><9222a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9222b>   DW_AT_type        : <0x7977a>
 <2><9222f>: Abbrev Number: 0
 <1><92230>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92231>   DW_AT_external    : 1
    <92231>   DW_AT_name        : (indirect string, offset: 0x1b94d): wcsncpy
    <92235>   DW_AT_decl_file   : 70
    <92236>   DW_AT_decl_line   : 92
    <92237>   DW_AT_decl_column : 17
    <92238>   DW_AT_type        : <0x91697>
    <9223c>   DW_AT_declaration : 1
    <9223c>   DW_AT_sibling     : <0x92250>
 <2><92240>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92241>   DW_AT_type        : <0x91697>
 <2><92245>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92246>   DW_AT_type        : <0x917b5>
 <2><9224a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9224b>   DW_AT_type        : <0x7977a>
 <2><9224f>: Abbrev Number: 0
 <1><92250>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92251>   DW_AT_external    : 1
    <92251>   DW_AT_name        : (indirect string, offset: 0x4eac9): wcsrtombs
    <92255>   DW_AT_decl_file   : 70
    <92256>   DW_AT_decl_line   : 343
    <92258>   DW_AT_decl_column : 15
    <92259>   DW_AT_type        : <0x7977a>
    <9225d>   DW_AT_declaration : 1
    <9225d>   DW_AT_sibling     : <0x92276>
 <2><92261>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92262>   DW_AT_type        : <0x7996a>
 <2><92266>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92267>   DW_AT_type        : <0x92276>
 <2><9226b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9226c>   DW_AT_type        : <0x7977a>
 <2><92270>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92271>   DW_AT_type        : <0x91f31>
 <2><92275>: Abbrev Number: 0
 <1><92276>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <92277>   DW_AT_byte_size   : 8
    <92277>   DW_AT_type        : <0x917b5>
 <1><9227b>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9227c>   DW_AT_external    : 1
    <9227c>   DW_AT_name        : (indirect string, offset: 0x31b0d): wcsspn
    <92280>   DW_AT_decl_file   : 70
    <92281>   DW_AT_decl_line   : 191
    <92282>   DW_AT_decl_column : 15
    <92283>   DW_AT_type        : <0x7977a>
    <92287>   DW_AT_declaration : 1
    <92287>   DW_AT_sibling     : <0x92296>
 <2><9228b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9228c>   DW_AT_type        : <0x917b5>
 <2><92290>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92291>   DW_AT_type        : <0x917b5>
 <2><92295>: Abbrev Number: 0
 <1><92296>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92297>   DW_AT_external    : 1
    <92297>   DW_AT_name        : (indirect string, offset: 0x37e28): wcstod
    <9229b>   DW_AT_decl_file   : 70
    <9229c>   DW_AT_decl_line   : 377
    <9229e>   DW_AT_decl_column : 15
    <9229f>   DW_AT_type        : <0x79bcd>
    <922a3>   DW_AT_declaration : 1
    <922a3>   DW_AT_sibling     : <0x922b2>
 <2><922a7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922a8>   DW_AT_type        : <0x917b5>
 <2><922ac>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922ad>   DW_AT_type        : <0x922b2>
 <2><922b1>: Abbrev Number: 0
 <1><922b2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <922b3>   DW_AT_byte_size   : 8
    <922b3>   DW_AT_type        : <0x91697>
 <1><922b7>: Abbrev Number: 23 (DW_TAG_subprogram)
    <922b8>   DW_AT_external    : 1
    <922b8>   DW_AT_name        : (indirect string, offset: 0x37e41): wcstof
    <922bc>   DW_AT_decl_file   : 70
    <922bd>   DW_AT_decl_line   : 382
    <922bf>   DW_AT_decl_column : 14
    <922c0>   DW_AT_type        : <0x79ba2>
    <922c4>   DW_AT_declaration : 1
    <922c4>   DW_AT_sibling     : <0x922d3>
 <2><922c8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922c9>   DW_AT_type        : <0x917b5>
 <2><922cd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922ce>   DW_AT_type        : <0x922b2>
 <2><922d2>: Abbrev Number: 0
 <1><922d3>: Abbrev Number: 29 (DW_TAG_subprogram)
    <922d4>   DW_AT_external    : 1
    <922d4>   DW_AT_name        : (indirect string, offset: 0x37e48): wcstok
    <922d8>   DW_AT_decl_file   : 70
    <922d9>   DW_AT_decl_line   : 217
    <922da>   DW_AT_decl_column : 17
    <922db>   DW_AT_type        : <0x91697>
    <922df>   DW_AT_declaration : 1
    <922df>   DW_AT_sibling     : <0x922f3>
 <2><922e3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922e4>   DW_AT_type        : <0x91697>
 <2><922e8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922e9>   DW_AT_type        : <0x917b5>
 <2><922ed>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <922ee>   DW_AT_type        : <0x922b2>
 <2><922f2>: Abbrev Number: 0
 <1><922f3>: Abbrev Number: 23 (DW_TAG_subprogram)
    <922f4>   DW_AT_external    : 1
    <922f4>   DW_AT_name        : (indirect string, offset: 0x37e4f): wcstol
    <922f8>   DW_AT_decl_file   : 70
    <922f9>   DW_AT_decl_line   : 428
    <922fb>   DW_AT_decl_column : 17
    <922fc>   DW_AT_type        : <0x79773>
    <92300>   DW_AT_declaration : 1
    <92300>   DW_AT_sibling     : <0x92314>
 <2><92304>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92305>   DW_AT_type        : <0x917b5>
 <2><92309>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9230a>   DW_AT_type        : <0x922b2>
 <2><9230e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9230f>   DW_AT_type        : <0x7980a>
 <2><92313>: Abbrev Number: 0
 <1><92314>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92315>   DW_AT_external    : 1
    <92315>   DW_AT_name        : (indirect string, offset: 0x3e4a4): wcstoul
    <92319>   DW_AT_decl_file   : 70
    <9231a>   DW_AT_decl_line   : 433
    <9231c>   DW_AT_decl_column : 26
    <9231d>   DW_AT_type        : <0x79786>
    <92321>   DW_AT_declaration : 1
    <92321>   DW_AT_sibling     : <0x92335>
 <2><92325>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92326>   DW_AT_type        : <0x917b5>
 <2><9232a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9232b>   DW_AT_type        : <0x922b2>
 <2><9232f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92330>   DW_AT_type        : <0x7980a>
 <2><92334>: Abbrev Number: 0
 <1><92335>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92336>   DW_AT_external    : 1
    <92336>   DW_AT_name        : (indirect string, offset: 0x26311): wcsxfrm
    <9233a>   DW_AT_decl_file   : 70
    <9233b>   DW_AT_decl_line   : 135
    <9233c>   DW_AT_decl_column : 15
    <9233d>   DW_AT_type        : <0x7977a>
    <92341>   DW_AT_declaration : 1
    <92341>   DW_AT_sibling     : <0x92355>
 <2><92345>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92346>   DW_AT_type        : <0x91697>
 <2><9234a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9234b>   DW_AT_type        : <0x917b5>
 <2><9234f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92350>   DW_AT_type        : <0x7977a>
 <2><92354>: Abbrev Number: 0
 <1><92355>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92356>   DW_AT_external    : 1
    <92356>   DW_AT_name        : (indirect string, offset: 0x1768e): wctob
    <9235a>   DW_AT_decl_file   : 70
    <9235b>   DW_AT_decl_line   : 288
    <9235d>   DW_AT_decl_column : 12
    <9235e>   DW_AT_type        : <0x7980a>
    <92362>   DW_AT_declaration : 1
    <92362>   DW_AT_sibling     : <0x9236c>
 <2><92366>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92367>   DW_AT_type        : <0x91de9>
 <2><9236b>: Abbrev Number: 0
 <1><9236c>: Abbrev Number: 23 (DW_TAG_subprogram)
    <9236d>   DW_AT_external    : 1
    <9236d>   DW_AT_name        : (indirect string, offset: 0x50dd6): wmemcmp
    <92371>   DW_AT_decl_file   : 70
    <92372>   DW_AT_decl_line   : 258
    <92374>   DW_AT_decl_column : 12
    <92375>   DW_AT_type        : <0x7980a>
    <92379>   DW_AT_declaration : 1
    <92379>   DW_AT_sibling     : <0x9238d>
 <2><9237d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9237e>   DW_AT_type        : <0x917b5>
 <2><92382>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92383>   DW_AT_type        : <0x917b5>
 <2><92387>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92388>   DW_AT_type        : <0x7977a>
 <2><9238c>: Abbrev Number: 0
 <1><9238d>: Abbrev Number: 23 (DW_TAG_subprogram)
    <9238e>   DW_AT_external    : 1
    <9238e>   DW_AT_name        : (indirect string, offset: 0x51222): wmemcpy
    <92392>   DW_AT_decl_file   : 70
    <92393>   DW_AT_decl_line   : 262
    <92395>   DW_AT_decl_column : 17
    <92396>   DW_AT_type        : <0x91697>
    <9239a>   DW_AT_declaration : 1
    <9239a>   DW_AT_sibling     : <0x923ae>
 <2><9239e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9239f>   DW_AT_type        : <0x91697>
 <2><923a3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923a4>   DW_AT_type        : <0x917b5>
 <2><923a8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923a9>   DW_AT_type        : <0x7977a>
 <2><923ad>: Abbrev Number: 0
 <1><923ae>: Abbrev Number: 23 (DW_TAG_subprogram)
    <923af>   DW_AT_external    : 1
    <923af>   DW_AT_name        : (indirect string, offset: 0x43d7e): wmemmove
    <923b3>   DW_AT_decl_file   : 70
    <923b4>   DW_AT_decl_line   : 267
    <923b6>   DW_AT_decl_column : 17
    <923b7>   DW_AT_type        : <0x91697>
    <923bb>   DW_AT_declaration : 1
    <923bb>   DW_AT_sibling     : <0x923cf>
 <2><923bf>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923c0>   DW_AT_type        : <0x91697>
 <2><923c4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923c5>   DW_AT_type        : <0x917b5>
 <2><923c9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923ca>   DW_AT_type        : <0x7977a>
 <2><923ce>: Abbrev Number: 0
 <1><923cf>: Abbrev Number: 23 (DW_TAG_subprogram)
    <923d0>   DW_AT_external    : 1
    <923d0>   DW_AT_name        : (indirect string, offset: 0x58ba1): wmemset
    <923d4>   DW_AT_decl_file   : 70
    <923d5>   DW_AT_decl_line   : 271
    <923d7>   DW_AT_decl_column : 17
    <923d8>   DW_AT_type        : <0x91697>
    <923dc>   DW_AT_declaration : 1
    <923dc>   DW_AT_sibling     : <0x923f0>
 <2><923e0>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923e1>   DW_AT_type        : <0x91697>
 <2><923e5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923e6>   DW_AT_type        : <0x9169c>
 <2><923ea>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <923eb>   DW_AT_type        : <0x7977a>
 <2><923ef>: Abbrev Number: 0
 <1><923f0>: Abbrev Number: 23 (DW_TAG_subprogram)
    <923f1>   DW_AT_external    : 1
    <923f1>   DW_AT_name        : (indirect string, offset: 0x4af7a): wprintf
    <923f5>   DW_AT_decl_file   : 70
    <923f6>   DW_AT_decl_line   : 587
    <923f8>   DW_AT_decl_column : 12
    <923f9>   DW_AT_type        : <0x7980a>
    <923fd>   DW_AT_declaration : 1
    <923fd>   DW_AT_sibling     : <0x92408>
 <2><92401>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92402>   DW_AT_type        : <0x917b5>
 <2><92406>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><92407>: Abbrev Number: 0
 <1><92408>: Abbrev Number: 45 (DW_TAG_subprogram)
    <92409>   DW_AT_external    : 1
    <92409>   DW_AT_name        : (indirect string, offset: 0x538a4): wscanf
    <9240d>   DW_AT_decl_file   : 70
    <9240e>   DW_AT_decl_line   : 646
    <92410>   DW_AT_decl_column : 12
    <92411>   DW_AT_linkage_name: (indirect string, offset: 0x5389b): __isoc99_wscanf
    <92415>   DW_AT_type        : <0x7980a>
    <92419>   DW_AT_declaration : 1
    <92419>   DW_AT_sibling     : <0x92424>
 <2><9241d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9241e>   DW_AT_type        : <0x917b5>
 <2><92422>: Abbrev Number: 69 (DW_TAG_unspecified_parameters)
 <2><92423>: Abbrev Number: 0
 <1><92424>: Abbrev Number: 55 (DW_TAG_subprogram)
    <92425>   DW_AT_external    : 1
    <92425>   DW_AT_name        : (indirect string, offset: 0x28291): wcschr
    <92429>   DW_AT_decl_file   : 70
    <9242a>   DW_AT_decl_line   : 161
    <9242b>   DW_AT_decl_column : 29
    <9242c>   DW_AT_linkage_name: (indirect string, offset: 0x28291): wcschr
    <92430>   DW_AT_type        : <0x917b5>
    <92434>   DW_AT_declaration : 1
    <92434>   DW_AT_sibling     : <0x92443>
 <2><92438>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92439>   DW_AT_type        : <0x917b5>
 <2><9243d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9243e>   DW_AT_type        : <0x9169c>
 <2><92442>: Abbrev Number: 0
 <1><92443>: Abbrev Number: 55 (DW_TAG_subprogram)
    <92444>   DW_AT_external    : 1
    <92444>   DW_AT_name        : (indirect string, offset: 0x28291): wcschr
    <92448>   DW_AT_decl_file   : 70
    <92449>   DW_AT_decl_line   : 159
    <9244a>   DW_AT_decl_column : 23
    <9244b>   DW_AT_linkage_name: (indirect string, offset: 0x28291): wcschr
    <9244f>   DW_AT_type        : <0x91697>
    <92453>   DW_AT_declaration : 1
    <92453>   DW_AT_sibling     : <0x92462>
 <2><92457>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92458>   DW_AT_type        : <0x91697>
 <2><9245c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9245d>   DW_AT_type        : <0x9169c>
 <2><92461>: Abbrev Number: 0
 <1><92462>: Abbrev Number: 55 (DW_TAG_subprogram)
    <92463>   DW_AT_external    : 1
    <92463>   DW_AT_name        : (indirect string, offset: 0x268fc): wcspbrk
    <92467>   DW_AT_decl_file   : 70
    <92468>   DW_AT_decl_line   : 197
    <92469>   DW_AT_decl_column : 29
    <9246a>   DW_AT_linkage_name: (indirect string, offset: 0x268fc): wcspbrk
    <9246e>   DW_AT_type        : <0x917b5>
    <92472>   DW_AT_declaration : 1
    <92472>   DW_AT_sibling     : <0x92481>
 <2><92476>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92477>   DW_AT_type        : <0x917b5>
 <2><9247b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9247c>   DW_AT_type        : <0x917b5>
 <2><92480>: Abbrev Number: 0
 <1><92481>: Abbrev Number: 55 (DW_TAG_subprogram)
    <92482>   DW_AT_external    : 1
    <92482>   DW_AT_name        : (indirect string, offset: 0x268fc): wcspbrk
    <92486>   DW_AT_decl_file   : 70
    <92487>   DW_AT_decl_line   : 195
    <92488>   DW_AT_decl_column : 23
    <92489>   DW_AT_linkage_name: (indirect string, offset: 0x268fc): wcspbrk
    <9248d>   DW_AT_type        : <0x91697>
    <92491>   DW_AT_declaration : 1
    <92491>   DW_AT_sibling     : <0x924a0>
 <2><92495>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92496>   DW_AT_type        : <0x91697>
 <2><9249a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9249b>   DW_AT_type        : <0x917b5>
 <2><9249f>: Abbrev Number: 0
 <1><924a0>: Abbrev Number: 55 (DW_TAG_subprogram)
    <924a1>   DW_AT_external    : 1
    <924a1>   DW_AT_name        : (indirect string, offset: 0x3cc57): wcsrchr
    <924a5>   DW_AT_decl_file   : 70
    <924a6>   DW_AT_decl_line   : 171
    <924a7>   DW_AT_decl_column : 29
    <924a8>   DW_AT_linkage_name: (indirect string, offset: 0x3cc57): wcsrchr
    <924ac>   DW_AT_type        : <0x917b5>
    <924b0>   DW_AT_declaration : 1
    <924b0>   DW_AT_sibling     : <0x924bf>
 <2><924b4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924b5>   DW_AT_type        : <0x917b5>
 <2><924b9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924ba>   DW_AT_type        : <0x9169c>
 <2><924be>: Abbrev Number: 0
 <1><924bf>: Abbrev Number: 55 (DW_TAG_subprogram)
    <924c0>   DW_AT_external    : 1
    <924c0>   DW_AT_name        : (indirect string, offset: 0x3cc57): wcsrchr
    <924c4>   DW_AT_decl_file   : 70
    <924c5>   DW_AT_decl_line   : 169
    <924c6>   DW_AT_decl_column : 23
    <924c7>   DW_AT_linkage_name: (indirect string, offset: 0x3cc57): wcsrchr
    <924cb>   DW_AT_type        : <0x91697>
    <924cf>   DW_AT_declaration : 1
    <924cf>   DW_AT_sibling     : <0x924de>
 <2><924d3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924d4>   DW_AT_type        : <0x91697>
 <2><924d8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924d9>   DW_AT_type        : <0x9169c>
 <2><924dd>: Abbrev Number: 0
 <1><924de>: Abbrev Number: 55 (DW_TAG_subprogram)
    <924df>   DW_AT_external    : 1
    <924df>   DW_AT_name        : (indirect string, offset: 0x3211f): wcsstr
    <924e3>   DW_AT_decl_file   : 70
    <924e4>   DW_AT_decl_line   : 208
    <924e5>   DW_AT_decl_column : 29
    <924e6>   DW_AT_linkage_name: (indirect string, offset: 0x3211f): wcsstr
    <924ea>   DW_AT_type        : <0x917b5>
    <924ee>   DW_AT_declaration : 1
    <924ee>   DW_AT_sibling     : <0x924fd>
 <2><924f2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924f3>   DW_AT_type        : <0x917b5>
 <2><924f7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <924f8>   DW_AT_type        : <0x917b5>
 <2><924fc>: Abbrev Number: 0
 <1><924fd>: Abbrev Number: 55 (DW_TAG_subprogram)
    <924fe>   DW_AT_external    : 1
    <924fe>   DW_AT_name        : (indirect string, offset: 0x3211f): wcsstr
    <92502>   DW_AT_decl_file   : 70
    <92503>   DW_AT_decl_line   : 206
    <92504>   DW_AT_decl_column : 23
    <92505>   DW_AT_linkage_name: (indirect string, offset: 0x3211f): wcsstr
    <92509>   DW_AT_type        : <0x91697>
    <9250d>   DW_AT_declaration : 1
    <9250d>   DW_AT_sibling     : <0x9251c>
 <2><92511>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92512>   DW_AT_type        : <0x91697>
 <2><92516>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92517>   DW_AT_type        : <0x917b5>
 <2><9251b>: Abbrev Number: 0
 <1><9251c>: Abbrev Number: 55 (DW_TAG_subprogram)
    <9251d>   DW_AT_external    : 1
    <9251d>   DW_AT_name        : (indirect string, offset: 0x50631): wmemchr
    <92521>   DW_AT_decl_file   : 70
    <92522>   DW_AT_decl_line   : 249
    <92523>   DW_AT_decl_column : 29
    <92524>   DW_AT_linkage_name: (indirect string, offset: 0x50631): wmemchr
    <92528>   DW_AT_type        : <0x917b5>
    <9252c>   DW_AT_declaration : 1
    <9252c>   DW_AT_sibling     : <0x92540>
 <2><92530>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92531>   DW_AT_type        : <0x917b5>
 <2><92535>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92536>   DW_AT_type        : <0x9169c>
 <2><9253a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9253b>   DW_AT_type        : <0x7977a>
 <2><9253f>: Abbrev Number: 0
 <1><92540>: Abbrev Number: 55 (DW_TAG_subprogram)
    <92541>   DW_AT_external    : 1
    <92541>   DW_AT_name        : (indirect string, offset: 0x50631): wmemchr
    <92545>   DW_AT_decl_file   : 70
    <92546>   DW_AT_decl_line   : 247
    <92547>   DW_AT_decl_column : 23
    <92548>   DW_AT_linkage_name: (indirect string, offset: 0x50631): wmemchr
    <9254c>   DW_AT_type        : <0x91697>
    <92550>   DW_AT_declaration : 1
    <92550>   DW_AT_sibling     : <0x92564>
 <2><92554>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92555>   DW_AT_type        : <0x91697>
 <2><92559>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9255a>   DW_AT_type        : <0x9169c>
 <2><9255e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9255f>   DW_AT_type        : <0x7977a>
 <2><92563>: Abbrev Number: 0
 <1><92564>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92565>   DW_AT_external    : 1
    <92565>   DW_AT_name        : (indirect string, offset: 0x3d7dd): wcstold
    <92569>   DW_AT_decl_file   : 70
    <9256a>   DW_AT_decl_line   : 384
    <9256c>   DW_AT_decl_column : 20
    <9256d>   DW_AT_type        : <0x79794>
    <92571>   DW_AT_declaration : 1
    <92571>   DW_AT_sibling     : <0x92580>
 <2><92575>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92576>   DW_AT_type        : <0x917b5>
 <2><9257a>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9257b>   DW_AT_type        : <0x922b2>
 <2><9257f>: Abbrev Number: 0
 <1><92580>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92581>   DW_AT_external    : 1
    <92581>   DW_AT_name        : (indirect string, offset: 0x3d825): wcstoll
    <92585>   DW_AT_decl_file   : 70
    <92586>   DW_AT_decl_line   : 441
    <92588>   DW_AT_decl_column : 22
    <92589>   DW_AT_type        : <0x7978d>
    <9258d>   DW_AT_declaration : 1
    <9258d>   DW_AT_sibling     : <0x925a1>
 <2><92591>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92592>   DW_AT_type        : <0x917b5>
 <2><92596>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92597>   DW_AT_type        : <0x922b2>
 <2><9259b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9259c>   DW_AT_type        : <0x7980a>
 <2><925a0>: Abbrev Number: 0
 <1><925a1>: Abbrev Number: 23 (DW_TAG_subprogram)
    <925a2>   DW_AT_external    : 1
    <925a2>   DW_AT_name        : (indirect string, offset: 0x66fa): wcstoull
    <925a6>   DW_AT_decl_file   : 70
    <925a7>   DW_AT_decl_line   : 448
    <925a9>   DW_AT_decl_column : 31
    <925aa>   DW_AT_type        : <0x8ff55>
    <925ae>   DW_AT_declaration : 1
    <925ae>   DW_AT_sibling     : <0x925c2>
 <2><925b2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <925b3>   DW_AT_type        : <0x917b5>
 <2><925b7>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <925b8>   DW_AT_type        : <0x922b2>
 <2><925bc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <925bd>   DW_AT_type        : <0x7980a>
 <2><925c1>: Abbrev Number: 0
 <1><925c2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <925c3>   DW_AT_byte_size   : 8
    <925c3>   DW_AT_type        : <0x90516>
 <1><925c7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <925c8>   DW_AT_byte_size   : 8
    <925c8>   DW_AT_type        : <0x906d6>
 <1><925cc>: Abbrev Number: 57 (DW_TAG_reference_type)
    <925cd>   DW_AT_byte_size   : 8
    <925cd>   DW_AT_type        : <0x906d6>
 <1><925d1>: Abbrev Number: 92 (DW_TAG_rvalue_reference_type)
    <925d2>   DW_AT_byte_size   : 8
    <925d2>   DW_AT_type        : <0x90516>
 <1><925d6>: Abbrev Number: 57 (DW_TAG_reference_type)
    <925d7>   DW_AT_byte_size   : 8
    <925d7>   DW_AT_type        : <0x90516>
 <1><925db>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <925dc>   DW_AT_byte_size   : 8
    <925dc>   DW_AT_type        : <0x90716>
 <1><925e0>: Abbrev Number: 57 (DW_TAG_reference_type)
    <925e1>   DW_AT_byte_size   : 8
    <925e1>   DW_AT_type        : <0x90745>
 <1><925e5>: Abbrev Number: 57 (DW_TAG_reference_type)
    <925e6>   DW_AT_byte_size   : 8
    <925e6>   DW_AT_type        : <0x90752>
 <1><925ea>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <925eb>   DW_AT_byte_size   : 8
    <925eb>   DW_AT_type        : <0x90752>
 <1><925ef>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <925f0>   DW_AT_byte_size   : 8
    <925f0>   DW_AT_type        : <0x90745>
 <1><925f4>: Abbrev Number: 57 (DW_TAG_reference_type)
    <925f5>   DW_AT_byte_size   : 8
    <925f5>   DW_AT_type        : <0x90891>
 <1><925f9>: Abbrev Number: 53 (DW_TAG_structure_type)
    <925fa>   DW_AT_name        : (indirect string, offset: 0x4e8fc): lconv
    <925fe>   DW_AT_byte_size   : 96
    <925ff>   DW_AT_decl_file   : 71
    <92600>   DW_AT_decl_line   : 51
    <92601>   DW_AT_decl_column : 8
    <92602>   DW_AT_sibling     : <0x9273f>
 <2><92606>: Abbrev Number: 18 (DW_TAG_member)
    <92607>   DW_AT_name        : (indirect string, offset: 0x2929a): decimal_point
    <9260b>   DW_AT_decl_file   : 71
    <9260c>   DW_AT_decl_line   : 55
    <9260d>   DW_AT_decl_column : 9
    <9260e>   DW_AT_type        : <0x7996a>
    <92612>   DW_AT_data_member_location: 0
 <2><92613>: Abbrev Number: 18 (DW_TAG_member)
    <92614>   DW_AT_name        : (indirect string, offset: 0x364f4): thousands_sep
    <92618>   DW_AT_decl_file   : 71
    <92619>   DW_AT_decl_line   : 56
    <9261a>   DW_AT_decl_column : 9
    <9261b>   DW_AT_type        : <0x7996a>
    <9261f>   DW_AT_data_member_location: 8
 <2><92620>: Abbrev Number: 18 (DW_TAG_member)
    <92621>   DW_AT_name        : (indirect string, offset: 0x4d872): grouping
    <92625>   DW_AT_decl_file   : 71
    <92626>   DW_AT_decl_line   : 62
    <92627>   DW_AT_decl_column : 9
    <92628>   DW_AT_type        : <0x7996a>
    <9262c>   DW_AT_data_member_location: 16
 <2><9262d>: Abbrev Number: 18 (DW_TAG_member)
    <9262e>   DW_AT_name        : (indirect string, offset: 0x40cd5): int_curr_symbol
    <92632>   DW_AT_decl_file   : 71
    <92633>   DW_AT_decl_line   : 68
    <92634>   DW_AT_decl_column : 9
    <92635>   DW_AT_type        : <0x7996a>
    <92639>   DW_AT_data_member_location: 24
 <2><9263a>: Abbrev Number: 18 (DW_TAG_member)
    <9263b>   DW_AT_name        : (indirect string, offset: 0x1c1e9): currency_symbol
    <9263f>   DW_AT_decl_file   : 71
    <92640>   DW_AT_decl_line   : 69
    <92641>   DW_AT_decl_column : 9
    <92642>   DW_AT_type        : <0x7996a>
    <92646>   DW_AT_data_member_location: 32
 <2><92647>: Abbrev Number: 18 (DW_TAG_member)
    <92648>   DW_AT_name        : (indirect string, offset: 0x29296): mon_decimal_point
    <9264c>   DW_AT_decl_file   : 71
    <9264d>   DW_AT_decl_line   : 70
    <9264e>   DW_AT_decl_column : 9
    <9264f>   DW_AT_type        : <0x7996a>
    <92653>   DW_AT_data_member_location: 40
 <2><92654>: Abbrev Number: 18 (DW_TAG_member)
    <92655>   DW_AT_name        : (indirect string, offset: 0x364f0): mon_thousands_sep
    <92659>   DW_AT_decl_file   : 71
    <9265a>   DW_AT_decl_line   : 71
    <9265b>   DW_AT_decl_column : 9
    <9265c>   DW_AT_type        : <0x7996a>
    <92660>   DW_AT_data_member_location: 48
 <2><92661>: Abbrev Number: 18 (DW_TAG_member)
    <92662>   DW_AT_name        : (indirect string, offset: 0x4d86e): mon_grouping
    <92666>   DW_AT_decl_file   : 71
    <92667>   DW_AT_decl_line   : 72
    <92668>   DW_AT_decl_column : 9
    <92669>   DW_AT_type        : <0x7996a>
    <9266d>   DW_AT_data_member_location: 56
 <2><9266e>: Abbrev Number: 18 (DW_TAG_member)
    <9266f>   DW_AT_name        : (indirect string, offset: 0x3e61f): positive_sign
    <92673>   DW_AT_decl_file   : 71
    <92674>   DW_AT_decl_line   : 73
    <92675>   DW_AT_decl_column : 9
    <92676>   DW_AT_type        : <0x7996a>
    <9267a>   DW_AT_data_member_location: 64
 <2><9267b>: Abbrev Number: 18 (DW_TAG_member)
    <9267c>   DW_AT_name        : (indirect string, offset: 0x1eb56): negative_sign
    <92680>   DW_AT_decl_file   : 71
    <92681>   DW_AT_decl_line   : 74
    <92682>   DW_AT_decl_column : 9
    <92683>   DW_AT_type        : <0x7996a>
    <92687>   DW_AT_data_member_location: 72
 <2><92688>: Abbrev Number: 18 (DW_TAG_member)
    <92689>   DW_AT_name        : (indirect string, offset: 0x3b06c): int_frac_digits
    <9268d>   DW_AT_decl_file   : 71
    <9268e>   DW_AT_decl_line   : 75
    <9268f>   DW_AT_decl_column : 8
    <92690>   DW_AT_type        : <0x7996f>
    <92694>   DW_AT_data_member_location: 80
 <2><92695>: Abbrev Number: 18 (DW_TAG_member)
    <92696>   DW_AT_name        : (indirect string, offset: 0x3b070): frac_digits
    <9269a>   DW_AT_decl_file   : 71
    <9269b>   DW_AT_decl_line   : 76
    <9269c>   DW_AT_decl_column : 8
    <9269d>   DW_AT_type        : <0x7996f>
    <926a1>   DW_AT_data_member_location: 81
 <2><926a2>: Abbrev Number: 18 (DW_TAG_member)
    <926a3>   DW_AT_name        : (indirect string, offset: 0x1d411): p_cs_precedes
    <926a7>   DW_AT_decl_file   : 71
    <926a8>   DW_AT_decl_line   : 78
    <926a9>   DW_AT_decl_column : 8
    <926aa>   DW_AT_type        : <0x7996f>
    <926ae>   DW_AT_data_member_location: 82
 <2><926af>: Abbrev Number: 18 (DW_TAG_member)
    <926b0>   DW_AT_name        : (indirect string, offset: 0x10fda): p_sep_by_space
    <926b4>   DW_AT_decl_file   : 71
    <926b5>   DW_AT_decl_line   : 80
    <926b6>   DW_AT_decl_column : 8
    <926b7>   DW_AT_type        : <0x7996f>
    <926bb>   DW_AT_data_member_location: 83
 <2><926bc>: Abbrev Number: 18 (DW_TAG_member)
    <926bd>   DW_AT_name        : (indirect string, offset: 0x1c842): n_cs_precedes
    <926c1>   DW_AT_decl_file   : 71
    <926c2>   DW_AT_decl_line   : 82
    <926c3>   DW_AT_decl_column : 8
    <926c4>   DW_AT_type        : <0x7996f>
    <926c8>   DW_AT_data_member_location: 84
 <2><926c9>: Abbrev Number: 18 (DW_TAG_member)
    <926ca>   DW_AT_name        : (indirect string, offset: 0x45d35): n_sep_by_space
    <926ce>   DW_AT_decl_file   : 71
    <926cf>   DW_AT_decl_line   : 84
    <926d0>   DW_AT_decl_column : 8
    <926d1>   DW_AT_type        : <0x7996f>
    <926d5>   DW_AT_data_member_location: 85
 <2><926d6>: Abbrev Number: 18 (DW_TAG_member)
    <926d7>   DW_AT_name        : (indirect string, offset: 0x31ec3): p_sign_posn
    <926db>   DW_AT_decl_file   : 71
    <926dc>   DW_AT_decl_line   : 91
    <926dd>   DW_AT_decl_column : 8
    <926de>   DW_AT_type        : <0x7996f>
    <926e2>   DW_AT_data_member_location: 86
 <2><926e3>: Abbrev Number: 18 (DW_TAG_member)
    <926e4>   DW_AT_name        : (indirect string, offset: 0x21ba7): n_sign_posn
    <926e8>   DW_AT_decl_file   : 71
    <926e9>   DW_AT_decl_line   : 92
    <926ea>   DW_AT_decl_column : 8
    <926eb>   DW_AT_type        : <0x7996f>
    <926ef>   DW_AT_data_member_location: 87
 <2><926f0>: Abbrev Number: 18 (DW_TAG_member)
    <926f1>   DW_AT_name        : (indirect string, offset: 0x1d40d): int_p_cs_precedes
    <926f5>   DW_AT_decl_file   : 71
    <926f6>   DW_AT_decl_line   : 95
    <926f7>   DW_AT_decl_column : 8
    <926f8>   DW_AT_type        : <0x7996f>
    <926fc>   DW_AT_data_member_location: 88
 <2><926fd>: Abbrev Number: 18 (DW_TAG_member)
    <926fe>   DW_AT_name        : (indirect string, offset: 0x10fd6): int_p_sep_by_space
    <92702>   DW_AT_decl_file   : 71
    <92703>   DW_AT_decl_line   : 97
    <92704>   DW_AT_decl_column : 8
    <92705>   DW_AT_type        : <0x7996f>
    <92709>   DW_AT_data_member_location: 89
 <2><9270a>: Abbrev Number: 18 (DW_TAG_member)
    <9270b>   DW_AT_name        : (indirect string, offset: 0x1c83e): int_n_cs_precedes
    <9270f>   DW_AT_decl_file   : 71
    <92710>   DW_AT_decl_line   : 99
    <92711>   DW_AT_decl_column : 8
    <92712>   DW_AT_type        : <0x7996f>
    <92716>   DW_AT_data_member_location: 90
 <2><92717>: Abbrev Number: 18 (DW_TAG_member)
    <92718>   DW_AT_name        : (indirect string, offset: 0x45d31): int_n_sep_by_space
    <9271c>   DW_AT_decl_file   : 71
    <9271d>   DW_AT_decl_line   : 101
    <9271e>   DW_AT_decl_column : 8
    <9271f>   DW_AT_type        : <0x7996f>
    <92723>   DW_AT_data_member_location: 91
 <2><92724>: Abbrev Number: 18 (DW_TAG_member)
    <92725>   DW_AT_name        : (indirect string, offset: 0x31ebf): int_p_sign_posn
    <92729>   DW_AT_decl_file   : 71
    <9272a>   DW_AT_decl_line   : 108
    <9272b>   DW_AT_decl_column : 8
    <9272c>   DW_AT_type        : <0x7996f>
    <92730>   DW_AT_data_member_location: 92
 <2><92731>: Abbrev Number: 18 (DW_TAG_member)
    <92732>   DW_AT_name        : (indirect string, offset: 0x21ba3): int_n_sign_posn
    <92736>   DW_AT_decl_file   : 71
    <92737>   DW_AT_decl_line   : 109
    <92738>   DW_AT_decl_column : 8
    <92739>   DW_AT_type        : <0x7996f>
    <9273d>   DW_AT_data_member_location: 93
 <2><9273e>: Abbrev Number: 0
 <1><9273f>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92740>   DW_AT_external    : 1
    <92740>   DW_AT_name        : (indirect string, offset: 0x2231f): setlocale
    <92744>   DW_AT_decl_file   : 71
    <92745>   DW_AT_decl_line   : 122
    <92746>   DW_AT_decl_column : 14
    <92747>   DW_AT_type        : <0x7996a>
    <9274b>   DW_AT_declaration : 1
    <9274b>   DW_AT_sibling     : <0x9275a>
 <2><9274f>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92750>   DW_AT_type        : <0x7980a>
 <2><92754>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92755>   DW_AT_type        : <0x8fe3f>
 <2><92759>: Abbrev Number: 0
 <1><9275a>: Abbrev Number: 116 (DW_TAG_subprogram)
    <9275b>   DW_AT_external    : 1
    <9275b>   DW_AT_name        : (indirect string, offset: 0x4e634): localeconv
    <9275f>   DW_AT_decl_file   : 71
    <92760>   DW_AT_decl_line   : 125
    <92761>   DW_AT_decl_column : 22
    <92762>   DW_AT_type        : <0x92766>
    <92766>   DW_AT_declaration : 1
 <1><92766>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <92767>   DW_AT_byte_size   : 8
    <92767>   DW_AT_type        : <0x925f9>
 <1><9276b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <9276c>   DW_AT_sibling     : <0x92776>
 <2><92770>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92771>   DW_AT_type        : <0x79937>
 <2><92775>: Abbrev Number: 0
 <1><92776>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <92777>   DW_AT_byte_size   : 8
    <92777>   DW_AT_type        : <0x9276b>
 <1><9277b>: Abbrev Number: 32 (DW_TAG_subprogram)
    <9277c>   DW_AT_external    : 1
    <9277c>   DW_AT_name        : (indirect string, offset: 0xefbe): clearerr
    <92780>   DW_AT_decl_file   : 65
    <92781>   DW_AT_decl_line   : 762
    <92783>   DW_AT_decl_column : 13
    <92784>   DW_AT_declaration : 1
    <92784>   DW_AT_sibling     : <0x9278e>
 <2><92788>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92789>   DW_AT_type        : <0x91cf9>
 <2><9278d>: Abbrev Number: 0
 <1><9278e>: Abbrev Number: 29 (DW_TAG_subprogram)
    <9278f>   DW_AT_external    : 1
    <9278f>   DW_AT_name        : (indirect string, offset: 0x1c703): fclose
    <92793>   DW_AT_decl_file   : 65
    <92794>   DW_AT_decl_line   : 213
    <92795>   DW_AT_decl_column : 12
    <92796>   DW_AT_type        : <0x7980a>
    <9279a>   DW_AT_declaration : 1
    <9279a>   DW_AT_sibling     : <0x927a4>
 <2><9279e>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9279f>   DW_AT_type        : <0x91cf9>
 <2><927a3>: Abbrev Number: 0
 <1><927a4>: Abbrev Number: 23 (DW_TAG_subprogram)
    <927a5>   DW_AT_external    : 1
    <927a5>   DW_AT_name        : (indirect string, offset: 0x4087c): feof
    <927a9>   DW_AT_decl_file   : 65
    <927aa>   DW_AT_decl_line   : 764
    <927ac>   DW_AT_decl_column : 12
    <927ad>   DW_AT_type        : <0x7980a>
    <927b1>   DW_AT_declaration : 1
    <927b1>   DW_AT_sibling     : <0x927bb>
 <2><927b5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <927b6>   DW_AT_type        : <0x91cf9>
 <2><927ba>: Abbrev Number: 0
 <1><927bb>: Abbrev Number: 23 (DW_TAG_subprogram)
    <927bc>   DW_AT_external    : 1
    <927bc>   DW_AT_name        : (indirect string, offset: 0xe261): ferror
    <927c0>   DW_AT_decl_file   : 65
    <927c1>   DW_AT_decl_line   : 766
    <927c3>   DW_AT_decl_column : 12
    <927c4>   DW_AT_type        : <0x7980a>
    <927c8>   DW_AT_declaration : 1
    <927c8>   DW_AT_sibling     : <0x927d2>
 <2><927cc>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <927cd>   DW_AT_type        : <0x91cf9>
 <2><927d1>: Abbrev Number: 0
 <1><927d2>: Abbrev Number: 29 (DW_TAG_subprogram)
    <927d3>   DW_AT_external    : 1
    <927d3>   DW_AT_name        : (indirect string, offset: 0x22dda): fflush
    <927d7>   DW_AT_decl_file   : 65
    <927d8>   DW_AT_decl_line   : 218
    <927d9>   DW_AT_decl_column : 12
    <927da>   DW_AT_type        : <0x7980a>
    <927de>   DW_AT_declaration : 1
    <927de>   DW_AT_sibling     : <0x927e8>
 <2><927e2>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <927e3>   DW_AT_type        : <0x91cf9>
 <2><927e7>: Abbrev Number: 0
 <1><927e8>: Abbrev Number: 23 (DW_TAG_subprogram)
    <927e9>   DW_AT_external    : 1
    <927e9>   DW_AT_name        : (indirect string, offset: 0x136e8): fgetc
    <927ed>   DW_AT_decl_file   : 65
    <927ee>   DW_AT_decl_line   : 489
    <927f0>   DW_AT_decl_column : 12
    <927f1>   DW_AT_type        : <0x7980a>
    <927f5>   DW_AT_declaration : 1
    <927f5>   DW_AT_sibling     : <0x927ff>
 <2><927f9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <927fa>   DW_AT_type        : <0x91cf9>
 <2><927fe>: Abbrev Number: 0
 <1><927ff>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92800>   DW_AT_external    : 1
    <92800>   DW_AT_name        : (indirect string, offset: 0x57e61): fgetpos
    <92804>   DW_AT_decl_file   : 65
    <92805>   DW_AT_decl_line   : 736
    <92807>   DW_AT_decl_column : 12
    <92808>   DW_AT_type        : <0x7980a>
    <9280c>   DW_AT_declaration : 1
    <9280c>   DW_AT_sibling     : <0x9281b>
 <2><92810>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92811>   DW_AT_type        : <0x91cf9>
 <2><92815>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92816>   DW_AT_type        : <0x9281b>
 <2><9281a>: Abbrev Number: 0
 <1><9281b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <9281c>   DW_AT_byte_size   : 8
    <9281c>   DW_AT_type        : <0x91cdc>
 <1><92820>: Abbrev Number: 23 (DW_TAG_subprogram)
    <92821>   DW_AT_external    : 1
    <92821>   DW_AT_name        : (indirect string, offset: 0x13724): fgets
    <92825>   DW_AT_decl_file   : 65
    <92826>   DW_AT_decl_line   : 568
    <92828>   DW_AT_decl_column : 14
    <92829>   DW_AT_type        : <0x7996a>
    <9282d>   DW_AT_declaration : 1
    <9282d>   DW_AT_sibling     : <0x92841>
 <2><92831>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92832>   DW_AT_type        : <0x7996a>
 <2><92836>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92837>   DW_AT_type        : <0x7980a>
 <2><9283b>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9283c>   DW_AT_type        : <0x91cf9>
 <2><92840>: Abbrev Number: 0
 <1><92841>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92842>   DW_AT_external    : 1
    <92842>   DW_AT_name        : (indirect string, offset: 0x3f063): fopen
    <92846>   DW_AT_decl_file   : 65
    <92847>   DW_AT_decl_line   : 246
    <92848>   DW_AT_decl_column : 14
    <92849>   DW_AT_type        : <0x91cf9>
    <9284d>   DW_AT_declaration : 1
    <9284d>   DW_AT_sibling     : <0x9285c>
 <2><92851>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92852>   DW_AT_type        : <0x8fe3f>
 <2><92856>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92857>   DW_AT_type        : <0x8fe3f>
 <2><9285b>: Abbrev Number: 0
 <1><9285c>: Abbrev Number: 23 (DW_TAG_subprogram)
    <9285d>   DW_AT_external    : 1
    <9285d>   DW_AT_name        : (indirect string, offset: 0x40274): fread
    <92861>   DW_AT_decl_file   : 65
    <92862>   DW_AT_decl_line   : 651
    <92864>   DW_AT_decl_column : 15
    <92865>   DW_AT_type        : <0x7977a>
    <92869>   DW_AT_declaration : 1
    <92869>   DW_AT_sibling     : <0x92882>
 <2><9286d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9286e>   DW_AT_type        : <0x79937>
 <2><92872>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92873>   DW_AT_type        : <0x7977a>
 <2><92877>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92878>   DW_AT_type        : <0x7977a>
 <2><9287c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9287d>   DW_AT_type        : <0x91cf9>
 <2><92881>: Abbrev Number: 0
 <1><92882>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92883>   DW_AT_external    : 1
    <92883>   DW_AT_name        : (indirect string, offset: 0x510e0): freopen
    <92887>   DW_AT_decl_file   : 65
    <92888>   DW_AT_decl_line   : 252
    <92889>   DW_AT_decl_column : 14
    <9288a>   DW_AT_type        : <0x91cf9>
    <9288e>   DW_AT_declaration : 1
    <9288e>   DW_AT_sibling     : <0x928a2>
 <2><92892>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92893>   DW_AT_type        : <0x8fe3f>
 <2><92897>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92898>   DW_AT_type        : <0x8fe3f>
 <2><9289c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9289d>   DW_AT_type        : <0x91cf9>
 <2><928a1>: Abbrev Number: 0
 <1><928a2>: Abbrev Number: 23 (DW_TAG_subprogram)
    <928a3>   DW_AT_external    : 1
    <928a3>   DW_AT_name        : (indirect string, offset: 0x19ffc): fseek
    <928a7>   DW_AT_decl_file   : 65
    <928a8>   DW_AT_decl_line   : 689
    <928aa>   DW_AT_decl_column : 12
    <928ab>   DW_AT_type        : <0x7980a>
    <928af>   DW_AT_declaration : 1
    <928af>   DW_AT_sibling     : <0x928c3>
 <2><928b3>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928b4>   DW_AT_type        : <0x91cf9>
 <2><928b8>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928b9>   DW_AT_type        : <0x79773>
 <2><928bd>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928be>   DW_AT_type        : <0x7980a>
 <2><928c2>: Abbrev Number: 0
 <1><928c3>: Abbrev Number: 23 (DW_TAG_subprogram)
    <928c4>   DW_AT_external    : 1
    <928c4>   DW_AT_name        : (indirect string, offset: 0x4ca45): fsetpos
    <928c8>   DW_AT_decl_file   : 65
    <928c9>   DW_AT_decl_line   : 741
    <928cb>   DW_AT_decl_column : 12
    <928cc>   DW_AT_type        : <0x7980a>
    <928d0>   DW_AT_declaration : 1
    <928d0>   DW_AT_sibling     : <0x928df>
 <2><928d4>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928d5>   DW_AT_type        : <0x91cf9>
 <2><928d9>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928da>   DW_AT_type        : <0x928df>
 <2><928de>: Abbrev Number: 0
 <1><928df>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <928e0>   DW_AT_byte_size   : 8
    <928e0>   DW_AT_type        : <0x91ce8>
 <1><928e4>: Abbrev Number: 23 (DW_TAG_subprogram)
    <928e5>   DW_AT_external    : 1
    <928e5>   DW_AT_name        : (indirect string, offset: 0x51fb4): ftell
    <928e9>   DW_AT_decl_file   : 65
    <928ea>   DW_AT_decl_line   : 694
    <928ec>   DW_AT_decl_column : 17
    <928ed>   DW_AT_type        : <0x79773>
    <928f1>   DW_AT_declaration : 1
    <928f1>   DW_AT_sibling     : <0x928fb>
 <2><928f5>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <928f6>   DW_AT_type        : <0x91cf9>
 <2><928fa>: Abbrev Number: 0
 <1><928fb>: Abbrev Number: 23 (DW_TAG_subprogram)
    <928fc>   DW_AT_external    : 1
    <928fc>   DW_AT_name        : (indirect string, offset: 0x136e9): getc
    <92900>   DW_AT_decl_file   : 65
    <92901>   DW_AT_decl_line   : 490
    <92903>   DW_AT_decl_column : 12
    <92904>   DW_AT_type        : <0x7980a>
    <92908>   DW_AT_declaration : 1
    <92908>   DW_AT_sibling     : <0x92912>
 <2><9290c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9290d>   DW_AT_type        : <0x91cf9>
 <2><92911>: Abbrev Number: 0
 <1><92912>: Abbrev Number: 89 (DW_TAG_subprogram)
    <92913>   DW_AT_external    : 1
    <92913>   DW_AT_name        : (indirect string, offset: 0x8f09f): getchar
    <92917>   DW_AT_decl_file   : 65
    <92918>   DW_AT_decl_line   : 496
    <9291a>   DW_AT_decl_column : 12
    <9291b>   DW_AT_type        : <0x7980a>
    <9291f>   DW_AT_declaration : 1
 <1><9291f>: Abbrev Number: 32 (DW_TAG_subprogram)
    <92920>   DW_AT_external    : 1
    <92920>   DW_AT_name        : (indirect string, offset: 0x416f): perror
    <92924>   DW_AT_decl_file   : 65
    <92925>   DW_AT_decl_line   : 780
    <92927>   DW_AT_decl_column : 13
    <92928>   DW_AT_declaration : 1
    <92928>   DW_AT_sibling     : <0x92932>
 <2><9292c>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9292d>   DW_AT_type        : <0x8fe3f>
 <2><92931>: Abbrev Number: 0
 <1><92932>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92933>   DW_AT_external    : 1
    <92933>   DW_AT_name        : (indirect string, offset: 0x6ed27): remove
    <92937>   DW_AT_decl_file   : 65
    <92938>   DW_AT_decl_line   : 146
    <92939>   DW_AT_decl_column : 12
    <9293a>   DW_AT_type        : <0x7980a>
    <9293e>   DW_AT_declaration : 1
    <9293e>   DW_AT_sibling     : <0x92948>
 <2><92942>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92943>   DW_AT_type        : <0x8fe3f>
 <2><92947>: Abbrev Number: 0
 <1><92948>: Abbrev Number: 29 (DW_TAG_subprogram)
    <92949>   DW_AT_external    : 1
    <92949>   DW_AT_name        : (indirect string, offset: 0x2eb8f): rename
    <9294d>   DW_AT_decl_file   : 65
    <9294e>   DW_AT_decl_line   : 148
    <9294f>   DW_AT_decl_column : 12
    <92950>   DW_AT_type        : <0x7980a>
    <92954>   DW_AT_declaration : 1
    <92954>   DW_AT_sibling     : <0x92963>
 <2><92958>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92959>   DW_AT_type        : <0x8fe3f>
 <2><9295d>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <9295e>   DW_AT_type        : <0x8fe3f>
 <2><92962>: Abbrev Number: 0
 <1><92963>: Abbrev Number: 32 (DW_TAG_subprogram)
    <92964>   DW_AT_external    : 1
    <92964>   DW_AT_name        : (indirect string, offset: 0x21bf1): rewind
    <92968>   DW_AT_decl_file   : 65
    <92969>   DW_AT_decl_line   : 699
    <9296b>   DW_AT_decl_column : 13
    <9296c>   DW_AT_declaration : 1
    <9296c>   DW_AT_sibling     : <0x92976>
 <2><92970>: Abbrev Number: 1 (DW_TAG_formal_parameter)
    <92971>   DW_AT_type        : <0x91cf9>
 <2><92975>: Abbrev Number: 0
