    <93b23>   DW_AT_type        : <0x93896>
    <93b27>   DW_AT_data_member_location: 40
 <2><93b28>: Abbrev Number: 10 (DW_TAG_member)
    <93b29>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <93b2d>   DW_AT_decl_file   : 81
    <93b2e>   DW_AT_decl_line   : 582
    <93b30>   DW_AT_decl_column : 9
    <93b31>   DW_AT_type        : <0x93896>
    <93b35>   DW_AT_data_member_location: 48
 <2><93b36>: Abbrev Number: 10 (DW_TAG_member)
    <93b37>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <93b3b>   DW_AT_decl_file   : 81
    <93b3c>   DW_AT_decl_line   : 583
    <93b3e>   DW_AT_decl_column : 7
    <93b3f>   DW_AT_type        : <0x9388a>
    <93b43>   DW_AT_data_member_location: 56
 <2><93b44>: Abbrev Number: 31 (DW_TAG_member)
    <93b45>   DW_AT_name        : x
    <93b47>   DW_AT_decl_file   : 81
    <93b48>   DW_AT_decl_line   : 584
    <93b4a>   DW_AT_decl_column : 6
    <93b4b>   DW_AT_type        : <0x7980a>
    <93b4f>   DW_AT_data_member_location: 64
 <2><93b50>: Abbrev Number: 31 (DW_TAG_member)
    <93b51>   DW_AT_name        : y
    <93b53>   DW_AT_decl_file   : 81
    <93b54>   DW_AT_decl_line   : 584
    <93b56>   DW_AT_decl_column : 9
    <93b57>   DW_AT_type        : <0x7980a>
    <93b5b>   DW_AT_data_member_location: 68
 <2><93b5c>: Abbrev Number: 10 (DW_TAG_member)
    <93b5d>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <93b61>   DW_AT_decl_file   : 81
    <93b62>   DW_AT_decl_line   : 585
    <93b64>   DW_AT_decl_column : 6
    <93b65>   DW_AT_type        : <0x7980a>
    <93b69>   DW_AT_data_member_location: 72
 <2><93b6a>: Abbrev Number: 10 (DW_TAG_member)
    <93b6b>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <93b6f>   DW_AT_decl_file   : 81
    <93b70>   DW_AT_decl_line   : 585
    <93b72>   DW_AT_decl_column : 14
    <93b73>   DW_AT_type        : <0x7980a>
    <93b77>   DW_AT_data_member_location: 76
 <2><93b78>: Abbrev Number: 10 (DW_TAG_member)
    <93b79>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <93b7d>   DW_AT_decl_file   : 81
    <93b7e>   DW_AT_decl_line   : 586
    <93b80>   DW_AT_decl_column : 15
    <93b81>   DW_AT_type        : <0x797b4>
    <93b85>   DW_AT_data_member_location: 80
 <2><93b86>: Abbrev Number: 10 (DW_TAG_member)
    <93b87>   DW_AT_name        : (indirect string, offset: 0x48b67): button
    <93b8b>   DW_AT_decl_file   : 81
    <93b8c>   DW_AT_decl_line   : 587
    <93b8e>   DW_AT_decl_column : 15
    <93b8f>   DW_AT_type        : <0x797b4>
    <93b93>   DW_AT_data_member_location: 84
 <2><93b94>: Abbrev Number: 10 (DW_TAG_member)
    <93b95>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <93b99>   DW_AT_decl_file   : 81
    <93b9a>   DW_AT_decl_line   : 588
    <93b9c>   DW_AT_decl_column : 7
    <93b9d>   DW_AT_type        : <0x7980a>
    <93ba1>   DW_AT_data_member_location: 88
 <2><93ba2>: Abbrev Number: 0
 <1><93ba3>: Abbrev Number: 4 (DW_TAG_typedef)
    <93ba4>   DW_AT_name        : (indirect string, offset: 0x84cdb): XButtonEvent
    <93ba8>   DW_AT_decl_file   : 81
    <93ba9>   DW_AT_decl_line   : 589
    <93bab>   DW_AT_decl_column : 3
    <93bac>   DW_AT_type        : <0x93ac6>
 <1><93bb0>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93bb1>   DW_AT_byte_size   : 96
    <93bb2>   DW_AT_decl_file   : 81
    <93bb3>   DW_AT_decl_line   : 593
    <93bb5>   DW_AT_decl_column : 16
    <93bb6>   DW_AT_linkage_name: (indirect string, offset: 0x6223b): 12XMotionEvent
    <93bba>   DW_AT_sibling     : <0x93c8d>
 <2><93bbe>: Abbrev Number: 10 (DW_TAG_member)
    <93bbf>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93bc3>   DW_AT_decl_file   : 81
    <93bc4>   DW_AT_decl_line   : 594
    <93bc6>   DW_AT_decl_column : 6
    <93bc7>   DW_AT_type        : <0x7980a>
    <93bcb>   DW_AT_data_member_location: 0
 <2><93bcc>: Abbrev Number: 10 (DW_TAG_member)
    <93bcd>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93bd1>   DW_AT_decl_file   : 81
    <93bd2>   DW_AT_decl_line   : 595
    <93bd4>   DW_AT_decl_column : 16
    <93bd5>   DW_AT_type        : <0x79786>
    <93bd9>   DW_AT_data_member_location: 8
 <2><93bda>: Abbrev Number: 10 (DW_TAG_member)
    <93bdb>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93bdf>   DW_AT_decl_file   : 81
    <93be0>   DW_AT_decl_line   : 596
    <93be2>   DW_AT_decl_column : 7
    <93be3>   DW_AT_type        : <0x7980a>
    <93be7>   DW_AT_data_member_location: 16
 <2><93be8>: Abbrev Number: 10 (DW_TAG_member)
    <93be9>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93bed>   DW_AT_decl_file   : 81
    <93bee>   DW_AT_decl_line   : 597
    <93bf0>   DW_AT_decl_column : 11
    <93bf1>   DW_AT_type        : <0x93ab4>
    <93bf5>   DW_AT_data_member_location: 24
 <2><93bf6>: Abbrev Number: 10 (DW_TAG_member)
    <93bf7>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <93bfb>   DW_AT_decl_file   : 81
    <93bfc>   DW_AT_decl_line   : 598
    <93bfe>   DW_AT_decl_column : 9
    <93bff>   DW_AT_type        : <0x93896>
    <93c03>   DW_AT_data_member_location: 32
 <2><93c04>: Abbrev Number: 10 (DW_TAG_member)
    <93c05>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <93c09>   DW_AT_decl_file   : 81
    <93c0a>   DW_AT_decl_line   : 599
    <93c0c>   DW_AT_decl_column : 9
    <93c0d>   DW_AT_type        : <0x93896>
    <93c11>   DW_AT_data_member_location: 40
 <2><93c12>: Abbrev Number: 10 (DW_TAG_member)
    <93c13>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <93c17>   DW_AT_decl_file   : 81
    <93c18>   DW_AT_decl_line   : 600
    <93c1a>   DW_AT_decl_column : 9
    <93c1b>   DW_AT_type        : <0x93896>
    <93c1f>   DW_AT_data_member_location: 48
 <2><93c20>: Abbrev Number: 10 (DW_TAG_member)
    <93c21>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <93c25>   DW_AT_decl_file   : 81
    <93c26>   DW_AT_decl_line   : 601
    <93c28>   DW_AT_decl_column : 7
    <93c29>   DW_AT_type        : <0x9388a>
    <93c2d>   DW_AT_data_member_location: 56
 <2><93c2e>: Abbrev Number: 31 (DW_TAG_member)
    <93c2f>   DW_AT_name        : x
    <93c31>   DW_AT_decl_file   : 81
    <93c32>   DW_AT_decl_line   : 602
    <93c34>   DW_AT_decl_column : 6
    <93c35>   DW_AT_type        : <0x7980a>
    <93c39>   DW_AT_data_member_location: 64
 <2><93c3a>: Abbrev Number: 31 (DW_TAG_member)
    <93c3b>   DW_AT_name        : y
    <93c3d>   DW_AT_decl_file   : 81
    <93c3e>   DW_AT_decl_line   : 602
    <93c40>   DW_AT_decl_column : 9
    <93c41>   DW_AT_type        : <0x7980a>
    <93c45>   DW_AT_data_member_location: 68
 <2><93c46>: Abbrev Number: 10 (DW_TAG_member)
    <93c47>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <93c4b>   DW_AT_decl_file   : 81
    <93c4c>   DW_AT_decl_line   : 603
    <93c4e>   DW_AT_decl_column : 6
    <93c4f>   DW_AT_type        : <0x7980a>
    <93c53>   DW_AT_data_member_location: 72
 <2><93c54>: Abbrev Number: 10 (DW_TAG_member)
    <93c55>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <93c59>   DW_AT_decl_file   : 81
    <93c5a>   DW_AT_decl_line   : 603
    <93c5c>   DW_AT_decl_column : 14
    <93c5d>   DW_AT_type        : <0x7980a>
    <93c61>   DW_AT_data_member_location: 76
 <2><93c62>: Abbrev Number: 10 (DW_TAG_member)
    <93c63>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <93c67>   DW_AT_decl_file   : 81
    <93c68>   DW_AT_decl_line   : 604
    <93c6a>   DW_AT_decl_column : 15
    <93c6b>   DW_AT_type        : <0x797b4>
    <93c6f>   DW_AT_data_member_location: 80
 <2><93c70>: Abbrev Number: 10 (DW_TAG_member)
    <93c71>   DW_AT_name        : (indirect string, offset: 0x5e6a8): is_hint
    <93c75>   DW_AT_decl_file   : 81
    <93c76>   DW_AT_decl_line   : 605
    <93c78>   DW_AT_decl_column : 7
    <93c79>   DW_AT_type        : <0x7996f>
    <93c7d>   DW_AT_data_member_location: 84
 <2><93c7e>: Abbrev Number: 10 (DW_TAG_member)
    <93c7f>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <93c83>   DW_AT_decl_file   : 81
    <93c84>   DW_AT_decl_line   : 606
    <93c86>   DW_AT_decl_column : 7
    <93c87>   DW_AT_type        : <0x7980a>
    <93c8b>   DW_AT_data_member_location: 88
 <2><93c8c>: Abbrev Number: 0
 <1><93c8d>: Abbrev Number: 4 (DW_TAG_typedef)
    <93c8e>   DW_AT_name        : (indirect string, offset: 0x6223d): XMotionEvent
    <93c92>   DW_AT_decl_file   : 81
    <93c93>   DW_AT_decl_line   : 607
    <93c95>   DW_AT_decl_column : 3
    <93c96>   DW_AT_type        : <0x93bb0>
 <1><93c9a>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93c9b>   DW_AT_byte_size   : 104
    <93c9c>   DW_AT_decl_file   : 81
    <93c9d>   DW_AT_decl_line   : 610
    <93c9f>   DW_AT_decl_column : 16
    <93ca0>   DW_AT_linkage_name: (indirect string, offset: 0x735e2): 14XCrossingEvent
    <93ca4>   DW_AT_sibling     : <0x93d93>
 <2><93ca8>: Abbrev Number: 10 (DW_TAG_member)
    <93ca9>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93cad>   DW_AT_decl_file   : 81
    <93cae>   DW_AT_decl_line   : 611
    <93cb0>   DW_AT_decl_column : 6
    <93cb1>   DW_AT_type        : <0x7980a>
    <93cb5>   DW_AT_data_member_location: 0
 <2><93cb6>: Abbrev Number: 10 (DW_TAG_member)
    <93cb7>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93cbb>   DW_AT_decl_file   : 81
    <93cbc>   DW_AT_decl_line   : 612
    <93cbe>   DW_AT_decl_column : 16
    <93cbf>   DW_AT_type        : <0x79786>
    <93cc3>   DW_AT_data_member_location: 8
 <2><93cc4>: Abbrev Number: 10 (DW_TAG_member)
    <93cc5>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93cc9>   DW_AT_decl_file   : 81
    <93cca>   DW_AT_decl_line   : 613
    <93ccc>   DW_AT_decl_column : 7
    <93ccd>   DW_AT_type        : <0x7980a>
    <93cd1>   DW_AT_data_member_location: 16
 <2><93cd2>: Abbrev Number: 10 (DW_TAG_member)
    <93cd3>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93cd7>   DW_AT_decl_file   : 81
    <93cd8>   DW_AT_decl_line   : 614
    <93cda>   DW_AT_decl_column : 11
    <93cdb>   DW_AT_type        : <0x93ab4>
    <93cdf>   DW_AT_data_member_location: 24
 <2><93ce0>: Abbrev Number: 10 (DW_TAG_member)
    <93ce1>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <93ce5>   DW_AT_decl_file   : 81
    <93ce6>   DW_AT_decl_line   : 615
    <93ce8>   DW_AT_decl_column : 9
    <93ce9>   DW_AT_type        : <0x93896>
    <93ced>   DW_AT_data_member_location: 32
 <2><93cee>: Abbrev Number: 10 (DW_TAG_member)
    <93cef>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <93cf3>   DW_AT_decl_file   : 81
    <93cf4>   DW_AT_decl_line   : 616
    <93cf6>   DW_AT_decl_column : 9
    <93cf7>   DW_AT_type        : <0x93896>
    <93cfb>   DW_AT_data_member_location: 40
 <2><93cfc>: Abbrev Number: 10 (DW_TAG_member)
    <93cfd>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <93d01>   DW_AT_decl_file   : 81
    <93d02>   DW_AT_decl_line   : 617
    <93d04>   DW_AT_decl_column : 9
    <93d05>   DW_AT_type        : <0x93896>
    <93d09>   DW_AT_data_member_location: 48
 <2><93d0a>: Abbrev Number: 10 (DW_TAG_member)
    <93d0b>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <93d0f>   DW_AT_decl_file   : 81
    <93d10>   DW_AT_decl_line   : 618
    <93d12>   DW_AT_decl_column : 7
    <93d13>   DW_AT_type        : <0x9388a>
    <93d17>   DW_AT_data_member_location: 56
 <2><93d18>: Abbrev Number: 31 (DW_TAG_member)
    <93d19>   DW_AT_name        : x
    <93d1b>   DW_AT_decl_file   : 81
    <93d1c>   DW_AT_decl_line   : 619
    <93d1e>   DW_AT_decl_column : 6
    <93d1f>   DW_AT_type        : <0x7980a>
    <93d23>   DW_AT_data_member_location: 64
 <2><93d24>: Abbrev Number: 31 (DW_TAG_member)
    <93d25>   DW_AT_name        : y
    <93d27>   DW_AT_decl_file   : 81
    <93d28>   DW_AT_decl_line   : 619
    <93d2a>   DW_AT_decl_column : 9
    <93d2b>   DW_AT_type        : <0x7980a>
    <93d2f>   DW_AT_data_member_location: 68
 <2><93d30>: Abbrev Number: 10 (DW_TAG_member)
    <93d31>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <93d35>   DW_AT_decl_file   : 81
    <93d36>   DW_AT_decl_line   : 620
    <93d38>   DW_AT_decl_column : 6
    <93d39>   DW_AT_type        : <0x7980a>
    <93d3d>   DW_AT_data_member_location: 72
 <2><93d3e>: Abbrev Number: 10 (DW_TAG_member)
    <93d3f>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <93d43>   DW_AT_decl_file   : 81
    <93d44>   DW_AT_decl_line   : 620
    <93d46>   DW_AT_decl_column : 14
    <93d47>   DW_AT_type        : <0x7980a>
    <93d4b>   DW_AT_data_member_location: 76
 <2><93d4c>: Abbrev Number: 10 (DW_TAG_member)
    <93d4d>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <93d51>   DW_AT_decl_file   : 81
    <93d52>   DW_AT_decl_line   : 621
    <93d54>   DW_AT_decl_column : 6
    <93d55>   DW_AT_type        : <0x7980a>
    <93d59>   DW_AT_data_member_location: 80
 <2><93d5a>: Abbrev Number: 10 (DW_TAG_member)
    <93d5b>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <93d5f>   DW_AT_decl_file   : 81
    <93d60>   DW_AT_decl_line   : 622
    <93d62>   DW_AT_decl_column : 6
    <93d63>   DW_AT_type        : <0x7980a>
    <93d67>   DW_AT_data_member_location: 84
 <2><93d68>: Abbrev Number: 10 (DW_TAG_member)
    <93d69>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <93d6d>   DW_AT_decl_file   : 81
    <93d6e>   DW_AT_decl_line   : 627
    <93d70>   DW_AT_decl_column : 7
    <93d71>   DW_AT_type        : <0x7980a>
    <93d75>   DW_AT_data_member_location: 88
 <2><93d76>: Abbrev Number: 10 (DW_TAG_member)
    <93d77>   DW_AT_name        : (indirect string, offset: 0x5a0d9): focus
    <93d7b>   DW_AT_decl_file   : 81
    <93d7c>   DW_AT_decl_line   : 628
    <93d7e>   DW_AT_decl_column : 7
    <93d7f>   DW_AT_type        : <0x7980a>
    <93d83>   DW_AT_data_member_location: 92
 <2><93d84>: Abbrev Number: 10 (DW_TAG_member)
    <93d85>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <93d89>   DW_AT_decl_file   : 81
    <93d8a>   DW_AT_decl_line   : 629
    <93d8c>   DW_AT_decl_column : 15
    <93d8d>   DW_AT_type        : <0x797b4>
    <93d91>   DW_AT_data_member_location: 96
 <2><93d92>: Abbrev Number: 0
 <1><93d93>: Abbrev Number: 4 (DW_TAG_typedef)
    <93d94>   DW_AT_name        : (indirect string, offset: 0x735e4): XCrossingEvent
    <93d98>   DW_AT_decl_file   : 81
    <93d99>   DW_AT_decl_line   : 630
    <93d9b>   DW_AT_decl_column : 3
    <93d9c>   DW_AT_type        : <0x93c9a>
 <1><93da0>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93da1>   DW_AT_byte_size   : 48
    <93da2>   DW_AT_decl_file   : 81
    <93da3>   DW_AT_decl_line   : 634
    <93da5>   DW_AT_decl_column : 16
    <93da6>   DW_AT_linkage_name: (indirect string, offset: 0x71788): 17XFocusChangeEvent
    <93daa>   DW_AT_sibling     : <0x93e11>
 <2><93dae>: Abbrev Number: 10 (DW_TAG_member)
    <93daf>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93db3>   DW_AT_decl_file   : 81
    <93db4>   DW_AT_decl_line   : 635
    <93db6>   DW_AT_decl_column : 6
    <93db7>   DW_AT_type        : <0x7980a>
    <93dbb>   DW_AT_data_member_location: 0
 <2><93dbc>: Abbrev Number: 10 (DW_TAG_member)
    <93dbd>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93dc1>   DW_AT_decl_file   : 81
    <93dc2>   DW_AT_decl_line   : 636
    <93dc4>   DW_AT_decl_column : 16
    <93dc5>   DW_AT_type        : <0x79786>
    <93dc9>   DW_AT_data_member_location: 8
 <2><93dca>: Abbrev Number: 10 (DW_TAG_member)
    <93dcb>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93dcf>   DW_AT_decl_file   : 81
    <93dd0>   DW_AT_decl_line   : 637
    <93dd2>   DW_AT_decl_column : 7
    <93dd3>   DW_AT_type        : <0x7980a>
    <93dd7>   DW_AT_data_member_location: 16
 <2><93dd8>: Abbrev Number: 10 (DW_TAG_member)
    <93dd9>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93ddd>   DW_AT_decl_file   : 81
    <93dde>   DW_AT_decl_line   : 638
    <93de0>   DW_AT_decl_column : 11
    <93de1>   DW_AT_type        : <0x93ab4>
    <93de5>   DW_AT_data_member_location: 24
 <2><93de6>: Abbrev Number: 10 (DW_TAG_member)
    <93de7>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <93deb>   DW_AT_decl_file   : 81
    <93dec>   DW_AT_decl_line   : 639
    <93dee>   DW_AT_decl_column : 9
    <93def>   DW_AT_type        : <0x93896>
    <93df3>   DW_AT_data_member_location: 32
 <2><93df4>: Abbrev Number: 10 (DW_TAG_member)
    <93df5>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <93df9>   DW_AT_decl_file   : 81
    <93dfa>   DW_AT_decl_line   : 640
    <93dfc>   DW_AT_decl_column : 6
    <93dfd>   DW_AT_type        : <0x7980a>
    <93e01>   DW_AT_data_member_location: 40
 <2><93e02>: Abbrev Number: 10 (DW_TAG_member)
    <93e03>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <93e07>   DW_AT_decl_file   : 81
    <93e08>   DW_AT_decl_line   : 642
    <93e0a>   DW_AT_decl_column : 6
    <93e0b>   DW_AT_type        : <0x7980a>
    <93e0f>   DW_AT_data_member_location: 44
 <2><93e10>: Abbrev Number: 0
 <1><93e11>: Abbrev Number: 4 (DW_TAG_typedef)
    <93e12>   DW_AT_name        : (indirect string, offset: 0x7178a): XFocusChangeEvent
    <93e16>   DW_AT_decl_file   : 81
    <93e17>   DW_AT_decl_line   : 648
    <93e19>   DW_AT_decl_column : 3
    <93e1a>   DW_AT_type        : <0x93da0>
 <1><93e1e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93e1f>   DW_AT_byte_size   : 72
    <93e20>   DW_AT_decl_file   : 81
    <93e21>   DW_AT_decl_line   : 653
    <93e23>   DW_AT_decl_column : 16
    <93e24>   DW_AT_linkage_name: (indirect string, offset: 0x6b356): 12XKeymapEvent
    <93e28>   DW_AT_sibling     : <0x93e81>
 <2><93e2c>: Abbrev Number: 10 (DW_TAG_member)
    <93e2d>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93e31>   DW_AT_decl_file   : 81
    <93e32>   DW_AT_decl_line   : 654
    <93e34>   DW_AT_decl_column : 6
    <93e35>   DW_AT_type        : <0x7980a>
    <93e39>   DW_AT_data_member_location: 0
 <2><93e3a>: Abbrev Number: 10 (DW_TAG_member)
    <93e3b>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93e3f>   DW_AT_decl_file   : 81
    <93e40>   DW_AT_decl_line   : 655
    <93e42>   DW_AT_decl_column : 16
    <93e43>   DW_AT_type        : <0x79786>
    <93e47>   DW_AT_data_member_location: 8
 <2><93e48>: Abbrev Number: 10 (DW_TAG_member)
    <93e49>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93e4d>   DW_AT_decl_file   : 81
    <93e4e>   DW_AT_decl_line   : 656
    <93e50>   DW_AT_decl_column : 7
    <93e51>   DW_AT_type        : <0x7980a>
    <93e55>   DW_AT_data_member_location: 16
 <2><93e56>: Abbrev Number: 10 (DW_TAG_member)
    <93e57>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93e5b>   DW_AT_decl_file   : 81
    <93e5c>   DW_AT_decl_line   : 657
    <93e5e>   DW_AT_decl_column : 11
    <93e5f>   DW_AT_type        : <0x93ab4>
    <93e63>   DW_AT_data_member_location: 24
 <2><93e64>: Abbrev Number: 10 (DW_TAG_member)
    <93e65>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <93e69>   DW_AT_decl_file   : 81
    <93e6a>   DW_AT_decl_line   : 658
    <93e6c>   DW_AT_decl_column : 9
    <93e6d>   DW_AT_type        : <0x93896>
    <93e71>   DW_AT_data_member_location: 32
 <2><93e72>: Abbrev Number: 10 (DW_TAG_member)
    <93e73>   DW_AT_name        : (indirect string, offset: 0x70daa): key_vector
    <93e77>   DW_AT_decl_file   : 81
    <93e78>   DW_AT_decl_line   : 659
    <93e7a>   DW_AT_decl_column : 7
    <93e7b>   DW_AT_type        : <0x90041>
    <93e7f>   DW_AT_data_member_location: 40
 <2><93e80>: Abbrev Number: 0
 <1><93e81>: Abbrev Number: 4 (DW_TAG_typedef)
    <93e82>   DW_AT_name        : (indirect string, offset: 0x6b358): XKeymapEvent
    <93e86>   DW_AT_decl_file   : 81
    <93e87>   DW_AT_decl_line   : 660
    <93e89>   DW_AT_decl_column : 3
    <93e8a>   DW_AT_type        : <0x93e1e>
 <1><93e8e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93e8f>   DW_AT_byte_size   : 64
    <93e90>   DW_AT_decl_file   : 81
    <93e91>   DW_AT_decl_line   : 662
    <93e93>   DW_AT_decl_column : 16
    <93e94>   DW_AT_linkage_name: (indirect string, offset: 0x834d4): 12XExposeEvent
    <93e98>   DW_AT_sibling     : <0x93f25>
 <2><93e9c>: Abbrev Number: 10 (DW_TAG_member)
    <93e9d>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93ea1>   DW_AT_decl_file   : 81
    <93ea2>   DW_AT_decl_line   : 663
    <93ea4>   DW_AT_decl_column : 6
    <93ea5>   DW_AT_type        : <0x7980a>
    <93ea9>   DW_AT_data_member_location: 0
 <2><93eaa>: Abbrev Number: 10 (DW_TAG_member)
    <93eab>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93eaf>   DW_AT_decl_file   : 81
    <93eb0>   DW_AT_decl_line   : 664
    <93eb2>   DW_AT_decl_column : 16
    <93eb3>   DW_AT_type        : <0x79786>
    <93eb7>   DW_AT_data_member_location: 8
 <2><93eb8>: Abbrev Number: 10 (DW_TAG_member)
    <93eb9>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93ebd>   DW_AT_decl_file   : 81
    <93ebe>   DW_AT_decl_line   : 665
    <93ec0>   DW_AT_decl_column : 7
    <93ec1>   DW_AT_type        : <0x7980a>
    <93ec5>   DW_AT_data_member_location: 16
 <2><93ec6>: Abbrev Number: 10 (DW_TAG_member)
    <93ec7>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93ecb>   DW_AT_decl_file   : 81
    <93ecc>   DW_AT_decl_line   : 666
    <93ece>   DW_AT_decl_column : 11
    <93ecf>   DW_AT_type        : <0x93ab4>
    <93ed3>   DW_AT_data_member_location: 24
 <2><93ed4>: Abbrev Number: 10 (DW_TAG_member)
    <93ed5>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <93ed9>   DW_AT_decl_file   : 81
    <93eda>   DW_AT_decl_line   : 667
    <93edc>   DW_AT_decl_column : 9
    <93edd>   DW_AT_type        : <0x93896>
    <93ee1>   DW_AT_data_member_location: 32
 <2><93ee2>: Abbrev Number: 31 (DW_TAG_member)
    <93ee3>   DW_AT_name        : x
    <93ee5>   DW_AT_decl_file   : 81
    <93ee6>   DW_AT_decl_line   : 668
    <93ee8>   DW_AT_decl_column : 6
    <93ee9>   DW_AT_type        : <0x7980a>
    <93eed>   DW_AT_data_member_location: 40
 <2><93eee>: Abbrev Number: 31 (DW_TAG_member)
    <93eef>   DW_AT_name        : y
    <93ef1>   DW_AT_decl_file   : 81
    <93ef2>   DW_AT_decl_line   : 668
    <93ef4>   DW_AT_decl_column : 9
    <93ef5>   DW_AT_type        : <0x7980a>
    <93ef9>   DW_AT_data_member_location: 44
 <2><93efa>: Abbrev Number: 10 (DW_TAG_member)
    <93efb>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <93eff>   DW_AT_decl_file   : 81
    <93f00>   DW_AT_decl_line   : 669
    <93f02>   DW_AT_decl_column : 6
    <93f03>   DW_AT_type        : <0x7980a>
    <93f07>   DW_AT_data_member_location: 48
 <2><93f08>: Abbrev Number: 10 (DW_TAG_member)
    <93f09>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <93f0d>   DW_AT_decl_file   : 81
    <93f0e>   DW_AT_decl_line   : 669
    <93f10>   DW_AT_decl_column : 13
    <93f11>   DW_AT_type        : <0x7980a>
    <93f15>   DW_AT_data_member_location: 52
 <2><93f16>: Abbrev Number: 10 (DW_TAG_member)
    <93f17>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <93f1b>   DW_AT_decl_file   : 81
    <93f1c>   DW_AT_decl_line   : 670
    <93f1e>   DW_AT_decl_column : 6
    <93f1f>   DW_AT_type        : <0x7980a>
    <93f23>   DW_AT_data_member_location: 56
 <2><93f24>: Abbrev Number: 0
 <1><93f25>: Abbrev Number: 4 (DW_TAG_typedef)
    <93f26>   DW_AT_name        : (indirect string, offset: 0x834d6): XExposeEvent
    <93f2a>   DW_AT_decl_file   : 81
    <93f2b>   DW_AT_decl_line   : 671
    <93f2d>   DW_AT_decl_column : 3
    <93f2e>   DW_AT_type        : <0x93e8e>
 <1><93f32>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93f33>   DW_AT_byte_size   : 72
    <93f34>   DW_AT_decl_file   : 81
    <93f35>   DW_AT_decl_line   : 673
    <93f37>   DW_AT_decl_column : 16
    <93f38>   DW_AT_linkage_name: (indirect string, offset: 0x8beb3): 20XGraphicsExposeEvent
    <93f3c>   DW_AT_sibling     : <0x93fe5>
 <2><93f40>: Abbrev Number: 10 (DW_TAG_member)
    <93f41>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <93f45>   DW_AT_decl_file   : 81
    <93f46>   DW_AT_decl_line   : 674
    <93f48>   DW_AT_decl_column : 6
    <93f49>   DW_AT_type        : <0x7980a>
    <93f4d>   DW_AT_data_member_location: 0
 <2><93f4e>: Abbrev Number: 10 (DW_TAG_member)
    <93f4f>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <93f53>   DW_AT_decl_file   : 81
    <93f54>   DW_AT_decl_line   : 675
    <93f56>   DW_AT_decl_column : 16
    <93f57>   DW_AT_type        : <0x79786>
    <93f5b>   DW_AT_data_member_location: 8
 <2><93f5c>: Abbrev Number: 10 (DW_TAG_member)
    <93f5d>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <93f61>   DW_AT_decl_file   : 81
    <93f62>   DW_AT_decl_line   : 676
    <93f64>   DW_AT_decl_column : 7
    <93f65>   DW_AT_type        : <0x7980a>
    <93f69>   DW_AT_data_member_location: 16
 <2><93f6a>: Abbrev Number: 10 (DW_TAG_member)
    <93f6b>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <93f6f>   DW_AT_decl_file   : 81
    <93f70>   DW_AT_decl_line   : 677
    <93f72>   DW_AT_decl_column : 11
    <93f73>   DW_AT_type        : <0x93ab4>
    <93f77>   DW_AT_data_member_location: 24
 <2><93f78>: Abbrev Number: 10 (DW_TAG_member)
    <93f79>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <93f7d>   DW_AT_decl_file   : 81
    <93f7e>   DW_AT_decl_line   : 678
    <93f80>   DW_AT_decl_column : 11
    <93f81>   DW_AT_type        : <0x938a2>
    <93f85>   DW_AT_data_member_location: 32
 <2><93f86>: Abbrev Number: 31 (DW_TAG_member)
    <93f87>   DW_AT_name        : x
    <93f89>   DW_AT_decl_file   : 81
    <93f8a>   DW_AT_decl_line   : 679
    <93f8c>   DW_AT_decl_column : 6
    <93f8d>   DW_AT_type        : <0x7980a>
    <93f91>   DW_AT_data_member_location: 40
 <2><93f92>: Abbrev Number: 31 (DW_TAG_member)
    <93f93>   DW_AT_name        : y
    <93f95>   DW_AT_decl_file   : 81
    <93f96>   DW_AT_decl_line   : 679
    <93f98>   DW_AT_decl_column : 9
    <93f99>   DW_AT_type        : <0x7980a>
    <93f9d>   DW_AT_data_member_location: 44
 <2><93f9e>: Abbrev Number: 10 (DW_TAG_member)
    <93f9f>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <93fa3>   DW_AT_decl_file   : 81
    <93fa4>   DW_AT_decl_line   : 680
    <93fa6>   DW_AT_decl_column : 6
    <93fa7>   DW_AT_type        : <0x7980a>
    <93fab>   DW_AT_data_member_location: 48
 <2><93fac>: Abbrev Number: 10 (DW_TAG_member)
    <93fad>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <93fb1>   DW_AT_decl_file   : 81
    <93fb2>   DW_AT_decl_line   : 680
    <93fb4>   DW_AT_decl_column : 13
    <93fb5>   DW_AT_type        : <0x7980a>
    <93fb9>   DW_AT_data_member_location: 52
 <2><93fba>: Abbrev Number: 10 (DW_TAG_member)
    <93fbb>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <93fbf>   DW_AT_decl_file   : 81
    <93fc0>   DW_AT_decl_line   : 681
    <93fc2>   DW_AT_decl_column : 6
    <93fc3>   DW_AT_type        : <0x7980a>
    <93fc7>   DW_AT_data_member_location: 56
 <2><93fc8>: Abbrev Number: 10 (DW_TAG_member)
    <93fc9>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <93fcd>   DW_AT_decl_file   : 81
    <93fce>   DW_AT_decl_line   : 682
    <93fd0>   DW_AT_decl_column : 6
    <93fd1>   DW_AT_type        : <0x7980a>
    <93fd5>   DW_AT_data_member_location: 60
 <2><93fd6>: Abbrev Number: 10 (DW_TAG_member)
    <93fd7>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <93fdb>   DW_AT_decl_file   : 81
    <93fdc>   DW_AT_decl_line   : 683
    <93fde>   DW_AT_decl_column : 6
    <93fdf>   DW_AT_type        : <0x7980a>
    <93fe3>   DW_AT_data_member_location: 64
 <2><93fe4>: Abbrev Number: 0
 <1><93fe5>: Abbrev Number: 4 (DW_TAG_typedef)
    <93fe6>   DW_AT_name        : (indirect string, offset: 0x8beb5): XGraphicsExposeEvent
    <93fea>   DW_AT_decl_file   : 81
    <93feb>   DW_AT_decl_line   : 684
    <93fed>   DW_AT_decl_column : 3
    <93fee>   DW_AT_type        : <0x93f32>
 <1><93ff2>: Abbrev Number: 40 (DW_TAG_structure_type)
    <93ff3>   DW_AT_byte_size   : 48
    <93ff4>   DW_AT_decl_file   : 81
    <93ff5>   DW_AT_decl_line   : 686
    <93ff7>   DW_AT_decl_column : 16
    <93ff8>   DW_AT_linkage_name: (indirect string, offset: 0x70fb8): 14XNoExposeEvent
    <93ffc>   DW_AT_sibling     : <0x94063>
 <2><94000>: Abbrev Number: 10 (DW_TAG_member)
    <94001>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94005>   DW_AT_decl_file   : 81
    <94006>   DW_AT_decl_line   : 687
    <94008>   DW_AT_decl_column : 6
    <94009>   DW_AT_type        : <0x7980a>
    <9400d>   DW_AT_data_member_location: 0
 <2><9400e>: Abbrev Number: 10 (DW_TAG_member)
    <9400f>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94013>   DW_AT_decl_file   : 81
    <94014>   DW_AT_decl_line   : 688
    <94016>   DW_AT_decl_column : 16
    <94017>   DW_AT_type        : <0x79786>
    <9401b>   DW_AT_data_member_location: 8
 <2><9401c>: Abbrev Number: 10 (DW_TAG_member)
    <9401d>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94021>   DW_AT_decl_file   : 81
    <94022>   DW_AT_decl_line   : 689
    <94024>   DW_AT_decl_column : 7
    <94025>   DW_AT_type        : <0x7980a>
    <94029>   DW_AT_data_member_location: 16
 <2><9402a>: Abbrev Number: 10 (DW_TAG_member)
    <9402b>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9402f>   DW_AT_decl_file   : 81
    <94030>   DW_AT_decl_line   : 690
    <94032>   DW_AT_decl_column : 11
    <94033>   DW_AT_type        : <0x93ab4>
    <94037>   DW_AT_data_member_location: 24
 <2><94038>: Abbrev Number: 10 (DW_TAG_member)
    <94039>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <9403d>   DW_AT_decl_file   : 81
    <9403e>   DW_AT_decl_line   : 691
    <94040>   DW_AT_decl_column : 11
    <94041>   DW_AT_type        : <0x938a2>
    <94045>   DW_AT_data_member_location: 32
 <2><94046>: Abbrev Number: 10 (DW_TAG_member)
    <94047>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <9404b>   DW_AT_decl_file   : 81
    <9404c>   DW_AT_decl_line   : 692
    <9404e>   DW_AT_decl_column : 6
    <9404f>   DW_AT_type        : <0x7980a>
    <94053>   DW_AT_data_member_location: 40
 <2><94054>: Abbrev Number: 10 (DW_TAG_member)
    <94055>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <94059>   DW_AT_decl_file   : 81
    <9405a>   DW_AT_decl_line   : 693
    <9405c>   DW_AT_decl_column : 6
    <9405d>   DW_AT_type        : <0x7980a>
    <94061>   DW_AT_data_member_location: 44
 <2><94062>: Abbrev Number: 0
 <1><94063>: Abbrev Number: 4 (DW_TAG_typedef)
    <94064>   DW_AT_name        : (indirect string, offset: 0x70fba): XNoExposeEvent
    <94068>   DW_AT_decl_file   : 81
    <94069>   DW_AT_decl_line   : 694
    <9406b>   DW_AT_decl_column : 3
    <9406c>   DW_AT_type        : <0x93ff2>
 <1><94070>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94071>   DW_AT_byte_size   : 48
    <94072>   DW_AT_decl_file   : 81
    <94073>   DW_AT_decl_line   : 696
    <94075>   DW_AT_decl_column : 16
    <94076>   DW_AT_linkage_name: (indirect string, offset: 0x62f5a): 16XVisibilityEvent
    <9407a>   DW_AT_sibling     : <0x940d3>
 <2><9407e>: Abbrev Number: 10 (DW_TAG_member)
    <9407f>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94083>   DW_AT_decl_file   : 81
    <94084>   DW_AT_decl_line   : 697
    <94086>   DW_AT_decl_column : 6
    <94087>   DW_AT_type        : <0x7980a>
    <9408b>   DW_AT_data_member_location: 0
 <2><9408c>: Abbrev Number: 10 (DW_TAG_member)
    <9408d>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94091>   DW_AT_decl_file   : 81
    <94092>   DW_AT_decl_line   : 698
    <94094>   DW_AT_decl_column : 16
    <94095>   DW_AT_type        : <0x79786>
    <94099>   DW_AT_data_member_location: 8
 <2><9409a>: Abbrev Number: 10 (DW_TAG_member)
    <9409b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9409f>   DW_AT_decl_file   : 81
    <940a0>   DW_AT_decl_line   : 699
    <940a2>   DW_AT_decl_column : 7
    <940a3>   DW_AT_type        : <0x7980a>
    <940a7>   DW_AT_data_member_location: 16
 <2><940a8>: Abbrev Number: 10 (DW_TAG_member)
    <940a9>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <940ad>   DW_AT_decl_file   : 81
    <940ae>   DW_AT_decl_line   : 700
    <940b0>   DW_AT_decl_column : 11
    <940b1>   DW_AT_type        : <0x93ab4>
    <940b5>   DW_AT_data_member_location: 24
 <2><940b6>: Abbrev Number: 10 (DW_TAG_member)
    <940b7>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <940bb>   DW_AT_decl_file   : 81
    <940bc>   DW_AT_decl_line   : 701
    <940be>   DW_AT_decl_column : 9
    <940bf>   DW_AT_type        : <0x93896>
    <940c3>   DW_AT_data_member_location: 32
 <2><940c4>: Abbrev Number: 10 (DW_TAG_member)
    <940c5>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <940c9>   DW_AT_decl_file   : 81
    <940ca>   DW_AT_decl_line   : 702
    <940cc>   DW_AT_decl_column : 6
    <940cd>   DW_AT_type        : <0x7980a>
    <940d1>   DW_AT_data_member_location: 40
 <2><940d2>: Abbrev Number: 0
 <1><940d3>: Abbrev Number: 4 (DW_TAG_typedef)
    <940d4>   DW_AT_name        : (indirect string, offset: 0x62f5c): XVisibilityEvent
    <940d8>   DW_AT_decl_file   : 81
    <940d9>   DW_AT_decl_line   : 703
    <940db>   DW_AT_decl_column : 3
    <940dc>   DW_AT_type        : <0x94070>
 <1><940e0>: Abbrev Number: 40 (DW_TAG_structure_type)
    <940e1>   DW_AT_byte_size   : 72
    <940e2>   DW_AT_decl_file   : 81
    <940e3>   DW_AT_decl_line   : 705
    <940e5>   DW_AT_decl_column : 16
    <940e6>   DW_AT_linkage_name: (indirect string, offset: 0x88213): 18XCreateWindowEvent
    <940ea>   DW_AT_sibling     : <0x94193>
 <2><940ee>: Abbrev Number: 10 (DW_TAG_member)
    <940ef>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <940f3>   DW_AT_decl_file   : 81
    <940f4>   DW_AT_decl_line   : 706
    <940f6>   DW_AT_decl_column : 6
    <940f7>   DW_AT_type        : <0x7980a>
    <940fb>   DW_AT_data_member_location: 0
 <2><940fc>: Abbrev Number: 10 (DW_TAG_member)
    <940fd>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94101>   DW_AT_decl_file   : 81
    <94102>   DW_AT_decl_line   : 707
    <94104>   DW_AT_decl_column : 16
    <94105>   DW_AT_type        : <0x79786>
    <94109>   DW_AT_data_member_location: 8
 <2><9410a>: Abbrev Number: 10 (DW_TAG_member)
    <9410b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9410f>   DW_AT_decl_file   : 81
    <94110>   DW_AT_decl_line   : 708
    <94112>   DW_AT_decl_column : 7
    <94113>   DW_AT_type        : <0x7980a>
    <94117>   DW_AT_data_member_location: 16
 <2><94118>: Abbrev Number: 10 (DW_TAG_member)
    <94119>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9411d>   DW_AT_decl_file   : 81
    <9411e>   DW_AT_decl_line   : 709
    <94120>   DW_AT_decl_column : 11
    <94121>   DW_AT_type        : <0x93ab4>
    <94125>   DW_AT_data_member_location: 24
 <2><94126>: Abbrev Number: 10 (DW_TAG_member)
    <94127>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <9412b>   DW_AT_decl_file   : 81
    <9412c>   DW_AT_decl_line   : 710
    <9412e>   DW_AT_decl_column : 9
    <9412f>   DW_AT_type        : <0x93896>
    <94133>   DW_AT_data_member_location: 32
 <2><94134>: Abbrev Number: 10 (DW_TAG_member)
    <94135>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94139>   DW_AT_decl_file   : 81
    <9413a>   DW_AT_decl_line   : 711
    <9413c>   DW_AT_decl_column : 9
    <9413d>   DW_AT_type        : <0x93896>
    <94141>   DW_AT_data_member_location: 40
 <2><94142>: Abbrev Number: 31 (DW_TAG_member)
    <94143>   DW_AT_name        : x
    <94145>   DW_AT_decl_file   : 81
    <94146>   DW_AT_decl_line   : 712
    <94148>   DW_AT_decl_column : 6
    <94149>   DW_AT_type        : <0x7980a>
    <9414d>   DW_AT_data_member_location: 48
 <2><9414e>: Abbrev Number: 31 (DW_TAG_member)
    <9414f>   DW_AT_name        : y
    <94151>   DW_AT_decl_file   : 81
    <94152>   DW_AT_decl_line   : 712
    <94154>   DW_AT_decl_column : 9
    <94155>   DW_AT_type        : <0x7980a>
    <94159>   DW_AT_data_member_location: 52
 <2><9415a>: Abbrev Number: 10 (DW_TAG_member)
    <9415b>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <9415f>   DW_AT_decl_file   : 81
    <94160>   DW_AT_decl_line   : 713
    <94162>   DW_AT_decl_column : 6
    <94163>   DW_AT_type        : <0x7980a>
    <94167>   DW_AT_data_member_location: 56
 <2><94168>: Abbrev Number: 10 (DW_TAG_member)
    <94169>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <9416d>   DW_AT_decl_file   : 81
    <9416e>   DW_AT_decl_line   : 713
    <94170>   DW_AT_decl_column : 13
    <94171>   DW_AT_type        : <0x7980a>
    <94175>   DW_AT_data_member_location: 60
 <2><94176>: Abbrev Number: 10 (DW_TAG_member)
    <94177>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <9417b>   DW_AT_decl_file   : 81
    <9417c>   DW_AT_decl_line   : 714
    <9417e>   DW_AT_decl_column : 6
    <9417f>   DW_AT_type        : <0x7980a>
    <94183>   DW_AT_data_member_location: 64
 <2><94184>: Abbrev Number: 10 (DW_TAG_member)
    <94185>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <94189>   DW_AT_decl_file   : 81
    <9418a>   DW_AT_decl_line   : 715
    <9418c>   DW_AT_decl_column : 7
    <9418d>   DW_AT_type        : <0x7980a>
    <94191>   DW_AT_data_member_location: 68
 <2><94192>: Abbrev Number: 0
 <1><94193>: Abbrev Number: 4 (DW_TAG_typedef)
    <94194>   DW_AT_name        : (indirect string, offset: 0x88215): XCreateWindowEvent
    <94198>   DW_AT_decl_file   : 81
    <94199>   DW_AT_decl_line   : 716
    <9419b>   DW_AT_decl_column : 3
    <9419c>   DW_AT_type        : <0x940e0>
 <1><941a0>: Abbrev Number: 40 (DW_TAG_structure_type)
    <941a1>   DW_AT_byte_size   : 48
    <941a2>   DW_AT_decl_file   : 81
    <941a3>   DW_AT_decl_line   : 718
    <941a5>   DW_AT_decl_column : 16
    <941a6>   DW_AT_linkage_name: (indirect string, offset: 0x79949): 19XDestroyWindowEvent
    <941aa>   DW_AT_sibling     : <0x94203>
 <2><941ae>: Abbrev Number: 10 (DW_TAG_member)
    <941af>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <941b3>   DW_AT_decl_file   : 81
    <941b4>   DW_AT_decl_line   : 719
    <941b6>   DW_AT_decl_column : 6
    <941b7>   DW_AT_type        : <0x7980a>
    <941bb>   DW_AT_data_member_location: 0
 <2><941bc>: Abbrev Number: 10 (DW_TAG_member)
    <941bd>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <941c1>   DW_AT_decl_file   : 81
    <941c2>   DW_AT_decl_line   : 720
    <941c4>   DW_AT_decl_column : 16
    <941c5>   DW_AT_type        : <0x79786>
    <941c9>   DW_AT_data_member_location: 8
 <2><941ca>: Abbrev Number: 10 (DW_TAG_member)
    <941cb>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <941cf>   DW_AT_decl_file   : 81
    <941d0>   DW_AT_decl_line   : 721
    <941d2>   DW_AT_decl_column : 7
    <941d3>   DW_AT_type        : <0x7980a>
    <941d7>   DW_AT_data_member_location: 16
 <2><941d8>: Abbrev Number: 10 (DW_TAG_member)
    <941d9>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <941dd>   DW_AT_decl_file   : 81
    <941de>   DW_AT_decl_line   : 722
    <941e0>   DW_AT_decl_column : 11
    <941e1>   DW_AT_type        : <0x93ab4>
    <941e5>   DW_AT_data_member_location: 24
 <2><941e6>: Abbrev Number: 10 (DW_TAG_member)
    <941e7>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <941eb>   DW_AT_decl_file   : 81
    <941ec>   DW_AT_decl_line   : 723
    <941ee>   DW_AT_decl_column : 9
    <941ef>   DW_AT_type        : <0x93896>
    <941f3>   DW_AT_data_member_location: 32
 <2><941f4>: Abbrev Number: 10 (DW_TAG_member)
    <941f5>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <941f9>   DW_AT_decl_file   : 81
    <941fa>   DW_AT_decl_line   : 724
    <941fc>   DW_AT_decl_column : 9
    <941fd>   DW_AT_type        : <0x93896>
    <94201>   DW_AT_data_member_location: 40
 <2><94202>: Abbrev Number: 0
 <1><94203>: Abbrev Number: 4 (DW_TAG_typedef)
    <94204>   DW_AT_name        : (indirect string, offset: 0x7994b): XDestroyWindowEvent
    <94208>   DW_AT_decl_file   : 81
    <94209>   DW_AT_decl_line   : 725
    <9420b>   DW_AT_decl_column : 3
    <9420c>   DW_AT_type        : <0x941a0>
 <1><94210>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94211>   DW_AT_byte_size   : 56
    <94212>   DW_AT_decl_file   : 81
    <94213>   DW_AT_decl_line   : 727
    <94215>   DW_AT_decl_column : 16
    <94216>   DW_AT_linkage_name: (indirect string, offset: 0x6fb42): 11XUnmapEvent
    <9421a>   DW_AT_sibling     : <0x94281>
 <2><9421e>: Abbrev Number: 10 (DW_TAG_member)
    <9421f>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94223>   DW_AT_decl_file   : 81
    <94224>   DW_AT_decl_line   : 728
    <94226>   DW_AT_decl_column : 6
    <94227>   DW_AT_type        : <0x7980a>
    <9422b>   DW_AT_data_member_location: 0
 <2><9422c>: Abbrev Number: 10 (DW_TAG_member)
    <9422d>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94231>   DW_AT_decl_file   : 81
    <94232>   DW_AT_decl_line   : 729
    <94234>   DW_AT_decl_column : 16
    <94235>   DW_AT_type        : <0x79786>
    <94239>   DW_AT_data_member_location: 8
 <2><9423a>: Abbrev Number: 10 (DW_TAG_member)
    <9423b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9423f>   DW_AT_decl_file   : 81
    <94240>   DW_AT_decl_line   : 730
    <94242>   DW_AT_decl_column : 7
    <94243>   DW_AT_type        : <0x7980a>
    <94247>   DW_AT_data_member_location: 16
 <2><94248>: Abbrev Number: 10 (DW_TAG_member)
    <94249>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9424d>   DW_AT_decl_file   : 81
    <9424e>   DW_AT_decl_line   : 731
    <94250>   DW_AT_decl_column : 11
    <94251>   DW_AT_type        : <0x93ab4>
    <94255>   DW_AT_data_member_location: 24
 <2><94256>: Abbrev Number: 10 (DW_TAG_member)
    <94257>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <9425b>   DW_AT_decl_file   : 81
    <9425c>   DW_AT_decl_line   : 732
    <9425e>   DW_AT_decl_column : 9
    <9425f>   DW_AT_type        : <0x93896>
    <94263>   DW_AT_data_member_location: 32
 <2><94264>: Abbrev Number: 10 (DW_TAG_member)
    <94265>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94269>   DW_AT_decl_file   : 81
    <9426a>   DW_AT_decl_line   : 733
    <9426c>   DW_AT_decl_column : 9
    <9426d>   DW_AT_type        : <0x93896>
    <94271>   DW_AT_data_member_location: 40
 <2><94272>: Abbrev Number: 10 (DW_TAG_member)
    <94273>   DW_AT_name        : (indirect string, offset: 0x6ee8a): from_configure
    <94277>   DW_AT_decl_file   : 81
    <94278>   DW_AT_decl_line   : 734
    <9427a>   DW_AT_decl_column : 7
    <9427b>   DW_AT_type        : <0x7980a>
    <9427f>   DW_AT_data_member_location: 48
 <2><94280>: Abbrev Number: 0
 <1><94281>: Abbrev Number: 4 (DW_TAG_typedef)
    <94282>   DW_AT_name        : (indirect string, offset: 0x6fb44): XUnmapEvent
    <94286>   DW_AT_decl_file   : 81
    <94287>   DW_AT_decl_line   : 735
    <94289>   DW_AT_decl_column : 3
    <9428a>   DW_AT_type        : <0x94210>
 <1><9428e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <9428f>   DW_AT_byte_size   : 56
    <94290>   DW_AT_decl_file   : 81
    <94291>   DW_AT_decl_line   : 737
    <94293>   DW_AT_decl_column : 16
    <94294>   DW_AT_linkage_name: (indirect string, offset: 0x7dc24): 9XMapEvent
    <94298>   DW_AT_sibling     : <0x942ff>
 <2><9429c>: Abbrev Number: 10 (DW_TAG_member)
    <9429d>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <942a1>   DW_AT_decl_file   : 81
    <942a2>   DW_AT_decl_line   : 738
    <942a4>   DW_AT_decl_column : 6
    <942a5>   DW_AT_type        : <0x7980a>
    <942a9>   DW_AT_data_member_location: 0
 <2><942aa>: Abbrev Number: 10 (DW_TAG_member)
    <942ab>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <942af>   DW_AT_decl_file   : 81
    <942b0>   DW_AT_decl_line   : 739
    <942b2>   DW_AT_decl_column : 16
    <942b3>   DW_AT_type        : <0x79786>
    <942b7>   DW_AT_data_member_location: 8
 <2><942b8>: Abbrev Number: 10 (DW_TAG_member)
    <942b9>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <942bd>   DW_AT_decl_file   : 81
    <942be>   DW_AT_decl_line   : 740
    <942c0>   DW_AT_decl_column : 7
    <942c1>   DW_AT_type        : <0x7980a>
    <942c5>   DW_AT_data_member_location: 16
 <2><942c6>: Abbrev Number: 10 (DW_TAG_member)
    <942c7>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <942cb>   DW_AT_decl_file   : 81
    <942cc>   DW_AT_decl_line   : 741
    <942ce>   DW_AT_decl_column : 11
    <942cf>   DW_AT_type        : <0x93ab4>
    <942d3>   DW_AT_data_member_location: 24
 <2><942d4>: Abbrev Number: 10 (DW_TAG_member)
    <942d5>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <942d9>   DW_AT_decl_file   : 81
    <942da>   DW_AT_decl_line   : 742
    <942dc>   DW_AT_decl_column : 9
    <942dd>   DW_AT_type        : <0x93896>
    <942e1>   DW_AT_data_member_location: 32
 <2><942e2>: Abbrev Number: 10 (DW_TAG_member)
    <942e3>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <942e7>   DW_AT_decl_file   : 81
    <942e8>   DW_AT_decl_line   : 743
    <942ea>   DW_AT_decl_column : 9
    <942eb>   DW_AT_type        : <0x93896>
    <942ef>   DW_AT_data_member_location: 40
 <2><942f0>: Abbrev Number: 10 (DW_TAG_member)
    <942f1>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <942f5>   DW_AT_decl_file   : 81
    <942f6>   DW_AT_decl_line   : 744
    <942f8>   DW_AT_decl_column : 7
    <942f9>   DW_AT_type        : <0x7980a>
    <942fd>   DW_AT_data_member_location: 48
 <2><942fe>: Abbrev Number: 0
 <1><942ff>: Abbrev Number: 4 (DW_TAG_typedef)
    <94300>   DW_AT_name        : (indirect string, offset: 0x7dc25): XMapEvent
    <94304>   DW_AT_decl_file   : 81
    <94305>   DW_AT_decl_line   : 745
    <94307>   DW_AT_decl_column : 3
    <94308>   DW_AT_type        : <0x9428e>
 <1><9430c>: Abbrev Number: 40 (DW_TAG_structure_type)
    <9430d>   DW_AT_byte_size   : 48
    <9430e>   DW_AT_decl_file   : 81
    <9430f>   DW_AT_decl_line   : 747
    <94311>   DW_AT_decl_column : 16
    <94312>   DW_AT_linkage_name: (indirect string, offset: 0x5eac4): 16XMapRequestEvent
    <94316>   DW_AT_sibling     : <0x9436f>
 <2><9431a>: Abbrev Number: 10 (DW_TAG_member)
    <9431b>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <9431f>   DW_AT_decl_file   : 81
    <94320>   DW_AT_decl_line   : 748
    <94322>   DW_AT_decl_column : 6
    <94323>   DW_AT_type        : <0x7980a>
    <94327>   DW_AT_data_member_location: 0
 <2><94328>: Abbrev Number: 10 (DW_TAG_member)
    <94329>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <9432d>   DW_AT_decl_file   : 81
    <9432e>   DW_AT_decl_line   : 749
    <94330>   DW_AT_decl_column : 16
    <94331>   DW_AT_type        : <0x79786>
    <94335>   DW_AT_data_member_location: 8
 <2><94336>: Abbrev Number: 10 (DW_TAG_member)
    <94337>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9433b>   DW_AT_decl_file   : 81
    <9433c>   DW_AT_decl_line   : 750
    <9433e>   DW_AT_decl_column : 7
    <9433f>   DW_AT_type        : <0x7980a>
    <94343>   DW_AT_data_member_location: 16
 <2><94344>: Abbrev Number: 10 (DW_TAG_member)
    <94345>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94349>   DW_AT_decl_file   : 81
    <9434a>   DW_AT_decl_line   : 751
    <9434c>   DW_AT_decl_column : 11
    <9434d>   DW_AT_type        : <0x93ab4>
    <94351>   DW_AT_data_member_location: 24
 <2><94352>: Abbrev Number: 10 (DW_TAG_member)
    <94353>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <94357>   DW_AT_decl_file   : 81
    <94358>   DW_AT_decl_line   : 752
    <9435a>   DW_AT_decl_column : 9
    <9435b>   DW_AT_type        : <0x93896>
    <9435f>   DW_AT_data_member_location: 32
 <2><94360>: Abbrev Number: 10 (DW_TAG_member)
    <94361>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94365>   DW_AT_decl_file   : 81
    <94366>   DW_AT_decl_line   : 753
    <94368>   DW_AT_decl_column : 9
    <94369>   DW_AT_type        : <0x93896>
    <9436d>   DW_AT_data_member_location: 40
 <2><9436e>: Abbrev Number: 0
 <1><9436f>: Abbrev Number: 4 (DW_TAG_typedef)
    <94370>   DW_AT_name        : (indirect string, offset: 0x5eac6): XMapRequestEvent
    <94374>   DW_AT_decl_file   : 81
    <94375>   DW_AT_decl_line   : 754
    <94377>   DW_AT_decl_column : 3
    <94378>   DW_AT_type        : <0x9430c>
 <1><9437c>: Abbrev Number: 40 (DW_TAG_structure_type)
    <9437d>   DW_AT_byte_size   : 72
    <9437e>   DW_AT_decl_file   : 81
    <9437f>   DW_AT_decl_line   : 756
    <94381>   DW_AT_decl_column : 16
    <94382>   DW_AT_linkage_name: (indirect string, offset: 0x77bd5): 14XReparentEvent
    <94386>   DW_AT_sibling     : <0x94413>
 <2><9438a>: Abbrev Number: 10 (DW_TAG_member)
    <9438b>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <9438f>   DW_AT_decl_file   : 81
    <94390>   DW_AT_decl_line   : 757
    <94392>   DW_AT_decl_column : 6
    <94393>   DW_AT_type        : <0x7980a>
    <94397>   DW_AT_data_member_location: 0
 <2><94398>: Abbrev Number: 10 (DW_TAG_member)
    <94399>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <9439d>   DW_AT_decl_file   : 81
    <9439e>   DW_AT_decl_line   : 758
    <943a0>   DW_AT_decl_column : 16
    <943a1>   DW_AT_type        : <0x79786>
    <943a5>   DW_AT_data_member_location: 8
 <2><943a6>: Abbrev Number: 10 (DW_TAG_member)
    <943a7>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <943ab>   DW_AT_decl_file   : 81
    <943ac>   DW_AT_decl_line   : 759
    <943ae>   DW_AT_decl_column : 7
    <943af>   DW_AT_type        : <0x7980a>
    <943b3>   DW_AT_data_member_location: 16
 <2><943b4>: Abbrev Number: 10 (DW_TAG_member)
    <943b5>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <943b9>   DW_AT_decl_file   : 81
    <943ba>   DW_AT_decl_line   : 760
    <943bc>   DW_AT_decl_column : 11
    <943bd>   DW_AT_type        : <0x93ab4>
    <943c1>   DW_AT_data_member_location: 24
 <2><943c2>: Abbrev Number: 10 (DW_TAG_member)
    <943c3>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <943c7>   DW_AT_decl_file   : 81
    <943c8>   DW_AT_decl_line   : 761
    <943ca>   DW_AT_decl_column : 9
    <943cb>   DW_AT_type        : <0x93896>
    <943cf>   DW_AT_data_member_location: 32
 <2><943d0>: Abbrev Number: 10 (DW_TAG_member)
    <943d1>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <943d5>   DW_AT_decl_file   : 81
    <943d6>   DW_AT_decl_line   : 762
    <943d8>   DW_AT_decl_column : 9
    <943d9>   DW_AT_type        : <0x93896>
    <943dd>   DW_AT_data_member_location: 40
 <2><943de>: Abbrev Number: 10 (DW_TAG_member)
    <943df>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <943e3>   DW_AT_decl_file   : 81
    <943e4>   DW_AT_decl_line   : 763
    <943e6>   DW_AT_decl_column : 9
    <943e7>   DW_AT_type        : <0x93896>
    <943eb>   DW_AT_data_member_location: 48
 <2><943ec>: Abbrev Number: 31 (DW_TAG_member)
    <943ed>   DW_AT_name        : x
    <943ef>   DW_AT_decl_file   : 81
    <943f0>   DW_AT_decl_line   : 764
    <943f2>   DW_AT_decl_column : 6
    <943f3>   DW_AT_type        : <0x7980a>
    <943f7>   DW_AT_data_member_location: 56
 <2><943f8>: Abbrev Number: 31 (DW_TAG_member)
    <943f9>   DW_AT_name        : y
    <943fb>   DW_AT_decl_file   : 81
    <943fc>   DW_AT_decl_line   : 764
    <943fe>   DW_AT_decl_column : 9
    <943ff>   DW_AT_type        : <0x7980a>
    <94403>   DW_AT_data_member_location: 60
 <2><94404>: Abbrev Number: 10 (DW_TAG_member)
    <94405>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <94409>   DW_AT_decl_file   : 81
    <9440a>   DW_AT_decl_line   : 765
    <9440c>   DW_AT_decl_column : 7
    <9440d>   DW_AT_type        : <0x7980a>
    <94411>   DW_AT_data_member_location: 64
 <2><94412>: Abbrev Number: 0
 <1><94413>: Abbrev Number: 4 (DW_TAG_typedef)
    <94414>   DW_AT_name        : (indirect string, offset: 0x77bd7): XReparentEvent
    <94418>   DW_AT_decl_file   : 81
    <94419>   DW_AT_decl_line   : 766
    <9441b>   DW_AT_decl_column : 3
    <9441c>   DW_AT_type        : <0x9437c>
 <1><94420>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94421>   DW_AT_byte_size   : 88
    <94422>   DW_AT_decl_file   : 81
    <94423>   DW_AT_decl_line   : 768
    <94425>   DW_AT_decl_column : 16
    <94426>   DW_AT_linkage_name: (indirect string, offset: 0x67351): 15XConfigureEvent
    <9442a>   DW_AT_sibling     : <0x944e1>
 <2><9442e>: Abbrev Number: 10 (DW_TAG_member)
    <9442f>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94433>   DW_AT_decl_file   : 81
    <94434>   DW_AT_decl_line   : 769
    <94436>   DW_AT_decl_column : 6
    <94437>   DW_AT_type        : <0x7980a>
    <9443b>   DW_AT_data_member_location: 0
 <2><9443c>: Abbrev Number: 10 (DW_TAG_member)
    <9443d>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94441>   DW_AT_decl_file   : 81
    <94442>   DW_AT_decl_line   : 770
    <94444>   DW_AT_decl_column : 16
    <94445>   DW_AT_type        : <0x79786>
    <94449>   DW_AT_data_member_location: 8
 <2><9444a>: Abbrev Number: 10 (DW_TAG_member)
    <9444b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9444f>   DW_AT_decl_file   : 81
    <94450>   DW_AT_decl_line   : 771
    <94452>   DW_AT_decl_column : 7
    <94453>   DW_AT_type        : <0x7980a>
    <94457>   DW_AT_data_member_location: 16
 <2><94458>: Abbrev Number: 10 (DW_TAG_member)
    <94459>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9445d>   DW_AT_decl_file   : 81
    <9445e>   DW_AT_decl_line   : 772
    <94460>   DW_AT_decl_column : 11
    <94461>   DW_AT_type        : <0x93ab4>
    <94465>   DW_AT_data_member_location: 24
 <2><94466>: Abbrev Number: 10 (DW_TAG_member)
    <94467>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <9446b>   DW_AT_decl_file   : 81
    <9446c>   DW_AT_decl_line   : 773
    <9446e>   DW_AT_decl_column : 9
    <9446f>   DW_AT_type        : <0x93896>
    <94473>   DW_AT_data_member_location: 32
 <2><94474>: Abbrev Number: 10 (DW_TAG_member)
    <94475>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94479>   DW_AT_decl_file   : 81
    <9447a>   DW_AT_decl_line   : 774
    <9447c>   DW_AT_decl_column : 9
    <9447d>   DW_AT_type        : <0x93896>
    <94481>   DW_AT_data_member_location: 40
 <2><94482>: Abbrev Number: 31 (DW_TAG_member)
    <94483>   DW_AT_name        : x
    <94485>   DW_AT_decl_file   : 81
    <94486>   DW_AT_decl_line   : 775
    <94488>   DW_AT_decl_column : 6
    <94489>   DW_AT_type        : <0x7980a>
    <9448d>   DW_AT_data_member_location: 48
 <2><9448e>: Abbrev Number: 31 (DW_TAG_member)
    <9448f>   DW_AT_name        : y
    <94491>   DW_AT_decl_file   : 81
    <94492>   DW_AT_decl_line   : 775
    <94494>   DW_AT_decl_column : 9
    <94495>   DW_AT_type        : <0x7980a>
    <94499>   DW_AT_data_member_location: 52
 <2><9449a>: Abbrev Number: 10 (DW_TAG_member)
    <9449b>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <9449f>   DW_AT_decl_file   : 81
    <944a0>   DW_AT_decl_line   : 776
    <944a2>   DW_AT_decl_column : 6
    <944a3>   DW_AT_type        : <0x7980a>
    <944a7>   DW_AT_data_member_location: 56
 <2><944a8>: Abbrev Number: 10 (DW_TAG_member)
    <944a9>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <944ad>   DW_AT_decl_file   : 81
    <944ae>   DW_AT_decl_line   : 776
    <944b0>   DW_AT_decl_column : 13
    <944b1>   DW_AT_type        : <0x7980a>
    <944b5>   DW_AT_data_member_location: 60
 <2><944b6>: Abbrev Number: 10 (DW_TAG_member)
    <944b7>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <944bb>   DW_AT_decl_file   : 81
    <944bc>   DW_AT_decl_line   : 777
    <944be>   DW_AT_decl_column : 6
    <944bf>   DW_AT_type        : <0x7980a>
    <944c3>   DW_AT_data_member_location: 64
 <2><944c4>: Abbrev Number: 10 (DW_TAG_member)
    <944c5>   DW_AT_name        : (indirect string, offset: 0x88ee2): above
    <944c9>   DW_AT_decl_file   : 81
    <944ca>   DW_AT_decl_line   : 778
    <944cc>   DW_AT_decl_column : 9
    <944cd>   DW_AT_type        : <0x93896>
    <944d1>   DW_AT_data_member_location: 72
 <2><944d2>: Abbrev Number: 10 (DW_TAG_member)
    <944d3>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <944d7>   DW_AT_decl_file   : 81
    <944d8>   DW_AT_decl_line   : 779
    <944da>   DW_AT_decl_column : 7
    <944db>   DW_AT_type        : <0x7980a>
    <944df>   DW_AT_data_member_location: 80
 <2><944e0>: Abbrev Number: 0
 <1><944e1>: Abbrev Number: 4 (DW_TAG_typedef)
    <944e2>   DW_AT_name        : (indirect string, offset: 0x67353): XConfigureEvent
    <944e6>   DW_AT_decl_file   : 81
    <944e7>   DW_AT_decl_line   : 780
    <944e9>   DW_AT_decl_column : 3
    <944ea>   DW_AT_type        : <0x94420>
 <1><944ee>: Abbrev Number: 40 (DW_TAG_structure_type)
    <944ef>   DW_AT_byte_size   : 56
    <944f0>   DW_AT_decl_file   : 81
    <944f1>   DW_AT_decl_line   : 782
    <944f3>   DW_AT_decl_column : 16
    <944f4>   DW_AT_linkage_name: (indirect string, offset: 0x738f0): 13XGravityEvent
    <944f8>   DW_AT_sibling     : <0x94569>
 <2><944fc>: Abbrev Number: 10 (DW_TAG_member)
    <944fd>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94501>   DW_AT_decl_file   : 81
    <94502>   DW_AT_decl_line   : 783
    <94504>   DW_AT_decl_column : 6
    <94505>   DW_AT_type        : <0x7980a>
    <94509>   DW_AT_data_member_location: 0
 <2><9450a>: Abbrev Number: 10 (DW_TAG_member)
    <9450b>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <9450f>   DW_AT_decl_file   : 81
    <94510>   DW_AT_decl_line   : 784
    <94512>   DW_AT_decl_column : 16
    <94513>   DW_AT_type        : <0x79786>
    <94517>   DW_AT_data_member_location: 8
 <2><94518>: Abbrev Number: 10 (DW_TAG_member)
    <94519>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9451d>   DW_AT_decl_file   : 81
    <9451e>   DW_AT_decl_line   : 785
    <94520>   DW_AT_decl_column : 7
    <94521>   DW_AT_type        : <0x7980a>
    <94525>   DW_AT_data_member_location: 16
 <2><94526>: Abbrev Number: 10 (DW_TAG_member)
    <94527>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9452b>   DW_AT_decl_file   : 81
    <9452c>   DW_AT_decl_line   : 786
    <9452e>   DW_AT_decl_column : 11
    <9452f>   DW_AT_type        : <0x93ab4>
    <94533>   DW_AT_data_member_location: 24
 <2><94534>: Abbrev Number: 10 (DW_TAG_member)
    <94535>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <94539>   DW_AT_decl_file   : 81
    <9453a>   DW_AT_decl_line   : 787
    <9453c>   DW_AT_decl_column : 9
    <9453d>   DW_AT_type        : <0x93896>
    <94541>   DW_AT_data_member_location: 32
 <2><94542>: Abbrev Number: 10 (DW_TAG_member)
    <94543>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94547>   DW_AT_decl_file   : 81
    <94548>   DW_AT_decl_line   : 788
    <9454a>   DW_AT_decl_column : 9
    <9454b>   DW_AT_type        : <0x93896>
    <9454f>   DW_AT_data_member_location: 40
 <2><94550>: Abbrev Number: 31 (DW_TAG_member)
    <94551>   DW_AT_name        : x
    <94553>   DW_AT_decl_file   : 81
    <94554>   DW_AT_decl_line   : 789
    <94556>   DW_AT_decl_column : 6
    <94557>   DW_AT_type        : <0x7980a>
    <9455b>   DW_AT_data_member_location: 48
 <2><9455c>: Abbrev Number: 31 (DW_TAG_member)
    <9455d>   DW_AT_name        : y
    <9455f>   DW_AT_decl_file   : 81
    <94560>   DW_AT_decl_line   : 789
    <94562>   DW_AT_decl_column : 9
    <94563>   DW_AT_type        : <0x7980a>
    <94567>   DW_AT_data_member_location: 52
 <2><94568>: Abbrev Number: 0
 <1><94569>: Abbrev Number: 4 (DW_TAG_typedef)
    <9456a>   DW_AT_name        : (indirect string, offset: 0x738f2): XGravityEvent
    <9456e>   DW_AT_decl_file   : 81
    <9456f>   DW_AT_decl_line   : 790
    <94571>   DW_AT_decl_column : 3
    <94572>   DW_AT_type        : <0x944ee>
 <1><94576>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94577>   DW_AT_byte_size   : 48
    <94578>   DW_AT_decl_file   : 81
    <94579>   DW_AT_decl_line   : 792
    <9457b>   DW_AT_decl_column : 16
    <9457c>   DW_AT_linkage_name: (indirect string, offset: 0x5e742): 19XResizeRequestEvent
    <94580>   DW_AT_sibling     : <0x945e7>
 <2><94584>: Abbrev Number: 10 (DW_TAG_member)
    <94585>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94589>   DW_AT_decl_file   : 81
    <9458a>   DW_AT_decl_line   : 793
    <9458c>   DW_AT_decl_column : 6
    <9458d>   DW_AT_type        : <0x7980a>
    <94591>   DW_AT_data_member_location: 0
 <2><94592>: Abbrev Number: 10 (DW_TAG_member)
    <94593>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94597>   DW_AT_decl_file   : 81
    <94598>   DW_AT_decl_line   : 794
    <9459a>   DW_AT_decl_column : 16
    <9459b>   DW_AT_type        : <0x79786>
    <9459f>   DW_AT_data_member_location: 8
 <2><945a0>: Abbrev Number: 10 (DW_TAG_member)
    <945a1>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <945a5>   DW_AT_decl_file   : 81
    <945a6>   DW_AT_decl_line   : 795
    <945a8>   DW_AT_decl_column : 7
    <945a9>   DW_AT_type        : <0x7980a>
    <945ad>   DW_AT_data_member_location: 16
 <2><945ae>: Abbrev Number: 10 (DW_TAG_member)
    <945af>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <945b3>   DW_AT_decl_file   : 81
    <945b4>   DW_AT_decl_line   : 796
    <945b6>   DW_AT_decl_column : 11
    <945b7>   DW_AT_type        : <0x93ab4>
    <945bb>   DW_AT_data_member_location: 24
 <2><945bc>: Abbrev Number: 10 (DW_TAG_member)
    <945bd>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <945c1>   DW_AT_decl_file   : 81
    <945c2>   DW_AT_decl_line   : 797
    <945c4>   DW_AT_decl_column : 9
    <945c5>   DW_AT_type        : <0x93896>
    <945c9>   DW_AT_data_member_location: 32
 <2><945ca>: Abbrev Number: 10 (DW_TAG_member)
    <945cb>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <945cf>   DW_AT_decl_file   : 81
    <945d0>   DW_AT_decl_line   : 798
    <945d2>   DW_AT_decl_column : 6
    <945d3>   DW_AT_type        : <0x7980a>
    <945d7>   DW_AT_data_member_location: 40
 <2><945d8>: Abbrev Number: 10 (DW_TAG_member)
    <945d9>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <945dd>   DW_AT_decl_file   : 81
    <945de>   DW_AT_decl_line   : 798
    <945e0>   DW_AT_decl_column : 13
    <945e1>   DW_AT_type        : <0x7980a>
    <945e5>   DW_AT_data_member_location: 44
 <2><945e6>: Abbrev Number: 0
 <1><945e7>: Abbrev Number: 4 (DW_TAG_typedef)
    <945e8>   DW_AT_name        : (indirect string, offset: 0x5e744): XResizeRequestEvent
    <945ec>   DW_AT_decl_file   : 81
    <945ed>   DW_AT_decl_line   : 799
    <945ef>   DW_AT_decl_column : 3
    <945f0>   DW_AT_type        : <0x94576>
 <1><945f4>: Abbrev Number: 40 (DW_TAG_structure_type)
    <945f5>   DW_AT_byte_size   : 96
    <945f6>   DW_AT_decl_file   : 81
    <945f7>   DW_AT_decl_line   : 801
    <945f9>   DW_AT_decl_column : 16
    <945fa>   DW_AT_linkage_name: (indirect string, offset: 0x7aa9a): 22XConfigureRequestEvent
    <945fe>   DW_AT_sibling     : <0x946c3>
 <2><94602>: Abbrev Number: 10 (DW_TAG_member)
    <94603>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94607>   DW_AT_decl_file   : 81
    <94608>   DW_AT_decl_line   : 802
    <9460a>   DW_AT_decl_column : 6
    <9460b>   DW_AT_type        : <0x7980a>
    <9460f>   DW_AT_data_member_location: 0
 <2><94610>: Abbrev Number: 10 (DW_TAG_member)
    <94611>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94615>   DW_AT_decl_file   : 81
    <94616>   DW_AT_decl_line   : 803
    <94618>   DW_AT_decl_column : 16
    <94619>   DW_AT_type        : <0x79786>
    <9461d>   DW_AT_data_member_location: 8
 <2><9461e>: Abbrev Number: 10 (DW_TAG_member)
    <9461f>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94623>   DW_AT_decl_file   : 81
    <94624>   DW_AT_decl_line   : 804
    <94626>   DW_AT_decl_column : 7
    <94627>   DW_AT_type        : <0x7980a>
    <9462b>   DW_AT_data_member_location: 16
 <2><9462c>: Abbrev Number: 10 (DW_TAG_member)
    <9462d>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94631>   DW_AT_decl_file   : 81
    <94632>   DW_AT_decl_line   : 805
    <94634>   DW_AT_decl_column : 11
    <94635>   DW_AT_type        : <0x93ab4>
    <94639>   DW_AT_data_member_location: 24
 <2><9463a>: Abbrev Number: 10 (DW_TAG_member)
    <9463b>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <9463f>   DW_AT_decl_file   : 81
    <94640>   DW_AT_decl_line   : 806
    <94642>   DW_AT_decl_column : 9
    <94643>   DW_AT_type        : <0x93896>
    <94647>   DW_AT_data_member_location: 32
 <2><94648>: Abbrev Number: 10 (DW_TAG_member)
    <94649>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <9464d>   DW_AT_decl_file   : 81
    <9464e>   DW_AT_decl_line   : 807
    <94650>   DW_AT_decl_column : 9
    <94651>   DW_AT_type        : <0x93896>
    <94655>   DW_AT_data_member_location: 40
 <2><94656>: Abbrev Number: 31 (DW_TAG_member)
    <94657>   DW_AT_name        : x
    <94659>   DW_AT_decl_file   : 81
    <9465a>   DW_AT_decl_line   : 808
    <9465c>   DW_AT_decl_column : 6
    <9465d>   DW_AT_type        : <0x7980a>
    <94661>   DW_AT_data_member_location: 48
 <2><94662>: Abbrev Number: 31 (DW_TAG_member)
    <94663>   DW_AT_name        : y
    <94665>   DW_AT_decl_file   : 81
    <94666>   DW_AT_decl_line   : 808
    <94668>   DW_AT_decl_column : 9
    <94669>   DW_AT_type        : <0x7980a>
    <9466d>   DW_AT_data_member_location: 52
 <2><9466e>: Abbrev Number: 10 (DW_TAG_member)
    <9466f>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <94673>   DW_AT_decl_file   : 81
    <94674>   DW_AT_decl_line   : 809
    <94676>   DW_AT_decl_column : 6
    <94677>   DW_AT_type        : <0x7980a>
    <9467b>   DW_AT_data_member_location: 56
 <2><9467c>: Abbrev Number: 10 (DW_TAG_member)
    <9467d>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <94681>   DW_AT_decl_file   : 81
    <94682>   DW_AT_decl_line   : 809
    <94684>   DW_AT_decl_column : 13
    <94685>   DW_AT_type        : <0x7980a>
    <94689>   DW_AT_data_member_location: 60
 <2><9468a>: Abbrev Number: 10 (DW_TAG_member)
    <9468b>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <9468f>   DW_AT_decl_file   : 81
    <94690>   DW_AT_decl_line   : 810
    <94692>   DW_AT_decl_column : 6
    <94693>   DW_AT_type        : <0x7980a>
    <94697>   DW_AT_data_member_location: 64
 <2><94698>: Abbrev Number: 10 (DW_TAG_member)
    <94699>   DW_AT_name        : (indirect string, offset: 0x88ee2): above
    <9469d>   DW_AT_decl_file   : 81
    <9469e>   DW_AT_decl_line   : 811
    <946a0>   DW_AT_decl_column : 9
    <946a1>   DW_AT_type        : <0x93896>
    <946a5>   DW_AT_data_member_location: 72
 <2><946a6>: Abbrev Number: 10 (DW_TAG_member)
    <946a7>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <946ab>   DW_AT_decl_file   : 81
    <946ac>   DW_AT_decl_line   : 812
    <946ae>   DW_AT_decl_column : 6
    <946af>   DW_AT_type        : <0x7980a>
    <946b3>   DW_AT_data_member_location: 80
 <2><946b4>: Abbrev Number: 10 (DW_TAG_member)
    <946b5>   DW_AT_name        : (indirect string, offset: 0x6bee7): value_mask
    <946b9>   DW_AT_decl_file   : 81
    <946ba>   DW_AT_decl_line   : 813
    <946bc>   DW_AT_decl_column : 16
    <946bd>   DW_AT_type        : <0x79786>
    <946c1>   DW_AT_data_member_location: 88
 <2><946c2>: Abbrev Number: 0
 <1><946c3>: Abbrev Number: 4 (DW_TAG_typedef)
    <946c4>   DW_AT_name        : (indirect string, offset: 0x7aa9c): XConfigureRequestEvent
    <946c8>   DW_AT_decl_file   : 81
    <946c9>   DW_AT_decl_line   : 814
    <946cb>   DW_AT_decl_column : 3
    <946cc>   DW_AT_type        : <0x945f4>
 <1><946d0>: Abbrev Number: 40 (DW_TAG_structure_type)
    <946d1>   DW_AT_byte_size   : 56
    <946d2>   DW_AT_decl_file   : 81
    <946d3>   DW_AT_decl_line   : 816
    <946d5>   DW_AT_decl_column : 16
    <946d6>   DW_AT_linkage_name: (indirect string, offset: 0x7f620): 15XCirculateEvent
    <946da>   DW_AT_sibling     : <0x94741>
 <2><946de>: Abbrev Number: 10 (DW_TAG_member)
    <946df>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <946e3>   DW_AT_decl_file   : 81
    <946e4>   DW_AT_decl_line   : 817
    <946e6>   DW_AT_decl_column : 6
    <946e7>   DW_AT_type        : <0x7980a>
    <946eb>   DW_AT_data_member_location: 0
 <2><946ec>: Abbrev Number: 10 (DW_TAG_member)
    <946ed>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <946f1>   DW_AT_decl_file   : 81
    <946f2>   DW_AT_decl_line   : 818
    <946f4>   DW_AT_decl_column : 16
    <946f5>   DW_AT_type        : <0x79786>
    <946f9>   DW_AT_data_member_location: 8
 <2><946fa>: Abbrev Number: 10 (DW_TAG_member)
    <946fb>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <946ff>   DW_AT_decl_file   : 81
    <94700>   DW_AT_decl_line   : 819
    <94702>   DW_AT_decl_column : 7
    <94703>   DW_AT_type        : <0x7980a>
    <94707>   DW_AT_data_member_location: 16
 <2><94708>: Abbrev Number: 10 (DW_TAG_member)
    <94709>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9470d>   DW_AT_decl_file   : 81
    <9470e>   DW_AT_decl_line   : 820
    <94710>   DW_AT_decl_column : 11
    <94711>   DW_AT_type        : <0x93ab4>
    <94715>   DW_AT_data_member_location: 24
 <2><94716>: Abbrev Number: 10 (DW_TAG_member)
    <94717>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <9471b>   DW_AT_decl_file   : 81
    <9471c>   DW_AT_decl_line   : 821
    <9471e>   DW_AT_decl_column : 9
    <9471f>   DW_AT_type        : <0x93896>
    <94723>   DW_AT_data_member_location: 32
 <2><94724>: Abbrev Number: 10 (DW_TAG_member)
    <94725>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94729>   DW_AT_decl_file   : 81
    <9472a>   DW_AT_decl_line   : 822
    <9472c>   DW_AT_decl_column : 9
    <9472d>   DW_AT_type        : <0x93896>
    <94731>   DW_AT_data_member_location: 40
 <2><94732>: Abbrev Number: 10 (DW_TAG_member)
    <94733>   DW_AT_name        : (indirect string, offset: 0x79a44): place
    <94737>   DW_AT_decl_file   : 81
    <94738>   DW_AT_decl_line   : 823
    <9473a>   DW_AT_decl_column : 6
    <9473b>   DW_AT_type        : <0x7980a>
    <9473f>   DW_AT_data_member_location: 48
 <2><94740>: Abbrev Number: 0
 <1><94741>: Abbrev Number: 4 (DW_TAG_typedef)
    <94742>   DW_AT_name        : (indirect string, offset: 0x7f622): XCirculateEvent
    <94746>   DW_AT_decl_file   : 81
    <94747>   DW_AT_decl_line   : 824
    <94749>   DW_AT_decl_column : 3
    <9474a>   DW_AT_type        : <0x946d0>
 <1><9474e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <9474f>   DW_AT_byte_size   : 56
    <94750>   DW_AT_decl_file   : 81
    <94751>   DW_AT_decl_line   : 826
    <94753>   DW_AT_decl_column : 16
    <94754>   DW_AT_linkage_name: (indirect string, offset: 0x7788a): 22XCirculateRequestEvent
    <94758>   DW_AT_sibling     : <0x947bf>
 <2><9475c>: Abbrev Number: 10 (DW_TAG_member)
    <9475d>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94761>   DW_AT_decl_file   : 81
    <94762>   DW_AT_decl_line   : 827
    <94764>   DW_AT_decl_column : 6
    <94765>   DW_AT_type        : <0x7980a>
    <94769>   DW_AT_data_member_location: 0
 <2><9476a>: Abbrev Number: 10 (DW_TAG_member)
    <9476b>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <9476f>   DW_AT_decl_file   : 81
    <94770>   DW_AT_decl_line   : 828
    <94772>   DW_AT_decl_column : 16
    <94773>   DW_AT_type        : <0x79786>
    <94777>   DW_AT_data_member_location: 8
 <2><94778>: Abbrev Number: 10 (DW_TAG_member)
    <94779>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <9477d>   DW_AT_decl_file   : 81
    <9477e>   DW_AT_decl_line   : 829
    <94780>   DW_AT_decl_column : 7
    <94781>   DW_AT_type        : <0x7980a>
    <94785>   DW_AT_data_member_location: 16
 <2><94786>: Abbrev Number: 10 (DW_TAG_member)
    <94787>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <9478b>   DW_AT_decl_file   : 81
    <9478c>   DW_AT_decl_line   : 830
    <9478e>   DW_AT_decl_column : 11
    <9478f>   DW_AT_type        : <0x93ab4>
    <94793>   DW_AT_data_member_location: 24
 <2><94794>: Abbrev Number: 10 (DW_TAG_member)
    <94795>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <94799>   DW_AT_decl_file   : 81
    <9479a>   DW_AT_decl_line   : 831
    <9479c>   DW_AT_decl_column : 9
    <9479d>   DW_AT_type        : <0x93896>
    <947a1>   DW_AT_data_member_location: 32
 <2><947a2>: Abbrev Number: 10 (DW_TAG_member)
    <947a3>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <947a7>   DW_AT_decl_file   : 81
    <947a8>   DW_AT_decl_line   : 832
    <947aa>   DW_AT_decl_column : 9
    <947ab>   DW_AT_type        : <0x93896>
    <947af>   DW_AT_data_member_location: 40
 <2><947b0>: Abbrev Number: 10 (DW_TAG_member)
    <947b1>   DW_AT_name        : (indirect string, offset: 0x79a44): place
    <947b5>   DW_AT_decl_file   : 81
    <947b6>   DW_AT_decl_line   : 833
    <947b8>   DW_AT_decl_column : 6
    <947b9>   DW_AT_type        : <0x7980a>
    <947bd>   DW_AT_data_member_location: 48
 <2><947be>: Abbrev Number: 0
 <1><947bf>: Abbrev Number: 4 (DW_TAG_typedef)
    <947c0>   DW_AT_name        : (indirect string, offset: 0x7788c): XCirculateRequestEvent
    <947c4>   DW_AT_decl_file   : 81
    <947c5>   DW_AT_decl_line   : 834
    <947c7>   DW_AT_decl_column : 3
    <947c8>   DW_AT_type        : <0x9474e>
 <1><947cc>: Abbrev Number: 40 (DW_TAG_structure_type)
    <947cd>   DW_AT_byte_size   : 64
    <947ce>   DW_AT_decl_file   : 81
    <947cf>   DW_AT_decl_line   : 836
    <947d1>   DW_AT_decl_column : 16
    <947d2>   DW_AT_linkage_name: (indirect string, offset: 0x70337): 14XPropertyEvent
    <947d6>   DW_AT_sibling     : <0x9484b>
 <2><947da>: Abbrev Number: 10 (DW_TAG_member)
    <947db>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <947df>   DW_AT_decl_file   : 81
    <947e0>   DW_AT_decl_line   : 837
    <947e2>   DW_AT_decl_column : 6
    <947e3>   DW_AT_type        : <0x7980a>
    <947e7>   DW_AT_data_member_location: 0
 <2><947e8>: Abbrev Number: 10 (DW_TAG_member)
    <947e9>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <947ed>   DW_AT_decl_file   : 81
    <947ee>   DW_AT_decl_line   : 838
    <947f0>   DW_AT_decl_column : 16
    <947f1>   DW_AT_type        : <0x79786>
    <947f5>   DW_AT_data_member_location: 8
 <2><947f6>: Abbrev Number: 10 (DW_TAG_member)
    <947f7>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <947fb>   DW_AT_decl_file   : 81
    <947fc>   DW_AT_decl_line   : 839
    <947fe>   DW_AT_decl_column : 7
    <947ff>   DW_AT_type        : <0x7980a>
    <94803>   DW_AT_data_member_location: 16
 <2><94804>: Abbrev Number: 10 (DW_TAG_member)
    <94805>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94809>   DW_AT_decl_file   : 81
    <9480a>   DW_AT_decl_line   : 840
    <9480c>   DW_AT_decl_column : 11
    <9480d>   DW_AT_type        : <0x93ab4>
    <94811>   DW_AT_data_member_location: 24
 <2><94812>: Abbrev Number: 10 (DW_TAG_member)
    <94813>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94817>   DW_AT_decl_file   : 81
    <94818>   DW_AT_decl_line   : 841
    <9481a>   DW_AT_decl_column : 9
    <9481b>   DW_AT_type        : <0x93896>
    <9481f>   DW_AT_data_member_location: 32
 <2><94820>: Abbrev Number: 10 (DW_TAG_member)
    <94821>   DW_AT_name        : (indirect string, offset: 0x7621b): atom
    <94825>   DW_AT_decl_file   : 81
    <94826>   DW_AT_decl_line   : 842
    <94828>   DW_AT_decl_column : 7
    <94829>   DW_AT_type        : <0x93872>
    <9482d>   DW_AT_data_member_location: 40
 <2><9482e>: Abbrev Number: 10 (DW_TAG_member)
    <9482f>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <94833>   DW_AT_decl_file   : 81
    <94834>   DW_AT_decl_line   : 843
    <94836>   DW_AT_decl_column : 7
    <94837>   DW_AT_type        : <0x9388a>
    <9483b>   DW_AT_data_member_location: 48
 <2><9483c>: Abbrev Number: 10 (DW_TAG_member)
    <9483d>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <94841>   DW_AT_decl_file   : 81
    <94842>   DW_AT_decl_line   : 844
    <94844>   DW_AT_decl_column : 6
    <94845>   DW_AT_type        : <0x7980a>
    <94849>   DW_AT_data_member_location: 56
 <2><9484a>: Abbrev Number: 0
 <1><9484b>: Abbrev Number: 4 (DW_TAG_typedef)
    <9484c>   DW_AT_name        : (indirect string, offset: 0x70339): XPropertyEvent
    <94850>   DW_AT_decl_file   : 81
    <94851>   DW_AT_decl_line   : 845
    <94853>   DW_AT_decl_column : 3
    <94854>   DW_AT_type        : <0x947cc>
 <1><94858>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94859>   DW_AT_byte_size   : 56
    <9485a>   DW_AT_decl_file   : 81
    <9485b>   DW_AT_decl_line   : 847
    <9485d>   DW_AT_decl_column : 16
    <9485e>   DW_AT_linkage_name: (indirect string, offset: 0x742ab): 20XSelectionClearEvent
    <94862>   DW_AT_sibling     : <0x948c9>
 <2><94866>: Abbrev Number: 10 (DW_TAG_member)
    <94867>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <9486b>   DW_AT_decl_file   : 81
    <9486c>   DW_AT_decl_line   : 848
    <9486e>   DW_AT_decl_column : 6
    <9486f>   DW_AT_type        : <0x7980a>
    <94873>   DW_AT_data_member_location: 0
 <2><94874>: Abbrev Number: 10 (DW_TAG_member)
    <94875>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94879>   DW_AT_decl_file   : 81
    <9487a>   DW_AT_decl_line   : 849
    <9487c>   DW_AT_decl_column : 16
    <9487d>   DW_AT_type        : <0x79786>
    <94881>   DW_AT_data_member_location: 8
 <2><94882>: Abbrev Number: 10 (DW_TAG_member)
    <94883>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94887>   DW_AT_decl_file   : 81
    <94888>   DW_AT_decl_line   : 850
    <9488a>   DW_AT_decl_column : 7
    <9488b>   DW_AT_type        : <0x7980a>
    <9488f>   DW_AT_data_member_location: 16
 <2><94890>: Abbrev Number: 10 (DW_TAG_member)
    <94891>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94895>   DW_AT_decl_file   : 81
    <94896>   DW_AT_decl_line   : 851
    <94898>   DW_AT_decl_column : 11
    <94899>   DW_AT_type        : <0x93ab4>
    <9489d>   DW_AT_data_member_location: 24
 <2><9489e>: Abbrev Number: 10 (DW_TAG_member)
    <9489f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <948a3>   DW_AT_decl_file   : 81
    <948a4>   DW_AT_decl_line   : 852
    <948a6>   DW_AT_decl_column : 9
    <948a7>   DW_AT_type        : <0x93896>
    <948ab>   DW_AT_data_member_location: 32
 <2><948ac>: Abbrev Number: 10 (DW_TAG_member)
    <948ad>   DW_AT_name        : (indirect string, offset: 0x63c39): selection
    <948b1>   DW_AT_decl_file   : 81
    <948b2>   DW_AT_decl_line   : 853
    <948b4>   DW_AT_decl_column : 7
    <948b5>   DW_AT_type        : <0x93872>
    <948b9>   DW_AT_data_member_location: 40
 <2><948ba>: Abbrev Number: 10 (DW_TAG_member)
    <948bb>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <948bf>   DW_AT_decl_file   : 81
    <948c0>   DW_AT_decl_line   : 854
    <948c2>   DW_AT_decl_column : 7
    <948c3>   DW_AT_type        : <0x9388a>
    <948c7>   DW_AT_data_member_location: 48
 <2><948c8>: Abbrev Number: 0
 <1><948c9>: Abbrev Number: 4 (DW_TAG_typedef)
    <948ca>   DW_AT_name        : (indirect string, offset: 0x742ad): XSelectionClearEvent
    <948ce>   DW_AT_decl_file   : 81
    <948cf>   DW_AT_decl_line   : 855
    <948d1>   DW_AT_decl_column : 3
    <948d2>   DW_AT_type        : <0x94858>
 <1><948d6>: Abbrev Number: 40 (DW_TAG_structure_type)
    <948d7>   DW_AT_byte_size   : 80
    <948d8>   DW_AT_decl_file   : 81
    <948d9>   DW_AT_decl_line   : 857
    <948db>   DW_AT_decl_column : 16
    <948dc>   DW_AT_linkage_name: (indirect string, offset: 0x6b163): 22XSelectionRequestEvent
    <948e0>   DW_AT_sibling     : <0x94971>
 <2><948e4>: Abbrev Number: 10 (DW_TAG_member)
    <948e5>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <948e9>   DW_AT_decl_file   : 81
    <948ea>   DW_AT_decl_line   : 858
    <948ec>   DW_AT_decl_column : 6
    <948ed>   DW_AT_type        : <0x7980a>
    <948f1>   DW_AT_data_member_location: 0
 <2><948f2>: Abbrev Number: 10 (DW_TAG_member)
    <948f3>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <948f7>   DW_AT_decl_file   : 81
    <948f8>   DW_AT_decl_line   : 859
    <948fa>   DW_AT_decl_column : 16
    <948fb>   DW_AT_type        : <0x79786>
    <948ff>   DW_AT_data_member_location: 8
 <2><94900>: Abbrev Number: 10 (DW_TAG_member)
    <94901>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94905>   DW_AT_decl_file   : 81
    <94906>   DW_AT_decl_line   : 860
    <94908>   DW_AT_decl_column : 7
    <94909>   DW_AT_type        : <0x7980a>
    <9490d>   DW_AT_data_member_location: 16
 <2><9490e>: Abbrev Number: 10 (DW_TAG_member)
    <9490f>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94913>   DW_AT_decl_file   : 81
    <94914>   DW_AT_decl_line   : 861
    <94916>   DW_AT_decl_column : 11
    <94917>   DW_AT_type        : <0x93ab4>
    <9491b>   DW_AT_data_member_location: 24
 <2><9491c>: Abbrev Number: 10 (DW_TAG_member)
    <9491d>   DW_AT_name        : (indirect string, offset: 0x7b437): owner
    <94921>   DW_AT_decl_file   : 81
    <94922>   DW_AT_decl_line   : 862
    <94924>   DW_AT_decl_column : 9
    <94925>   DW_AT_type        : <0x93896>
    <94929>   DW_AT_data_member_location: 32
 <2><9492a>: Abbrev Number: 10 (DW_TAG_member)
    <9492b>   DW_AT_name        : (indirect string, offset: 0x79d6d): requestor
    <9492f>   DW_AT_decl_file   : 81
    <94930>   DW_AT_decl_line   : 863
    <94932>   DW_AT_decl_column : 9
    <94933>   DW_AT_type        : <0x93896>
    <94937>   DW_AT_data_member_location: 40
 <2><94938>: Abbrev Number: 10 (DW_TAG_member)
    <94939>   DW_AT_name        : (indirect string, offset: 0x63c39): selection
    <9493d>   DW_AT_decl_file   : 81
    <9493e>   DW_AT_decl_line   : 864
    <94940>   DW_AT_decl_column : 7
    <94941>   DW_AT_type        : <0x93872>
    <94945>   DW_AT_data_member_location: 48
 <2><94946>: Abbrev Number: 10 (DW_TAG_member)
    <94947>   DW_AT_name        : (indirect string, offset: 0x8ccdd): target
    <9494b>   DW_AT_decl_file   : 81
    <9494c>   DW_AT_decl_line   : 865
    <9494e>   DW_AT_decl_column : 7
    <9494f>   DW_AT_type        : <0x93872>
    <94953>   DW_AT_data_member_location: 56
 <2><94954>: Abbrev Number: 10 (DW_TAG_member)
    <94955>   DW_AT_name        : (indirect string, offset: 0x7b577): property
    <94959>   DW_AT_decl_file   : 81
    <9495a>   DW_AT_decl_line   : 866
    <9495c>   DW_AT_decl_column : 7
    <9495d>   DW_AT_type        : <0x93872>
    <94961>   DW_AT_data_member_location: 64
 <2><94962>: Abbrev Number: 10 (DW_TAG_member)
    <94963>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <94967>   DW_AT_decl_file   : 81
    <94968>   DW_AT_decl_line   : 867
    <9496a>   DW_AT_decl_column : 7
    <9496b>   DW_AT_type        : <0x9388a>
    <9496f>   DW_AT_data_member_location: 72
 <2><94970>: Abbrev Number: 0
 <1><94971>: Abbrev Number: 4 (DW_TAG_typedef)
    <94972>   DW_AT_name        : (indirect string, offset: 0x6b165): XSelectionRequestEvent
    <94976>   DW_AT_decl_file   : 81
    <94977>   DW_AT_decl_line   : 868
    <94979>   DW_AT_decl_column : 3
    <9497a>   DW_AT_type        : <0x948d6>
 <1><9497e>: Abbrev Number: 40 (DW_TAG_structure_type)
    <9497f>   DW_AT_byte_size   : 72
    <94980>   DW_AT_decl_file   : 81
    <94981>   DW_AT_decl_line   : 870
    <94983>   DW_AT_decl_column : 16
    <94984>   DW_AT_linkage_name: (indirect string, offset: 0x5fabb): 15XSelectionEvent
    <94988>   DW_AT_sibling     : <0x94a0b>
 <2><9498c>: Abbrev Number: 10 (DW_TAG_member)
    <9498d>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94991>   DW_AT_decl_file   : 81
    <94992>   DW_AT_decl_line   : 871
    <94994>   DW_AT_decl_column : 6
    <94995>   DW_AT_type        : <0x7980a>
    <94999>   DW_AT_data_member_location: 0
 <2><9499a>: Abbrev Number: 10 (DW_TAG_member)
    <9499b>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <9499f>   DW_AT_decl_file   : 81
    <949a0>   DW_AT_decl_line   : 872
    <949a2>   DW_AT_decl_column : 16
    <949a3>   DW_AT_type        : <0x79786>
    <949a7>   DW_AT_data_member_location: 8
 <2><949a8>: Abbrev Number: 10 (DW_TAG_member)
    <949a9>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <949ad>   DW_AT_decl_file   : 81
    <949ae>   DW_AT_decl_line   : 873
    <949b0>   DW_AT_decl_column : 7
    <949b1>   DW_AT_type        : <0x7980a>
    <949b5>   DW_AT_data_member_location: 16
 <2><949b6>: Abbrev Number: 10 (DW_TAG_member)
    <949b7>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <949bb>   DW_AT_decl_file   : 81
    <949bc>   DW_AT_decl_line   : 874
    <949be>   DW_AT_decl_column : 11
    <949bf>   DW_AT_type        : <0x93ab4>
    <949c3>   DW_AT_data_member_location: 24
 <2><949c4>: Abbrev Number: 10 (DW_TAG_member)
    <949c5>   DW_AT_name        : (indirect string, offset: 0x79d6d): requestor
    <949c9>   DW_AT_decl_file   : 81
    <949ca>   DW_AT_decl_line   : 875
    <949cc>   DW_AT_decl_column : 9
    <949cd>   DW_AT_type        : <0x93896>
    <949d1>   DW_AT_data_member_location: 32
 <2><949d2>: Abbrev Number: 10 (DW_TAG_member)
    <949d3>   DW_AT_name        : (indirect string, offset: 0x63c39): selection
    <949d7>   DW_AT_decl_file   : 81
    <949d8>   DW_AT_decl_line   : 876
    <949da>   DW_AT_decl_column : 7
    <949db>   DW_AT_type        : <0x93872>
    <949df>   DW_AT_data_member_location: 40
 <2><949e0>: Abbrev Number: 10 (DW_TAG_member)
    <949e1>   DW_AT_name        : (indirect string, offset: 0x8ccdd): target
    <949e5>   DW_AT_decl_file   : 81
    <949e6>   DW_AT_decl_line   : 877
    <949e8>   DW_AT_decl_column : 7
    <949e9>   DW_AT_type        : <0x93872>
    <949ed>   DW_AT_data_member_location: 48
 <2><949ee>: Abbrev Number: 10 (DW_TAG_member)
    <949ef>   DW_AT_name        : (indirect string, offset: 0x7b577): property
    <949f3>   DW_AT_decl_file   : 81
    <949f4>   DW_AT_decl_line   : 878
    <949f6>   DW_AT_decl_column : 7
    <949f7>   DW_AT_type        : <0x93872>
    <949fb>   DW_AT_data_member_location: 56
 <2><949fc>: Abbrev Number: 10 (DW_TAG_member)
    <949fd>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <94a01>   DW_AT_decl_file   : 81
    <94a02>   DW_AT_decl_line   : 879
    <94a04>   DW_AT_decl_column : 7
    <94a05>   DW_AT_type        : <0x9388a>
    <94a09>   DW_AT_data_member_location: 64
 <2><94a0a>: Abbrev Number: 0
 <1><94a0b>: Abbrev Number: 4 (DW_TAG_typedef)
    <94a0c>   DW_AT_name        : (indirect string, offset: 0x5fabd): XSelectionEvent
    <94a10>   DW_AT_decl_file   : 81
    <94a11>   DW_AT_decl_line   : 880
    <94a13>   DW_AT_decl_column : 3
    <94a14>   DW_AT_type        : <0x9497e>
 <1><94a18>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94a19>   DW_AT_byte_size   : 56
    <94a1a>   DW_AT_decl_file   : 81
    <94a1b>   DW_AT_decl_line   : 882
    <94a1d>   DW_AT_decl_column : 16
    <94a1e>   DW_AT_linkage_name: (indirect string, offset: 0x6b809): 14XColormapEvent
    <94a22>   DW_AT_sibling     : <0x94a97>
 <2><94a26>: Abbrev Number: 10 (DW_TAG_member)
    <94a27>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94a2b>   DW_AT_decl_file   : 81
    <94a2c>   DW_AT_decl_line   : 883
    <94a2e>   DW_AT_decl_column : 6
    <94a2f>   DW_AT_type        : <0x7980a>
    <94a33>   DW_AT_data_member_location: 0
 <2><94a34>: Abbrev Number: 10 (DW_TAG_member)
    <94a35>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94a39>   DW_AT_decl_file   : 81
    <94a3a>   DW_AT_decl_line   : 884
    <94a3c>   DW_AT_decl_column : 16
    <94a3d>   DW_AT_type        : <0x79786>
    <94a41>   DW_AT_data_member_location: 8
 <2><94a42>: Abbrev Number: 10 (DW_TAG_member)
    <94a43>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94a47>   DW_AT_decl_file   : 81
    <94a48>   DW_AT_decl_line   : 885
    <94a4a>   DW_AT_decl_column : 7
    <94a4b>   DW_AT_type        : <0x7980a>
    <94a4f>   DW_AT_data_member_location: 16
 <2><94a50>: Abbrev Number: 10 (DW_TAG_member)
    <94a51>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94a55>   DW_AT_decl_file   : 81
    <94a56>   DW_AT_decl_line   : 886
    <94a58>   DW_AT_decl_column : 11
    <94a59>   DW_AT_type        : <0x93ab4>
    <94a5d>   DW_AT_data_member_location: 24
 <2><94a5e>: Abbrev Number: 10 (DW_TAG_member)
    <94a5f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94a63>   DW_AT_decl_file   : 81
    <94a64>   DW_AT_decl_line   : 887
    <94a66>   DW_AT_decl_column : 9
    <94a67>   DW_AT_type        : <0x93896>
    <94a6b>   DW_AT_data_member_location: 32
 <2><94a6c>: Abbrev Number: 10 (DW_TAG_member)
    <94a6d>   DW_AT_name        : (indirect string, offset: 0x60b73): colormap
    <94a71>   DW_AT_decl_file   : 81
    <94a72>   DW_AT_decl_line   : 888
    <94a74>   DW_AT_decl_column : 11
    <94a75>   DW_AT_type        : <0x938ba>
    <94a79>   DW_AT_data_member_location: 40
 <2><94a7a>: Abbrev Number: 10 (DW_TAG_member)
    <94a7b>   DW_AT_name        : (indirect string, offset: 0x84d57): c_new
    <94a7f>   DW_AT_decl_file   : 81
    <94a80>   DW_AT_decl_line   : 890
    <94a82>   DW_AT_decl_column : 7
    <94a83>   DW_AT_type        : <0x7980a>
    <94a87>   DW_AT_data_member_location: 48
 <2><94a88>: Abbrev Number: 10 (DW_TAG_member)
    <94a89>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <94a8d>   DW_AT_decl_file   : 81
    <94a8e>   DW_AT_decl_line   : 894
    <94a90>   DW_AT_decl_column : 6
    <94a91>   DW_AT_type        : <0x7980a>
    <94a95>   DW_AT_data_member_location: 52
 <2><94a96>: Abbrev Number: 0
 <1><94a97>: Abbrev Number: 4 (DW_TAG_typedef)
    <94a98>   DW_AT_name        : (indirect string, offset: 0x6b80b): XColormapEvent
    <94a9c>   DW_AT_decl_file   : 81
    <94a9d>   DW_AT_decl_line   : 895
    <94a9f>   DW_AT_decl_column : 3
    <94aa0>   DW_AT_type        : <0x94a18>
 <1><94aa4>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94aa5>   DW_AT_byte_size   : 96
    <94aa6>   DW_AT_decl_file   : 81
    <94aa7>   DW_AT_decl_line   : 897
    <94aa9>   DW_AT_decl_column : 16
    <94aaa>   DW_AT_linkage_name: (indirect string, offset: 0x8326b): 19XClientMessageEvent
    <94aae>   DW_AT_sibling     : <0x94b4f>
 <2><94ab2>: Abbrev Number: 47 (DW_TAG_union_type)
    <94ab3>   DW_AT_byte_size   : 40
    <94ab4>   DW_AT_decl_file   : 81
    <94ab5>   DW_AT_decl_line   : 905
    <94ab7>   DW_AT_decl_column : 8
    <94ab8>   DW_AT_sibling     : <0x94ade>
 <3><94abc>: Abbrev Number: 41 (DW_TAG_member)
    <94abd>   DW_AT_name        : b
    <94abf>   DW_AT_decl_file   : 81
    <94ac0>   DW_AT_decl_line   : 906
    <94ac2>   DW_AT_decl_column : 8
    <94ac3>   DW_AT_type        : <0x91ccc>
 <3><94ac7>: Abbrev Number: 41 (DW_TAG_member)
    <94ac8>   DW_AT_name        : s
    <94aca>   DW_AT_decl_file   : 81
    <94acb>   DW_AT_decl_line   : 907
    <94acd>   DW_AT_decl_column : 9
    <94ace>   DW_AT_type        : <0x94b4f>
 <3><94ad2>: Abbrev Number: 41 (DW_TAG_member)
    <94ad3>   DW_AT_name        : l
    <94ad5>   DW_AT_decl_file   : 81
    <94ad6>   DW_AT_decl_line   : 908
    <94ad8>   DW_AT_decl_column : 8
    <94ad9>   DW_AT_type        : <0x94b5f>
 <3><94add>: Abbrev Number: 0
 <2><94ade>: Abbrev Number: 10 (DW_TAG_member)
    <94adf>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94ae3>   DW_AT_decl_file   : 81
    <94ae4>   DW_AT_decl_line   : 898
    <94ae6>   DW_AT_decl_column : 6
    <94ae7>   DW_AT_type        : <0x7980a>
    <94aeb>   DW_AT_data_member_location: 0
 <2><94aec>: Abbrev Number: 10 (DW_TAG_member)
    <94aed>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94af1>   DW_AT_decl_file   : 81
    <94af2>   DW_AT_decl_line   : 899
    <94af4>   DW_AT_decl_column : 16
    <94af5>   DW_AT_type        : <0x79786>
    <94af9>   DW_AT_data_member_location: 8
 <2><94afa>: Abbrev Number: 10 (DW_TAG_member)
    <94afb>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94aff>   DW_AT_decl_file   : 81
    <94b00>   DW_AT_decl_line   : 900
    <94b02>   DW_AT_decl_column : 7
    <94b03>   DW_AT_type        : <0x7980a>
    <94b07>   DW_AT_data_member_location: 16
 <2><94b08>: Abbrev Number: 10 (DW_TAG_member)
    <94b09>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94b0d>   DW_AT_decl_file   : 81
    <94b0e>   DW_AT_decl_line   : 901
    <94b10>   DW_AT_decl_column : 11
    <94b11>   DW_AT_type        : <0x93ab4>
    <94b15>   DW_AT_data_member_location: 24
 <2><94b16>: Abbrev Number: 10 (DW_TAG_member)
    <94b17>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94b1b>   DW_AT_decl_file   : 81
    <94b1c>   DW_AT_decl_line   : 902
    <94b1e>   DW_AT_decl_column : 9
    <94b1f>   DW_AT_type        : <0x93896>
    <94b23>   DW_AT_data_member_location: 32
 <2><94b24>: Abbrev Number: 10 (DW_TAG_member)
    <94b25>   DW_AT_name        : (indirect string, offset: 0x63486): message_type
    <94b29>   DW_AT_decl_file   : 81
    <94b2a>   DW_AT_decl_line   : 903
    <94b2c>   DW_AT_decl_column : 7
    <94b2d>   DW_AT_type        : <0x93872>
    <94b31>   DW_AT_data_member_location: 40
 <2><94b32>: Abbrev Number: 10 (DW_TAG_member)
    <94b33>   DW_AT_name        : (indirect string, offset: 0x82f17): format
    <94b37>   DW_AT_decl_file   : 81
    <94b38>   DW_AT_decl_line   : 904
    <94b3a>   DW_AT_decl_column : 6
    <94b3b>   DW_AT_type        : <0x7980a>
    <94b3f>   DW_AT_data_member_location: 48
 <2><94b40>: Abbrev Number: 10 (DW_TAG_member)
    <94b41>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <94b45>   DW_AT_decl_file   : 81
    <94b46>   DW_AT_decl_line   : 909
    <94b48>   DW_AT_decl_column : 5
    <94b49>   DW_AT_type        : <0x94ab2>
    <94b4d>   DW_AT_data_member_location: 56
 <2><94b4e>: Abbrev Number: 0
 <1><94b4f>: Abbrev Number: 30 (DW_TAG_array_type)
    <94b50>   DW_AT_type        : <0x797e6>
    <94b54>   DW_AT_sibling     : <0x94b5f>
 <2><94b58>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <94b59>   DW_AT_type        : <0x79786>
    <94b5d>   DW_AT_upper_bound : 9
 <2><94b5e>: Abbrev Number: 0
 <1><94b5f>: Abbrev Number: 30 (DW_TAG_array_type)
    <94b60>   DW_AT_type        : <0x79773>
    <94b64>   DW_AT_sibling     : <0x94b6f>
 <2><94b68>: Abbrev Number: 33 (DW_TAG_subrange_type)
    <94b69>   DW_AT_type        : <0x79786>
    <94b6d>   DW_AT_upper_bound : 4
 <2><94b6e>: Abbrev Number: 0
 <1><94b6f>: Abbrev Number: 4 (DW_TAG_typedef)
    <94b70>   DW_AT_name        : (indirect string, offset: 0x8326d): XClientMessageEvent
    <94b74>   DW_AT_decl_file   : 81
    <94b75>   DW_AT_decl_line   : 910
    <94b77>   DW_AT_decl_column : 3
    <94b78>   DW_AT_type        : <0x94aa4>
 <1><94b7c>: Abbrev Number: 40 (DW_TAG_structure_type)
    <94b7d>   DW_AT_byte_size   : 56
    <94b7e>   DW_AT_decl_file   : 81
    <94b7f>   DW_AT_decl_line   : 912
    <94b81>   DW_AT_decl_column : 16
    <94b82>   DW_AT_linkage_name: (indirect string, offset: 0x73707): 13XMappingEvent
    <94b86>   DW_AT_sibling     : <0x94bfb>
 <2><94b8a>: Abbrev Number: 10 (DW_TAG_member)
    <94b8b>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <94b8f>   DW_AT_decl_file   : 81
    <94b90>   DW_AT_decl_line   : 913
    <94b92>   DW_AT_decl_column : 6
    <94b93>   DW_AT_type        : <0x7980a>
    <94b97>   DW_AT_data_member_location: 0
 <2><94b98>: Abbrev Number: 10 (DW_TAG_member)
    <94b99>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <94b9d>   DW_AT_decl_file   : 81
    <94b9e>   DW_AT_decl_line   : 914
    <94ba0>   DW_AT_decl_column : 16
    <94ba1>   DW_AT_type        : <0x79786>
    <94ba5>   DW_AT_data_member_location: 8
 <2><94ba6>: Abbrev Number: 10 (DW_TAG_member)
    <94ba7>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <94bab>   DW_AT_decl_file   : 81
    <94bac>   DW_AT_decl_line   : 915
    <94bae>   DW_AT_decl_column : 7
    <94baf>   DW_AT_type        : <0x7980a>
    <94bb3>   DW_AT_data_member_location: 16
 <2><94bb4>: Abbrev Number: 10 (DW_TAG_member)
    <94bb5>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <94bb9>   DW_AT_decl_file   : 81
    <94bba>   DW_AT_decl_line   : 916
    <94bbc>   DW_AT_decl_column : 11
    <94bbd>   DW_AT_type        : <0x93ab4>
    <94bc1>   DW_AT_data_member_location: 24
 <2><94bc2>: Abbrev Number: 10 (DW_TAG_member)
    <94bc3>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <94bc7>   DW_AT_decl_file   : 81
    <94bc8>   DW_AT_decl_line   : 917
    <94bca>   DW_AT_decl_column : 9
    <94bcb>   DW_AT_type        : <0x93896>
    <94bcf>   DW_AT_data_member_location: 32
 <2><94bd0>: Abbrev Number: 10 (DW_TAG_member)
    <94bd1>   DW_AT_name        : (indirect string, offset: 0x7ad1f): request
    <94bd5>   DW_AT_decl_file   : 81
    <94bd6>   DW_AT_decl_line   : 918
    <94bd8>   DW_AT_decl_column : 6
    <94bd9>   DW_AT_type        : <0x7980a>
    <94bdd>   DW_AT_data_member_location: 40
 <2><94bde>: Abbrev Number: 10 (DW_TAG_member)
    <94bdf>   DW_AT_name        : (indirect string, offset: 0x809a6): first_keycode
    <94be3>   DW_AT_decl_file   : 81
    <94be4>   DW_AT_decl_line   : 920
    <94be6>   DW_AT_decl_column : 6
    <94be7>   DW_AT_type        : <0x7980a>
    <94beb>   DW_AT_data_member_location: 44
 <2><94bec>: Abbrev Number: 10 (DW_TAG_member)
    <94bed>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <94bf1>   DW_AT_decl_file   : 81
    <94bf2>   DW_AT_decl_line   : 921
    <94bf4>   DW_AT_decl_column : 6
