    <c4423>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><c4426>: Abbrev Number: 0
 <1><c4427>: Abbrev Number: 14 (DW_TAG_subprogram)
    <c4428>   DW_AT_name        : (indirect string, offset: 0x7a2ad): _glewInit_GL_NV_depth_buffer_float
    <c442c>   DW_AT_decl_file   : 4
    <c442d>   DW_AT_decl_line   : 7897
    <c442f>   DW_AT_decl_column : 18
    <c4430>   DW_AT_type        : <0x79b36>
    <c4434>   DW_AT_low_pc      : 0x8bb5e5
    <c443c>   DW_AT_high_pc     : 0xb7
    <c4444>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c4446>   DW_AT_call_all_tail_calls: 1
    <c4446>   DW_AT_sibling     : <0xc4459>
 <2><c444a>: Abbrev Number: 5 (DW_TAG_variable)
    <c444b>   DW_AT_name        : r
    <c444d>   DW_AT_decl_file   : 4
    <c444e>   DW_AT_decl_line   : 7899
    <c4450>   DW_AT_decl_column : 13
    <c4451>   DW_AT_type        : <0x79b36>
    <c4455>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <2><c4458>: Abbrev Number: 0
 <1><c4459>: Abbrev Number: 14 (DW_TAG_subprogram)
    <c445a>   DW_AT_name        : (indirect string, offset: 0x638e1): _glewInit_GL_NV_copy_image
    <c445e>   DW_AT_decl_file   : 4
    <c445f>   DW_AT_decl_line   : 7880
    <c4461>   DW_AT_decl_column : 18
    <c4462>   DW_AT_type        : <0x79b36>
    <c4466>   DW_AT_low_pc      : 0x8bb59c
    <c446e>   DW_AT_high_pc     : 0x49
    <c4476>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)

  Compilation Unit @ offset 0xc6e03:
   Length:        0x1964 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x17e5
   Pointer Size:  8
 <0><c6e0f>: Abbrev Number: 32 (DW_TAG_compile_unit)
    <c6e10>   DW_AT_producer    : (indirect string, offset: 0x8e3e7): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O2
    <c6e14>   DW_AT_language    : 29	(C11)
    <c6e15>   DW_AT_name        : (indirect line string, offset: 0x18dc): ../../src/freeglut_callbacks.c
    <c6e19>   DW_AT_comp_dir    : (indirect line string, offset: 0x18af): /home/main/qb64/internal/c/parts/core/os/lnx
    <c6e1d>   DW_AT_ranges      : 0x48b
    <c6e21>   DW_AT_low_pc      : 0x0
    <c6e29>   DW_AT_stmt_list   : 0x2960c9
 <1><c6e2d>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e2e>   DW_AT_byte_size   : 4
    <c6e2f>   DW_AT_encoding    : 7	(unsigned)
    <c6e30>   DW_AT_name        : (indirect string, offset: 0x21686): unsigned int
 <1><c6e34>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6e35>   DW_AT_name        : (indirect string, offset: 0x7ffc7): GLboolean
    <c6e39>   DW_AT_decl_file   : 2
    <c6e3a>   DW_AT_decl_line   : 117
    <c6e3b>   DW_AT_decl_column : 23
    <c6e3c>   DW_AT_type        : <0xc6e40>
 <1><c6e40>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e41>   DW_AT_byte_size   : 1
    <c6e42>   DW_AT_encoding    : 8	(unsigned char)
    <c6e43>   DW_AT_name        : (indirect string, offset: 0x26886): unsigned char
 <1><c6e47>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e48>   DW_AT_byte_size   : 1
    <c6e49>   DW_AT_encoding    : 6	(signed char)
    <c6e4a>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><c6e4e>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e4f>   DW_AT_byte_size   : 2
    <c6e50>   DW_AT_encoding    : 5	(signed)
    <c6e51>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><c6e55>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6e56>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <c6e5a>   DW_AT_decl_file   : 2
    <c6e5b>   DW_AT_decl_line   : 122
    <c6e5c>   DW_AT_decl_column : 14
    <c6e5d>   DW_AT_type        : <0xc6e61>
 <1><c6e61>: Abbrev Number: 33 (DW_TAG_base_type)
    <c6e62>   DW_AT_byte_size   : 4
    <c6e63>   DW_AT_encoding    : 5	(signed)
    <c6e64>   DW_AT_name        : int
 <1><c6e68>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e69>   DW_AT_byte_size   : 2
    <c6e6a>   DW_AT_encoding    : 7	(unsigned)
    <c6e6b>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><c6e6f>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6e70>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <c6e74>   DW_AT_decl_file   : 2
    <c6e75>   DW_AT_decl_line   : 125
    <c6e76>   DW_AT_decl_column : 22
    <c6e77>   DW_AT_type        : <0xc6e2d>
 <1><c6e7b>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e7c>   DW_AT_byte_size   : 4
    <c6e7d>   DW_AT_encoding    : 4	(float)
    <c6e7e>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><c6e82>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e83>   DW_AT_byte_size   : 8
    <c6e84>   DW_AT_encoding    : 4	(float)
    <c6e85>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><c6e89>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e8a>   DW_AT_byte_size   : 8
    <c6e8b>   DW_AT_encoding    : 7	(unsigned)
    <c6e8c>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><c6e90>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e91>   DW_AT_byte_size   : 8
    <c6e92>   DW_AT_encoding    : 5	(signed)
    <c6e93>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><c6e97>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <c6e98>   DW_AT_byte_size   : 8
 <1><c6e99>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6e9a>   DW_AT_byte_size   : 8
    <c6e9a>   DW_AT_type        : <0xc6e9e>
 <1><c6e9e>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6e9f>   DW_AT_byte_size   : 1
    <c6ea0>   DW_AT_encoding    : 6	(signed char)
    <c6ea1>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><c6ea5>: Abbrev Number: 35 (DW_TAG_const_type)
    <c6ea6>   DW_AT_type        : <0xc6e9e>
 <1><c6eaa>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6eab>   DW_AT_byte_size   : 8
    <c6eab>   DW_AT_type        : <0xc6eaf>
 <1><c6eaf>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <c6eb0>   DW_AT_prototyped  : 1
 <1><c6eb0>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6eb1>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <c6eb5>   DW_AT_decl_file   : 3
    <c6eb6>   DW_AT_decl_line   : 209
    <c6eb7>   DW_AT_decl_column : 23
    <c6eb8>   DW_AT_type        : <0xc6e89>
 <1><c6ebc>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6ebd>   DW_AT_byte_size   : 8
    <c6ebe>   DW_AT_encoding    : 5	(signed)
    <c6ebf>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><c6ec3>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6ec4>   DW_AT_byte_size   : 8
    <c6ec5>   DW_AT_encoding    : 7	(unsigned)
    <c6ec6>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><c6eca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6ecb>   DW_AT_byte_size   : 8
    <c6ecb>   DW_AT_type        : <0xc6ecf>
 <1><c6ecf>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <c6ed0>   DW_AT_sibling     : <0xc6ed6>
 <2><c6ed4>: Abbrev Number: 24 (DW_TAG_unspecified_parameters)
 <2><c6ed5>: Abbrev Number: 0
 <1><c6ed6>: Abbrev Number: 38 (DW_TAG_structure_type)
    <c6ed7>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <c6edb>   DW_AT_byte_size   : 24
    <c6edc>   DW_AT_decl_file   : 4
    <c6edd>   DW_AT_decl_line   : 0
    <c6ede>   DW_AT_sibling     : <0xc6f0b>
 <2><c6ee2>: Abbrev Number: 20 (DW_TAG_member)
    <c6ee3>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <c6ee7>   DW_AT_decl_file   : 4
    <c6ee7>   DW_AT_decl_line   : 0
    <c6ee7>   DW_AT_type        : <0xc6e2d>
    <c6eeb>   DW_AT_data_member_location: 0
 <2><c6eec>: Abbrev Number: 20 (DW_TAG_member)
    <c6eed>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <c6ef1>   DW_AT_decl_file   : 4
    <c6ef1>   DW_AT_decl_line   : 0
    <c6ef1>   DW_AT_type        : <0xc6e2d>
    <c6ef5>   DW_AT_data_member_location: 4
 <2><c6ef6>: Abbrev Number: 20 (DW_TAG_member)
    <c6ef7>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <c6efb>   DW_AT_decl_file   : 4
    <c6efb>   DW_AT_decl_line   : 0
    <c6efb>   DW_AT_type        : <0xc6e97>
    <c6eff>   DW_AT_data_member_location: 8
 <2><c6f00>: Abbrev Number: 20 (DW_TAG_member)
    <c6f01>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <c6f05>   DW_AT_decl_file   : 4
    <c6f05>   DW_AT_decl_line   : 0
    <c6f05>   DW_AT_type        : <0xc6e97>
    <c6f09>   DW_AT_data_member_location: 16
 <2><c6f0a>: Abbrev Number: 0
 <1><c6f0b>: Abbrev Number: 39 (DW_TAG_typedef)
    <c6f0c>   DW_AT_name        : XID
    <c6f10>   DW_AT_decl_file   : 5
    <c6f11>   DW_AT_decl_line   : 66
    <c6f12>   DW_AT_decl_column : 23
    <c6f13>   DW_AT_type        : <0xc6e89>
 <1><c6f17>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6f18>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <c6f1c>   DW_AT_decl_file   : 5
    <c6f1d>   DW_AT_decl_line   : 96
    <c6f1e>   DW_AT_decl_column : 13
    <c6f1f>   DW_AT_type        : <0xc6f0b>
 <1><c6f23>: Abbrev Number: 13 (DW_TAG_base_type)
    <c6f24>   DW_AT_byte_size   : 16
    <c6f25>   DW_AT_encoding    : 4	(float)
    <c6f26>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><c6f2a>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6f2b>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <c6f2f>   DW_AT_decl_file   : 6
    <c6f30>   DW_AT_decl_line   : 165
    <c6f31>   DW_AT_decl_column : 33
    <c6f32>   DW_AT_type        : <0xc6f36>
 <1><c6f36>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f37>   DW_AT_byte_size   : 8
    <c6f37>   DW_AT_type        : <0xc6f3b>
 <1><c6f3b>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c6f3c>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <c6f40>   DW_AT_declaration : 1
 <1><c6f40>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6f41>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <c6f45>   DW_AT_decl_file   : 6
    <c6f46>   DW_AT_decl_line   : 169
    <c6f47>   DW_AT_decl_column : 34
    <c6f48>   DW_AT_type        : <0xc6f4c>
 <1><c6f4c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f4d>   DW_AT_byte_size   : 8
    <c6f4d>   DW_AT_type        : <0xc6f51>
 <1><c6f51>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c6f52>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <c6f56>   DW_AT_declaration : 1
 <1><c6f56>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f57>   DW_AT_byte_size   : 8
    <c6f57>   DW_AT_type        : <0xc6f40>
 <1><c6f5b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f5c>   DW_AT_byte_size   : 8
    <c6f5c>   DW_AT_type        : <0xc6ea5>
 <1><c6f60>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f61>   DW_AT_byte_size   : 8
    <c6f61>   DW_AT_type        : <0xc6f65>
 <1><c6f65>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6f66>   DW_AT_prototyped  : 1
    <c6f66>   DW_AT_sibling     : <0xc6f75>
 <2><c6f6a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f6b>   DW_AT_type        : <0xc6e61>
 <2><c6f6f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f70>   DW_AT_type        : <0xc6e61>
 <2><c6f74>: Abbrev Number: 0
 <1><c6f75>: Abbrev Number: 11 (DW_TAG_typedef)
    <c6f76>   DW_AT_name        : (indirect string, offset: 0x8e144): FGCBVisibility
    <c6f7a>   DW_AT_decl_file   : 7
    <c6f7b>   DW_AT_decl_line   : 218
    <c6f7c>   DW_AT_decl_column : 17
    <c6f7d>   DW_AT_type        : <0xc6f81>
 <1><c6f81>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f82>   DW_AT_byte_size   : 8
    <c6f82>   DW_AT_type        : <0xc6f86>
 <1><c6f86>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6f87>   DW_AT_prototyped  : 1
    <c6f87>   DW_AT_sibling     : <0xc6f91>
 <2><c6f8b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f8c>   DW_AT_type        : <0xc6e61>
 <2><c6f90>: Abbrev Number: 0
 <1><c6f91>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6f92>   DW_AT_byte_size   : 8
    <c6f92>   DW_AT_type        : <0xc6f96>
 <1><c6f96>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6f97>   DW_AT_prototyped  : 1
    <c6f97>   DW_AT_sibling     : <0xc6fab>
 <2><c6f9b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f9c>   DW_AT_type        : <0xc6e40>
 <2><c6fa0>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fa1>   DW_AT_type        : <0xc6e61>
 <2><c6fa5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fa6>   DW_AT_type        : <0xc6e61>
 <2><c6faa>: Abbrev Number: 0
 <1><c6fab>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6fac>   DW_AT_byte_size   : 8
    <c6fac>   DW_AT_type        : <0xc6fb0>
 <1><c6fb0>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6fb1>   DW_AT_prototyped  : 1
    <c6fb1>   DW_AT_sibling     : <0xc6fc5>
 <2><c6fb5>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fb6>   DW_AT_type        : <0xc6e61>
 <2><c6fba>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fbb>   DW_AT_type        : <0xc6e61>
 <2><c6fbf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fc0>   DW_AT_type        : <0xc6e61>
 <2><c6fc4>: Abbrev Number: 0
 <1><c6fc5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6fc6>   DW_AT_byte_size   : 8
    <c6fc6>   DW_AT_type        : <0xc6fca>
 <1><c6fca>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6fcb>   DW_AT_prototyped  : 1
    <c6fcb>   DW_AT_sibling     : <0xc6fe4>
 <2><c6fcf>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fd0>   DW_AT_type        : <0xc6e61>
 <2><c6fd4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fd5>   DW_AT_type        : <0xc6e61>
 <2><c6fd9>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fda>   DW_AT_type        : <0xc6e61>
 <2><c6fde>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fdf>   DW_AT_type        : <0xc6e61>
 <2><c6fe3>: Abbrev Number: 0
 <1><c6fe4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c6fe5>   DW_AT_byte_size   : 8
    <c6fe5>   DW_AT_type        : <0xc6fe9>
 <1><c6fe9>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c6fea>   DW_AT_prototyped  : 1
    <c6fea>   DW_AT_sibling     : <0xc7003>
 <2><c6fee>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6fef>   DW_AT_type        : <0xc6e2d>
 <2><c6ff3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6ff4>   DW_AT_type        : <0xc6e61>
 <2><c6ff8>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6ff9>   DW_AT_type        : <0xc6e61>
 <2><c6ffd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6ffe>   DW_AT_type        : <0xc6e61>
 <2><c7002>: Abbrev Number: 0
 <1><c7003>: Abbrev Number: 11 (DW_TAG_typedef)
    <c7004>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <c7008>   DW_AT_decl_file   : 7
    <c7009>   DW_AT_decl_line   : 239
    <c700a>   DW_AT_decl_column : 17
    <c700b>   DW_AT_type        : <0xc6eaa>
 <1><c700f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7010>   DW_AT_byte_size   : 8
    <c7010>   DW_AT_type        : <0xc7014>
 <1><c7014>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c7015>   DW_AT_prototyped  : 1
    <c7015>   DW_AT_sibling     : <0xc7033>
 <2><c7019>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c701a>   DW_AT_type        : <0xc6e61>
 <2><c701e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c701f>   DW_AT_type        : <0xc6e61>
 <2><c7023>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c7024>   DW_AT_type        : <0xc6e61>
 <2><c7028>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c7029>   DW_AT_type        : <0xc6e61>
 <2><c702d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c702e>   DW_AT_type        : <0xc6e61>
 <2><c7032>: Abbrev Number: 0
 <1><c7033>: Abbrev Number: 11 (DW_TAG_typedef)
    <c7034>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <c7038>   DW_AT_decl_file   : 7
    <c7039>   DW_AT_decl_line   : 247
    <c703a>   DW_AT_decl_column : 17
    <c703b>   DW_AT_type        : <0xc6eaa>
 <1><c703f>: Abbrev Number: 11 (DW_TAG_typedef)
    <c7040>   DW_AT_name        : (indirect string, offset: 0x8e55e): FGCBTimer
    <c7044>   DW_AT_decl_file   : 7
    <c7045>   DW_AT_decl_line   : 248
    <c7046>   DW_AT_decl_column : 17
    <c7047>   DW_AT_type        : <0xc6f81>
 <1><c704b>: Abbrev Number: 11 (DW_TAG_typedef)
    <c704c>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <c7050>   DW_AT_decl_file   : 7
    <c7051>   DW_AT_decl_line   : 249
    <c7052>   DW_AT_decl_column : 17
    <c7053>   DW_AT_type        : <0xc6f81>
 <1><c7057>: Abbrev Number: 11 (DW_TAG_typedef)
    <c7058>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <c705c>   DW_AT_decl_file   : 7
    <c705d>   DW_AT_decl_line   : 250
    <c705e>   DW_AT_decl_column : 17
    <c705f>   DW_AT_type        : <0xc6fab>
 <1><c7063>: Abbrev Number: 11 (DW_TAG_typedef)
    <c7064>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <c7068>   DW_AT_decl_file   : 7
    <c7069>   DW_AT_decl_line   : 253
    <c706a>   DW_AT_decl_column : 17
    <c706b>   DW_AT_type        : <0xc6f81>
 <1><c706f>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7070>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <c7074>   DW_AT_decl_file   : 7
    <c7074>   DW_AT_decl_line   : 256
    <c7076>   DW_AT_decl_column : 17
    <c7077>   DW_AT_type        : <0xc707b>
 <1><c707b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c707c>   DW_AT_byte_size   : 8
    <c707c>   DW_AT_type        : <0xc7080>
 <1><c7080>: Abbrev Number: 16 (DW_TAG_subroutine_type)
    <c7081>   DW_AT_prototyped  : 1
    <c7081>   DW_AT_sibling     : <0xc7090>
 <2><c7085>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c7086>   DW_AT_type        : <0xc6f5b>
 <2><c708a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c708b>   DW_AT_type        : <0xc7090>
 <2><c708f>: Abbrev Number: 0
 <1><c7090>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c7091>   DW_AT_byte_size   : 8
    <c7091>   DW_AT_type        : <0xc6ed6>
 <1><c7095>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7096>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <c709a>   DW_AT_decl_file   : 7
    <c709a>   DW_AT_decl_line   : 257
    <c709c>   DW_AT_decl_column : 17
    <c709d>   DW_AT_type        : <0xc707b>
 <1><c70a1>: Abbrev Number: 8 (DW_TAG_typedef)
    <c70a2>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <c70a6>   DW_AT_decl_file   : 7
    <c70a6>   DW_AT_decl_line   : 261
    <c70a8>   DW_AT_decl_column : 28
    <c70a9>   DW_AT_type        : <0xc70ad>
 <1><c70ad>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c70ae>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <c70b2>   DW_AT_byte_size   : 16
    <c70b3>   DW_AT_decl_file   : 7
    <c70b3>   DW_AT_decl_line   : 262
    <c70b5>   DW_AT_decl_column : 8
    <c70b5>   DW_AT_sibling     : <0xc70d4>
 <2><c70b9>: Abbrev Number: 1 (DW_TAG_member)
    <c70ba>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <c70be>   DW_AT_decl_file   : 7
    <c70be>   DW_AT_decl_line   : 264
    <c70c0>   DW_AT_decl_column : 11
    <c70c1>   DW_AT_type        : <0xc6e97>
    <c70c5>   DW_AT_data_member_location: 0
 <2><c70c6>: Abbrev Number: 1 (DW_TAG_member)
    <c70c7>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <c70cb>   DW_AT_decl_file   : 7
    <c70cb>   DW_AT_decl_line   : 265
    <c70cd>   DW_AT_decl_column : 11
    <c70ce>   DW_AT_type        : <0xc6e97>
    <c70d2>   DW_AT_data_member_location: 8
 <2><c70d3>: Abbrev Number: 0
 <1><c70d4>: Abbrev Number: 8 (DW_TAG_typedef)
    <c70d5>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <c70d9>   DW_AT_decl_file   : 7
    <c70d9>   DW_AT_decl_line   : 269
    <c70db>   DW_AT_decl_column : 28
    <c70dc>   DW_AT_type        : <0xc70e0>
 <1><c70e0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c70e1>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <c70e5>   DW_AT_byte_size   : 16
    <c70e6>   DW_AT_decl_file   : 7
    <c70e6>   DW_AT_decl_line   : 270
    <c70e8>   DW_AT_decl_column : 8
    <c70e8>   DW_AT_sibling     : <0xc7107>
 <2><c70ec>: Abbrev Number: 1 (DW_TAG_member)
    <c70ed>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <c70f1>   DW_AT_decl_file   : 7
    <c70f1>   DW_AT_decl_line   : 272
    <c70f3>   DW_AT_decl_column : 11
    <c70f4>   DW_AT_type        : <0xc6e97>
    <c70f8>   DW_AT_data_member_location: 0
 <2><c70f9>: Abbrev Number: 1 (DW_TAG_member)
    <c70fa>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <c70fe>   DW_AT_decl_file   : 7
    <c70fe>   DW_AT_decl_line   : 273
    <c7100>   DW_AT_decl_column : 11
    <c7101>   DW_AT_type        : <0xc6e97>
    <c7105>   DW_AT_data_member_location: 8
 <2><c7106>: Abbrev Number: 0
 <1><c7107>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7108>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <c710c>   DW_AT_decl_file   : 7
    <c710c>   DW_AT_decl_line   : 277
    <c710e>   DW_AT_decl_column : 29
    <c710f>   DW_AT_type        : <0xc7113>
 <1><c7113>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c7114>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <c7118>   DW_AT_byte_size   : 12
    <c7119>   DW_AT_decl_file   : 7
    <c7119>   DW_AT_decl_line   : 278
    <c711b>   DW_AT_decl_column : 8
    <c711b>   DW_AT_sibling     : <0xc7143>
 <2><c711f>: Abbrev Number: 15 (DW_TAG_member)
    <c7120>   DW_AT_name        : X
    <c7122>   DW_AT_decl_file   : 7
    <c7122>   DW_AT_decl_line   : 280
    <c7124>   DW_AT_decl_column : 21
    <c7125>   DW_AT_type        : <0xc6e55>
    <c7129>   DW_AT_data_member_location: 0
 <2><c712a>: Abbrev Number: 15 (DW_TAG_member)
    <c712b>   DW_AT_name        : Y
    <c712d>   DW_AT_decl_file   : 7
    <c712d>   DW_AT_decl_line   : 280
    <c712f>   DW_AT_decl_column : 24
    <c7130>   DW_AT_type        : <0xc6e55>
    <c7134>   DW_AT_data_member_location: 4
 <2><c7135>: Abbrev Number: 15 (DW_TAG_member)
    <c7136>   DW_AT_name        : Use
    <c713a>   DW_AT_decl_file   : 7
    <c713a>   DW_AT_decl_line   : 281
    <c713c>   DW_AT_decl_column : 21
    <c713d>   DW_AT_type        : <0xc6e34>
    <c7141>   DW_AT_data_member_location: 8
 <2><c7142>: Abbrev Number: 0
 <1><c7143>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <c7144>   DW_AT_encoding    : 7	(void)
    <c7144>   DW_AT_byte_size   : 4
    <c7144>   DW_AT_type        : <0xc6e2d>
    <c7148>   DW_AT_decl_file   : 7
    <c7148>   DW_AT_decl_line   : 289
    <c714a>   DW_AT_decl_column : 1
    <c714a>   DW_AT_sibling     : <0xc7161>
 <2><c714e>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c714f>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <c7153>   DW_AT_const_value : 0
 <2><c7154>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7155>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <c7159>   DW_AT_const_value : 1
 <2><c715a>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c715b>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <c715f>   DW_AT_const_value : 2
 <2><c7160>: Abbrev Number: 0
 <1><c7161>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7162>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <c7166>   DW_AT_decl_file   : 7
    <c7166>   DW_AT_decl_line   : 293
    <c7168>   DW_AT_decl_column : 3
    <c7169>   DW_AT_type        : <0xc7143>
 <1><c716d>: Abbrev Number: 8 (DW_TAG_typedef)
    <c716e>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <c7172>   DW_AT_decl_file   : 7
    <c7172>   DW_AT_decl_line   : 296
    <c7174>   DW_AT_decl_column : 29
    <c7175>   DW_AT_type        : <0xc7179>
 <1><c7179>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c717a>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <c717e>   DW_AT_byte_size   : 232
    <c717f>   DW_AT_decl_file   : 7
    <c717f>   DW_AT_decl_line   : 297
    <c7181>   DW_AT_decl_column : 8
    <c7181>   DW_AT_sibling     : <0xc7381>
 <2><c7185>: Abbrev Number: 1 (DW_TAG_member)
    <c7186>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <c718a>   DW_AT_decl_file   : 7
    <c718a>   DW_AT_decl_line   : 299
    <c718c>   DW_AT_decl_column : 22
    <c718d>   DW_AT_type        : <0xc7107>
    <c7191>   DW_AT_data_member_location: 0
 <2><c7192>: Abbrev Number: 1 (DW_TAG_member)
    <c7193>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <c7197>   DW_AT_decl_file   : 7
    <c7197>   DW_AT_decl_line   : 300
    <c7199>   DW_AT_decl_column : 22
    <c719a>   DW_AT_type        : <0xc7107>
    <c719e>   DW_AT_data_member_location: 12
 <2><c719f>: Abbrev Number: 1 (DW_TAG_member)
    <c71a0>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <c71a4>   DW_AT_decl_file   : 7
    <c71a4>   DW_AT_decl_line   : 301
    <c71a6>   DW_AT_decl_column : 22
    <c71a7>   DW_AT_type        : <0xc6e2d>
    <c71ab>   DW_AT_data_member_location: 24
 <2><c71ac>: Abbrev Number: 1 (DW_TAG_member)
    <c71ad>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <c71b1>   DW_AT_decl_file   : 7
    <c71b1>   DW_AT_decl_line   : 303
    <c71b3>   DW_AT_decl_column : 22
    <c71b4>   DW_AT_type        : <0xc6e34>
    <c71b8>   DW_AT_data_member_location: 28
 <2><c71b9>: Abbrev Number: 1 (DW_TAG_member)
    <c71ba>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <c71be>   DW_AT_decl_file   : 7
    <c71be>   DW_AT_decl_line   : 305
    <c71c0>   DW_AT_decl_column : 22
    <c71c1>   DW_AT_type        : <0xc6e61>
    <c71c5>   DW_AT_data_member_location: 32
 <2><c71c6>: Abbrev Number: 1 (DW_TAG_member)
    <c71c7>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <c71cb>   DW_AT_decl_file   : 7
    <c71cb>   DW_AT_decl_line   : 307
    <c71cd>   DW_AT_decl_column : 22
    <c71ce>   DW_AT_type        : <0xc6e34>
    <c71d2>   DW_AT_data_member_location: 36
 <2><c71d3>: Abbrev Number: 1 (DW_TAG_member)
    <c71d4>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <c71d8>   DW_AT_decl_file   : 7
    <c71d8>   DW_AT_decl_line   : 308
    <c71da>   DW_AT_decl_column : 22
    <c71db>   DW_AT_type        : <0xc6e34>
    <c71df>   DW_AT_data_member_location: 37
 <2><c71e0>: Abbrev Number: 1 (DW_TAG_member)
    <c71e1>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <c71e5>   DW_AT_decl_file   : 7
    <c71e5>   DW_AT_decl_line   : 310
    <c71e7>   DW_AT_decl_column : 22
    <c71e8>   DW_AT_type        : <0xc6e34>
    <c71ec>   DW_AT_data_member_location: 38
 <2><c71ed>: Abbrev Number: 1 (DW_TAG_member)
    <c71ee>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <c71f2>   DW_AT_decl_file   : 7
    <c71f2>   DW_AT_decl_line   : 311
    <c71f4>   DW_AT_decl_column : 22
    <c71f5>   DW_AT_type        : <0xc6e34>
    <c71f9>   DW_AT_data_member_location: 39
 <2><c71fa>: Abbrev Number: 1 (DW_TAG_member)
    <c71fb>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <c71ff>   DW_AT_decl_file   : 7
    <c71ff>   DW_AT_decl_line   : 313
    <c7201>   DW_AT_decl_column : 22
    <c7202>   DW_AT_type        : <0xc6e61>
    <c7206>   DW_AT_data_member_location: 40
 <2><c7207>: Abbrev Number: 1 (DW_TAG_member)
    <c7208>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <c720c>   DW_AT_decl_file   : 7
    <c720c>   DW_AT_decl_line   : 314
    <c720e>   DW_AT_decl_column : 22
    <c720f>   DW_AT_type        : <0xc6e61>
    <c7213>   DW_AT_data_member_location: 44
 <2><c7214>: Abbrev Number: 1 (DW_TAG_member)
    <c7215>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <c7219>   DW_AT_decl_file   : 7
    <c7219>   DW_AT_decl_line   : 316
    <c721b>   DW_AT_decl_column : 22
    <c721c>   DW_AT_type        : <0xc6e6f>
    <c7220>   DW_AT_data_member_location: 48
 <2><c7221>: Abbrev Number: 1 (DW_TAG_member)
    <c7222>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <c7226>   DW_AT_decl_file   : 7
    <c7226>   DW_AT_decl_line   : 317
    <c7228>   DW_AT_decl_column : 22
    <c7229>   DW_AT_type        : <0xc6e6f>
    <c722d>   DW_AT_data_member_location: 52
 <2><c722e>: Abbrev Number: 1 (DW_TAG_member)
    <c722f>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <c7233>   DW_AT_decl_file   : 7
    <c7233>   DW_AT_decl_line   : 318
    <c7235>   DW_AT_decl_column : 22
    <c7236>   DW_AT_type        : <0xc6e6f>
    <c723a>   DW_AT_data_member_location: 56
 <2><c723b>: Abbrev Number: 1 (DW_TAG_member)
    <c723c>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <c7240>   DW_AT_decl_file   : 7
    <c7240>   DW_AT_decl_line   : 320
    <c7242>   DW_AT_decl_column : 22
    <c7243>   DW_AT_type        : <0xc6e89>
    <c7247>   DW_AT_data_member_location: 64
 <2><c7248>: Abbrev Number: 1 (DW_TAG_member)
    <c7249>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <c724d>   DW_AT_decl_file   : 7
    <c724d>   DW_AT_decl_line   : 321
    <c724f>   DW_AT_decl_column : 22
    <c7250>   DW_AT_type        : <0xc70a1>
    <c7254>   DW_AT_data_member_location: 72
 <2><c7255>: Abbrev Number: 1 (DW_TAG_member)
    <c7256>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <c725a>   DW_AT_decl_file   : 7
    <c725a>   DW_AT_decl_line   : 322
    <c725c>   DW_AT_decl_column : 22
    <c725d>   DW_AT_type        : <0xc70a1>
    <c7261>   DW_AT_data_member_location: 88
 <2><c7262>: Abbrev Number: 1 (DW_TAG_member)
    <c7263>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <c7267>   DW_AT_decl_file   : 7
    <c7267>   DW_AT_decl_line   : 324
    <c7269>   DW_AT_decl_column : 22
    <c726a>   DW_AT_type        : <0xc7033>
    <c726e>   DW_AT_data_member_location: 104
 <2><c726f>: Abbrev Number: 1 (DW_TAG_member)
    <c7270>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <c7274>   DW_AT_decl_file   : 7
    <c7274>   DW_AT_decl_line   : 326
    <c7276>   DW_AT_decl_column : 22
    <c7277>   DW_AT_type        : <0xc6e61>
    <c727b>   DW_AT_data_member_location: 112
 <2><c727c>: Abbrev Number: 1 (DW_TAG_member)
    <c727d>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <c7281>   DW_AT_decl_file   : 7
    <c7281>   DW_AT_decl_line   : 327
    <c7283>   DW_AT_decl_column : 22
    <c7284>   DW_AT_type        : <0xc704b>
    <c7288>   DW_AT_data_member_location: 120
 <2><c7289>: Abbrev Number: 1 (DW_TAG_member)
    <c728a>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <c728e>   DW_AT_decl_file   : 7
    <c728e>   DW_AT_decl_line   : 328
    <c7290>   DW_AT_decl_column : 22
    <c7291>   DW_AT_type        : <0xc7057>
    <c7295>   DW_AT_data_member_location: 128
 <2><c7296>: Abbrev Number: 1 (DW_TAG_member)
    <c7297>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <c729b>   DW_AT_decl_file   : 7
    <c729b>   DW_AT_decl_line   : 330
    <c729d>   DW_AT_decl_column : 22
    <c729e>   DW_AT_type        : <0xc7107>
    <c72a2>   DW_AT_data_member_location: 136
 <2><c72a3>: Abbrev Number: 1 (DW_TAG_member)
    <c72a4>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <c72a8>   DW_AT_decl_file   : 7
    <c72a8>   DW_AT_decl_line   : 331
    <c72aa>   DW_AT_decl_column : 22
    <c72ab>   DW_AT_type        : <0xc6e61>
    <c72af>   DW_AT_data_member_location: 148
 <2><c72b0>: Abbrev Number: 1 (DW_TAG_member)
    <c72b1>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <c72b5>   DW_AT_decl_file   : 7
    <c72b5>   DW_AT_decl_line   : 332
    <c72b7>   DW_AT_decl_column : 22
    <c72b8>   DW_AT_type        : <0xc6e61>
    <c72bc>   DW_AT_data_member_location: 152
 <2><c72bd>: Abbrev Number: 1 (DW_TAG_member)
    <c72be>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <c72c2>   DW_AT_decl_file   : 7
    <c72c2>   DW_AT_decl_line   : 334
    <c72c4>   DW_AT_decl_column : 22
    <c72c5>   DW_AT_type        : <0xc6e61>
    <c72c9>   DW_AT_data_member_location: 156
 <2><c72ca>: Abbrev Number: 1 (DW_TAG_member)
    <c72cb>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <c72cf>   DW_AT_decl_file   : 7
    <c72cf>   DW_AT_decl_line   : 336
    <c72d1>   DW_AT_decl_column : 22
    <c72d2>   DW_AT_type        : <0xc7161>
    <c72d6>   DW_AT_data_member_location: 160
 <2><c72d7>: Abbrev Number: 1 (DW_TAG_member)
    <c72d8>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <c72dc>   DW_AT_decl_file   : 7
    <c72dc>   DW_AT_decl_line   : 337
    <c72de>   DW_AT_decl_column : 22
    <c72df>   DW_AT_type        : <0xc6e99>
    <c72e3>   DW_AT_data_member_location: 168
 <2><c72e4>: Abbrev Number: 1 (DW_TAG_member)
    <c72e5>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <c72e9>   DW_AT_decl_file   : 7
    <c72e9>   DW_AT_decl_line   : 338
    <c72eb>   DW_AT_decl_column : 22
    <c72ec>   DW_AT_type        : <0xc6e34>
    <c72f0>   DW_AT_data_member_location: 176
 <2><c72f1>: Abbrev Number: 1 (DW_TAG_member)
    <c72f2>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <c72f6>   DW_AT_decl_file   : 7
    <c72f6>   DW_AT_decl_line   : 339
    <c72f8>   DW_AT_decl_column : 22
    <c72f9>   DW_AT_type        : <0xc6e61>
    <c72fd>   DW_AT_data_member_location: 180
 <2><c72fe>: Abbrev Number: 1 (DW_TAG_member)
    <c72ff>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <c7303>   DW_AT_decl_file   : 7
    <c7303>   DW_AT_decl_line   : 340
    <c7305>   DW_AT_decl_column : 22
    <c7306>   DW_AT_type        : <0xc6e34>
    <c730a>   DW_AT_data_member_location: 184
 <2><c730b>: Abbrev Number: 1 (DW_TAG_member)
    <c730c>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <c7310>   DW_AT_decl_file   : 7
    <c7310>   DW_AT_decl_line   : 342
    <c7312>   DW_AT_decl_column : 19
    <c7313>   DW_AT_type        : <0xc6e61>
    <c7317>   DW_AT_data_member_location: 188
 <2><c7318>: Abbrev Number: 1 (DW_TAG_member)
    <c7319>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <c731d>   DW_AT_decl_file   : 7
    <c731d>   DW_AT_decl_line   : 344
    <c731f>   DW_AT_decl_column : 22
    <c7320>   DW_AT_type        : <0xc6e61>
    <c7324>   DW_AT_data_member_location: 192
 <2><c7325>: Abbrev Number: 1 (DW_TAG_member)
    <c7326>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <c732a>   DW_AT_decl_file   : 7
    <c732a>   DW_AT_decl_line   : 345
    <c732c>   DW_AT_decl_column : 22
    <c732d>   DW_AT_type        : <0xc6e61>
    <c7331>   DW_AT_data_member_location: 196
 <2><c7332>: Abbrev Number: 1 (DW_TAG_member)
    <c7333>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <c7337>   DW_AT_decl_file   : 7
    <c7337>   DW_AT_decl_line   : 347
    <c7339>   DW_AT_decl_column : 22
    <c733a>   DW_AT_type        : <0xc6e61>
    <c733e>   DW_AT_data_member_location: 200
 <2><c733f>: Abbrev Number: 1 (DW_TAG_member)
    <c7340>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <c7344>   DW_AT_decl_file   : 7
    <c7344>   DW_AT_decl_line   : 348
    <c7346>   DW_AT_decl_column : 22
    <c7347>   DW_AT_type        : <0xc6e61>
    <c734b>   DW_AT_data_member_location: 204
 <2><c734c>: Abbrev Number: 1 (DW_TAG_member)
    <c734d>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <c7351>   DW_AT_decl_file   : 7
    <c7351>   DW_AT_decl_line   : 349
    <c7353>   DW_AT_decl_column : 22
    <c7354>   DW_AT_type        : <0xc6e61>
    <c7358>   DW_AT_data_member_location: 208
 <2><c7359>: Abbrev Number: 1 (DW_TAG_member)
    <c735a>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <c735e>   DW_AT_decl_file   : 7
    <c735e>   DW_AT_decl_line   : 350
    <c7360>   DW_AT_decl_column : 22
    <c7361>   DW_AT_type        : <0xc6e61>
    <c7365>   DW_AT_data_member_location: 212
 <2><c7366>: Abbrev Number: 1 (DW_TAG_member)
    <c7367>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <c736b>   DW_AT_decl_file   : 7
    <c736b>   DW_AT_decl_line   : 351
    <c736d>   DW_AT_decl_column : 22
    <c736e>   DW_AT_type        : <0xc706f>
    <c7372>   DW_AT_data_member_location: 216
 <2><c7373>: Abbrev Number: 1 (DW_TAG_member)
    <c7374>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <c7378>   DW_AT_decl_file   : 7
    <c7378>   DW_AT_decl_line   : 352
    <c737a>   DW_AT_decl_column : 22
    <c737b>   DW_AT_type        : <0xc7095>
    <c737f>   DW_AT_data_member_location: 224
 <2><c7380>: Abbrev Number: 0
 <1><c7381>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7382>   DW_AT_name        : (indirect string, offset: 0x8e462): SFG_Timer
    <c7386>   DW_AT_decl_file   : 7
    <c7386>   DW_AT_decl_line   : 404
    <c7388>   DW_AT_decl_column : 29
    <c7389>   DW_AT_type        : <0xc738d>
 <1><c738d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c738e>   DW_AT_name        : (indirect string, offset: 0x8e45f): tagSFG_Timer
    <c7392>   DW_AT_byte_size   : 40
    <c7393>   DW_AT_decl_file   : 7
    <c7393>   DW_AT_decl_line   : 405
    <c7395>   DW_AT_decl_column : 8
    <c7395>   DW_AT_sibling     : <0xc73cd>
 <2><c7399>: Abbrev Number: 1 (DW_TAG_member)
    <c739a>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <c739e>   DW_AT_decl_file   : 7
    <c739e>   DW_AT_decl_line   : 407
    <c73a0>   DW_AT_decl_column : 21
    <c73a1>   DW_AT_type        : <0xc70d4>
    <c73a5>   DW_AT_data_member_location: 0
 <2><c73a6>: Abbrev Number: 15 (DW_TAG_member)
    <c73a7>   DW_AT_name        : ID
    <c73aa>   DW_AT_decl_file   : 7
    <c73aa>   DW_AT_decl_line   : 408
    <c73ac>   DW_AT_decl_column : 21
    <c73ad>   DW_AT_type        : <0xc6e61>
    <c73b1>   DW_AT_data_member_location: 16
 <2><c73b2>: Abbrev Number: 1 (DW_TAG_member)
    <c73b3>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <c73b7>   DW_AT_decl_file   : 7
    <c73b7>   DW_AT_decl_line   : 409
    <c73b9>   DW_AT_decl_column : 21
    <c73ba>   DW_AT_type        : <0xc703f>
    <c73be>   DW_AT_data_member_location: 24
 <2><c73bf>: Abbrev Number: 1 (DW_TAG_member)
    <c73c0>   DW_AT_name        : (indirect string, offset: 0x8e231): TriggerTime
    <c73c4>   DW_AT_decl_file   : 7
    <c73c4>   DW_AT_decl_line   : 410
    <c73c6>   DW_AT_decl_column : 21
    <c73c7>   DW_AT_type        : <0xc6e90>
    <c73cb>   DW_AT_data_member_location: 32
 <2><c73cc>: Abbrev Number: 0
 <1><c73cd>: Abbrev Number: 8 (DW_TAG_typedef)
    <c73ce>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <c73d2>   DW_AT_decl_file   : 7
    <c73d2>   DW_AT_decl_line   : 419
    <c73d4>   DW_AT_decl_column : 20
    <c73d5>   DW_AT_type        : <0xc6f17>
 <1><c73d9>: Abbrev Number: 8 (DW_TAG_typedef)
    <c73da>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <c73de>   DW_AT_decl_file   : 7
    <c73de>   DW_AT_decl_line   : 420
    <c73e0>   DW_AT_decl_column : 20
    <c73e1>   DW_AT_type        : <0xc6f2a>
 <1><c73e5>: Abbrev Number: 8 (DW_TAG_typedef)
    <c73e6>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <c73ea>   DW_AT_decl_file   : 7
    <c73ea>   DW_AT_decl_line   : 433
    <c73ec>   DW_AT_decl_column : 31
    <c73ed>   DW_AT_type        : <0xc73f1>
 <1><c73f1>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c73f2>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <c73f6>   DW_AT_byte_size   : 32
    <c73f7>   DW_AT_decl_file   : 7
    <c73f7>   DW_AT_decl_line   : 434
    <c73f9>   DW_AT_decl_column : 8
    <c73f9>   DW_AT_sibling     : <0xc7432>
 <2><c73fd>: Abbrev Number: 1 (DW_TAG_member)
    <c73fe>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <c7402>   DW_AT_decl_file   : 7
    <c7402>   DW_AT_decl_line   : 436
    <c7404>   DW_AT_decl_column : 27
    <c7405>   DW_AT_type        : <0xc73cd>
    <c7409>   DW_AT_data_member_location: 0
 <2><c740a>: Abbrev Number: 1 (DW_TAG_member)
    <c740b>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <c740f>   DW_AT_decl_file   : 7
    <c740f>   DW_AT_decl_line   : 437
    <c7411>   DW_AT_decl_column : 27
    <c7412>   DW_AT_type        : <0xc73d9>
    <c7416>   DW_AT_data_member_location: 8
 <2><c7417>: Abbrev Number: 1 (DW_TAG_member)
    <c7418>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <c741c>   DW_AT_decl_file   : 7
    <c741c>   DW_AT_decl_line   : 440
    <c741e>   DW_AT_decl_column : 21
    <c741f>   DW_AT_type        : <0xc6f56>
    <c7423>   DW_AT_data_member_location: 16
 <2><c7424>: Abbrev Number: 1 (DW_TAG_member)
    <c7425>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <c7429>   DW_AT_decl_file   : 7
    <c7429>   DW_AT_decl_line   : 445
    <c742b>   DW_AT_decl_column : 21
    <c742c>   DW_AT_type        : <0xc6e61>
    <c7430>   DW_AT_data_member_location: 24
 <2><c7431>: Abbrev Number: 0
 <1><c7432>: Abbrev Number: 8 (DW_TAG_typedef)
    <c7433>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <c7437>   DW_AT_decl_file   : 7
    <c7437>   DW_AT_decl_line   : 449
    <c7439>   DW_AT_decl_column : 35
    <c743a>   DW_AT_type        : <0xc743e>
 <1><c743e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c743f>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <c7443>   DW_AT_byte_size   : 56
    <c7444>   DW_AT_decl_file   : 7
    <c7444>   DW_AT_decl_line   : 450
    <c7446>   DW_AT_decl_column : 8
    <c7446>   DW_AT_sibling     : <0xc750e>
 <2><c744a>: Abbrev Number: 1 (DW_TAG_member)
    <c744b>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <c744f>   DW_AT_decl_file   : 7
    <c744f>   DW_AT_decl_line   : 453
    <c7451>   DW_AT_decl_column : 21
    <c7452>   DW_AT_type        : <0xc6e61>
    <c7456>   DW_AT_data_member_location: 0
 <2><c7457>: Abbrev Number: 1 (DW_TAG_member)
    <c7458>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <c745c>   DW_AT_decl_file   : 7
    <c745c>   DW_AT_decl_line   : 454
    <c745e>   DW_AT_decl_column : 21
    <c745f>   DW_AT_type        : <0xc6e61>
    <c7463>   DW_AT_data_member_location: 4
 <2><c7464>: Abbrev Number: 1 (DW_TAG_member)
    <c7465>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <c7469>   DW_AT_decl_file   : 7
    <c7469>   DW_AT_decl_line   : 456
    <c746b>   DW_AT_decl_column : 21
    <c746c>   DW_AT_type        : <0xc6e61>
    <c7470>   DW_AT_data_member_location: 8
 <2><c7471>: Abbrev Number: 1 (DW_TAG_member)
    <c7472>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <c7476>   DW_AT_decl_file   : 7
    <c7476>   DW_AT_decl_line   : 457
    <c7478>   DW_AT_decl_column : 21
    <c7479>   DW_AT_type        : <0xc6e61>
    <c747d>   DW_AT_data_member_location: 12
 <2><c747e>: Abbrev Number: 1 (DW_TAG_member)
    <c747f>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <c7483>   DW_AT_decl_file   : 7
    <c7483>   DW_AT_decl_line   : 463
    <c7485>   DW_AT_decl_column : 21
    <c7486>   DW_AT_type        : <0xc6e34>
    <c748a>   DW_AT_data_member_location: 16
 <2><c748b>: Abbrev Number: 1 (DW_TAG_member)
    <c748c>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <c7490>   DW_AT_decl_file   : 7
    <c7490>   DW_AT_decl_line   : 464
    <c7492>   DW_AT_decl_column : 21
    <c7493>   DW_AT_type        : <0xc6e34>
    <c7497>   DW_AT_data_member_location: 17
 <2><c7498>: Abbrev Number: 1 (DW_TAG_member)
    <c7499>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <c749d>   DW_AT_decl_file   : 7
    <c749d>   DW_AT_decl_line   : 466
    <c749f>   DW_AT_decl_column : 21
    <c74a0>   DW_AT_type        : <0xc6e61>
    <c74a4>   DW_AT_data_member_location: 20
 <2><c74a5>: Abbrev Number: 1 (DW_TAG_member)
    <c74a6>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <c74aa>   DW_AT_decl_file   : 7
    <c74aa>   DW_AT_decl_line   : 468
    <c74ac>   DW_AT_decl_column : 21
    <c74ad>   DW_AT_type        : <0xc6e90>
    <c74b1>   DW_AT_data_member_location: 24
 <2><c74b2>: Abbrev Number: 1 (DW_TAG_member)
    <c74b3>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <c74b7>   DW_AT_decl_file   : 7
    <c74b7>   DW_AT_decl_line   : 469
    <c74b9>   DW_AT_decl_column : 21
    <c74ba>   DW_AT_type        : <0xc6e90>
    <c74be>   DW_AT_data_member_location: 32
 <2><c74bf>: Abbrev Number: 1 (DW_TAG_member)
    <c74c0>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <c74c4>   DW_AT_decl_file   : 7
    <c74c4>   DW_AT_decl_line   : 471
    <c74c6>   DW_AT_decl_column : 21
    <c74c7>   DW_AT_type        : <0xc6e61>
    <c74cb>   DW_AT_data_member_location: 40
 <2><c74cc>: Abbrev Number: 1 (DW_TAG_member)
    <c74cd>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <c74d1>   DW_AT_decl_file   : 7
    <c74d1>   DW_AT_decl_line   : 471
    <c74d3>   DW_AT_decl_column : 29
    <c74d4>   DW_AT_type        : <0xc6e61>
    <c74d8>   DW_AT_data_member_location: 44
 <2><c74d9>: Abbrev Number: 1 (DW_TAG_member)
    <c74da>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <c74de>   DW_AT_decl_file   : 7
    <c74de>   DW_AT_decl_line   : 473
    <c74e0>   DW_AT_decl_column : 21
    <c74e1>   DW_AT_type        : <0xc6e34>
    <c74e5>   DW_AT_data_member_location: 48
 <2><c74e6>: Abbrev Number: 1 (DW_TAG_member)
    <c74e7>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <c74eb>   DW_AT_decl_file   : 7
    <c74eb>   DW_AT_decl_line   : 474
    <c74ed>   DW_AT_decl_column : 21
    <c74ee>   DW_AT_type        : <0xc6e34>
    <c74f2>   DW_AT_data_member_location: 49
 <2><c74f3>: Abbrev Number: 1 (DW_TAG_member)
    <c74f4>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <c74f8>   DW_AT_decl_file   : 7
    <c74f8>   DW_AT_decl_line   : 476
    <c74fa>   DW_AT_decl_column : 21
    <c74fb>   DW_AT_type        : <0xc6e34>
    <c74ff>   DW_AT_data_member_location: 50
 <2><c7500>: Abbrev Number: 1 (DW_TAG_member)
    <c7501>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <c7505>   DW_AT_decl_file   : 7
    <c7505>   DW_AT_decl_line   : 478
    <c7507>   DW_AT_decl_column : 21
    <c7508>   DW_AT_type        : <0xc6e34>
    <c750c>   DW_AT_data_member_location: 51
 <2><c750d>: Abbrev Number: 0
 <1><c750e>: Abbrev Number: 8 (DW_TAG_typedef)
    <c750f>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <c7513>   DW_AT_decl_file   : 7
    <c7513>   DW_AT_decl_line   : 487
    <c7515>   DW_AT_decl_column : 16
    <c7516>   DW_AT_type        : <0xc6eca>
 <1><c751a>: Abbrev Number: 26 (DW_TAG_enumeration_type)
    <c751b>   DW_AT_encoding    : 7	(void)
    <c751b>   DW_AT_byte_size   : 4
    <c751b>   DW_AT_type        : <0xc6e2d>
    <c751f>   DW_AT_decl_file   : 7
    <c751f>   DW_AT_decl_line   : 587
    <c7521>   DW_AT_decl_column : 1
    <c7521>   DW_AT_sibling     : <0xc75d4>
 <2><c7525>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7526>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <c752a>   DW_AT_const_value : 0
 <2><c752b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c752c>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <c7530>   DW_AT_const_value : 1
 <2><c7531>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7532>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <c7536>   DW_AT_const_value : 2
 <2><c7537>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7538>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <c753c>   DW_AT_const_value : 3
 <2><c753d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c753e>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <c7542>   DW_AT_const_value : 4
 <2><c7543>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7544>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <c7548>   DW_AT_const_value : 5
 <2><c7549>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c754a>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <c754e>   DW_AT_const_value : 6
 <2><c754f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7550>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <c7554>   DW_AT_const_value : 7
 <2><c7555>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7556>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <c755a>   DW_AT_const_value : 8
 <2><c755b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c755c>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <c7560>   DW_AT_const_value : 9
 <2><c7561>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7562>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <c7566>   DW_AT_const_value : 10
 <2><c7567>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7568>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <c756c>   DW_AT_const_value : 11
 <2><c756d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c756e>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <c7572>   DW_AT_const_value : 12
 <2><c7573>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7574>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <c7578>   DW_AT_const_value : 13
 <2><c7579>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c757a>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <c757e>   DW_AT_const_value : 14
 <2><c757f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7580>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <c7584>   DW_AT_const_value : 15
 <2><c7585>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7586>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <c758a>   DW_AT_const_value : 16
 <2><c758b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c758c>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <c7590>   DW_AT_const_value : 17
 <2><c7591>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7592>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <c7596>   DW_AT_const_value : 18
 <2><c7597>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c7598>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <c759c>   DW_AT_const_value : 19
 <2><c759d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c759e>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <c75a2>   DW_AT_const_value : 20
 <2><c75a3>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75a4>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <c75a8>   DW_AT_const_value : 21
 <2><c75a9>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75aa>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <c75ae>   DW_AT_const_value : 22
 <2><c75af>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75b0>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <c75b4>   DW_AT_const_value : 23
 <2><c75b5>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75b6>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <c75ba>   DW_AT_const_value : 24
 <2><c75bb>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75bc>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <c75c0>   DW_AT_const_value : 25
 <2><c75c1>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75c2>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <c75c6>   DW_AT_const_value : 26
 <2><c75c7>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75c8>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <c75cc>   DW_AT_const_value : 27
 <2><c75cd>: Abbrev Number: 5 (DW_TAG_enumerator)
    <c75ce>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <c75d2>   DW_AT_const_value : 28
 <2><c75d3>: Abbrev Number: 0
 <1><c75d4>: Abbrev Number: 8 (DW_TAG_typedef)
    <c75d5>   DW_AT_name        : (indirect string, offset: 0x8e56b): SFG_MenuContext
    <c75d9>   DW_AT_decl_file   : 7
    <c75d9>   DW_AT_decl_line   : 627
    <c75db>   DW_AT_decl_column : 35
    <c75dc>   DW_AT_type        : <0xc75e0>
 <1><c75e0>: Abbrev Number: 14 (DW_TAG_structure_type)
    <c75e1>   DW_AT_name        : (indirect string, offset: 0x8e568): tagSFG_MenuContext
    <c75e5>   DW_AT_byte_size   : 8
    <c75e6>   DW_AT_decl_file   : 7
    <c75e6>   DW_AT_decl_line   : 628
    <c75e8>   DW_AT_decl_column : 8
    <c75e8>   DW_AT_sibling     : <0xc75fa>
 <2><c75ec>: Abbrev Number: 1 (DW_TAG_member)
    <c75ed>   DW_AT_name        : (indirect string, offset: 0x8e24f): MContext
    <c75f1>   DW_AT_decl_file   : 7
    <c75f1>   DW_AT_decl_line   : 630
    <c75f3>   DW_AT_decl_column : 27
    <c75f4>   DW_AT_type        : <0xc73d9>
    <c75f8>   DW_AT_data_member_location: 0
 <2><c75f9>: Abbrev Number: 0
 <1><c75fa>: Abbrev Number: 8 (DW_TAG_typedef)
    <c75fb>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <c75ff>   DW_AT_decl_file   : 7
    <c75ff>   DW_AT_decl_line   : 634
    <c7601>   DW_AT_decl_column : 30
    <c7602>   DW_AT_type        : <0xc7606>
 <1><c7606>: Abbrev Number: 40 (DW_TAG_structure_type)
    <c7607>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <c760b>   DW_AT_byte_size   : 408
    <c760d>   DW_AT_decl_file   : 7
    <c760e>   DW_AT_decl_line   : 673
    <c7610>   DW_AT_decl_column : 8
    <c7611>   DW_AT_sibling     : <0xc76aa>
 <2><c7615>: Abbrev Number: 1 (DW_TAG_member)
    <c7616>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <c761a>   DW_AT_decl_file   : 7
    <c761a>   DW_AT_decl_line   : 675
    <c761c>   DW_AT_decl_column : 25
    <c761d>   DW_AT_type        : <0xc70d4>
    <c7621>   DW_AT_data_member_location: 0
 <2><c7622>: Abbrev Number: 15 (DW_TAG_member)
    <c7623>   DW_AT_name        : ID
    <c7626>   DW_AT_decl_file   : 7
    <c7626>   DW_AT_decl_line   : 676
    <c7628>   DW_AT_decl_column : 25
    <c7629>   DW_AT_type        : <0xc6e61>
    <c762d>   DW_AT_data_member_location: 16
 <2><c762e>: Abbrev Number: 1 (DW_TAG_member)
    <c762f>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <c7633>   DW_AT_decl_file   : 7
    <c7633>   DW_AT_decl_line   : 678
    <c7635>   DW_AT_decl_column : 25
    <c7636>   DW_AT_type        : <0xc73e5>
    <c763a>   DW_AT_data_member_location: 24
 <2><c763b>: Abbrev Number: 1 (DW_TAG_member)
    <c763c>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <c7640>   DW_AT_decl_file   : 7
    <c7640>   DW_AT_decl_line   : 679
