    <ca285>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <ca289>   DW_AT_decl_file   : 11
    <ca28a>   DW_AT_decl_line   : 636
    <ca28c>   DW_AT_decl_column : 28
    <ca28d>   DW_AT_type        : <0xca291>
 <1><ca291>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ca292>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <ca296>   DW_AT_byte_size   : 112
    <ca297>   DW_AT_decl_file   : 11
    <ca297>   DW_AT_decl_line   : 637
    <ca299>   DW_AT_decl_column : 8
    <ca299>   DW_AT_sibling     : <0xca34f>
 <2><ca29d>: Abbrev Number: 1 (DW_TAG_member)
    <ca29e>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <ca2a2>   DW_AT_decl_file   : 11
    <ca2a2>   DW_AT_decl_line   : 639
    <ca2a4>   DW_AT_decl_column : 25
    <ca2a5>   DW_AT_type        : <0xc9c6e>
    <ca2a9>   DW_AT_data_member_location: 0
 <2><ca2aa>: Abbrev Number: 1 (DW_TAG_member)
    <ca2ab>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <ca2af>   DW_AT_decl_file   : 11
    <ca2af>   DW_AT_decl_line   : 640
    <ca2b1>   DW_AT_decl_column : 25
    <ca2b2>   DW_AT_type        : <0xc98c7>
    <ca2b6>   DW_AT_data_member_location: 16
 <2><ca2b7>: Abbrev Number: 10 (DW_TAG_member)
    <ca2b8>   DW_AT_name        : ID
    <ca2bb>   DW_AT_decl_file   : 11
    <ca2bb>   DW_AT_decl_line   : 641
    <ca2bd>   DW_AT_decl_column : 25
    <ca2be>   DW_AT_type        : <0xc9880>
    <ca2c2>   DW_AT_data_member_location: 24
 <2><ca2c3>: Abbrev Number: 1 (DW_TAG_member)
    <ca2c4>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <ca2c8>   DW_AT_decl_file   : 11
    <ca2c8>   DW_AT_decl_line   : 642
    <ca2ca>   DW_AT_decl_column : 25
    <ca2cb>   DW_AT_type        : <0xc9c3a>
    <ca2cf>   DW_AT_data_member_location: 32
 <2><ca2d0>: Abbrev Number: 1 (DW_TAG_member)
    <ca2d1>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <ca2d5>   DW_AT_decl_file   : 11
    <ca2d5>   DW_AT_decl_line   : 643
    <ca2d7>   DW_AT_decl_column : 25
    <ca2d8>   DW_AT_type        : <0xc9bfa>
    <ca2dc>   DW_AT_data_member_location: 48
 <2><ca2dd>: Abbrev Number: 1 (DW_TAG_member)
    <ca2de>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <ca2e2>   DW_AT_decl_file   : 11
    <ca2e2>   DW_AT_decl_line   : 644
    <ca2e4>   DW_AT_decl_column : 25
    <ca2e5>   DW_AT_type        : <0xc9bca>
    <ca2e9>   DW_AT_data_member_location: 56
 <2><ca2ea>: Abbrev Number: 1 (DW_TAG_member)
    <ca2eb>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <ca2ef>   DW_AT_decl_file   : 11
    <ca2ef>   DW_AT_decl_line   : 645
    <ca2f1>   DW_AT_decl_column : 25
    <ca2f2>   DW_AT_type        : <0xc9853>
    <ca2f6>   DW_AT_data_member_location: 64
 <2><ca2f7>: Abbrev Number: 1 (DW_TAG_member)
    <ca2f8>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <ca2fc>   DW_AT_decl_file   : 11
    <ca2fc>   DW_AT_decl_line   : 646
    <ca2fe>   DW_AT_decl_column : 25
    <ca2ff>   DW_AT_type        : <0xc9880>
    <ca303>   DW_AT_data_member_location: 68
 <2><ca304>: Abbrev Number: 1 (DW_TAG_member)
    <ca305>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <ca309>   DW_AT_decl_file   : 11
    <ca309>   DW_AT_decl_line   : 647
    <ca30b>   DW_AT_decl_column : 25
    <ca30c>   DW_AT_type        : <0xc9880>
    <ca310>   DW_AT_data_member_location: 72
 <2><ca311>: Abbrev Number: 10 (DW_TAG_member)
    <ca312>   DW_AT_name        : X
    <ca314>   DW_AT_decl_file   : 11
    <ca314>   DW_AT_decl_line   : 648
    <ca316>   DW_AT_decl_column : 25
    <ca317>   DW_AT_type        : <0xc9880>
    <ca31b>   DW_AT_data_member_location: 76
 <2><ca31c>: Abbrev Number: 10 (DW_TAG_member)
    <ca31d>   DW_AT_name        : Y
    <ca31f>   DW_AT_decl_file   : 11
    <ca31f>   DW_AT_decl_line   : 648
    <ca321>   DW_AT_decl_column : 28
    <ca322>   DW_AT_type        : <0xc9880>
    <ca326>   DW_AT_data_member_location: 80
 <2><ca327>: Abbrev Number: 1 (DW_TAG_member)
    <ca328>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <ca32c>   DW_AT_decl_file   : 11
    <ca32c>   DW_AT_decl_line   : 650
    <ca32e>   DW_AT_decl_column : 25
    <ca32f>   DW_AT_type        : <0xca34f>
    <ca333>   DW_AT_data_member_location: 88
 <2><ca334>: Abbrev Number: 1 (DW_TAG_member)
    <ca335>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <ca339>   DW_AT_decl_file   : 11
    <ca339>   DW_AT_decl_line   : 651
    <ca33b>   DW_AT_decl_column : 25
    <ca33c>   DW_AT_type        : <0xca354>
    <ca340>   DW_AT_data_member_location: 96
 <2><ca341>: Abbrev Number: 1 (DW_TAG_member)
    <ca342>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <ca346>   DW_AT_decl_file   : 11
    <ca346>   DW_AT_decl_line   : 652
    <ca348>   DW_AT_decl_column : 25
    <ca349>   DW_AT_type        : <0xca354>
    <ca34d>   DW_AT_data_member_location: 104
 <2><ca34e>: Abbrev Number: 0
 <1><ca34f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca350>   DW_AT_byte_size   : 8
    <ca350>   DW_AT_type        : <0xca210>
 <1><ca354>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca355>   DW_AT_byte_size   : 8
    <ca355>   DW_AT_type        : <0xca15f>
 <1><ca359>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca35a>   DW_AT_byte_size   : 8
    <ca35a>   DW_AT_type        : <0xca284>
 <1><ca35e>: Abbrev Number: 15 (DW_TAG_array_type)
    <ca35f>   DW_AT_type        : <0xca12b>
    <ca363>   DW_AT_sibling     : <0xca36e>
 <2><ca367>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <ca368>   DW_AT_type        : <0xc98a1>
    <ca36c>   DW_AT_upper_bound : 27
 <2><ca36d>: Abbrev Number: 0
 <1><ca36e>: Abbrev Number: 15 (DW_TAG_array_type)
    <ca36f>   DW_AT_type        : <0xca359>
    <ca373>   DW_AT_sibling     : <0xca37e>
 <2><ca377>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <ca378>   DW_AT_type        : <0xc98a1>
    <ca37c>   DW_AT_upper_bound : 2
 <2><ca37d>: Abbrev Number: 0
 <1><ca37e>: Abbrev Number: 4 (DW_TAG_typedef)
    <ca37f>   DW_AT_name        : (indirect string, offset: 0x8e11b): SFG_Structure
    <ca383>   DW_AT_decl_file   : 11
    <ca384>   DW_AT_decl_line   : 702
    <ca386>   DW_AT_decl_column : 33
    <ca387>   DW_AT_type        : <0xca38b>
 <1><ca38b>: Abbrev Number: 9 (DW_TAG_structure_type)
    <ca38c>   DW_AT_name        : (indirect string, offset: 0x8e118): tagSFG_Structure
    <ca390>   DW_AT_byte_size   : 88
    <ca391>   DW_AT_decl_file   : 11
    <ca391>   DW_AT_decl_line   : 703
    <ca393>   DW_AT_decl_column : 8
    <ca393>   DW_AT_sibling     : <0xca40d>
 <2><ca397>: Abbrev Number: 1 (DW_TAG_member)
    <ca398>   DW_AT_name        : (indirect string, offset: 0x8f090): Windows
    <ca39c>   DW_AT_decl_file   : 11
    <ca39c>   DW_AT_decl_line   : 705
    <ca39e>   DW_AT_decl_column : 21
    <ca39f>   DW_AT_type        : <0xc9c3a>
    <ca3a3>   DW_AT_data_member_location: 0
 <2><ca3a4>: Abbrev Number: 1 (DW_TAG_member)
    <ca3a5>   DW_AT_name        : (indirect string, offset: 0x8e25e): Menus
    <ca3a9>   DW_AT_decl_file   : 11
    <ca3a9>   DW_AT_decl_line   : 706
    <ca3ab>   DW_AT_decl_column : 21
    <ca3ac>   DW_AT_type        : <0xc9c3a>
    <ca3b0>   DW_AT_data_member_location: 16
 <2><ca3b1>: Abbrev Number: 1 (DW_TAG_member)
    <ca3b2>   DW_AT_name        : (indirect string, offset: 0x8e65c): WindowsToDestroy
    <ca3b6>   DW_AT_decl_file   : 11
    <ca3b6>   DW_AT_decl_line   : 707
    <ca3b8>   DW_AT_decl_column : 21
    <ca3b9>   DW_AT_type        : <0xc9c3a>
    <ca3bd>   DW_AT_data_member_location: 32
 <2><ca3be>: Abbrev Number: 1 (DW_TAG_member)
    <ca3bf>   DW_AT_name        : (indirect string, offset: 0x8e343): CurrentWindow
    <ca3c3>   DW_AT_decl_file   : 11
    <ca3c3>   DW_AT_decl_line   : 709
    <ca3c5>   DW_AT_decl_column : 21
    <ca3c6>   DW_AT_type        : <0xca354>
    <ca3ca>   DW_AT_data_member_location: 48
 <2><ca3cb>: Abbrev Number: 1 (DW_TAG_member)
    <ca3cc>   DW_AT_name        : (indirect string, offset: 0x8e07f): CurrentMenu
    <ca3d0>   DW_AT_decl_file   : 11
    <ca3d0>   DW_AT_decl_line   : 710
    <ca3d2>   DW_AT_decl_column : 21
    <ca3d3>   DW_AT_type        : <0xca359>
    <ca3d7>   DW_AT_data_member_location: 56
 <2><ca3d8>: Abbrev Number: 1 (DW_TAG_member)
    <ca3d9>   DW_AT_name        : (indirect string, offset: 0x8e56f): MenuContext
    <ca3dd>   DW_AT_decl_file   : 11
    <ca3dd>   DW_AT_decl_line   : 712
    <ca3df>   DW_AT_decl_column : 22
    <ca3e0>   DW_AT_type        : <0xca40d>
    <ca3e4>   DW_AT_data_member_location: 64
 <2><ca3e5>: Abbrev Number: 1 (DW_TAG_member)
    <ca3e6>   DW_AT_name        : (indirect string, offset: 0x8e5bb): GameModeWindow
    <ca3ea>   DW_AT_decl_file   : 11
    <ca3ea>   DW_AT_decl_line   : 714
    <ca3ec>   DW_AT_decl_column : 22
    <ca3ed>   DW_AT_type        : <0xca354>
    <ca3f1>   DW_AT_data_member_location: 72
 <2><ca3f2>: Abbrev Number: 1 (DW_TAG_member)
    <ca3f3>   DW_AT_name        : (indirect string, offset: 0x8e2ad): WindowID
    <ca3f7>   DW_AT_decl_file   : 11
    <ca3f7>   DW_AT_decl_line   : 716
    <ca3f9>   DW_AT_decl_column : 22
    <ca3fa>   DW_AT_type        : <0xc9880>
    <ca3fe>   DW_AT_data_member_location: 80
 <2><ca3ff>: Abbrev Number: 1 (DW_TAG_member)
    <ca400>   DW_AT_name        : (indirect string, offset: 0x8f878): MenuID
    <ca404>   DW_AT_decl_file   : 11
    <ca404>   DW_AT_decl_line   : 717
    <ca406>   DW_AT_decl_column : 22
    <ca407>   DW_AT_type        : <0xc9880>
    <ca40b>   DW_AT_data_member_location: 84
 <2><ca40c>: Abbrev Number: 0
 <1><ca40d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ca40e>   DW_AT_byte_size   : 8
    <ca40e>   DW_AT_type        : <0xca138>
 <1><ca412>: Abbrev Number: 20 (DW_TAG_variable)
    <ca413>   DW_AT_name        : (indirect string, offset: 0x8e82f): fgDisplay
    <ca417>   DW_AT_decl_file   : 11
    <ca417>   DW_AT_decl_line   : 781
    <ca419>   DW_AT_decl_column : 20
    <ca41a>   DW_AT_type        : <0xc9f23>
    <ca41e>   DW_AT_external    : 1
    <ca41e>   DW_AT_declaration : 1
 <1><ca41e>: Abbrev Number: 20 (DW_TAG_variable)
    <ca41f>   DW_AT_name        : (indirect string, offset: 0x8e3ad): fgStructure
    <ca423>   DW_AT_decl_file   : 11
    <ca423>   DW_AT_decl_line   : 784
    <ca425>   DW_AT_decl_column : 22
    <ca426>   DW_AT_type        : <0xca37e>
    <ca42a>   DW_AT_external    : 1
    <ca42a>   DW_AT_declaration : 1
 <1><ca42a>: Abbrev Number: 20 (DW_TAG_variable)
    <ca42b>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <ca42f>   DW_AT_decl_file   : 11
    <ca42f>   DW_AT_decl_line   : 787
    <ca431>   DW_AT_decl_column : 18
    <ca432>   DW_AT_type        : <0xc9d0e>
    <ca436>   DW_AT_external    : 1
    <ca436>   DW_AT_declaration : 1
 <1><ca436>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ca437>   DW_AT_external    : 1
    <ca437>   DW_AT_name        : (indirect string, offset: 0x8e951): fgWindowByID
    <ca43b>   DW_AT_decl_file   : 11
    <ca43c>   DW_AT_decl_line   : 960
    <ca43e>   DW_AT_decl_column : 13
    <ca43f>   DW_AT_prototyped  : 1
    <ca43f>   DW_AT_type        : <0xca354>
    <ca443>   DW_AT_declaration : 1
    <ca443>   DW_AT_sibling     : <0xca44d>
 <2><ca447>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca448>   DW_AT_type        : <0xc9880>
 <2><ca44c>: Abbrev Number: 0
 <1><ca44d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ca44e>   DW_AT_external    : 1
    <ca44e>   DW_AT_name        : (indirect string, offset: 0x8e966): fprintf
    <ca452>   DW_AT_decl_file   : 12
    <ca453>   DW_AT_decl_line   : 326
    <ca455>   DW_AT_decl_column : 12
    <ca456>   DW_AT_prototyped  : 1
    <ca456>   DW_AT_type        : <0xc9880>
    <ca45a>   DW_AT_declaration : 1
    <ca45a>   DW_AT_sibling     : <0xca46a>
 <2><ca45e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca45f>   DW_AT_type        : <0xc9b8f>
 <2><ca463>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca464>   DW_AT_type        : <0xc99cf>
 <2><ca468>: Abbrev Number: 17 (DW_TAG_unspecified_parameters)
 <2><ca469>: Abbrev Number: 0
 <1><ca46a>: Abbrev Number: 21 (DW_TAG_subprogram)
    <ca46b>   DW_AT_external    : 1
    <ca46b>   DW_AT_name        : (indirect string, offset: 0x62495): glutGet
    <ca46f>   DW_AT_decl_file   : 13
    <ca470>   DW_AT_decl_line   : 498
    <ca472>   DW_AT_decl_column : 26
    <ca473>   DW_AT_prototyped  : 1
    <ca473>   DW_AT_type        : <0xc9880>
    <ca477>   DW_AT_declaration : 1
    <ca477>   DW_AT_sibling     : <0xca481>
 <2><ca47b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca47c>   DW_AT_type        : <0xc9847>
 <2><ca480>: Abbrev Number: 0
 <1><ca481>: Abbrev Number: 42 (DW_TAG_subprogram)
    <ca482>   DW_AT_external    : 1
    <ca482>   DW_AT_name        : (indirect string, offset: 0x8e96e): glXSwapBuffers
    <ca486>   DW_AT_decl_file   : 8
    <ca487>   DW_AT_decl_line   : 201
    <ca488>   DW_AT_decl_column : 13
    <ca489>   DW_AT_prototyped  : 1
    <ca489>   DW_AT_declaration : 1
    <ca489>   DW_AT_sibling     : <0xca498>
 <2><ca48d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca48e>   DW_AT_type        : <0xc9978>
 <2><ca492>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca493>   DW_AT_type        : <0xc99a3>
 <2><ca497>: Abbrev Number: 0
 <1><ca498>: Abbrev Number: 43 (DW_TAG_subprogram)
    <ca499>   DW_AT_external    : 1
    <ca499>   DW_AT_name        : (indirect string, offset: 0x8e95e): glFlush
    <ca49d>   DW_AT_decl_file   : 2
    <ca49e>   DW_AT_decl_line   : 830
    <ca4a0>   DW_AT_decl_column : 23
    <ca4a1>   DW_AT_prototyped  : 1
    <ca4a1>   DW_AT_declaration : 1
 <1><ca4a1>: Abbrev Number: 44 (DW_TAG_subprogram)
    <ca4a2>   DW_AT_external    : 1
    <ca4a2>   DW_AT_name        : (indirect string, offset: 0x8e9c9): fgError
    <ca4a6>   DW_AT_decl_file   : 11
    <ca4a7>   DW_AT_decl_line   : 998
    <ca4a9>   DW_AT_decl_column : 6
    <ca4aa>   DW_AT_prototyped  : 1
    <ca4aa>   DW_AT_declaration : 1
    <ca4aa>   DW_AT_sibling     : <0xca4b5>
 <2><ca4ae>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ca4af>   DW_AT_type        : <0xc99ca>
 <2><ca4b3>: Abbrev Number: 17 (DW_TAG_unspecified_parameters)
 <2><ca4b4>: Abbrev Number: 0
 <1><ca4b5>: Abbrev Number: 24 (DW_TAG_subprogram)
    <ca4b6>   DW_AT_external    : 1
    <ca4b6>   DW_AT_name        : (indirect string, offset: 0x8e97d): glutPostWindowRedisplay
    <ca4ba>   DW_AT_decl_file   : 1
    <ca4ba>   DW_AT_decl_line   : 96
    <ca4bb>   DW_AT_decl_column : 17
    <ca4bb>   DW_AT_prototyped  : 1
    <ca4bb>   DW_AT_low_pc      : 0x9cf630
    <ca4c3>   DW_AT_high_pc     : 0x37
    <ca4cb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ca4cd>   DW_AT_call_all_calls: 1
    <ca4cd>   DW_AT_sibling     : <0xca539>
 <2><ca4d1>: Abbrev Number: 45 (DW_TAG_formal_parameter)
    <ca4d2>   DW_AT_name        : (indirect string, offset: 0x8e948): windowID
    <ca4d6>   DW_AT_decl_file   : 1
    <ca4d7>   DW_AT_decl_line   : 96
    <ca4d8>   DW_AT_decl_column : 46
    <ca4d9>   DW_AT_type        : <0xc9880>
    <ca4dd>   DW_AT_location    : 0x879 (location list)
    <ca4e1>   DW_AT_GNU_locviews: 0x86f
 <2><ca4e5>: Abbrev Number: 25 (DW_TAG_variable)
    <ca4e6>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <ca4ea>   DW_AT_decl_file   : 1
    <ca4ea>   DW_AT_decl_line   : 98
    <ca4eb>   DW_AT_decl_column : 17
    <ca4ec>   DW_AT_type        : <0xca354>
    <ca4f0>   DW_AT_location    : 0x8a2 (location list)
    <ca4f4>   DW_AT_GNU_locviews: 0x8a0
 <2><ca4f8>: Abbrev Number: 22 (DW_TAG_call_site)
    <ca4f9>   DW_AT_call_return_pc: 0x9cf643
    <ca501>   DW_AT_call_origin : <0xca436>
    <ca505>   DW_AT_sibling     : <0xca510>
 <3><ca509>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca50a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca50c>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><ca50f>: Abbrev Number: 0
 <2><ca510>: Abbrev Number: 13 (DW_TAG_call_site)
    <ca511>   DW_AT_call_return_pc: 0x9cf665
    <ca519>   DW_AT_call_origin : <0xca4a1>
 <3><ca51d>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca51e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca520>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><ca52a>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca52b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca52d>   DW_AT_call_value  : 9 byte block: 3 0 ba a3 0 0 0 0 0 	(DW_OP_addr: a3ba00)
 <3><ca537>: Abbrev Number: 0
 <2><ca538>: Abbrev Number: 0
 <1><ca539>: Abbrev Number: 24 (DW_TAG_subprogram)
    <ca53a>   DW_AT_external    : 1
    <ca53a>   DW_AT_name        : (indirect string, offset: 0x73e24): glutSwapBuffers
    <ca53e>   DW_AT_decl_file   : 1
    <ca53e>   DW_AT_decl_line   : 54
    <ca53f>   DW_AT_decl_column : 17
    <ca53f>   DW_AT_prototyped  : 1
    <ca53f>   DW_AT_low_pc      : 0x9cf4f0
    <ca547>   DW_AT_high_pc     : 0x132
    <ca54f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ca551>   DW_AT_call_all_calls: 1
    <ca551>   DW_AT_sibling     : <0xca63f>
 <2><ca555>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <ca556>   DW_AT_ranges      : 0x4fb
    <ca55a>   DW_AT_sibling     : <0xca5d0>
 <3><ca55e>: Abbrev Number: 27 (DW_TAG_variable)
    <ca55f>   DW_AT_name        : t
    <ca561>   DW_AT_decl_file   : 1
    <ca561>   DW_AT_decl_line   : 76
    <ca562>   DW_AT_decl_column : 15
    <ca563>   DW_AT_type        : <0xc9874>
    <ca567>   DW_AT_location    : 0x8b0 (location list)
    <ca56b>   DW_AT_GNU_locviews: 0x8aa
 <3><ca56f>: Abbrev Number: 26 (DW_TAG_lexical_block)
    <ca570>   DW_AT_ranges      : 0x50b
    <ca574>   DW_AT_sibling     : <0xca5ba>
 <4><ca578>: Abbrev Number: 25 (DW_TAG_variable)
    <ca579>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <ca57d>   DW_AT_decl_file   : 1
    <ca57d>   DW_AT_decl_line   : 82
    <ca57e>   DW_AT_decl_column : 19
    <ca57f>   DW_AT_type        : <0xc9839>
    <ca583>   DW_AT_location    : 0x8c8 (location list)
    <ca587>   DW_AT_GNU_locviews: 0x8c6
 <4><ca58b>: Abbrev Number: 27 (DW_TAG_variable)
    <ca58c>   DW_AT_name        : fps
    <ca590>   DW_AT_decl_file   : 1
    <ca590>   DW_AT_decl_line   : 83
    <ca591>   DW_AT_decl_column : 19
    <ca592>   DW_AT_type        : <0xc9839>
    <ca596>   DW_AT_location    : 0x8d2 (location list)
    <ca59a>   DW_AT_GNU_locviews: 0x8d0
 <4><ca59e>: Abbrev Number: 13 (DW_TAG_call_site)
    <ca59f>   DW_AT_call_return_pc: 0x9cf610
    <ca5a7>   DW_AT_call_origin : <0xca44d>
 <5><ca5ab>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca5ac>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca5ae>   DW_AT_call_value  : 9 byte block: 3 18 ba a3 0 0 0 0 0 	(DW_OP_addr: a3ba18)
 <5><ca5b8>: Abbrev Number: 0
 <4><ca5b9>: Abbrev Number: 0
 <3><ca5ba>: Abbrev Number: 13 (DW_TAG_call_site)
    <ca5bb>   DW_AT_call_return_pc: 0x9cf544
    <ca5c3>   DW_AT_call_origin : <0xca46a>
 <4><ca5c7>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca5c8>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca5ca>   DW_AT_call_value  : 3 byte block: a bc 2 	(DW_OP_const2u: 700)
 <4><ca5ce>: Abbrev Number: 0
 <3><ca5cf>: Abbrev Number: 0
 <2><ca5d0>: Abbrev Number: 28 (DW_TAG_call_site)
    <ca5d1>   DW_AT_call_return_pc: 0x9cf50d
    <ca5d9>   DW_AT_call_origin : <0xca498>
 <2><ca5dd>: Abbrev Number: 28 (DW_TAG_call_site)
    <ca5de>   DW_AT_call_return_pc: 0x9cf530
    <ca5e6>   DW_AT_call_origin : <0xca481>
 <2><ca5ea>: Abbrev Number: 22 (DW_TAG_call_site)
    <ca5eb>   DW_AT_call_return_pc: 0x9cf585
    <ca5f3>   DW_AT_call_origin : <0xca4a1>
    <ca5f7>   DW_AT_sibling     : <0xca616>
 <3><ca5fb>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca5fc>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca5fe>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><ca608>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca609>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca60b>   DW_AT_call_value  : 9 byte block: 3 f0 b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9f0)
 <3><ca615>: Abbrev Number: 0
 <2><ca616>: Abbrev Number: 13 (DW_TAG_call_site)
    <ca617>   DW_AT_call_return_pc: 0x9cf5b5
    <ca61f>   DW_AT_call_origin : <0xca4a1>
 <3><ca623>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca624>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca626>   DW_AT_call_value  : 9 byte block: 3 a0 b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9a0)
 <3><ca630>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca631>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca633>   DW_AT_call_value  : 9 byte block: 3 f0 b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9f0)
 <3><ca63d>: Abbrev Number: 0
 <2><ca63e>: Abbrev Number: 0
 <1><ca63f>: Abbrev Number: 46 (DW_TAG_subprogram)
    <ca640>   DW_AT_external    : 1
    <ca640>   DW_AT_name        : (indirect string, offset: 0x64553): glutPostRedisplay
    <ca644>   DW_AT_decl_file   : 1
    <ca645>   DW_AT_decl_line   : 39
    <ca646>   DW_AT_decl_column : 17
    <ca647>   DW_AT_prototyped  : 1
    <ca647>   DW_AT_low_pc      : 0x9cf480
    <ca64f>   DW_AT_high_pc     : 0x6c
    <ca657>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ca659>   DW_AT_call_all_calls: 1
 <2><ca659>: Abbrev Number: 22 (DW_TAG_call_site)
    <ca65a>   DW_AT_call_return_pc: 0x9cf4bd
    <ca662>   DW_AT_call_origin : <0xca4a1>
    <ca666>   DW_AT_sibling     : <0xca685>
 <3><ca66a>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca66b>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca66d>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><ca677>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca678>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca67a>   DW_AT_call_value  : 9 byte block: 3 de b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9de)
 <3><ca684>: Abbrev Number: 0
 <2><ca685>: Abbrev Number: 13 (DW_TAG_call_site)
    <ca686>   DW_AT_call_return_pc: 0x9cf4dc
    <ca68e>   DW_AT_call_origin : <0xca4a1>
 <3><ca692>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca693>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <ca695>   DW_AT_call_value  : 9 byte block: 3 a0 b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9a0)
 <3><ca69f>: Abbrev Number: 8 (DW_TAG_call_site_parameter)
    <ca6a0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <ca6a2>   DW_AT_call_value  : 9 byte block: 3 de b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9de)
 <3><ca6ac>: Abbrev Number: 0
 <2><ca6ad>: Abbrev Number: 0
 <1><ca6ae>: Abbrev Number: 0
  Compilation Unit @ offset 0xca6af:
   Length:        0x2655 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x2107
   Pointer Size:  8
 <0><ca6bb>: Abbrev Number: 58 (DW_TAG_compile_unit)
    <ca6bc>   DW_AT_producer    : (indirect string, offset: 0x8e3e7): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O2
    <ca6c0>   DW_AT_language    : 29	(C11)
    <ca6c1>   DW_AT_name        : (indirect line string, offset: 0x195d): ../../src/freeglut_init.c
    <ca6c5>   DW_AT_comp_dir    : (indirect line string, offset: 0x18af): /home/main/qb64/internal/c/parts/core/os/lnx
    <ca6c9>   DW_AT_low_pc      : 0x9cf670
    <ca6d1>   DW_AT_high_pc     : 0xcf8
    <ca6d9>   DW_AT_stmt_list   : 0x29724d
 <1><ca6dd>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca6de>   DW_AT_byte_size   : 4
    <ca6df>   DW_AT_encoding    : 7	(unsigned)
    <ca6e0>   DW_AT_name        : (indirect string, offset: 0x21686): unsigned int
 <1><ca6e4>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca6e5>   DW_AT_name        : (indirect string, offset: 0x7ffc7): GLboolean
    <ca6e9>   DW_AT_decl_file   : 2
    <ca6ea>   DW_AT_decl_line   : 117
    <ca6eb>   DW_AT_decl_column : 23
    <ca6ec>   DW_AT_type        : <0xca6f0>
 <1><ca6f0>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca6f1>   DW_AT_byte_size   : 1
    <ca6f2>   DW_AT_encoding    : 8	(unsigned char)
    <ca6f3>   DW_AT_name        : (indirect string, offset: 0x26886): unsigned char
 <1><ca6f7>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca6f8>   DW_AT_byte_size   : 1
    <ca6f9>   DW_AT_encoding    : 6	(signed char)
    <ca6fa>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><ca6fe>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca6ff>   DW_AT_byte_size   : 2
    <ca700>   DW_AT_encoding    : 5	(signed)
    <ca701>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><ca705>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca706>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <ca70a>   DW_AT_decl_file   : 2
    <ca70b>   DW_AT_decl_line   : 122
    <ca70c>   DW_AT_decl_column : 14
    <ca70d>   DW_AT_type        : <0xca711>
 <1><ca711>: Abbrev Number: 59 (DW_TAG_base_type)
    <ca712>   DW_AT_byte_size   : 4
    <ca713>   DW_AT_encoding    : 5	(signed)
    <ca714>   DW_AT_name        : int
 <1><ca718>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca719>   DW_AT_byte_size   : 2
    <ca71a>   DW_AT_encoding    : 7	(unsigned)
    <ca71b>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><ca71f>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca720>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <ca724>   DW_AT_decl_file   : 2
    <ca725>   DW_AT_decl_line   : 125
    <ca726>   DW_AT_decl_column : 22
    <ca727>   DW_AT_type        : <0xca6dd>
 <1><ca72b>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca72c>   DW_AT_byte_size   : 4
    <ca72d>   DW_AT_encoding    : 4	(float)
    <ca72e>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><ca732>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca733>   DW_AT_byte_size   : 8
    <ca734>   DW_AT_encoding    : 4	(float)
    <ca735>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><ca739>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca73a>   DW_AT_byte_size   : 8
    <ca73b>   DW_AT_encoding    : 7	(unsigned)
    <ca73c>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><ca740>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca741>   DW_AT_byte_size   : 8
    <ca742>   DW_AT_encoding    : 5	(signed)
    <ca743>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><ca747>: Abbrev Number: 60 (DW_TAG_pointer_type)
    <ca748>   DW_AT_byte_size   : 8
 <1><ca749>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca74a>   DW_AT_byte_size   : 8
    <ca74a>   DW_AT_type        : <0xca753>
 <1><ca74e>: Abbrev Number: 47 (DW_TAG_restrict_type)
    <ca74f>   DW_AT_type        : <0xca749>
 <1><ca753>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca754>   DW_AT_byte_size   : 1
    <ca755>   DW_AT_encoding    : 6	(signed char)
    <ca756>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><ca75a>: Abbrev Number: 48 (DW_TAG_const_type)
    <ca75b>   DW_AT_type        : <0xca753>
 <1><ca75f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca760>   DW_AT_byte_size   : 8
    <ca760>   DW_AT_type        : <0xca764>
 <1><ca764>: Abbrev Number: 61 (DW_TAG_const_type)
 <1><ca765>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca766>   DW_AT_byte_size   : 8
    <ca766>   DW_AT_type        : <0xca76a>
 <1><ca76a>: Abbrev Number: 62 (DW_TAG_subroutine_type)
    <ca76b>   DW_AT_prototyped  : 1
 <1><ca76b>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca76c>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <ca770>   DW_AT_decl_file   : 3
    <ca771>   DW_AT_decl_line   : 209
    <ca772>   DW_AT_decl_column : 23
    <ca773>   DW_AT_type        : <0xca739>
 <1><ca777>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca778>   DW_AT_byte_size   : 8
    <ca779>   DW_AT_encoding    : 5	(signed)
    <ca77a>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><ca77e>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca77f>   DW_AT_byte_size   : 8
    <ca780>   DW_AT_encoding    : 7	(unsigned)
    <ca781>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><ca785>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca786>   DW_AT_byte_size   : 8
    <ca786>   DW_AT_type        : <0xca78a>
 <1><ca78a>: Abbrev Number: 63 (DW_TAG_subroutine_type)
    <ca78b>   DW_AT_sibling     : <0xca791>
 <2><ca78f>: Abbrev Number: 30 (DW_TAG_unspecified_parameters)
 <2><ca790>: Abbrev Number: 0
 <1><ca791>: Abbrev Number: 64 (DW_TAG_structure_type)
    <ca792>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <ca796>   DW_AT_byte_size   : 24
    <ca797>   DW_AT_decl_file   : 4
    <ca798>   DW_AT_decl_line   : 0
    <ca799>   DW_AT_sibling     : <0xca7c6>
 <2><ca79d>: Abbrev Number: 31 (DW_TAG_member)
    <ca79e>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <ca7a2>   DW_AT_decl_file   : 4
    <ca7a2>   DW_AT_decl_line   : 0
    <ca7a2>   DW_AT_type        : <0xca6dd>
    <ca7a6>   DW_AT_data_member_location: 0
 <2><ca7a7>: Abbrev Number: 31 (DW_TAG_member)
    <ca7a8>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <ca7ac>   DW_AT_decl_file   : 4
    <ca7ac>   DW_AT_decl_line   : 0
    <ca7ac>   DW_AT_type        : <0xca6dd>
    <ca7b0>   DW_AT_data_member_location: 4
 <2><ca7b1>: Abbrev Number: 31 (DW_TAG_member)
    <ca7b2>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <ca7b6>   DW_AT_decl_file   : 4
    <ca7b6>   DW_AT_decl_line   : 0
    <ca7b6>   DW_AT_type        : <0xca747>
    <ca7ba>   DW_AT_data_member_location: 8
 <2><ca7bb>: Abbrev Number: 31 (DW_TAG_member)
    <ca7bc>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <ca7c0>   DW_AT_decl_file   : 4
    <ca7c0>   DW_AT_decl_line   : 0
    <ca7c0>   DW_AT_type        : <0xca747>
    <ca7c4>   DW_AT_data_member_location: 16
 <2><ca7c5>: Abbrev Number: 0
 <1><ca7c6>: Abbrev Number: 49 (DW_TAG_typedef)
    <ca7c7>   DW_AT_name        : XID
    <ca7cb>   DW_AT_decl_file   : 5
    <ca7cc>   DW_AT_decl_line   : 66
    <ca7cd>   DW_AT_decl_column : 23
    <ca7ce>   DW_AT_type        : <0xca739>
 <1><ca7d2>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca7d3>   DW_AT_name        : (indirect string, offset: 0x6eb27): Atom
    <ca7d7>   DW_AT_decl_file   : 5
    <ca7d8>   DW_AT_decl_line   : 74
    <ca7d9>   DW_AT_decl_column : 23
    <ca7da>   DW_AT_type        : <0xca739>
 <1><ca7de>: Abbrev Number: 48 (DW_TAG_const_type)
    <ca7df>   DW_AT_type        : <0xca7d2>
 <1><ca7e3>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca7e4>   DW_AT_name        : (indirect string, offset: 0x7c79a): VisualID
    <ca7e8>   DW_AT_decl_file   : 5
    <ca7e9>   DW_AT_decl_line   : 76
    <ca7ea>   DW_AT_decl_column : 23
    <ca7eb>   DW_AT_type        : <0xca739>
 <1><ca7ef>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca7f0>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <ca7f4>   DW_AT_decl_file   : 5
    <ca7f5>   DW_AT_decl_line   : 96
    <ca7f6>   DW_AT_decl_column : 13
    <ca7f7>   DW_AT_type        : <0xca7c6>
 <1><ca7fb>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca7fc>   DW_AT_name        : (indirect string, offset: 0x90395): Colormap
    <ca800>   DW_AT_decl_file   : 5
    <ca801>   DW_AT_decl_line   : 104
    <ca802>   DW_AT_decl_column : 13
    <ca803>   DW_AT_type        : <0xca7c6>
 <1><ca807>: Abbrev Number: 14 (DW_TAG_base_type)
    <ca808>   DW_AT_byte_size   : 16
    <ca809>   DW_AT_encoding    : 4	(float)
    <ca80a>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><ca80e>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca80f>   DW_AT_name        : (indirect string, offset: 0x7030a): XPointer
    <ca813>   DW_AT_decl_file   : 6
    <ca814>   DW_AT_decl_line   : 80
    <ca815>   DW_AT_decl_column : 15
    <ca816>   DW_AT_type        : <0xca749>
 <1><ca81a>: Abbrev Number: 65 (DW_TAG_structure_type)
    <ca81b>   DW_AT_name        : (indirect string, offset: 0x7fc01): _XExtData
    <ca81f>   DW_AT_byte_size   : 32
    <ca820>   DW_AT_decl_file   : 6
    <ca821>   DW_AT_decl_line   : 148
    <ca822>   DW_AT_decl_column : 16
    <ca823>   DW_AT_sibling     : <0xca858>
 <2><ca827>: Abbrev Number: 11 (DW_TAG_member)
    <ca828>   DW_AT_name        : (indirect string, offset: 0x8f519): number
    <ca82c>   DW_AT_decl_file   : 6
    <ca82c>   DW_AT_decl_line   : 149
    <ca82d>   DW_AT_decl_column : 6
    <ca82e>   DW_AT_type        : <0xca711>
    <ca832>   DW_AT_data_member_location: 0
 <2><ca833>: Abbrev Number: 11 (DW_TAG_member)
    <ca834>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <ca838>   DW_AT_decl_file   : 6
    <ca838>   DW_AT_decl_line   : 150
    <ca839>   DW_AT_decl_column : 20
    <ca83a>   DW_AT_type        : <0xca858>
    <ca83e>   DW_AT_data_member_location: 8
 <2><ca83f>: Abbrev Number: 11 (DW_TAG_member)
    <ca840>   DW_AT_name        : (indirect string, offset: 0x8b0b7): free_private
    <ca844>   DW_AT_decl_file   : 6
    <ca844>   DW_AT_decl_line   : 151
    <ca845>   DW_AT_decl_column : 8
    <ca846>   DW_AT_type        : <0xca86c>
    <ca84a>   DW_AT_data_member_location: 16
 <2><ca84b>: Abbrev Number: 11 (DW_TAG_member)
    <ca84c>   DW_AT_name        : (indirect string, offset: 0x6bca1): private_data
    <ca850>   DW_AT_decl_file   : 6
    <ca850>   DW_AT_decl_line   : 154
    <ca851>   DW_AT_decl_column : 11
    <ca852>   DW_AT_type        : <0xca80e>
    <ca856>   DW_AT_data_member_location: 24
 <2><ca857>: Abbrev Number: 0
 <1><ca858>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca859>   DW_AT_byte_size   : 8
    <ca859>   DW_AT_type        : <0xca81a>
 <1><ca85d>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <ca85e>   DW_AT_prototyped  : 1
    <ca85e>   DW_AT_type        : <0xca711>
    <ca862>   DW_AT_sibling     : <0xca86c>
 <2><ca866>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ca867>   DW_AT_type        : <0xca858>
 <2><ca86b>: Abbrev Number: 0
 <1><ca86c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca86d>   DW_AT_byte_size   : 8
    <ca86d>   DW_AT_type        : <0xca85d>
 <1><ca871>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca872>   DW_AT_name        : (indirect string, offset: 0x7fc02): XExtData
    <ca876>   DW_AT_decl_file   : 6
    <ca877>   DW_AT_decl_line   : 155
    <ca878>   DW_AT_decl_column : 3
    <ca879>   DW_AT_type        : <0xca81a>
 <1><ca87d>: Abbrev Number: 49 (DW_TAG_typedef)
    <ca87e>   DW_AT_name        : GC
    <ca881>   DW_AT_decl_file   : 6
    <ca882>   DW_AT_decl_line   : 222
    <ca883>   DW_AT_decl_column : 2
    <ca884>   DW_AT_type        : <0xca888>
 <1><ca888>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca889>   DW_AT_byte_size   : 8
    <ca889>   DW_AT_type        : <0xca88d>
 <1><ca88d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ca88e>   DW_AT_name        : (indirect string, offset: 0x8e99c): _XGC
    <ca892>   DW_AT_declaration : 1
 <1><ca892>: Abbrev Number: 50 (DW_TAG_structure_type)
    <ca893>   DW_AT_byte_size   : 56
    <ca894>   DW_AT_decl_file   : 6
    <ca894>   DW_AT_decl_line   : 227
    <ca895>   DW_AT_decl_column : 9
    <ca895>   DW_AT_sibling     : <0xca8fa>
 <2><ca899>: Abbrev Number: 11 (DW_TAG_member)
    <ca89a>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <ca89e>   DW_AT_decl_file   : 6
    <ca89e>   DW_AT_decl_line   : 228
    <ca89f>   DW_AT_decl_column : 12
    <ca8a0>   DW_AT_type        : <0xca8fa>
    <ca8a4>   DW_AT_data_member_location: 0
 <2><ca8a5>: Abbrev Number: 11 (DW_TAG_member)
    <ca8a6>   DW_AT_name        : (indirect string, offset: 0x6994f): visualid
    <ca8aa>   DW_AT_decl_file   : 6
    <ca8aa>   DW_AT_decl_line   : 229
    <ca8ab>   DW_AT_decl_column : 11
    <ca8ac>   DW_AT_type        : <0xca7e3>
    <ca8b0>   DW_AT_data_member_location: 8
 <2><ca8b1>: Abbrev Number: 11 (DW_TAG_member)
    <ca8b2>   DW_AT_name        : (indirect string, offset: 0x7e4d3): class
    <ca8b6>   DW_AT_decl_file   : 6
    <ca8b6>   DW_AT_decl_line   : 233
    <ca8b7>   DW_AT_decl_column : 6
    <ca8b8>   DW_AT_type        : <0xca711>
    <ca8bc>   DW_AT_data_member_location: 16
 <2><ca8bd>: Abbrev Number: 11 (DW_TAG_member)
    <ca8be>   DW_AT_name        : (indirect string, offset: 0x86da8): red_mask
    <ca8c2>   DW_AT_decl_file   : 6
    <ca8c2>   DW_AT_decl_line   : 235
    <ca8c3>   DW_AT_decl_column : 16
    <ca8c4>   DW_AT_type        : <0xca739>
    <ca8c8>   DW_AT_data_member_location: 24
 <2><ca8c9>: Abbrev Number: 11 (DW_TAG_member)
    <ca8ca>   DW_AT_name        : (indirect string, offset: 0x6943c): green_mask
    <ca8ce>   DW_AT_decl_file   : 6
    <ca8ce>   DW_AT_decl_line   : 235
    <ca8cf>   DW_AT_decl_column : 26
    <ca8d0>   DW_AT_type        : <0xca739>
    <ca8d4>   DW_AT_data_member_location: 32
 <2><ca8d5>: Abbrev Number: 11 (DW_TAG_member)
    <ca8d6>   DW_AT_name        : (indirect string, offset: 0x679ce): blue_mask
    <ca8da>   DW_AT_decl_file   : 6
    <ca8da>   DW_AT_decl_line   : 235
    <ca8db>   DW_AT_decl_column : 38
    <ca8dc>   DW_AT_type        : <0xca739>
    <ca8e0>   DW_AT_data_member_location: 40
 <2><ca8e1>: Abbrev Number: 11 (DW_TAG_member)
    <ca8e2>   DW_AT_name        : (indirect string, offset: 0x88e77): bits_per_rgb
    <ca8e6>   DW_AT_decl_file   : 6
    <ca8e6>   DW_AT_decl_line   : 236
    <ca8e7>   DW_AT_decl_column : 6
    <ca8e8>   DW_AT_type        : <0xca711>
    <ca8ec>   DW_AT_data_member_location: 48
 <2><ca8ed>: Abbrev Number: 11 (DW_TAG_member)
    <ca8ee>   DW_AT_name        : (indirect string, offset: 0x85773): map_entries
    <ca8f2>   DW_AT_decl_file   : 6
    <ca8f2>   DW_AT_decl_line   : 237
    <ca8f3>   DW_AT_decl_column : 6
    <ca8f4>   DW_AT_type        : <0xca711>
    <ca8f8>   DW_AT_data_member_location: 52
 <2><ca8f9>: Abbrev Number: 0
 <1><ca8fa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca8fb>   DW_AT_byte_size   : 8
    <ca8fb>   DW_AT_type        : <0xca871>
 <1><ca8ff>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca900>   DW_AT_name        : (indirect string, offset: 0x8721d): Visual
    <ca904>   DW_AT_decl_file   : 6
    <ca905>   DW_AT_decl_line   : 238
    <ca906>   DW_AT_decl_column : 3
    <ca907>   DW_AT_type        : <0xca892>
 <1><ca90b>: Abbrev Number: 50 (DW_TAG_structure_type)
    <ca90c>   DW_AT_byte_size   : 16
    <ca90d>   DW_AT_decl_file   : 6
    <ca90d>   DW_AT_decl_line   : 243
    <ca90e>   DW_AT_decl_column : 9
    <ca90e>   DW_AT_sibling     : <0xca937>
 <2><ca912>: Abbrev Number: 11 (DW_TAG_member)
    <ca913>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <ca917>   DW_AT_decl_file   : 6
    <ca917>   DW_AT_decl_line   : 244
    <ca918>   DW_AT_decl_column : 6
    <ca919>   DW_AT_type        : <0xca711>
    <ca91d>   DW_AT_data_member_location: 0
 <2><ca91e>: Abbrev Number: 11 (DW_TAG_member)
    <ca91f>   DW_AT_name        : (indirect string, offset: 0x8ee30): nvisuals
    <ca923>   DW_AT_decl_file   : 6
    <ca923>   DW_AT_decl_line   : 245
    <ca924>   DW_AT_decl_column : 6
    <ca925>   DW_AT_type        : <0xca711>
    <ca929>   DW_AT_data_member_location: 4
 <2><ca92a>: Abbrev Number: 11 (DW_TAG_member)
    <ca92b>   DW_AT_name        : (indirect string, offset: 0x8ee31): visuals
    <ca92f>   DW_AT_decl_file   : 6
    <ca92f>   DW_AT_decl_line   : 246
    <ca930>   DW_AT_decl_column : 10
    <ca931>   DW_AT_type        : <0xca937>
    <ca935>   DW_AT_data_member_location: 8
 <2><ca936>: Abbrev Number: 0
 <1><ca937>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <ca938>   DW_AT_byte_size   : 8
    <ca938>   DW_AT_type        : <0xca8ff>
 <1><ca93c>: Abbrev Number: 9 (DW_TAG_typedef)
    <ca93d>   DW_AT_name        : (indirect string, offset: 0x8e26c): Depth
    <ca941>   DW_AT_decl_file   : 6
    <ca942>   DW_AT_decl_line   : 247
    <ca943>   DW_AT_decl_column : 3
    <ca944>   DW_AT_type        : <0xca90b>
 <1><ca948>: Abbrev Number: 51 (DW_TAG_structure_type)
    <ca949>   DW_AT_byte_size   : 128
    <ca94a>   DW_AT_decl_file   : 6
    <ca94a>   DW_AT_decl_line   : 257
    <ca94c>   DW_AT_decl_column : 9
    <ca94c>   DW_AT_sibling     : <0xcaa69>
 <2><ca950>: Abbrev Number: 1 (DW_TAG_member)
    <ca951>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <ca955>   DW_AT_decl_file   : 6
    <ca956>   DW_AT_decl_line   : 258
    <ca958>   DW_AT_decl_column : 12
    <ca959>   DW_AT_type        : <0xca8fa>
    <ca95d>   DW_AT_data_member_location: 0
 <2><ca95e>: Abbrev Number: 1 (DW_TAG_member)
    <ca95f>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <ca963>   DW_AT_decl_file   : 6
    <ca964>   DW_AT_decl_line   : 259
    <ca966>   DW_AT_decl_column : 20
    <ca967>   DW_AT_type        : <0xcaa6e>
    <ca96b>   DW_AT_data_member_location: 8
 <2><ca96c>: Abbrev Number: 1 (DW_TAG_member)
    <ca96d>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <ca971>   DW_AT_decl_file   : 6
    <ca972>   DW_AT_decl_line   : 260
    <ca974>   DW_AT_decl_column : 9
    <ca975>   DW_AT_type        : <0xca7ef>
    <ca979>   DW_AT_data_member_location: 16
 <2><ca97a>: Abbrev Number: 1 (DW_TAG_member)
    <ca97b>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <ca97f>   DW_AT_decl_file   : 6
    <ca980>   DW_AT_decl_line   : 261
    <ca982>   DW_AT_decl_column : 6
    <ca983>   DW_AT_type        : <0xca711>
    <ca987>   DW_AT_data_member_location: 24
 <2><ca988>: Abbrev Number: 1 (DW_TAG_member)
    <ca989>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <ca98d>   DW_AT_decl_file   : 6
    <ca98e>   DW_AT_decl_line   : 261
    <ca990>   DW_AT_decl_column : 13
    <ca991>   DW_AT_type        : <0xca711>
    <ca995>   DW_AT_data_member_location: 28
 <2><ca996>: Abbrev Number: 1 (DW_TAG_member)
    <ca997>   DW_AT_name        : (indirect string, offset: 0x8ef5b): mwidth
    <ca99b>   DW_AT_decl_file   : 6
    <ca99c>   DW_AT_decl_line   : 262
    <ca99e>   DW_AT_decl_column : 6
    <ca99f>   DW_AT_type        : <0xca711>
    <ca9a3>   DW_AT_data_member_location: 32
 <2><ca9a4>: Abbrev Number: 1 (DW_TAG_member)
    <ca9a5>   DW_AT_name        : (indirect string, offset: 0x8ec40): mheight
    <ca9a9>   DW_AT_decl_file   : 6
    <ca9aa>   DW_AT_decl_line   : 262
    <ca9ac>   DW_AT_decl_column : 14
    <ca9ad>   DW_AT_type        : <0xca711>
    <ca9b1>   DW_AT_data_member_location: 36
 <2><ca9b2>: Abbrev Number: 1 (DW_TAG_member)
    <ca9b3>   DW_AT_name        : (indirect string, offset: 0x8ed65): ndepths
    <ca9b7>   DW_AT_decl_file   : 6
    <ca9b8>   DW_AT_decl_line   : 263
    <ca9ba>   DW_AT_decl_column : 6
    <ca9bb>   DW_AT_type        : <0xca711>
    <ca9bf>   DW_AT_data_member_location: 40
 <2><ca9c0>: Abbrev Number: 1 (DW_TAG_member)
    <ca9c1>   DW_AT_name        : (indirect string, offset: 0x8ed66): depths
    <ca9c5>   DW_AT_decl_file   : 6
    <ca9c6>   DW_AT_decl_line   : 264
    <ca9c8>   DW_AT_decl_column : 9
    <ca9c9>   DW_AT_type        : <0xcaa73>
    <ca9cd>   DW_AT_data_member_location: 48
 <2><ca9ce>: Abbrev Number: 1 (DW_TAG_member)
    <ca9cf>   DW_AT_name        : (indirect string, offset: 0x8ea6b): root_depth
    <ca9d3>   DW_AT_decl_file   : 6
    <ca9d4>   DW_AT_decl_line   : 265
    <ca9d6>   DW_AT_decl_column : 6
    <ca9d7>   DW_AT_type        : <0xca711>
    <ca9db>   DW_AT_data_member_location: 56
 <2><ca9dc>: Abbrev Number: 1 (DW_TAG_member)
    <ca9dd>   DW_AT_name        : (indirect string, offset: 0x8ebbe): root_visual
    <ca9e1>   DW_AT_decl_file   : 6
    <ca9e2>   DW_AT_decl_line   : 266
    <ca9e4>   DW_AT_decl_column : 10
    <ca9e5>   DW_AT_type        : <0xca937>
    <ca9e9>   DW_AT_data_member_location: 64
 <2><ca9ea>: Abbrev Number: 1 (DW_TAG_member)
    <ca9eb>   DW_AT_name        : (indirect string, offset: 0x8ed1a): default_gc
    <ca9ef>   DW_AT_decl_file   : 6
    <ca9f0>   DW_AT_decl_line   : 267
    <ca9f2>   DW_AT_decl_column : 5
    <ca9f3>   DW_AT_type        : <0xca87d>
    <ca9f7>   DW_AT_data_member_location: 72
 <2><ca9f8>: Abbrev Number: 1 (DW_TAG_member)
    <ca9f9>   DW_AT_name        : (indirect string, offset: 0x8ebf6): cmap
    <ca9fd>   DW_AT_decl_file   : 6
    <ca9fe>   DW_AT_decl_line   : 268
    <caa00>   DW_AT_decl_column : 11
    <caa01>   DW_AT_type        : <0xca7fb>
    <caa05>   DW_AT_data_member_location: 80
 <2><caa06>: Abbrev Number: 1 (DW_TAG_member)
    <caa07>   DW_AT_name        : (indirect string, offset: 0x8edfe): white_pixel
    <caa0b>   DW_AT_decl_file   : 6
    <caa0c>   DW_AT_decl_line   : 269
    <caa0e>   DW_AT_decl_column : 16
    <caa0f>   DW_AT_type        : <0xca739>
    <caa13>   DW_AT_data_member_location: 88
 <2><caa14>: Abbrev Number: 1 (DW_TAG_member)
    <caa15>   DW_AT_name        : (indirect string, offset: 0x8ae26): black_pixel
    <caa19>   DW_AT_decl_file   : 6
    <caa1a>   DW_AT_decl_line   : 270
    <caa1c>   DW_AT_decl_column : 16
    <caa1d>   DW_AT_type        : <0xca739>
    <caa21>   DW_AT_data_member_location: 96
 <2><caa22>: Abbrev Number: 1 (DW_TAG_member)
    <caa23>   DW_AT_name        : (indirect string, offset: 0x8ec81): max_maps
    <caa27>   DW_AT_decl_file   : 6
    <caa28>   DW_AT_decl_line   : 271
    <caa2a>   DW_AT_decl_column : 6
    <caa2b>   DW_AT_type        : <0xca711>
    <caa2f>   DW_AT_data_member_location: 104
 <2><caa30>: Abbrev Number: 1 (DW_TAG_member)
    <caa31>   DW_AT_name        : (indirect string, offset: 0x8ee27): min_maps
    <caa35>   DW_AT_decl_file   : 6
    <caa36>   DW_AT_decl_line   : 271
    <caa38>   DW_AT_decl_column : 16
    <caa39>   DW_AT_type        : <0xca711>
    <caa3d>   DW_AT_data_member_location: 108
 <2><caa3e>: Abbrev Number: 1 (DW_TAG_member)
    <caa3f>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <caa43>   DW_AT_decl_file   : 6
    <caa44>   DW_AT_decl_line   : 272
    <caa46>   DW_AT_decl_column : 6
    <caa47>   DW_AT_type        : <0xca711>
    <caa4b>   DW_AT_data_member_location: 112
 <2><caa4c>: Abbrev Number: 1 (DW_TAG_member)
    <caa4d>   DW_AT_name        : (indirect string, offset: 0x8eb52): save_unders
    <caa51>   DW_AT_decl_file   : 6
    <caa52>   DW_AT_decl_line   : 273
    <caa54>   DW_AT_decl_column : 7
    <caa55>   DW_AT_type        : <0xca711>
    <caa59>   DW_AT_data_member_location: 116
 <2><caa5a>: Abbrev Number: 1 (DW_TAG_member)
    <caa5b>   DW_AT_name        : (indirect string, offset: 0x8ea5b): root_input_mask
    <caa5f>   DW_AT_decl_file   : 6
    <caa60>   DW_AT_decl_line   : 274
    <caa62>   DW_AT_decl_column : 7
    <caa63>   DW_AT_type        : <0xca740>
    <caa67>   DW_AT_data_member_location: 120
 <2><caa68>: Abbrev Number: 0
 <1><caa69>: Abbrev Number: 24 (DW_TAG_structure_type)
    <caa6a>   DW_AT_name        : (indirect string, offset: 0x8bb46): _XDisplay
    <caa6e>   DW_AT_declaration : 1
 <1><caa6e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <caa6f>   DW_AT_byte_size   : 8
    <caa6f>   DW_AT_type        : <0xcaa69>
 <1><caa73>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <caa74>   DW_AT_byte_size   : 8
    <caa74>   DW_AT_type        : <0xca93c>
 <1><caa78>: Abbrev Number: 7 (DW_TAG_typedef)
    <caa79>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <caa7d>   DW_AT_decl_file   : 6
    <caa7e>   DW_AT_decl_line   : 275
    <caa80>   DW_AT_decl_column : 3
    <caa81>   DW_AT_type        : <0xca948>
 <1><caa85>: Abbrev Number: 51 (DW_TAG_structure_type)
    <caa86>   DW_AT_byte_size   : 24
    <caa87>   DW_AT_decl_file   : 6
    <caa87>   DW_AT_decl_line   : 280
    <caa89>   DW_AT_decl_column : 9
    <caa89>   DW_AT_sibling     : <0xcaac6>
 <2><caa8d>: Abbrev Number: 1 (DW_TAG_member)
    <caa8e>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <caa92>   DW_AT_decl_file   : 6
    <caa93>   DW_AT_decl_line   : 281
    <caa95>   DW_AT_decl_column : 12
    <caa96>   DW_AT_type        : <0xca8fa>
    <caa9a>   DW_AT_data_member_location: 0
 <2><caa9b>: Abbrev Number: 1 (DW_TAG_member)
    <caa9c>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <caaa0>   DW_AT_decl_file   : 6
    <caaa1>   DW_AT_decl_line   : 282
    <caaa3>   DW_AT_decl_column : 6
    <caaa4>   DW_AT_type        : <0xca711>
    <caaa8>   DW_AT_data_member_location: 8
 <2><caaa9>: Abbrev Number: 1 (DW_TAG_member)
    <caaaa>   DW_AT_name        : (indirect string, offset: 0x6313a): bits_per_pixel
    <caaae>   DW_AT_decl_file   : 6
    <caaaf>   DW_AT_decl_line   : 283
    <caab1>   DW_AT_decl_column : 6
    <caab2>   DW_AT_type        : <0xca711>
    <caab6>   DW_AT_data_member_location: 12
 <2><caab7>: Abbrev Number: 1 (DW_TAG_member)
    <caab8>   DW_AT_name        : (indirect string, offset: 0x8edf1): scanline_pad
    <caabc>   DW_AT_decl_file   : 6
    <caabd>   DW_AT_decl_line   : 284
    <caabf>   DW_AT_decl_column : 6
    <caac0>   DW_AT_type        : <0xca711>
    <caac4>   DW_AT_data_member_location: 16
 <2><caac5>: Abbrev Number: 0
 <1><caac6>: Abbrev Number: 7 (DW_TAG_typedef)
    <caac7>   DW_AT_name        : (indirect string, offset: 0x8ebb1): ScreenFormat
    <caacb>   DW_AT_decl_file   : 6
    <caacc>   DW_AT_decl_line   : 285
    <caace>   DW_AT_decl_column : 3
    <caacf>   DW_AT_type        : <0xcaa85>
 <1><caad3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <caad4>   DW_AT_byte_size   : 8
    <caad4>   DW_AT_type        : <0xcaa78>
 <1><caad8>: Abbrev Number: 7 (DW_TAG_typedef)
    <caad9>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <caadd>   DW_AT_decl_file   : 6
    <caade>   DW_AT_decl_line   : 487
    <caae0>   DW_AT_decl_column : 26
    <caae1>   DW_AT_type        : <0xcaa69>
 <1><caae5>: Abbrev Number: 66 (DW_TAG_structure_type)
    <caae6>   DW_AT_byte_size   : 296
    <caae8>   DW_AT_decl_file   : 6
    <caae9>   DW_AT_decl_line   : 493
    <caaeb>   DW_AT_decl_column : 9
    <caaec>   DW_AT_sibling     : <0xcad5d>
 <2><caaf0>: Abbrev Number: 1 (DW_TAG_member)
    <caaf1>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <caaf5>   DW_AT_decl_file   : 6
    <caaf6>   DW_AT_decl_line   : 498
    <caaf8>   DW_AT_decl_column : 12
    <caaf9>   DW_AT_type        : <0xca8fa>
    <caafd>   DW_AT_data_member_location: 0
 <2><caafe>: Abbrev Number: 1 (DW_TAG_member)
    <caaff>   DW_AT_name        : (indirect string, offset: 0x8eabf): private1
    <cab03>   DW_AT_decl_file   : 6
    <cab04>   DW_AT_decl_line   : 499
    <cab06>   DW_AT_decl_column : 20
    <cab07>   DW_AT_type        : <0xcad62>
    <cab0b>   DW_AT_data_member_location: 8
 <2><cab0c>: Abbrev Number: 18 (DW_TAG_member)
    <cab0d>   DW_AT_name        : fd
    <cab10>   DW_AT_decl_file   : 6
    <cab11>   DW_AT_decl_line   : 500
    <cab13>   DW_AT_decl_column : 6
    <cab14>   DW_AT_type        : <0xca711>
    <cab18>   DW_AT_data_member_location: 16
 <2><cab19>: Abbrev Number: 1 (DW_TAG_member)
    <cab1a>   DW_AT_name        : (indirect string, offset: 0x8ed89): private2
    <cab1e>   DW_AT_decl_file   : 6
    <cab1f>   DW_AT_decl_line   : 501
    <cab21>   DW_AT_decl_column : 6
    <cab22>   DW_AT_type        : <0xca711>
    <cab26>   DW_AT_data_member_location: 20
 <2><cab27>: Abbrev Number: 1 (DW_TAG_member)
    <cab28>   DW_AT_name        : (indirect string, offset: 0x8ecc8): proto_major_version
    <cab2c>   DW_AT_decl_file   : 6
    <cab2d>   DW_AT_decl_line   : 502
    <cab2f>   DW_AT_decl_column : 6
    <cab30>   DW_AT_type        : <0xca711>
    <cab34>   DW_AT_data_member_location: 24
 <2><cab35>: Abbrev Number: 1 (DW_TAG_member)
    <cab36>   DW_AT_name        : (indirect string, offset: 0x8ed06): proto_minor_version
    <cab3a>   DW_AT_decl_file   : 6
    <cab3b>   DW_AT_decl_line   : 503
    <cab3d>   DW_AT_decl_column : 6
    <cab3e>   DW_AT_type        : <0xca711>
    <cab42>   DW_AT_data_member_location: 28
 <2><cab43>: Abbrev Number: 1 (DW_TAG_member)
    <cab44>   DW_AT_name        : (indirect string, offset: 0x8eb36): vendor
    <cab48>   DW_AT_decl_file   : 6
    <cab49>   DW_AT_decl_line   : 504
    <cab4b>   DW_AT_decl_column : 8
    <cab4c>   DW_AT_type        : <0xca749>
    <cab50>   DW_AT_data_member_location: 32
 <2><cab51>: Abbrev Number: 1 (DW_TAG_member)
    <cab52>   DW_AT_name        : (indirect string, offset: 0x8ed92): private3
    <cab56>   DW_AT_decl_file   : 6
    <cab57>   DW_AT_decl_line   : 505
    <cab59>   DW_AT_decl_column : 13
    <cab5a>   DW_AT_type        : <0xca7c6>
    <cab5e>   DW_AT_data_member_location: 40
 <2><cab5f>: Abbrev Number: 1 (DW_TAG_member)
    <cab60>   DW_AT_name        : (indirect string, offset: 0x8ed9b): private4
    <cab64>   DW_AT_decl_file   : 6
    <cab65>   DW_AT_decl_line   : 506
    <cab67>   DW_AT_decl_column : 6
    <cab68>   DW_AT_type        : <0xca7c6>
    <cab6c>   DW_AT_data_member_location: 48
 <2><cab6d>: Abbrev Number: 1 (DW_TAG_member)
    <cab6e>   DW_AT_name        : (indirect string, offset: 0x8ee81): private5
    <cab72>   DW_AT_decl_file   : 6
    <cab73>   DW_AT_decl_line   : 507
    <cab75>   DW_AT_decl_column : 6
    <cab76>   DW_AT_type        : <0xca7c6>
    <cab7a>   DW_AT_data_member_location: 56
 <2><cab7b>: Abbrev Number: 1 (DW_TAG_member)
    <cab7c>   DW_AT_name        : (indirect string, offset: 0x8edaf): private6
    <cab80>   DW_AT_decl_file   : 6
    <cab81>   DW_AT_decl_line   : 508
    <cab83>   DW_AT_decl_column : 6
    <cab84>   DW_AT_type        : <0xca711>
    <cab88>   DW_AT_data_member_location: 64
 <2><cab89>: Abbrev Number: 1 (DW_TAG_member)
    <cab8a>   DW_AT_name        : (indirect string, offset: 0x8eb5e): resource_alloc
    <cab8e>   DW_AT_decl_file   : 6
    <cab8f>   DW_AT_decl_line   : 509
    <cab91>   DW_AT_decl_column : 8
    <cab92>   DW_AT_type        : <0xcad76>
    <cab96>   DW_AT_data_member_location: 72
 <2><cab97>: Abbrev Number: 1 (DW_TAG_member)
    <cab98>   DW_AT_name        : (indirect string, offset: 0x8ecdc): byte_order
    <cab9c>   DW_AT_decl_file   : 6
    <cab9d>   DW_AT_decl_line   : 512
    <cab9f>   DW_AT_decl_column : 6
    <caba0>   DW_AT_type        : <0xca711>
    <caba4>   DW_AT_data_member_location: 80
 <2><caba5>: Abbrev Number: 1 (DW_TAG_member)
    <caba6>   DW_AT_name        : (indirect string, offset: 0x8ec75): bitmap_unit
    <cabaa>   DW_AT_decl_file   : 6
    <cabab>   DW_AT_decl_line   : 513
    <cabad>   DW_AT_decl_column : 6
    <cabae>   DW_AT_type        : <0xca711>
    <cabb2>   DW_AT_data_member_location: 84
 <2><cabb3>: Abbrev Number: 1 (DW_TAG_member)
    <cabb4>   DW_AT_name        : (indirect string, offset: 0x8ee60): bitmap_pad
    <cabb8>   DW_AT_decl_file   : 6
    <cabb9>   DW_AT_decl_line   : 514
    <cabbb>   DW_AT_decl_column : 6
    <cabbc>   DW_AT_type        : <0xca711>
    <cabc0>   DW_AT_data_member_location: 88
 <2><cabc1>: Abbrev Number: 1 (DW_TAG_member)
    <cabc2>   DW_AT_name        : (indirect string, offset: 0x8ea33): bitmap_bit_order
    <cabc6>   DW_AT_decl_file   : 6
    <cabc7>   DW_AT_decl_line   : 515
    <cabc9>   DW_AT_decl_column : 6
    <cabca>   DW_AT_type        : <0xca711>
    <cabce>   DW_AT_data_member_location: 92
 <2><cabcf>: Abbrev Number: 1 (DW_TAG_member)
    <cabd0>   DW_AT_name        : (indirect string, offset: 0x8eddc): nformats
    <cabd4>   DW_AT_decl_file   : 6
    <cabd5>   DW_AT_decl_line   : 516
    <cabd7>   DW_AT_decl_column : 6
    <cabd8>   DW_AT_type        : <0xca711>
    <cabdc>   DW_AT_data_member_location: 96
 <2><cabdd>: Abbrev Number: 1 (DW_TAG_member)
    <cabde>   DW_AT_name        : (indirect string, offset: 0x8ec9d): pixmap_format
    <cabe2>   DW_AT_decl_file   : 6
    <cabe3>   DW_AT_decl_line   : 517
    <cabe5>   DW_AT_decl_column : 16
    <cabe6>   DW_AT_type        : <0xcad7b>
    <cabea>   DW_AT_data_member_location: 104
 <2><cabeb>: Abbrev Number: 1 (DW_TAG_member)
    <cabec>   DW_AT_name        : (indirect string, offset: 0x8edca): private8
    <cabf0>   DW_AT_decl_file   : 6
    <cabf1>   DW_AT_decl_line   : 518
    <cabf3>   DW_AT_decl_column : 6
    <cabf4>   DW_AT_type        : <0xca711>
    <cabf8>   DW_AT_data_member_location: 112
 <2><cabf9>: Abbrev Number: 1 (DW_TAG_member)
    <cabfa>   DW_AT_name        : (indirect string, offset: 0xa9ad): release
    <cabfe>   DW_AT_decl_file   : 6
    <cabff>   DW_AT_decl_line   : 519
    <cac01>   DW_AT_decl_column : 6
    <cac02>   DW_AT_type        : <0xca711>
    <cac06>   DW_AT_data_member_location: 116
 <2><cac07>: Abbrev Number: 1 (DW_TAG_member)
    <cac08>   DW_AT_name        : (indirect string, offset: 0x8edd3): private9
    <cac0c>   DW_AT_decl_file   : 6
    <cac0d>   DW_AT_decl_line   : 520
    <cac0f>   DW_AT_decl_column : 20
    <cac10>   DW_AT_type        : <0xcad62>
    <cac14>   DW_AT_data_member_location: 120
 <2><cac15>: Abbrev Number: 1 (DW_TAG_member)
    <cac16>   DW_AT_name        : (indirect string, offset: 0x8eea2): private10
    <cac1a>   DW_AT_decl_file   : 6
    <cac1b>   DW_AT_decl_line   : 520
    <cac1d>   DW_AT_decl_column : 31
    <cac1e>   DW_AT_type        : <0xcad62>
    <cac22>   DW_AT_data_member_location: 128
 <2><cac23>: Abbrev Number: 1 (DW_TAG_member)
    <cac24>   DW_AT_name        : (indirect string, offset: 0x8eb9f): qlen
    <cac28>   DW_AT_decl_file   : 6
    <cac29>   DW_AT_decl_line   : 521
    <cac2b>   DW_AT_decl_column : 6
    <cac2c>   DW_AT_type        : <0xca711>
    <cac30>   DW_AT_data_member_location: 136
 <2><cac31>: Abbrev Number: 1 (DW_TAG_member)
    <cac32>   DW_AT_name        : (indirect string, offset: 0x8ea04): last_request_read
    <cac36>   DW_AT_decl_file   : 6
    <cac37>   DW_AT_decl_line   : 522
    <cac39>   DW_AT_decl_column : 16
    <cac3a>   DW_AT_type        : <0xca739>
    <cac3e>   DW_AT_data_member_location: 144
 <2><cac3f>: Abbrev Number: 1 (DW_TAG_member)
    <cac40>   DW_AT_name        : (indirect string, offset: 0x7ad1f): request
    <cac44>   DW_AT_decl_file   : 6
    <cac45>   DW_AT_decl_line   : 523
    <cac47>   DW_AT_decl_column : 16
    <cac48>   DW_AT_type        : <0xca739>
    <cac4c>   DW_AT_data_member_location: 152
 <2><cac4d>: Abbrev Number: 1 (DW_TAG_member)
    <cac4e>   DW_AT_name        : (indirect string, offset: 0x8eeac): private11
    <cac52>   DW_AT_decl_file   : 6
    <cac53>   DW_AT_decl_line   : 524
    <cac55>   DW_AT_decl_column : 11
    <cac56>   DW_AT_type        : <0xca80e>
    <cac5a>   DW_AT_data_member_location: 160
 <2><cac5b>: Abbrev Number: 1 (DW_TAG_member)
    <cac5c>   DW_AT_name        : (indirect string, offset: 0x8eed5): private12
    <cac60>   DW_AT_decl_file   : 6
    <cac61>   DW_AT_decl_line   : 525
    <cac63>   DW_AT_decl_column : 11
    <cac64>   DW_AT_type        : <0xca80e>
    <cac68>   DW_AT_data_member_location: 168
 <2><cac69>: Abbrev Number: 1 (DW_TAG_member)
    <cac6a>   DW_AT_name        : (indirect string, offset: 0x8eedf): private13
    <cac6e>   DW_AT_decl_file   : 6
    <cac6f>   DW_AT_decl_line   : 526
    <cac71>   DW_AT_decl_column : 11
    <cac72>   DW_AT_type        : <0xca80e>
    <cac76>   DW_AT_data_member_location: 176
 <2><cac77>: Abbrev Number: 1 (DW_TAG_member)
    <cac78>   DW_AT_name        : (indirect string, offset: 0x8eee9): private14
    <cac7c>   DW_AT_decl_file   : 6
    <cac7d>   DW_AT_decl_line   : 527
    <cac7f>   DW_AT_decl_column : 11
    <cac80>   DW_AT_type        : <0xca80e>
    <cac84>   DW_AT_data_member_location: 184
 <2><cac85>: Abbrev Number: 1 (DW_TAG_member)
    <cac86>   DW_AT_name        : (indirect string, offset: 0x8e9a1): max_request_size
    <cac8a>   DW_AT_decl_file   : 6
    <cac8b>   DW_AT_decl_line   : 528
    <cac8d>   DW_AT_decl_column : 11
    <cac8e>   DW_AT_type        : <0xca6dd>
    <cac92>   DW_AT_data_member_location: 192
 <2><cac93>: Abbrev Number: 18 (DW_TAG_member)
    <cac94>   DW_AT_name        : db
    <cac97>   DW_AT_decl_file   : 6
    <cac98>   DW_AT_decl_line   : 529
    <cac9a>   DW_AT_decl_column : 28
    <cac9b>   DW_AT_type        : <0xcad85>
    <cac9f>   DW_AT_data_member_location: 200
 <2><caca0>: Abbrev Number: 1 (DW_TAG_member)
    <caca1>   DW_AT_name        : (indirect string, offset: 0x8eef3): private15
    <caca5>   DW_AT_decl_file   : 6
    <caca6>   DW_AT_decl_line   : 530
    <caca8>   DW_AT_decl_column : 8
    <caca9>   DW_AT_type        : <0xcad99>
    <cacad>   DW_AT_data_member_location: 208
 <2><cacae>: Abbrev Number: 1 (DW_TAG_member)
    <cacaf>   DW_AT_name        : (indirect string, offset: 0x8ea9d): display_name
    <cacb3>   DW_AT_decl_file   : 6
    <cacb4>   DW_AT_decl_line   : 533
    <cacb6>   DW_AT_decl_column : 8
    <cacb7>   DW_AT_type        : <0xca749>
    <cacbb>   DW_AT_data_member_location: 216
 <2><cacbc>: Abbrev Number: 1 (DW_TAG_member)
    <cacbd>   DW_AT_name        : (indirect string, offset: 0x8ee93): default_screen
    <cacc1>   DW_AT_decl_file   : 6
    <cacc2>   DW_AT_decl_line   : 534
    <cacc4>   DW_AT_decl_column : 6
    <cacc5>   DW_AT_type        : <0xca711>
    <cacc9>   DW_AT_data_member_location: 224
 <2><cacca>: Abbrev Number: 1 (DW_TAG_member)
    <caccb>   DW_AT_name        : (indirect string, offset: 0x8ebca): nscreens
    <caccf>   DW_AT_decl_file   : 6
    <cacd0>   DW_AT_decl_line   : 535
    <cacd2>   DW_AT_decl_column : 6
    <cacd3>   DW_AT_type        : <0xca711>
    <cacd7>   DW_AT_data_member_location: 228
 <2><cacd8>: Abbrev Number: 1 (DW_TAG_member)
    <cacd9>   DW_AT_name        : (indirect string, offset: 0x8ebcb): screens
    <cacdd>   DW_AT_decl_file   : 6
    <cacde>   DW_AT_decl_line   : 536
    <cace0>   DW_AT_decl_column : 10
    <cace1>   DW_AT_type        : <0xcaad3>
    <cace5>   DW_AT_data_member_location: 232
 <2><cace6>: Abbrev Number: 1 (DW_TAG_member)
    <cace7>   DW_AT_name        : (indirect string, offset: 0x8eb6d): motion_buffer
    <caceb>   DW_AT_decl_file   : 6
    <cacec>   DW_AT_decl_line   : 537
    <cacee>   DW_AT_decl_column : 16
    <cacef>   DW_AT_type        : <0xca739>
    <cacf3>   DW_AT_data_member_location: 240
 <2><cacf4>: Abbrev Number: 1 (DW_TAG_member)
    <cacf5>   DW_AT_name        : (indirect string, offset: 0x8eefd): private16
    <cacf9>   DW_AT_decl_file   : 6
    <cacfa>   DW_AT_decl_line   : 538
    <cacfc>   DW_AT_decl_column : 16
    <cacfd>   DW_AT_type        : <0xca739>
    <cad01>   DW_AT_data_member_location: 248
 <2><cad02>: Abbrev Number: 16 (DW_TAG_member)
    <cad03>   DW_AT_name        : (indirect string, offset: 0x8eb7b): min_keycode
    <cad07>   DW_AT_decl_file   : 6
    <cad08>   DW_AT_decl_line   : 539
    <cad0a>   DW_AT_decl_column : 6
    <cad0b>   DW_AT_type        : <0xca711>
    <cad0f>   DW_AT_data_member_location: 256
 <2><cad11>: Abbrev Number: 16 (DW_TAG_member)
    <cad12>   DW_AT_name        : (indirect string, offset: 0x8eb46): max_keycode
    <cad16>   DW_AT_decl_file   : 6
    <cad17>   DW_AT_decl_line   : 540
    <cad19>   DW_AT_decl_column : 6
    <cad1a>   DW_AT_type        : <0xca711>
    <cad1e>   DW_AT_data_member_location: 260
 <2><cad20>: Abbrev Number: 16 (DW_TAG_member)
    <cad21>   DW_AT_name        : (indirect string, offset: 0x8ef07): private17
    <cad25>   DW_AT_decl_file   : 6
    <cad26>   DW_AT_decl_line   : 541
    <cad28>   DW_AT_decl_column : 11
    <cad29>   DW_AT_type        : <0xca80e>
    <cad2d>   DW_AT_data_member_location: 264
 <2><cad2f>: Abbrev Number: 16 (DW_TAG_member)
    <cad30>   DW_AT_name        : (indirect string, offset: 0x8ef11): private18
    <cad34>   DW_AT_decl_file   : 6
    <cad35>   DW_AT_decl_line   : 542
    <cad37>   DW_AT_decl_column : 11
    <cad38>   DW_AT_type        : <0xca80e>
    <cad3c>   DW_AT_data_member_location: 272
 <2><cad3e>: Abbrev Number: 16 (DW_TAG_member)
    <cad3f>   DW_AT_name        : (indirect string, offset: 0x8ef1b): private19
    <cad43>   DW_AT_decl_file   : 6
    <cad44>   DW_AT_decl_line   : 543
    <cad46>   DW_AT_decl_column : 6
    <cad47>   DW_AT_type        : <0xca711>
    <cad4b>   DW_AT_data_member_location: 280
 <2><cad4d>: Abbrev Number: 16 (DW_TAG_member)
    <cad4e>   DW_AT_name        : (indirect string, offset: 0x8ea16): xdefaults
    <cad52>   DW_AT_decl_file   : 6
    <cad53>   DW_AT_decl_line   : 544
    <cad55>   DW_AT_decl_column : 8
    <cad56>   DW_AT_type        : <0xca749>
    <cad5a>   DW_AT_data_member_location: 288
 <2><cad5c>: Abbrev Number: 0
 <1><cad5d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cad5e>   DW_AT_name        : (indirect string, offset: 0x8ed7f): _XPrivate
    <cad62>   DW_AT_declaration : 1
 <1><cad62>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cad63>   DW_AT_byte_size   : 8
    <cad63>   DW_AT_type        : <0xcad5d>
 <1><cad67>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <cad68>   DW_AT_prototyped  : 1
    <cad68>   DW_AT_type        : <0xca7c6>
    <cad6c>   DW_AT_sibling     : <0xcad76>
 <2><cad70>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cad71>   DW_AT_type        : <0xcaa6e>
 <2><cad75>: Abbrev Number: 0
 <1><cad76>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cad77>   DW_AT_byte_size   : 8
    <cad77>   DW_AT_type        : <0xcad67>
 <1><cad7b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cad7c>   DW_AT_byte_size   : 8
    <cad7c>   DW_AT_type        : <0xcaac6>
 <1><cad80>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cad81>   DW_AT_name        : (indirect string, offset: 0x8ef49): _XrmHashBucketRec
    <cad85>   DW_AT_declaration : 1
 <1><cad85>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cad86>   DW_AT_byte_size   : 8
    <cad86>   DW_AT_type        : <0xcad80>
 <1><cad8a>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <cad8b>   DW_AT_prototyped  : 1
    <cad8b>   DW_AT_type        : <0xca711>
    <cad8f>   DW_AT_sibling     : <0xcad99>
 <2><cad93>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cad94>   DW_AT_type        : <0xcaa6e>
 <2><cad98>: Abbrev Number: 0
 <1><cad99>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cad9a>   DW_AT_byte_size   : 8
    <cad9a>   DW_AT_type        : <0xcad8a>
 <1><cad9e>: Abbrev Number: 7 (DW_TAG_typedef)
    <cad9f>   DW_AT_name        : (indirect string, offset: 0x8ed46): _XPrivDisplay
    <cada3>   DW_AT_decl_file   : 6
    <cada4>   DW_AT_decl_line   : 550
    <cada6>   DW_AT_decl_column : 2
    <cada7>   DW_AT_type        : <0xcadab>
 <1><cadab>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadac>   DW_AT_byte_size   : 8
    <cadac>   DW_AT_type        : <0xcaae5>
 <1><cadb0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadb1>   DW_AT_byte_size   : 8
    <cadb1>   DW_AT_type        : <0xcaad8>
 <1><cadb5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadb6>   DW_AT_byte_size   : 8
    <cadb6>   DW_AT_type        : <0xca749>
 <1><cadba>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadbb>   DW_AT_byte_size   : 8
    <cadbb>   DW_AT_type        : <0xca6f0>
 <1><cadbf>: Abbrev Number: 9 (DW_TAG_typedef)
    <cadc0>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <cadc4>   DW_AT_decl_file   : 7
    <cadc5>   DW_AT_decl_line   : 165
    <cadc6>   DW_AT_decl_column : 33
    <cadc7>   DW_AT_type        : <0xcadcb>
 <1><cadcb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadcc>   DW_AT_byte_size   : 8
    <cadcc>   DW_AT_type        : <0xcadd0>
 <1><cadd0>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cadd1>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <cadd5>   DW_AT_declaration : 1
 <1><cadd5>: Abbrev Number: 9 (DW_TAG_typedef)
    <cadd6>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <cadda>   DW_AT_decl_file   : 7
    <caddb>   DW_AT_decl_line   : 169
    <caddc>   DW_AT_decl_column : 34
    <caddd>   DW_AT_type        : <0xcade1>
 <1><cade1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cade2>   DW_AT_byte_size   : 8
    <cade2>   DW_AT_type        : <0xcade6>
 <1><cade6>: Abbrev Number: 24 (DW_TAG_structure_type)
    <cade7>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <cadeb>   DW_AT_declaration : 1
 <1><cadeb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadec>   DW_AT_byte_size   : 8
    <cadec>   DW_AT_type        : <0xcadd5>
 <1><cadf0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadf1>   DW_AT_byte_size   : 8
    <cadf1>   DW_AT_type        : <0xca711>
 <1><cadf5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadf6>   DW_AT_byte_size   : 8
    <cadf6>   DW_AT_type        : <0xca6dd>
 <1><cadfa>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cadfb>   DW_AT_byte_size   : 8
    <cadfb>   DW_AT_type        : <0xca739>
 <1><cadff>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cae00>   DW_AT_byte_size   : 8
    <cae00>   DW_AT_type        : <0xca75a>
 <1><cae04>: Abbrev Number: 47 (DW_TAG_restrict_type)
    <cae05>   DW_AT_type        : <0xcadff>
 <1><cae09>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cae0a>   DW_AT_byte_size   : 8
    <cae0a>   DW_AT_type        : <0xcae0e>
 <1><cae0e>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <cae0f>   DW_AT_prototyped  : 1
    <cae0f>   DW_AT_sibling     : <0xcae19>
 <2><cae13>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae14>   DW_AT_type        : <0xca711>
 <2><cae18>: Abbrev Number: 0
 <1><cae19>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cae1a>   DW_AT_byte_size   : 8
    <cae1a>   DW_AT_type        : <0xcae1e>
 <1><cae1e>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <cae1f>   DW_AT_prototyped  : 1
    <cae1f>   DW_AT_sibling     : <0xcae33>
 <2><cae23>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae24>   DW_AT_type        : <0xca711>
 <2><cae28>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae29>   DW_AT_type        : <0xca711>
 <2><cae2d>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae2e>   DW_AT_type        : <0xca711>
 <2><cae32>: Abbrev Number: 0
 <1><cae33>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae34>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <cae38>   DW_AT_decl_file   : 8
    <cae39>   DW_AT_decl_line   : 239
    <cae3a>   DW_AT_decl_column : 17
    <cae3b>   DW_AT_type        : <0xca765>
 <1><cae3f>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae40>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <cae44>   DW_AT_decl_file   : 8
    <cae45>   DW_AT_decl_line   : 247
    <cae46>   DW_AT_decl_column : 17
    <cae47>   DW_AT_type        : <0xca765>
 <1><cae4b>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae4c>   DW_AT_name        : (indirect string, offset: 0x8e55e): FGCBTimer
    <cae50>   DW_AT_decl_file   : 8
    <cae51>   DW_AT_decl_line   : 248
    <cae52>   DW_AT_decl_column : 17
    <cae53>   DW_AT_type        : <0xcae09>
 <1><cae57>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae58>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <cae5c>   DW_AT_decl_file   : 8
    <cae5d>   DW_AT_decl_line   : 249
    <cae5e>   DW_AT_decl_column : 17
    <cae5f>   DW_AT_type        : <0xcae09>
 <1><cae63>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae64>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <cae68>   DW_AT_decl_file   : 8
    <cae69>   DW_AT_decl_line   : 250
    <cae6a>   DW_AT_decl_column : 17
    <cae6b>   DW_AT_type        : <0xcae19>
 <1><cae6f>: Abbrev Number: 9 (DW_TAG_typedef)
    <cae70>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <cae74>   DW_AT_decl_file   : 8
    <cae75>   DW_AT_decl_line   : 253
    <cae76>   DW_AT_decl_column : 17
    <cae77>   DW_AT_type        : <0xcae09>
 <1><cae7b>: Abbrev Number: 7 (DW_TAG_typedef)
    <cae7c>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <cae80>   DW_AT_decl_file   : 8
    <cae81>   DW_AT_decl_line   : 256
    <cae83>   DW_AT_decl_column : 17
    <cae84>   DW_AT_type        : <0xcae88>
 <1><cae88>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cae89>   DW_AT_byte_size   : 8
    <cae89>   DW_AT_type        : <0xcae8d>
 <1><cae8d>: Abbrev Number: 37 (DW_TAG_subroutine_type)
    <cae8e>   DW_AT_prototyped  : 1
    <cae8e>   DW_AT_sibling     : <0xcae9d>
 <2><cae92>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae93>   DW_AT_type        : <0xcadff>
 <2><cae97>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <cae98>   DW_AT_type        : <0xcae9d>
 <2><cae9c>: Abbrev Number: 0
 <1><cae9d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <cae9e>   DW_AT_byte_size   : 8
    <cae9e>   DW_AT_type        : <0xca791>
 <1><caea2>: Abbrev Number: 7 (DW_TAG_typedef)
    <caea3>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <caea7>   DW_AT_decl_file   : 8
    <caea8>   DW_AT_decl_line   : 257
    <caeaa>   DW_AT_decl_column : 17
    <caeab>   DW_AT_type        : <0xcae88>
 <1><caeaf>: Abbrev Number: 7 (DW_TAG_typedef)
    <caeb0>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <caeb4>   DW_AT_decl_file   : 8
    <caeb5>   DW_AT_decl_line   : 261
    <caeb7>   DW_AT_decl_column : 28
    <caeb8>   DW_AT_type        : <0xcaebc>
 <1><caebc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <caebd>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <caec1>   DW_AT_byte_size   : 16
    <caec2>   DW_AT_decl_file   : 8
    <caec2>   DW_AT_decl_line   : 262
    <caec4>   DW_AT_decl_column : 8
    <caec4>   DW_AT_sibling     : <0xcaee5>
 <2><caec8>: Abbrev Number: 1 (DW_TAG_member)
    <caec9>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <caecd>   DW_AT_decl_file   : 8
    <caece>   DW_AT_decl_line   : 264
    <caed0>   DW_AT_decl_column : 11
    <caed1>   DW_AT_type        : <0xca747>
    <caed5>   DW_AT_data_member_location: 0
 <2><caed6>: Abbrev Number: 1 (DW_TAG_member)
    <caed7>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <caedb>   DW_AT_decl_file   : 8
    <caedc>   DW_AT_decl_line   : 265
    <caede>   DW_AT_decl_column : 11
    <caedf>   DW_AT_type        : <0xca747>
    <caee3>   DW_AT_data_member_location: 8
 <2><caee4>: Abbrev Number: 0
 <1><caee5>: Abbrev Number: 7 (DW_TAG_typedef)
    <caee6>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <caeea>   DW_AT_decl_file   : 8
    <caeeb>   DW_AT_decl_line   : 269
    <caeed>   DW_AT_decl_column : 28
    <caeee>   DW_AT_type        : <0xcaef2>
 <1><caef2>: Abbrev Number: 17 (DW_TAG_structure_type)
    <caef3>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <caef7>   DW_AT_byte_size   : 16
    <caef8>   DW_AT_decl_file   : 8
    <caef8>   DW_AT_decl_line   : 270
    <caefa>   DW_AT_decl_column : 8
    <caefa>   DW_AT_sibling     : <0xcaf1b>
 <2><caefe>: Abbrev Number: 1 (DW_TAG_member)
    <caeff>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <caf03>   DW_AT_decl_file   : 8
    <caf04>   DW_AT_decl_line   : 272
    <caf06>   DW_AT_decl_column : 11
    <caf07>   DW_AT_type        : <0xca747>
    <caf0b>   DW_AT_data_member_location: 0
 <2><caf0c>: Abbrev Number: 1 (DW_TAG_member)
    <caf0d>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <caf11>   DW_AT_decl_file   : 8
    <caf12>   DW_AT_decl_line   : 273
    <caf14>   DW_AT_decl_column : 11
    <caf15>   DW_AT_type        : <0xca747>
    <caf19>   DW_AT_data_member_location: 8
 <2><caf1a>: Abbrev Number: 0
 <1><caf1b>: Abbrev Number: 7 (DW_TAG_typedef)
    <caf1c>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <caf20>   DW_AT_decl_file   : 8
    <caf21>   DW_AT_decl_line   : 277
    <caf23>   DW_AT_decl_column : 29
    <caf24>   DW_AT_type        : <0xcaf28>
 <1><caf28>: Abbrev Number: 17 (DW_TAG_structure_type)
    <caf29>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <caf2d>   DW_AT_byte_size   : 12
    <caf2e>   DW_AT_decl_file   : 8
    <caf2e>   DW_AT_decl_line   : 278
    <caf30>   DW_AT_decl_column : 8
    <caf30>   DW_AT_sibling     : <0xcaf5b>
 <2><caf34>: Abbrev Number: 18 (DW_TAG_member)
    <caf35>   DW_AT_name        : X
    <caf37>   DW_AT_decl_file   : 8
    <caf38>   DW_AT_decl_line   : 280
    <caf3a>   DW_AT_decl_column : 21
    <caf3b>   DW_AT_type        : <0xca705>
    <caf3f>   DW_AT_data_member_location: 0
 <2><caf40>: Abbrev Number: 18 (DW_TAG_member)
    <caf41>   DW_AT_name        : Y
    <caf43>   DW_AT_decl_file   : 8
    <caf44>   DW_AT_decl_line   : 280
    <caf46>   DW_AT_decl_column : 24
    <caf47>   DW_AT_type        : <0xca705>
    <caf4b>   DW_AT_data_member_location: 4
 <2><caf4c>: Abbrev Number: 18 (DW_TAG_member)
    <caf4d>   DW_AT_name        : Use
    <caf51>   DW_AT_decl_file   : 8
    <caf52>   DW_AT_decl_line   : 281
    <caf54>   DW_AT_decl_column : 21
    <caf55>   DW_AT_type        : <0xca6e4>
    <caf59>   DW_AT_data_member_location: 8
 <2><caf5a>: Abbrev Number: 0
 <1><caf5b>: Abbrev Number: 52 (DW_TAG_enumeration_type)
    <caf5c>   DW_AT_encoding    : 7	(void)
    <caf5c>   DW_AT_byte_size   : 4
    <caf5c>   DW_AT_type        : <0xca6dd>
    <caf60>   DW_AT_decl_file   : 8
    <caf60>   DW_AT_decl_line   : 289
    <caf62>   DW_AT_decl_column : 1
    <caf62>   DW_AT_sibling     : <0xcaf79>
 <2><caf66>: Abbrev Number: 6 (DW_TAG_enumerator)
    <caf67>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <caf6b>   DW_AT_const_value : 0
 <2><caf6c>: Abbrev Number: 6 (DW_TAG_enumerator)
    <caf6d>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <caf71>   DW_AT_const_value : 1
 <2><caf72>: Abbrev Number: 6 (DW_TAG_enumerator)
    <caf73>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <caf77>   DW_AT_const_value : 2
 <2><caf78>: Abbrev Number: 0
 <1><caf79>: Abbrev Number: 7 (DW_TAG_typedef)
    <caf7a>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <caf7e>   DW_AT_decl_file   : 8
    <caf7f>   DW_AT_decl_line   : 293
    <caf81>   DW_AT_decl_column : 3
    <caf82>   DW_AT_type        : <0xcaf5b>
 <1><caf86>: Abbrev Number: 7 (DW_TAG_typedef)
    <caf87>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <caf8b>   DW_AT_decl_file   : 8
    <caf8c>   DW_AT_decl_line   : 296
    <caf8e>   DW_AT_decl_column : 29
    <caf8f>   DW_AT_type        : <0xcaf93>
 <1><caf93>: Abbrev Number: 17 (DW_TAG_structure_type)
    <caf94>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <caf98>   DW_AT_byte_size   : 232
    <caf99>   DW_AT_decl_file   : 8
    <caf99>   DW_AT_decl_line   : 297
    <caf9b>   DW_AT_decl_column : 8
    <caf9b>   DW_AT_sibling     : <0xcb1c2>
 <2><caf9f>: Abbrev Number: 1 (DW_TAG_member)
    <cafa0>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <cafa4>   DW_AT_decl_file   : 8
    <cafa5>   DW_AT_decl_line   : 299
    <cafa7>   DW_AT_decl_column : 22
    <cafa8>   DW_AT_type        : <0xcaf1b>
    <cafac>   DW_AT_data_member_location: 0
 <2><cafad>: Abbrev Number: 1 (DW_TAG_member)
    <cafae>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <cafb2>   DW_AT_decl_file   : 8
    <cafb3>   DW_AT_decl_line   : 300
    <cafb5>   DW_AT_decl_column : 22
    <cafb6>   DW_AT_type        : <0xcaf1b>
    <cafba>   DW_AT_data_member_location: 12
 <2><cafbb>: Abbrev Number: 1 (DW_TAG_member)
    <cafbc>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <cafc0>   DW_AT_decl_file   : 8
    <cafc1>   DW_AT_decl_line   : 301
    <cafc3>   DW_AT_decl_column : 22
    <cafc4>   DW_AT_type        : <0xca6dd>
    <cafc8>   DW_AT_data_member_location: 24
 <2><cafc9>: Abbrev Number: 1 (DW_TAG_member)
    <cafca>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <cafce>   DW_AT_decl_file   : 8
    <cafcf>   DW_AT_decl_line   : 303
    <cafd1>   DW_AT_decl_column : 22
    <cafd2>   DW_AT_type        : <0xca6e4>
    <cafd6>   DW_AT_data_member_location: 28
 <2><cafd7>: Abbrev Number: 1 (DW_TAG_member)
    <cafd8>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <cafdc>   DW_AT_decl_file   : 8
    <cafdd>   DW_AT_decl_line   : 305
    <cafdf>   DW_AT_decl_column : 22
    <cafe0>   DW_AT_type        : <0xca711>
    <cafe4>   DW_AT_data_member_location: 32
 <2><cafe5>: Abbrev Number: 1 (DW_TAG_member)
    <cafe6>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <cafea>   DW_AT_decl_file   : 8
    <cafeb>   DW_AT_decl_line   : 307
    <cafed>   DW_AT_decl_column : 22
    <cafee>   DW_AT_type        : <0xca6e4>
    <caff2>   DW_AT_data_member_location: 36
 <2><caff3>: Abbrev Number: 1 (DW_TAG_member)
    <caff4>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <caff8>   DW_AT_decl_file   : 8
    <caff9>   DW_AT_decl_line   : 308
    <caffb>   DW_AT_decl_column : 22
    <caffc>   DW_AT_type        : <0xca6e4>
    <cb000>   DW_AT_data_member_location: 37
 <2><cb001>: Abbrev Number: 1 (DW_TAG_member)
    <cb002>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <cb006>   DW_AT_decl_file   : 8
    <cb007>   DW_AT_decl_line   : 310
    <cb009>   DW_AT_decl_column : 22
    <cb00a>   DW_AT_type        : <0xca6e4>
    <cb00e>   DW_AT_data_member_location: 38
 <2><cb00f>: Abbrev Number: 1 (DW_TAG_member)
    <cb010>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <cb014>   DW_AT_decl_file   : 8
    <cb015>   DW_AT_decl_line   : 311
    <cb017>   DW_AT_decl_column : 22
    <cb018>   DW_AT_type        : <0xca6e4>
    <cb01c>   DW_AT_data_member_location: 39
 <2><cb01d>: Abbrev Number: 1 (DW_TAG_member)
    <cb01e>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <cb022>   DW_AT_decl_file   : 8
    <cb023>   DW_AT_decl_line   : 313
    <cb025>   DW_AT_decl_column : 22
    <cb026>   DW_AT_type        : <0xca711>
    <cb02a>   DW_AT_data_member_location: 40
 <2><cb02b>: Abbrev Number: 1 (DW_TAG_member)
    <cb02c>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <cb030>   DW_AT_decl_file   : 8
    <cb031>   DW_AT_decl_line   : 314
    <cb033>   DW_AT_decl_column : 22
    <cb034>   DW_AT_type        : <0xca711>
    <cb038>   DW_AT_data_member_location: 44
 <2><cb039>: Abbrev Number: 1 (DW_TAG_member)
    <cb03a>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <cb03e>   DW_AT_decl_file   : 8
    <cb03f>   DW_AT_decl_line   : 316
    <cb041>   DW_AT_decl_column : 22
    <cb042>   DW_AT_type        : <0xca71f>
    <cb046>   DW_AT_data_member_location: 48
 <2><cb047>: Abbrev Number: 1 (DW_TAG_member)
    <cb048>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <cb04c>   DW_AT_decl_file   : 8
    <cb04d>   DW_AT_decl_line   : 317
    <cb04f>   DW_AT_decl_column : 22
    <cb050>   DW_AT_type        : <0xca71f>
    <cb054>   DW_AT_data_member_location: 52
 <2><cb055>: Abbrev Number: 1 (DW_TAG_member)
    <cb056>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <cb05a>   DW_AT_decl_file   : 8
    <cb05b>   DW_AT_decl_line   : 318
    <cb05d>   DW_AT_decl_column : 22
    <cb05e>   DW_AT_type        : <0xca71f>
    <cb062>   DW_AT_data_member_location: 56
 <2><cb063>: Abbrev Number: 1 (DW_TAG_member)
    <cb064>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <cb068>   DW_AT_decl_file   : 8
    <cb069>   DW_AT_decl_line   : 320
    <cb06b>   DW_AT_decl_column : 22
    <cb06c>   DW_AT_type        : <0xca739>
    <cb070>   DW_AT_data_member_location: 64
 <2><cb071>: Abbrev Number: 1 (DW_TAG_member)
    <cb072>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <cb076>   DW_AT_decl_file   : 8
    <cb077>   DW_AT_decl_line   : 321
    <cb079>   DW_AT_decl_column : 22
    <cb07a>   DW_AT_type        : <0xcaeaf>
    <cb07e>   DW_AT_data_member_location: 72
 <2><cb07f>: Abbrev Number: 1 (DW_TAG_member)
    <cb080>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <cb084>   DW_AT_decl_file   : 8
    <cb085>   DW_AT_decl_line   : 322
    <cb087>   DW_AT_decl_column : 22
    <cb088>   DW_AT_type        : <0xcaeaf>
    <cb08c>   DW_AT_data_member_location: 88
 <2><cb08d>: Abbrev Number: 1 (DW_TAG_member)
    <cb08e>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <cb092>   DW_AT_decl_file   : 8
    <cb093>   DW_AT_decl_line   : 324
    <cb095>   DW_AT_decl_column : 22
    <cb096>   DW_AT_type        : <0xcae3f>
    <cb09a>   DW_AT_data_member_location: 104
 <2><cb09b>: Abbrev Number: 1 (DW_TAG_member)
    <cb09c>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <cb0a0>   DW_AT_decl_file   : 8
    <cb0a1>   DW_AT_decl_line   : 326
    <cb0a3>   DW_AT_decl_column : 22
    <cb0a4>   DW_AT_type        : <0xca711>
    <cb0a8>   DW_AT_data_member_location: 112
 <2><cb0a9>: Abbrev Number: 1 (DW_TAG_member)
    <cb0aa>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <cb0ae>   DW_AT_decl_file   : 8
    <cb0af>   DW_AT_decl_line   : 327
    <cb0b1>   DW_AT_decl_column : 22
    <cb0b2>   DW_AT_type        : <0xcae57>
    <cb0b6>   DW_AT_data_member_location: 120
 <2><cb0b7>: Abbrev Number: 1 (DW_TAG_member)
    <cb0b8>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <cb0bc>   DW_AT_decl_file   : 8
    <cb0bd>   DW_AT_decl_line   : 328
    <cb0bf>   DW_AT_decl_column : 22
    <cb0c0>   DW_AT_type        : <0xcae63>
    <cb0c4>   DW_AT_data_member_location: 128
 <2><cb0c5>: Abbrev Number: 1 (DW_TAG_member)
    <cb0c6>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <cb0ca>   DW_AT_decl_file   : 8
    <cb0cb>   DW_AT_decl_line   : 330
    <cb0cd>   DW_AT_decl_column : 22
    <cb0ce>   DW_AT_type        : <0xcaf1b>
    <cb0d2>   DW_AT_data_member_location: 136
 <2><cb0d3>: Abbrev Number: 1 (DW_TAG_member)
    <cb0d4>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <cb0d8>   DW_AT_decl_file   : 8
    <cb0d9>   DW_AT_decl_line   : 331
    <cb0db>   DW_AT_decl_column : 22
    <cb0dc>   DW_AT_type        : <0xca711>
    <cb0e0>   DW_AT_data_member_location: 148
 <2><cb0e1>: Abbrev Number: 1 (DW_TAG_member)
    <cb0e2>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <cb0e6>   DW_AT_decl_file   : 8
    <cb0e7>   DW_AT_decl_line   : 332
    <cb0e9>   DW_AT_decl_column : 22
    <cb0ea>   DW_AT_type        : <0xca711>
    <cb0ee>   DW_AT_data_member_location: 152
 <2><cb0ef>: Abbrev Number: 1 (DW_TAG_member)
    <cb0f0>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <cb0f4>   DW_AT_decl_file   : 8
    <cb0f5>   DW_AT_decl_line   : 334
    <cb0f7>   DW_AT_decl_column : 22
    <cb0f8>   DW_AT_type        : <0xca711>
    <cb0fc>   DW_AT_data_member_location: 156
 <2><cb0fd>: Abbrev Number: 1 (DW_TAG_member)
    <cb0fe>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <cb102>   DW_AT_decl_file   : 8
    <cb103>   DW_AT_decl_line   : 336
    <cb105>   DW_AT_decl_column : 22
    <cb106>   DW_AT_type        : <0xcaf79>
    <cb10a>   DW_AT_data_member_location: 160
 <2><cb10b>: Abbrev Number: 1 (DW_TAG_member)
    <cb10c>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <cb110>   DW_AT_decl_file   : 8
    <cb111>   DW_AT_decl_line   : 337
    <cb113>   DW_AT_decl_column : 22
    <cb114>   DW_AT_type        : <0xca749>
    <cb118>   DW_AT_data_member_location: 168
 <2><cb119>: Abbrev Number: 1 (DW_TAG_member)
    <cb11a>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <cb11e>   DW_AT_decl_file   : 8
    <cb11f>   DW_AT_decl_line   : 338
    <cb121>   DW_AT_decl_column : 22
    <cb122>   DW_AT_type        : <0xca6e4>
    <cb126>   DW_AT_data_member_location: 176
 <2><cb127>: Abbrev Number: 1 (DW_TAG_member)
    <cb128>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <cb12c>   DW_AT_decl_file   : 8
    <cb12d>   DW_AT_decl_line   : 339
    <cb12f>   DW_AT_decl_column : 22
    <cb130>   DW_AT_type        : <0xca711>
    <cb134>   DW_AT_data_member_location: 180
 <2><cb135>: Abbrev Number: 1 (DW_TAG_member)
    <cb136>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <cb13a>   DW_AT_decl_file   : 8
    <cb13b>   DW_AT_decl_line   : 340
    <cb13d>   DW_AT_decl_column : 22
    <cb13e>   DW_AT_type        : <0xca6e4>
    <cb142>   DW_AT_data_member_location: 184
 <2><cb143>: Abbrev Number: 1 (DW_TAG_member)
    <cb144>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <cb148>   DW_AT_decl_file   : 8
    <cb149>   DW_AT_decl_line   : 342
    <cb14b>   DW_AT_decl_column : 19
    <cb14c>   DW_AT_type        : <0xca711>
    <cb150>   DW_AT_data_member_location: 188
 <2><cb151>: Abbrev Number: 1 (DW_TAG_member)
    <cb152>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <cb156>   DW_AT_decl_file   : 8
    <cb157>   DW_AT_decl_line   : 344
    <cb159>   DW_AT_decl_column : 22
    <cb15a>   DW_AT_type        : <0xca711>
    <cb15e>   DW_AT_data_member_location: 192
 <2><cb15f>: Abbrev Number: 1 (DW_TAG_member)
    <cb160>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <cb164>   DW_AT_decl_file   : 8
    <cb165>   DW_AT_decl_line   : 345
    <cb167>   DW_AT_decl_column : 22
    <cb168>   DW_AT_type        : <0xca711>
    <cb16c>   DW_AT_data_member_location: 196
 <2><cb16d>: Abbrev Number: 1 (DW_TAG_member)
    <cb16e>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <cb172>   DW_AT_decl_file   : 8
    <cb173>   DW_AT_decl_line   : 347
    <cb175>   DW_AT_decl_column : 22
    <cb176>   DW_AT_type        : <0xca711>
    <cb17a>   DW_AT_data_member_location: 200
 <2><cb17b>: Abbrev Number: 1 (DW_TAG_member)
    <cb17c>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <cb180>   DW_AT_decl_file   : 8
    <cb181>   DW_AT_decl_line   : 348
    <cb183>   DW_AT_decl_column : 22
    <cb184>   DW_AT_type        : <0xca711>
    <cb188>   DW_AT_data_member_location: 204
 <2><cb189>: Abbrev Number: 1 (DW_TAG_member)
    <cb18a>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <cb18e>   DW_AT_decl_file   : 8
    <cb18f>   DW_AT_decl_line   : 349
    <cb191>   DW_AT_decl_column : 22
    <cb192>   DW_AT_type        : <0xca711>
    <cb196>   DW_AT_data_member_location: 208
 <2><cb197>: Abbrev Number: 1 (DW_TAG_member)
    <cb198>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <cb19c>   DW_AT_decl_file   : 8
    <cb19d>   DW_AT_decl_line   : 350
    <cb19f>   DW_AT_decl_column : 22
    <cb1a0>   DW_AT_type        : <0xca711>
    <cb1a4>   DW_AT_data_member_location: 212
 <2><cb1a5>: Abbrev Number: 1 (DW_TAG_member)
    <cb1a6>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <cb1aa>   DW_AT_decl_file   : 8
    <cb1ab>   DW_AT_decl_line   : 351
    <cb1ad>   DW_AT_decl_column : 22
    <cb1ae>   DW_AT_type        : <0xcae7b>
    <cb1b2>   DW_AT_data_member_location: 216
 <2><cb1b3>: Abbrev Number: 1 (DW_TAG_member)
    <cb1b4>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <cb1b8>   DW_AT_decl_file   : 8
    <cb1b9>   DW_AT_decl_line   : 352
    <cb1bb>   DW_AT_decl_column : 22
    <cb1bc>   DW_AT_type        : <0xcaea2>
    <cb1c0>   DW_AT_data_member_location: 224
 <2><cb1c1>: Abbrev Number: 0
 <1><cb1c2>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb1c3>   DW_AT_name        : (indirect string, offset: 0x8e79c): SFG_Display
    <cb1c7>   DW_AT_decl_file   : 8
    <cb1c8>   DW_AT_decl_line   : 356
    <cb1ca>   DW_AT_decl_column : 31
    <cb1cb>   DW_AT_type        : <0xcb1cf>
 <1><cb1cf>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cb1d0>   DW_AT_name        : (indirect string, offset: 0x8e799): tagSFG_Display
    <cb1d4>   DW_AT_byte_size   : 80
    <cb1d5>   DW_AT_decl_file   : 8
    <cb1d5>   DW_AT_decl_line   : 357
    <cb1d7>   DW_AT_decl_column : 8
    <cb1d7>   DW_AT_sibling     : <0xcb292>
 <2><cb1db>: Abbrev Number: 1 (DW_TAG_member)
    <cb1dc>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <cb1e0>   DW_AT_decl_file   : 8
    <cb1e1>   DW_AT_decl_line   : 360
    <cb1e3>   DW_AT_decl_column : 21
    <cb1e4>   DW_AT_type        : <0xcadb0>
    <cb1e8>   DW_AT_data_member_location: 0
 <2><cb1e9>: Abbrev Number: 1 (DW_TAG_member)
    <cb1ea>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <cb1ee>   DW_AT_decl_file   : 8
    <cb1ef>   DW_AT_decl_line   : 361
    <cb1f1>   DW_AT_decl_column : 21
    <cb1f2>   DW_AT_type        : <0xca711>
    <cb1f6>   DW_AT_data_member_location: 8
 <2><cb1f7>: Abbrev Number: 1 (DW_TAG_member)
    <cb1f8>   DW_AT_name        : (indirect string, offset: 0x8e7ee): RootWindow
    <cb1fc>   DW_AT_decl_file   : 8
    <cb1fd>   DW_AT_decl_line   : 362
    <cb1ff>   DW_AT_decl_column : 21
    <cb200>   DW_AT_type        : <0xca7ef>
    <cb204>   DW_AT_data_member_location: 16
 <2><cb205>: Abbrev Number: 1 (DW_TAG_member)
    <cb206>   DW_AT_name        : (indirect string, offset: 0x8e855): Connection
    <cb20a>   DW_AT_decl_file   : 8
    <cb20b>   DW_AT_decl_line   : 363
    <cb20d>   DW_AT_decl_column : 21
    <cb20e>   DW_AT_type        : <0xca711>
    <cb212>   DW_AT_data_member_location: 24
 <2><cb213>: Abbrev Number: 1 (DW_TAG_member)
    <cb214>   DW_AT_name        : (indirect string, offset: 0x8e8cc): DeleteWindow
    <cb218>   DW_AT_decl_file   : 8
    <cb219>   DW_AT_decl_line   : 364
    <cb21b>   DW_AT_decl_column : 21
    <cb21c>   DW_AT_type        : <0xca7d2>
    <cb220>   DW_AT_data_member_location: 32
 <2><cb221>: Abbrev Number: 1 (DW_TAG_member)
    <cb222>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <cb226>   DW_AT_decl_file   : 8
    <cb227>   DW_AT_decl_line   : 365
    <cb229>   DW_AT_decl_column : 21
    <cb22a>   DW_AT_type        : <0xca7d2>
    <cb22e>   DW_AT_data_member_location: 40
 <2><cb22f>: Abbrev Number: 1 (DW_TAG_member)
    <cb230>   DW_AT_name        : (indirect string, offset: 0x8e8e6): StateFullScreen
    <cb234>   DW_AT_decl_file   : 8
    <cb235>   DW_AT_decl_line   : 366
    <cb237>   DW_AT_decl_column : 21
    <cb238>   DW_AT_type        : <0xca7d2>
    <cb23c>   DW_AT_data_member_location: 48
 <2><cb23d>: Abbrev Number: 1 (DW_TAG_member)
    <cb23e>   DW_AT_name        : (indirect string, offset: 0x8e7de): DisplayPointerX
    <cb242>   DW_AT_decl_file   : 8
    <cb243>   DW_AT_decl_line   : 386
    <cb245>   DW_AT_decl_column : 21
    <cb246>   DW_AT_type        : <0xca711>
    <cb24a>   DW_AT_data_member_location: 56
 <2><cb24b>: Abbrev Number: 1 (DW_TAG_member)
    <cb24c>   DW_AT_name        : (indirect string, offset: 0x8e938): DisplayPointerY
    <cb250>   DW_AT_decl_file   : 8
    <cb251>   DW_AT_decl_line   : 387
    <cb253>   DW_AT_decl_column : 21
    <cb254>   DW_AT_type        : <0xca711>
    <cb258>   DW_AT_data_member_location: 60
 <2><cb259>: Abbrev Number: 1 (DW_TAG_member)
    <cb25a>   DW_AT_name        : (indirect string, offset: 0x8e849): ScreenWidth
    <cb25e>   DW_AT_decl_file   : 8
    <cb25f>   DW_AT_decl_line   : 396
    <cb261>   DW_AT_decl_column : 21
    <cb262>   DW_AT_type        : <0xca711>
    <cb266>   DW_AT_data_member_location: 64
 <2><cb267>: Abbrev Number: 1 (DW_TAG_member)
    <cb268>   DW_AT_name        : (indirect string, offset: 0x8e7b7): ScreenHeight
    <cb26c>   DW_AT_decl_file   : 8
    <cb26d>   DW_AT_decl_line   : 397
    <cb26f>   DW_AT_decl_column : 21
    <cb270>   DW_AT_type        : <0xca711>
    <cb274>   DW_AT_data_member_location: 68
 <2><cb275>: Abbrev Number: 1 (DW_TAG_member)
    <cb276>   DW_AT_name        : (indirect string, offset: 0x8e8be): ScreenWidthMM
    <cb27a>   DW_AT_decl_file   : 8
    <cb27b>   DW_AT_decl_line   : 398
    <cb27d>   DW_AT_decl_column : 21
    <cb27e>   DW_AT_type        : <0xca711>
    <cb282>   DW_AT_data_member_location: 72
 <2><cb283>: Abbrev Number: 1 (DW_TAG_member)
    <cb284>   DW_AT_name        : (indirect string, offset: 0x8e7f9): ScreenHeightMM
    <cb288>   DW_AT_decl_file   : 8
    <cb289>   DW_AT_decl_line   : 399
    <cb28b>   DW_AT_decl_column : 21
    <cb28c>   DW_AT_type        : <0xca711>
    <cb290>   DW_AT_data_member_location: 76
 <2><cb291>: Abbrev Number: 0
 <1><cb292>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb293>   DW_AT_name        : (indirect string, offset: 0x8e462): SFG_Timer
    <cb297>   DW_AT_decl_file   : 8
    <cb298>   DW_AT_decl_line   : 404
    <cb29a>   DW_AT_decl_column : 29
    <cb29b>   DW_AT_type        : <0xcb29f>
 <1><cb29f>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cb2a0>   DW_AT_name        : (indirect string, offset: 0x8e45f): tagSFG_Timer
    <cb2a4>   DW_AT_byte_size   : 40
    <cb2a5>   DW_AT_decl_file   : 8
    <cb2a5>   DW_AT_decl_line   : 405
    <cb2a7>   DW_AT_decl_column : 8
    <cb2a7>   DW_AT_sibling     : <0xcb2e3>
 <2><cb2ab>: Abbrev Number: 1 (DW_TAG_member)
    <cb2ac>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <cb2b0>   DW_AT_decl_file   : 8
    <cb2b1>   DW_AT_decl_line   : 407
    <cb2b3>   DW_AT_decl_column : 21
    <cb2b4>   DW_AT_type        : <0xcaee5>
    <cb2b8>   DW_AT_data_member_location: 0
 <2><cb2b9>: Abbrev Number: 18 (DW_TAG_member)
    <cb2ba>   DW_AT_name        : ID
    <cb2bd>   DW_AT_decl_file   : 8
    <cb2be>   DW_AT_decl_line   : 408
    <cb2c0>   DW_AT_decl_column : 21
    <cb2c1>   DW_AT_type        : <0xca711>
    <cb2c5>   DW_AT_data_member_location: 16
 <2><cb2c6>: Abbrev Number: 1 (DW_TAG_member)
    <cb2c7>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <cb2cb>   DW_AT_decl_file   : 8
    <cb2cc>   DW_AT_decl_line   : 409
    <cb2ce>   DW_AT_decl_column : 21
    <cb2cf>   DW_AT_type        : <0xcae4b>
    <cb2d3>   DW_AT_data_member_location: 24
 <2><cb2d4>: Abbrev Number: 1 (DW_TAG_member)
    <cb2d5>   DW_AT_name        : (indirect string, offset: 0x8e231): TriggerTime
    <cb2d9>   DW_AT_decl_file   : 8
    <cb2da>   DW_AT_decl_line   : 410
    <cb2dc>   DW_AT_decl_column : 21
    <cb2dd>   DW_AT_type        : <0xca740>
    <cb2e1>   DW_AT_data_member_location: 32
 <2><cb2e2>: Abbrev Number: 0
 <1><cb2e3>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb2e4>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <cb2e8>   DW_AT_decl_file   : 8
    <cb2e9>   DW_AT_decl_line   : 419
    <cb2eb>   DW_AT_decl_column : 20
    <cb2ec>   DW_AT_type        : <0xca7ef>
 <1><cb2f0>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb2f1>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <cb2f5>   DW_AT_decl_file   : 8
    <cb2f6>   DW_AT_decl_line   : 420
    <cb2f8>   DW_AT_decl_column : 20
    <cb2f9>   DW_AT_type        : <0xcadbf>
 <1><cb2fd>: Abbrev Number: 7 (DW_TAG_typedef)
    <cb2fe>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <cb302>   DW_AT_decl_file   : 8
    <cb303>   DW_AT_decl_line   : 433
    <cb305>   DW_AT_decl_column : 31
    <cb306>   DW_AT_type        : <0xcb30a>
 <1><cb30a>: Abbrev Number: 17 (DW_TAG_structure_type)
    <cb30b>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <cb30f>   DW_AT_byte_size   : 32
    <cb310>   DW_AT_decl_file   : 8
    <cb310>   DW_AT_decl_line   : 434
    <cb312>   DW_AT_decl_column : 8
    <cb312>   DW_AT_sibling     : <0xcb34f>
 <2><cb316>: Abbrev Number: 1 (DW_TAG_member)
    <cb317>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <cb31b>   DW_AT_decl_file   : 8
    <cb31c>   DW_AT_decl_line   : 436
    <cb31e>   DW_AT_decl_column : 27
    <cb31f>   DW_AT_type        : <0xcb2e3>
    <cb323>   DW_AT_data_member_location: 0
 <2><cb324>: Abbrev Number: 1 (DW_TAG_member)
    <cb325>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <cb329>   DW_AT_decl_file   : 8
    <cb32a>   DW_AT_decl_line   : 437
    <cb32c>   DW_AT_decl_column : 27
    <cb32d>   DW_AT_type        : <0xcb2f0>
    <cb331>   DW_AT_data_member_location: 8
