 <2><d8178>: Abbrev Number: 0
 <1><d8179>: Abbrev Number: 4 (DW_TAG_typedef)
    <d817a>   DW_AT_name        : (indirect string, offset: 0x73709): XMappingEvent
    <d817e>   DW_AT_decl_file   : 6
    <d817f>   DW_AT_decl_line   : 922
    <d8181>   DW_AT_decl_column : 3
    <d8182>   DW_AT_type        : <0xd8100>
 <1><d8186>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d8187>   DW_AT_byte_size   : 40
    <d8188>   DW_AT_decl_file   : 6
    <d8188>   DW_AT_decl_line   : 924
    <d818a>   DW_AT_decl_column : 9
    <d818a>   DW_AT_sibling     : <0xd81f1>
 <2><d818e>: Abbrev Number: 1 (DW_TAG_member)
    <d818f>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d8193>   DW_AT_decl_file   : 6
    <d8194>   DW_AT_decl_line   : 925
    <d8196>   DW_AT_decl_column : 6
    <d8197>   DW_AT_type        : <0xd6957>
    <d819b>   DW_AT_data_member_location: 0
 <2><d819c>: Abbrev Number: 1 (DW_TAG_member)
    <d819d>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d81a1>   DW_AT_decl_file   : 6
    <d81a2>   DW_AT_decl_line   : 926
    <d81a4>   DW_AT_decl_column : 11
    <d81a5>   DW_AT_type        : <0xd70cd>
    <d81a9>   DW_AT_data_member_location: 8
 <2><d81aa>: Abbrev Number: 1 (DW_TAG_member)
    <d81ab>   DW_AT_name        : (indirect string, offset: 0x7ce4e): resourceid
    <d81af>   DW_AT_decl_file   : 6
    <d81b0>   DW_AT_decl_line   : 927
    <d81b2>   DW_AT_decl_column : 6
    <d81b3>   DW_AT_type        : <0xd69e8>
    <d81b7>   DW_AT_data_member_location: 16
 <2><d81b8>: Abbrev Number: 1 (DW_TAG_member)
    <d81b9>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d81bd>   DW_AT_decl_file   : 6
    <d81be>   DW_AT_decl_line   : 928
    <d81c0>   DW_AT_decl_column : 16
    <d81c1>   DW_AT_type        : <0xd6973>
    <d81c5>   DW_AT_data_member_location: 24
 <2><d81c6>: Abbrev Number: 1 (DW_TAG_member)
    <d81c7>   DW_AT_name        : (indirect string, offset: 0x5e11b): error_code
    <d81cb>   DW_AT_decl_file   : 6
    <d81cc>   DW_AT_decl_line   : 929
    <d81ce>   DW_AT_decl_column : 16
    <d81cf>   DW_AT_type        : <0xd6942>
    <d81d3>   DW_AT_data_member_location: 32
 <2><d81d4>: Abbrev Number: 1 (DW_TAG_member)
    <d81d5>   DW_AT_name        : (indirect string, offset: 0x7ca8e): request_code
    <d81d9>   DW_AT_decl_file   : 6
    <d81da>   DW_AT_decl_line   : 930
    <d81dc>   DW_AT_decl_column : 16
    <d81dd>   DW_AT_type        : <0xd6942>
    <d81e1>   DW_AT_data_member_location: 33
 <2><d81e2>: Abbrev Number: 1 (DW_TAG_member)
    <d81e3>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <d81e7>   DW_AT_decl_file   : 6
    <d81e8>   DW_AT_decl_line   : 931
    <d81ea>   DW_AT_decl_column : 16
    <d81eb>   DW_AT_type        : <0xd6942>
    <d81ef>   DW_AT_data_member_location: 34
 <2><d81f0>: Abbrev Number: 0
 <1><d81f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <d81f2>   DW_AT_name        : (indirect string, offset: 0x73c69): XErrorEvent
    <d81f6>   DW_AT_decl_file   : 6
    <d81f7>   DW_AT_decl_line   : 932
    <d81f9>   DW_AT_decl_column : 3
    <d81fa>   DW_AT_type        : <0xd8186>
 <1><d81fe>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d81ff>   DW_AT_byte_size   : 40
    <d8200>   DW_AT_decl_file   : 6
    <d8200>   DW_AT_decl_line   : 934
    <d8202>   DW_AT_decl_column : 9
    <d8202>   DW_AT_sibling     : <0xd824d>
 <2><d8206>: Abbrev Number: 1 (DW_TAG_member)
    <d8207>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d820b>   DW_AT_decl_file   : 6
    <d820c>   DW_AT_decl_line   : 935
    <d820e>   DW_AT_decl_column : 6
    <d820f>   DW_AT_type        : <0xd6957>
    <d8213>   DW_AT_data_member_location: 0
 <2><d8214>: Abbrev Number: 1 (DW_TAG_member)
    <d8215>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d8219>   DW_AT_decl_file   : 6
    <d821a>   DW_AT_decl_line   : 936
    <d821c>   DW_AT_decl_column : 16
    <d821d>   DW_AT_type        : <0xd6973>
    <d8221>   DW_AT_data_member_location: 8
 <2><d8222>: Abbrev Number: 1 (DW_TAG_member)
    <d8223>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d8227>   DW_AT_decl_file   : 6
    <d8228>   DW_AT_decl_line   : 937
    <d822a>   DW_AT_decl_column : 7
    <d822b>   DW_AT_type        : <0xd6957>
    <d822f>   DW_AT_data_member_location: 16
 <2><d8230>: Abbrev Number: 1 (DW_TAG_member)
    <d8231>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d8235>   DW_AT_decl_file   : 6
    <d8236>   DW_AT_decl_line   : 938
    <d8238>   DW_AT_decl_column : 11
    <d8239>   DW_AT_type        : <0xd70cd>
    <d823d>   DW_AT_data_member_location: 24
 <2><d823e>: Abbrev Number: 1 (DW_TAG_member)
    <d823f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d8243>   DW_AT_decl_file   : 6
    <d8244>   DW_AT_decl_line   : 939
    <d8246>   DW_AT_decl_column : 9
    <d8247>   DW_AT_type        : <0xd6a18>
    <d824b>   DW_AT_data_member_location: 32
 <2><d824c>: Abbrev Number: 0
 <1><d824d>: Abbrev Number: 4 (DW_TAG_typedef)
    <d824e>   DW_AT_name        : (indirect string, offset: 0x68f70): XAnyEvent
    <d8252>   DW_AT_decl_file   : 6
    <d8253>   DW_AT_decl_line   : 940
    <d8255>   DW_AT_decl_column : 3
    <d8256>   DW_AT_type        : <0xd81fe>
 <1><d825a>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d825b>   DW_AT_byte_size   : 40
    <d825c>   DW_AT_decl_file   : 6
    <d825c>   DW_AT_decl_line   : 948
    <d825e>   DW_AT_decl_column : 9
    <d825e>   DW_AT_sibling     : <0xd82b7>
 <2><d8262>: Abbrev Number: 1 (DW_TAG_member)
    <d8263>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d8267>   DW_AT_decl_file   : 6
    <d8268>   DW_AT_decl_line   : 950
    <d826a>   DW_AT_decl_column : 20
    <d826b>   DW_AT_type        : <0xd6957>
    <d826f>   DW_AT_data_member_location: 0
 <2><d8270>: Abbrev Number: 1 (DW_TAG_member)
    <d8271>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d8275>   DW_AT_decl_file   : 6
    <d8276>   DW_AT_decl_line   : 951
    <d8278>   DW_AT_decl_column : 20
    <d8279>   DW_AT_type        : <0xd6973>
    <d827d>   DW_AT_data_member_location: 8
 <2><d827e>: Abbrev Number: 1 (DW_TAG_member)
    <d827f>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d8283>   DW_AT_decl_file   : 6
    <d8284>   DW_AT_decl_line   : 952
    <d8286>   DW_AT_decl_column : 20
    <d8287>   DW_AT_type        : <0xd6957>
    <d828b>   DW_AT_data_member_location: 16
 <2><d828c>: Abbrev Number: 1 (DW_TAG_member)
    <d828d>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d8291>   DW_AT_decl_file   : 6
    <d8292>   DW_AT_decl_line   : 953
    <d8294>   DW_AT_decl_column : 21
    <d8295>   DW_AT_type        : <0xd70cd>
    <d8299>   DW_AT_data_member_location: 24
 <2><d829a>: Abbrev Number: 1 (DW_TAG_member)
    <d829b>   DW_AT_name        : (indirect string, offset: 0x871a3): extension
    <d829f>   DW_AT_decl_file   : 6
    <d82a0>   DW_AT_decl_line   : 954
    <d82a2>   DW_AT_decl_column : 20
    <d82a3>   DW_AT_type        : <0xd6957>
    <d82a7>   DW_AT_data_member_location: 32
 <2><d82a8>: Abbrev Number: 1 (DW_TAG_member)
    <d82a9>   DW_AT_name        : (indirect string, offset: 0x8d566): evtype
    <d82ad>   DW_AT_decl_file   : 6
    <d82ae>   DW_AT_decl_line   : 955
    <d82b0>   DW_AT_decl_column : 20
    <d82b1>   DW_AT_type        : <0xd6957>
    <d82b5>   DW_AT_data_member_location: 36
 <2><d82b6>: Abbrev Number: 0
 <1><d82b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <d82b8>   DW_AT_name        : (indirect string, offset: 0x63563): XGenericEvent
    <d82bc>   DW_AT_decl_file   : 6
    <d82bd>   DW_AT_decl_line   : 956
    <d82bf>   DW_AT_decl_column : 7
    <d82c0>   DW_AT_type        : <0xd825a>
 <1><d82c4>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d82c5>   DW_AT_byte_size   : 56
    <d82c6>   DW_AT_decl_file   : 6
    <d82c6>   DW_AT_decl_line   : 958
    <d82c8>   DW_AT_decl_column : 9
    <d82c8>   DW_AT_sibling     : <0xd833d>
 <2><d82cc>: Abbrev Number: 1 (DW_TAG_member)
    <d82cd>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d82d1>   DW_AT_decl_file   : 6
    <d82d2>   DW_AT_decl_line   : 959
    <d82d4>   DW_AT_decl_column : 20
    <d82d5>   DW_AT_type        : <0xd6957>
    <d82d9>   DW_AT_data_member_location: 0
 <2><d82da>: Abbrev Number: 1 (DW_TAG_member)
    <d82db>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d82df>   DW_AT_decl_file   : 6
    <d82e0>   DW_AT_decl_line   : 960
    <d82e2>   DW_AT_decl_column : 20
    <d82e3>   DW_AT_type        : <0xd6973>
    <d82e7>   DW_AT_data_member_location: 8
 <2><d82e8>: Abbrev Number: 1 (DW_TAG_member)
    <d82e9>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d82ed>   DW_AT_decl_file   : 6
    <d82ee>   DW_AT_decl_line   : 961
    <d82f0>   DW_AT_decl_column : 20
    <d82f1>   DW_AT_type        : <0xd6957>
    <d82f5>   DW_AT_data_member_location: 16
 <2><d82f6>: Abbrev Number: 1 (DW_TAG_member)
    <d82f7>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d82fb>   DW_AT_decl_file   : 6
    <d82fc>   DW_AT_decl_line   : 962
    <d82fe>   DW_AT_decl_column : 21
    <d82ff>   DW_AT_type        : <0xd70cd>
    <d8303>   DW_AT_data_member_location: 24
 <2><d8304>: Abbrev Number: 1 (DW_TAG_member)
    <d8305>   DW_AT_name        : (indirect string, offset: 0x871a3): extension
    <d8309>   DW_AT_decl_file   : 6
    <d830a>   DW_AT_decl_line   : 963
    <d830c>   DW_AT_decl_column : 20
    <d830d>   DW_AT_type        : <0xd6957>
    <d8311>   DW_AT_data_member_location: 32
 <2><d8312>: Abbrev Number: 1 (DW_TAG_member)
    <d8313>   DW_AT_name        : (indirect string, offset: 0x8d566): evtype
    <d8317>   DW_AT_decl_file   : 6
    <d8318>   DW_AT_decl_line   : 964
    <d831a>   DW_AT_decl_column : 20
    <d831b>   DW_AT_type        : <0xd6957>
    <d831f>   DW_AT_data_member_location: 36
 <2><d8320>: Abbrev Number: 1 (DW_TAG_member)
    <d8321>   DW_AT_name        : (indirect string, offset: 0x8a741): cookie
    <d8325>   DW_AT_decl_file   : 6
    <d8326>   DW_AT_decl_line   : 965
    <d8328>   DW_AT_decl_column : 20
    <d8329>   DW_AT_type        : <0xd692f>
    <d832d>   DW_AT_data_member_location: 40
 <2><d832e>: Abbrev Number: 1 (DW_TAG_member)
    <d832f>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <d8333>   DW_AT_decl_file   : 6
    <d8334>   DW_AT_decl_line   : 966
    <d8336>   DW_AT_decl_column : 21
    <d8337>   DW_AT_type        : <0xd6999>
    <d833b>   DW_AT_data_member_location: 48
 <2><d833c>: Abbrev Number: 0
 <1><d833d>: Abbrev Number: 4 (DW_TAG_typedef)
    <d833e>   DW_AT_name        : (indirect string, offset: 0x5e7fe): XGenericEventCookie
    <d8342>   DW_AT_decl_file   : 6
    <d8343>   DW_AT_decl_line   : 967
    <d8345>   DW_AT_decl_column : 3
    <d8346>   DW_AT_type        : <0xd82c4>
 <1><d834a>: Abbrev Number: 72 (DW_TAG_union_type)
    <d834b>   DW_AT_name        : (indirect string, offset: 0x707f7): _XEvent
    <d834f>   DW_AT_byte_size   : 192
    <d8350>   DW_AT_decl_file   : 6
    <d8351>   DW_AT_decl_line   : 973
    <d8353>   DW_AT_decl_column : 15
    <d8354>   DW_AT_sibling     : <0xd84fd>
 <2><d8358>: Abbrev Number: 8 (DW_TAG_member)
    <d8359>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d835d>   DW_AT_decl_file   : 6
    <d835d>   DW_AT_decl_line   : 974
    <d835f>   DW_AT_decl_column : 13
    <d8360>   DW_AT_type        : <0xd6957>
 <2><d8364>: Abbrev Number: 8 (DW_TAG_member)
    <d8365>   DW_AT_name        : (indirect string, offset: 0x61d72): xany
    <d8369>   DW_AT_decl_file   : 6
    <d8369>   DW_AT_decl_line   : 975
    <d836b>   DW_AT_decl_column : 12
    <d836c>   DW_AT_type        : <0xd824d>
 <2><d8370>: Abbrev Number: 8 (DW_TAG_member)
    <d8371>   DW_AT_name        : (indirect string, offset: 0x72f4b): xkey
    <d8375>   DW_AT_decl_file   : 6
    <d8375>   DW_AT_decl_line   : 976
    <d8377>   DW_AT_decl_column : 12
    <d8378>   DW_AT_type        : <0xd70d2>
 <2><d837c>: Abbrev Number: 8 (DW_TAG_member)
    <d837d>   DW_AT_name        : (indirect string, offset: 0x7adcf): xbutton
    <d8381>   DW_AT_decl_file   : 6
    <d8381>   DW_AT_decl_line   : 977
    <d8383>   DW_AT_decl_column : 15
    <d8384>   DW_AT_type        : <0xd71b6>
 <2><d8388>: Abbrev Number: 8 (DW_TAG_member)
    <d8389>   DW_AT_name        : (indirect string, offset: 0x8d389): xmotion
    <d838d>   DW_AT_decl_file   : 6
    <d838d>   DW_AT_decl_line   : 978
    <d838f>   DW_AT_decl_column : 15
    <d8390>   DW_AT_type        : <0xd729a>
 <2><d8394>: Abbrev Number: 8 (DW_TAG_member)
    <d8395>   DW_AT_name        : (indirect string, offset: 0x6578b): xcrossing
    <d8399>   DW_AT_decl_file   : 6
    <d8399>   DW_AT_decl_line   : 979
    <d839b>   DW_AT_decl_column : 17
    <d839c>   DW_AT_type        : <0xd739a>
 <2><d83a0>: Abbrev Number: 8 (DW_TAG_member)
    <d83a1>   DW_AT_name        : (indirect string, offset: 0x6b365): xfocus
    <d83a5>   DW_AT_decl_file   : 6
    <d83a5>   DW_AT_decl_line   : 980
    <d83a7>   DW_AT_decl_column : 20
    <d83a8>   DW_AT_type        : <0xd7412>
 <2><d83ac>: Abbrev Number: 8 (DW_TAG_member)
    <d83ad>   DW_AT_name        : (indirect string, offset: 0x74708): xexpose
    <d83b1>   DW_AT_decl_file   : 6
    <d83b1>   DW_AT_decl_line   : 981
    <d83b3>   DW_AT_decl_column : 15
    <d83b4>   DW_AT_type        : <0xd751a>
 <2><d83b8>: Abbrev Number: 8 (DW_TAG_member)
    <d83b9>   DW_AT_name        : (indirect string, offset: 0x60f75): xgraphicsexpose
    <d83bd>   DW_AT_decl_file   : 6
    <d83bd>   DW_AT_decl_line   : 982
    <d83bf>   DW_AT_decl_column : 23
    <d83c0>   DW_AT_type        : <0xd75d4>
 <2><d83c4>: Abbrev Number: 8 (DW_TAG_member)
    <d83c5>   DW_AT_name        : (indirect string, offset: 0x67447): xnoexpose
    <d83c9>   DW_AT_decl_file   : 6
    <d83c9>   DW_AT_decl_line   : 983
    <d83cb>   DW_AT_decl_column : 17
    <d83cc>   DW_AT_type        : <0xd764c>
 <2><d83d0>: Abbrev Number: 8 (DW_TAG_member)
    <d83d1>   DW_AT_name        : (indirect string, offset: 0x7eab3): xvisibility
    <d83d5>   DW_AT_decl_file   : 6
    <d83d5>   DW_AT_decl_line   : 984
    <d83d7>   DW_AT_decl_column : 19
    <d83d8>   DW_AT_type        : <0xd76b6>
 <2><d83dc>: Abbrev Number: 8 (DW_TAG_member)
    <d83dd>   DW_AT_name        : (indirect string, offset: 0x85750): xcreatewindow
    <d83e1>   DW_AT_decl_file   : 6
    <d83e1>   DW_AT_decl_line   : 985
    <d83e3>   DW_AT_decl_column : 21
    <d83e4>   DW_AT_type        : <0xd7770>
 <2><d83e8>: Abbrev Number: 8 (DW_TAG_member)
    <d83e9>   DW_AT_name        : (indirect string, offset: 0x85333): xdestroywindow
    <d83ed>   DW_AT_decl_file   : 6
    <d83ed>   DW_AT_decl_line   : 986
    <d83ef>   DW_AT_decl_column : 22
    <d83f0>   DW_AT_type        : <0xd77da>
 <2><d83f4>: Abbrev Number: 8 (DW_TAG_member)
    <d83f5>   DW_AT_name        : (indirect string, offset: 0x68c1d): xunmap
    <d83f9>   DW_AT_decl_file   : 6
    <d83f9>   DW_AT_decl_line   : 987
    <d83fb>   DW_AT_decl_column : 14
    <d83fc>   DW_AT_type        : <0xd7852>
 <2><d8400>: Abbrev Number: 8 (DW_TAG_member)
    <d8401>   DW_AT_name        : (indirect string, offset: 0x6e0f9): xmap
    <d8405>   DW_AT_decl_file   : 6
    <d8405>   DW_AT_decl_line   : 988
    <d8407>   DW_AT_decl_column : 12
    <d8408>   DW_AT_type        : <0xd78ca>
 <2><d840c>: Abbrev Number: 8 (DW_TAG_member)
    <d840d>   DW_AT_name        : (indirect string, offset: 0x63a18): xmaprequest
    <d8411>   DW_AT_decl_file   : 6
    <d8411>   DW_AT_decl_line   : 989
    <d8413>   DW_AT_decl_column : 19
    <d8414>   DW_AT_type        : <0xd7934>
 <2><d8418>: Abbrev Number: 8 (DW_TAG_member)
    <d8419>   DW_AT_name        : (indirect string, offset: 0x71d41): xreparent
    <d841d>   DW_AT_decl_file   : 6
    <d841d>   DW_AT_decl_line   : 990
    <d841f>   DW_AT_decl_column : 17
    <d8420>   DW_AT_type        : <0xd79d2>
 <2><d8424>: Abbrev Number: 8 (DW_TAG_member)
    <d8425>   DW_AT_name        : (indirect string, offset: 0x62b6d): xconfigure
    <d8429>   DW_AT_decl_file   : 6
    <d8429>   DW_AT_decl_line   : 991
    <d842b>   DW_AT_decl_column : 18
    <d842c>   DW_AT_type        : <0xd7a9a>
 <2><d8430>: Abbrev Number: 8 (DW_TAG_member)
    <d8431>   DW_AT_name        : (indirect string, offset: 0x87148): xgravity
    <d8435>   DW_AT_decl_file   : 6
    <d8435>   DW_AT_decl_line   : 992
    <d8437>   DW_AT_decl_column : 16
    <d8438>   DW_AT_type        : <0xd7b1c>
 <2><d843c>: Abbrev Number: 8 (DW_TAG_member)
    <d843d>   DW_AT_name        : (indirect string, offset: 0x73483): xresizerequest
    <d8441>   DW_AT_decl_file   : 6
    <d8441>   DW_AT_decl_line   : 993
    <d8443>   DW_AT_decl_column : 22
    <d8444>   DW_AT_type        : <0xd7b94>
 <2><d8448>: Abbrev Number: 8 (DW_TAG_member)
    <d8449>   DW_AT_name        : (indirect string, offset: 0x75c48): xconfigurerequest
    <d844d>   DW_AT_decl_file   : 6
    <d844d>   DW_AT_decl_line   : 994
    <d844f>   DW_AT_decl_column : 25
    <d8450>   DW_AT_type        : <0xd7c6a>
 <2><d8454>: Abbrev Number: 8 (DW_TAG_member)
    <d8455>   DW_AT_name        : (indirect string, offset: 0x7934a): xcirculate
    <d8459>   DW_AT_decl_file   : 6
    <d8459>   DW_AT_decl_line   : 995
    <d845b>   DW_AT_decl_column : 18
    <d845c>   DW_AT_type        : <0xd7ce2>
 <2><d8460>: Abbrev Number: 8 (DW_TAG_member)
    <d8461>   DW_AT_name        : (indirect string, offset: 0x63507): xcirculaterequest
    <d8465>   DW_AT_decl_file   : 6
    <d8465>   DW_AT_decl_line   : 996
    <d8467>   DW_AT_decl_column : 25
    <d8468>   DW_AT_type        : <0xd7d5a>
 <2><d846c>: Abbrev Number: 8 (DW_TAG_member)
    <d846d>   DW_AT_name        : (indirect string, offset: 0x7b576): xproperty
    <d8471>   DW_AT_decl_file   : 6
    <d8471>   DW_AT_decl_line   : 997
    <d8473>   DW_AT_decl_column : 17
    <d8474>   DW_AT_type        : <0xd7de0>
 <2><d8478>: Abbrev Number: 8 (DW_TAG_member)
    <d8479>   DW_AT_name        : (indirect string, offset: 0x8d9b9): xselectionclear
    <d847d>   DW_AT_decl_file   : 6
    <d847d>   DW_AT_decl_line   : 998
    <d847f>   DW_AT_decl_column : 23
    <d8480>   DW_AT_type        : <0xd7e58>
 <2><d8484>: Abbrev Number: 8 (DW_TAG_member)
    <d8485>   DW_AT_name        : (indirect string, offset: 0x8b832): xselectionrequest
    <d8489>   DW_AT_decl_file   : 6
    <d8489>   DW_AT_decl_line   : 999
    <d848b>   DW_AT_decl_column : 25
    <d848c>   DW_AT_type        : <0xd7efa>
 <2><d8490>: Abbrev Number: 8 (DW_TAG_member)
    <d8491>   DW_AT_name        : (indirect string, offset: 0x63c38): xselection
    <d8495>   DW_AT_decl_file   : 6
    <d8495>   DW_AT_decl_line   : 1000
    <d8497>   DW_AT_decl_column : 18
    <d8498>   DW_AT_type        : <0xd7f8e>
 <2><d849c>: Abbrev Number: 8 (DW_TAG_member)
    <d849d>   DW_AT_name        : (indirect string, offset: 0x7cbae): xcolormap
    <d84a1>   DW_AT_decl_file   : 6
    <d84a1>   DW_AT_decl_line   : 1001
    <d84a3>   DW_AT_decl_column : 17
    <d84a4>   DW_AT_type        : <0xd8014>
 <2><d84a8>: Abbrev Number: 8 (DW_TAG_member)
    <d84a9>   DW_AT_name        : (indirect string, offset: 0x6032b): xclient
    <d84ad>   DW_AT_decl_file   : 6
    <d84ad>   DW_AT_decl_line   : 1002
    <d84af>   DW_AT_decl_column : 22
    <d84b0>   DW_AT_type        : <0xd80f3>
 <2><d84b4>: Abbrev Number: 8 (DW_TAG_member)
    <d84b5>   DW_AT_name        : (indirect string, offset: 0x7a27a): xmapping
    <d84b9>   DW_AT_decl_file   : 6
    <d84b9>   DW_AT_decl_line   : 1003
    <d84bb>   DW_AT_decl_column : 16
    <d84bc>   DW_AT_type        : <0xd8179>
 <2><d84c0>: Abbrev Number: 8 (DW_TAG_member)
    <d84c1>   DW_AT_name        : (indirect string, offset: 0x78767): xerror
    <d84c5>   DW_AT_decl_file   : 6
    <d84c5>   DW_AT_decl_line   : 1004
    <d84c7>   DW_AT_decl_column : 14
    <d84c8>   DW_AT_type        : <0xd81f1>
 <2><d84cc>: Abbrev Number: 8 (DW_TAG_member)
    <d84cd>   DW_AT_name        : (indirect string, offset: 0x6f0e7): xkeymap
    <d84d1>   DW_AT_decl_file   : 6
    <d84d1>   DW_AT_decl_line   : 1005
    <d84d3>   DW_AT_decl_column : 15
    <d84d4>   DW_AT_type        : <0xd747c>
 <2><d84d8>: Abbrev Number: 8 (DW_TAG_member)
    <d84d9>   DW_AT_name        : (indirect string, offset: 0x70ee5): xgeneric
    <d84dd>   DW_AT_decl_file   : 6
    <d84dd>   DW_AT_decl_line   : 1006
    <d84df>   DW_AT_decl_column : 16
    <d84e0>   DW_AT_type        : <0xd82b7>
 <2><d84e4>: Abbrev Number: 8 (DW_TAG_member)
    <d84e5>   DW_AT_name        : (indirect string, offset: 0x8a740): xcookie
    <d84e9>   DW_AT_decl_file   : 6
    <d84e9>   DW_AT_decl_line   : 1007
    <d84eb>   DW_AT_decl_column : 22
    <d84ec>   DW_AT_type        : <0xd833d>
 <2><d84f0>: Abbrev Number: 31 (DW_TAG_member)
    <d84f1>   DW_AT_name        : pad
    <d84f5>   DW_AT_decl_file   : 6
    <d84f5>   DW_AT_decl_line   : 1008
    <d84f7>   DW_AT_decl_column : 7
    <d84f8>   DW_AT_type        : <0xd84fd>
 <2><d84fc>: Abbrev Number: 0
 <1><d84fd>: Abbrev Number: 18 (DW_TAG_array_type)
    <d84fe>   DW_AT_type        : <0xd697a>
    <d8502>   DW_AT_sibling     : <0xd850d>
 <2><d8506>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d8507>   DW_AT_type        : <0xd6973>
    <d850b>   DW_AT_upper_bound : 23
 <2><d850c>: Abbrev Number: 0
 <1><d850d>: Abbrev Number: 4 (DW_TAG_typedef)
    <d850e>   DW_AT_name        : (indirect string, offset: 0x707f8): XEvent
    <d8512>   DW_AT_decl_file   : 6
    <d8513>   DW_AT_decl_line   : 1009
    <d8515>   DW_AT_decl_column : 3
    <d8516>   DW_AT_type        : <0xd834a>
 <1><d851a>: Abbrev Number: 47 (DW_TAG_const_type)
    <d851b>   DW_AT_type        : <0xd850d>
 <1><d851f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8520>   DW_AT_name        : (indirect string, offset: 0x8fd23): XErrorHandler
    <d8524>   DW_AT_decl_file   : 6
    <d8525>   DW_AT_decl_line   : 1843
    <d8527>   DW_AT_decl_column : 15
    <d8528>   DW_AT_type        : <0xd852c>
 <1><d852c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d852d>   DW_AT_byte_size   : 8
    <d852d>   DW_AT_type        : <0xd8531>
 <1><d8531>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <d8532>   DW_AT_prototyped  : 1
    <d8532>   DW_AT_type        : <0xd6957>
    <d8536>   DW_AT_sibling     : <0xd8545>
 <2><d853a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d853b>   DW_AT_type        : <0xd70cd>
 <2><d853f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8540>   DW_AT_type        : <0xd8545>
 <2><d8544>: Abbrev Number: 0
 <1><d8545>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8546>   DW_AT_byte_size   : 8
    <d8546>   DW_AT_type        : <0xd81f1>
 <1><d854a>: Abbrev Number: 38 (DW_TAG_structure_type)
    <d854b>   DW_AT_byte_size   : 32
    <d854c>   DW_AT_decl_file   : 7
    <d854d>   DW_AT_decl_line   : 163
    <d854e>   DW_AT_decl_column : 9
    <d854e>   DW_AT_sibling     : <0xd8587>
 <2><d8552>: Abbrev Number: 3 (DW_TAG_member)
    <d8553>   DW_AT_name        : (indirect string, offset: 0x655de): value
    <d8557>   DW_AT_decl_file   : 7
    <d8558>   DW_AT_decl_line   : 164
    <d8559>   DW_AT_decl_column : 20
    <d855a>   DW_AT_type        : <0xd8587>
    <d855e>   DW_AT_data_member_location: 0
 <2><d855f>: Abbrev Number: 3 (DW_TAG_member)
    <d8560>   DW_AT_name        : (indirect string, offset: 0x69045): encoding
    <d8564>   DW_AT_decl_file   : 7
    <d8565>   DW_AT_decl_line   : 165
    <d8566>   DW_AT_decl_column : 10
    <d8567>   DW_AT_type        : <0xd69f4>
    <d856b>   DW_AT_data_member_location: 8
 <2><d856c>: Abbrev Number: 3 (DW_TAG_member)
    <d856d>   DW_AT_name        : (indirect string, offset: 0x82f17): format
    <d8571>   DW_AT_decl_file   : 7
    <d8572>   DW_AT_decl_line   : 166
    <d8573>   DW_AT_decl_column : 9
    <d8574>   DW_AT_type        : <0xd6957>
    <d8578>   DW_AT_data_member_location: 16
 <2><d8579>: Abbrev Number: 3 (DW_TAG_member)
    <d857a>   DW_AT_name        : (indirect string, offset: 0x8fb9d): nitems
    <d857e>   DW_AT_decl_file   : 7
    <d857f>   DW_AT_decl_line   : 167
    <d8580>   DW_AT_decl_column : 19
    <d8581>   DW_AT_type        : <0xd6973>
    <d8585>   DW_AT_data_member_location: 24
 <2><d8586>: Abbrev Number: 0
 <1><d8587>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8588>   DW_AT_byte_size   : 8
    <d8588>   DW_AT_type        : <0xd6942>
 <1><d858c>: Abbrev Number: 11 (DW_TAG_typedef)
    <d858d>   DW_AT_name        : (indirect string, offset: 0x8fc5b): XTextProperty
    <d8591>   DW_AT_decl_file   : 7
    <d8592>   DW_AT_decl_line   : 168
    <d8593>   DW_AT_decl_column : 3
    <d8594>   DW_AT_type        : <0xd854a>
 <1><d8598>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8599>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <d859d>   DW_AT_decl_file   : 8
    <d859e>   DW_AT_decl_line   : 165
    <d859f>   DW_AT_decl_column : 33
    <d85a0>   DW_AT_type        : <0xd85a4>
 <1><d85a4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85a5>   DW_AT_byte_size   : 8
    <d85a5>   DW_AT_type        : <0xd85a9>
 <1><d85a9>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d85aa>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <d85ae>   DW_AT_declaration : 1
 <1><d85ae>: Abbrev Number: 11 (DW_TAG_typedef)
    <d85af>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <d85b3>   DW_AT_decl_file   : 8
    <d85b4>   DW_AT_decl_line   : 169
    <d85b5>   DW_AT_decl_column : 34
    <d85b6>   DW_AT_type        : <0xd85ba>
 <1><d85ba>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85bb>   DW_AT_byte_size   : 8
    <d85bb>   DW_AT_type        : <0xd85bf>
 <1><d85bf>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d85c0>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <d85c4>   DW_AT_declaration : 1
 <1><d85c4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85c5>   DW_AT_byte_size   : 8
    <d85c5>   DW_AT_type        : <0xd85ae>
 <1><d85c9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85ca>   DW_AT_byte_size   : 8
    <d85ca>   DW_AT_type        : <0xd6957>
 <1><d85ce>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85cf>   DW_AT_byte_size   : 8
    <d85cf>   DW_AT_type        : <0xd6973>
 <1><d85d3>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d85d4>   DW_AT_byte_size   : 8
    <d85d4>   DW_AT_type        : <0xd69a7>
 <1><d85d8>: Abbrev Number: 49 (DW_TAG_restrict_type)
    <d85d9>   DW_AT_type        : <0xd85d3>
 <1><d85dd>: Abbrev Number: 30 (DW_TAG_structure_type)
    <d85de>   DW_AT_name        : (indirect string, offset: 0x59af): _IO_FILE
    <d85e2>   DW_AT_byte_size   : 216
    <d85e3>   DW_AT_decl_file   : 9
    <d85e4>   DW_AT_decl_line   : 49
    <d85e5>   DW_AT_decl_column : 8
    <d85e6>   DW_AT_sibling     : <0xd8764>
 <2><d85ea>: Abbrev Number: 3 (DW_TAG_member)
    <d85eb>   DW_AT_name        : (indirect string, offset: 0x4e5de): _flags
    <d85ef>   DW_AT_decl_file   : 9
    <d85f0>   DW_AT_decl_line   : 51
    <d85f1>   DW_AT_decl_column : 7
    <d85f2>   DW_AT_type        : <0xd6957>
    <d85f6>   DW_AT_data_member_location: 0
 <2><d85f7>: Abbrev Number: 3 (DW_TAG_member)
    <d85f8>   DW_AT_name        : (indirect string, offset: 0x3570a): _IO_read_ptr
    <d85fc>   DW_AT_decl_file   : 9
    <d85fd>   DW_AT_decl_line   : 54
    <d85fe>   DW_AT_decl_column : 9
    <d85ff>   DW_AT_type        : <0xd699b>
    <d8603>   DW_AT_data_member_location: 8
 <2><d8604>: Abbrev Number: 3 (DW_TAG_member)
    <d8605>   DW_AT_name        : (indirect string, offset: 0x4c222): _IO_read_end
    <d8609>   DW_AT_decl_file   : 9
    <d860a>   DW_AT_decl_line   : 55
    <d860b>   DW_AT_decl_column : 9
    <d860c>   DW_AT_type        : <0xd699b>
    <d8610>   DW_AT_data_member_location: 16
 <2><d8611>: Abbrev Number: 3 (DW_TAG_member)
    <d8612>   DW_AT_name        : (indirect string, offset: 0x31ac7): _IO_read_base
    <d8616>   DW_AT_decl_file   : 9
    <d8617>   DW_AT_decl_line   : 56
    <d8618>   DW_AT_decl_column : 9
    <d8619>   DW_AT_type        : <0xd699b>
    <d861d>   DW_AT_data_member_location: 24
 <2><d861e>: Abbrev Number: 3 (DW_TAG_member)
    <d861f>   DW_AT_name        : (indirect string, offset: 0x42c55): _IO_write_base
    <d8623>   DW_AT_decl_file   : 9
    <d8624>   DW_AT_decl_line   : 57
    <d8625>   DW_AT_decl_column : 9
    <d8626>   DW_AT_type        : <0xd699b>
    <d862a>   DW_AT_data_member_location: 32
 <2><d862b>: Abbrev Number: 3 (DW_TAG_member)
    <d862c>   DW_AT_name        : (indirect string, offset: 0x34886): _IO_write_ptr
    <d8630>   DW_AT_decl_file   : 9
    <d8631>   DW_AT_decl_line   : 58
    <d8632>   DW_AT_decl_column : 9
    <d8633>   DW_AT_type        : <0xd699b>
    <d8637>   DW_AT_data_member_location: 40
 <2><d8638>: Abbrev Number: 3 (DW_TAG_member)
    <d8639>   DW_AT_name        : (indirect string, offset: 0x4ae61): _IO_write_end
    <d863d>   DW_AT_decl_file   : 9
    <d863e>   DW_AT_decl_line   : 59
    <d863f>   DW_AT_decl_column : 9
    <d8640>   DW_AT_type        : <0xd699b>
    <d8644>   DW_AT_data_member_location: 48
 <2><d8645>: Abbrev Number: 3 (DW_TAG_member)
    <d8646>   DW_AT_name        : (indirect string, offset: 0x1ba0b): _IO_buf_base
    <d864a>   DW_AT_decl_file   : 9
    <d864b>   DW_AT_decl_line   : 60
    <d864c>   DW_AT_decl_column : 9
    <d864d>   DW_AT_type        : <0xd699b>
    <d8651>   DW_AT_data_member_location: 56
 <2><d8652>: Abbrev Number: 3 (DW_TAG_member)
    <d8653>   DW_AT_name        : (indirect string, offset: 0x256c0): _IO_buf_end
    <d8657>   DW_AT_decl_file   : 9
    <d8658>   DW_AT_decl_line   : 61
    <d8659>   DW_AT_decl_column : 9
    <d865a>   DW_AT_type        : <0xd699b>
    <d865e>   DW_AT_data_member_location: 64
 <2><d865f>: Abbrev Number: 3 (DW_TAG_member)
    <d8660>   DW_AT_name        : (indirect string, offset: 0x3c689): _IO_save_base
    <d8664>   DW_AT_decl_file   : 9
    <d8665>   DW_AT_decl_line   : 64
    <d8666>   DW_AT_decl_column : 9
    <d8667>   DW_AT_type        : <0xd699b>
    <d866b>   DW_AT_data_member_location: 72
 <2><d866c>: Abbrev Number: 3 (DW_TAG_member)
    <d866d>   DW_AT_name        : (indirect string, offset: 0x3ce9e): _IO_backup_base
    <d8671>   DW_AT_decl_file   : 9
    <d8672>   DW_AT_decl_line   : 65
    <d8673>   DW_AT_decl_column : 9
    <d8674>   DW_AT_type        : <0xd699b>
    <d8678>   DW_AT_data_member_location: 80
 <2><d8679>: Abbrev Number: 3 (DW_TAG_member)
    <d867a>   DW_AT_name        : (indirect string, offset: 0x42ac8): _IO_save_end
    <d867e>   DW_AT_decl_file   : 9
    <d867f>   DW_AT_decl_line   : 66
    <d8680>   DW_AT_decl_column : 9
    <d8681>   DW_AT_type        : <0xd699b>
    <d8685>   DW_AT_data_member_location: 88
 <2><d8686>: Abbrev Number: 3 (DW_TAG_member)
    <d8687>   DW_AT_name        : (indirect string, offset: 0x489b4): _markers
    <d868b>   DW_AT_decl_file   : 9
    <d868c>   DW_AT_decl_line   : 68
    <d868d>   DW_AT_decl_column : 22
    <d868e>   DW_AT_type        : <0xd877d>
    <d8692>   DW_AT_data_member_location: 96
 <2><d8693>: Abbrev Number: 3 (DW_TAG_member)
    <d8694>   DW_AT_name        : (indirect string, offset: 0x299f0): _chain
    <d8698>   DW_AT_decl_file   : 9
    <d8699>   DW_AT_decl_line   : 70
    <d869a>   DW_AT_decl_column : 20
    <d869b>   DW_AT_type        : <0xd8782>
    <d869f>   DW_AT_data_member_location: 104
 <2><d86a0>: Abbrev Number: 3 (DW_TAG_member)
    <d86a1>   DW_AT_name        : (indirect string, offset: 0x8ec6): _fileno
    <d86a5>   DW_AT_decl_file   : 9
    <d86a6>   DW_AT_decl_line   : 72
    <d86a7>   DW_AT_decl_column : 7
    <d86a8>   DW_AT_type        : <0xd6957>
    <d86ac>   DW_AT_data_member_location: 112
 <2><d86ad>: Abbrev Number: 3 (DW_TAG_member)
    <d86ae>   DW_AT_name        : (indirect string, offset: 0x569c1): _flags2
    <d86b2>   DW_AT_decl_file   : 9
    <d86b3>   DW_AT_decl_line   : 73
    <d86b4>   DW_AT_decl_column : 7
    <d86b5>   DW_AT_type        : <0xd6957>
    <d86b9>   DW_AT_data_member_location: 116
 <2><d86ba>: Abbrev Number: 3 (DW_TAG_member)
    <d86bb>   DW_AT_name        : (indirect string, offset: 0x356da): _old_offset
    <d86bf>   DW_AT_decl_file   : 9
    <d86c0>   DW_AT_decl_line   : 74
    <d86c1>   DW_AT_decl_column : 11
    <d86c2>   DW_AT_type        : <0xd6981>
    <d86c6>   DW_AT_data_member_location: 120
 <2><d86c7>: Abbrev Number: 3 (DW_TAG_member)
    <d86c8>   DW_AT_name        : (indirect string, offset: 0x455ea): _cur_column
    <d86cc>   DW_AT_decl_file   : 9
    <d86cd>   DW_AT_decl_line   : 77
    <d86ce>   DW_AT_decl_column : 18
    <d86cf>   DW_AT_type        : <0xd695e>
    <d86d3>   DW_AT_data_member_location: 128
 <2><d86d4>: Abbrev Number: 3 (DW_TAG_member)
    <d86d5>   DW_AT_name        : (indirect string, offset: 0xda5b): _vtable_offset
    <d86d9>   DW_AT_decl_file   : 9
    <d86da>   DW_AT_decl_line   : 78
    <d86db>   DW_AT_decl_column : 15
    <d86dc>   DW_AT_type        : <0xd6949>
    <d86e0>   DW_AT_data_member_location: 130
 <2><d86e1>: Abbrev Number: 3 (DW_TAG_member)
    <d86e2>   DW_AT_name        : (indirect string, offset: 0x3d7c2): _shortbuf
    <d86e6>   DW_AT_decl_file   : 9
    <d86e7>   DW_AT_decl_line   : 79
    <d86e8>   DW_AT_decl_column : 8
    <d86e9>   DW_AT_type        : <0xd8787>
    <d86ed>   DW_AT_data_member_location: 131
 <2><d86ee>: Abbrev Number: 3 (DW_TAG_member)
    <d86ef>   DW_AT_name        : (indirect string, offset: 0x61f5e): _lock
    <d86f3>   DW_AT_decl_file   : 9
    <d86f4>   DW_AT_decl_line   : 81
    <d86f5>   DW_AT_decl_column : 15
    <d86f6>   DW_AT_type        : <0xd8797>
    <d86fa>   DW_AT_data_member_location: 136
 <2><d86fb>: Abbrev Number: 3 (DW_TAG_member)
    <d86fc>   DW_AT_name        : (indirect string, offset: 0x7c0cf): _offset
    <d8700>   DW_AT_decl_file   : 9
    <d8701>   DW_AT_decl_line   : 89
    <d8702>   DW_AT_decl_column : 13
    <d8703>   DW_AT_type        : <0xd698d>
    <d8707>   DW_AT_data_member_location: 144
 <2><d8708>: Abbrev Number: 3 (DW_TAG_member)
    <d8709>   DW_AT_name        : (indirect string, offset: 0x522dd): _codecvt
    <d870d>   DW_AT_decl_file   : 9
    <d870e>   DW_AT_decl_line   : 91
    <d870f>   DW_AT_decl_column : 23
    <d8710>   DW_AT_type        : <0xd87a1>
    <d8714>   DW_AT_data_member_location: 152
 <2><d8715>: Abbrev Number: 3 (DW_TAG_member)
    <d8716>   DW_AT_name        : (indirect string, offset: 0xdef4): _wide_data
    <d871a>   DW_AT_decl_file   : 9
    <d871b>   DW_AT_decl_line   : 92
    <d871c>   DW_AT_decl_column : 25
    <d871d>   DW_AT_type        : <0xd87ab>
    <d8721>   DW_AT_data_member_location: 160
 <2><d8722>: Abbrev Number: 3 (DW_TAG_member)
    <d8723>   DW_AT_name        : (indirect string, offset: 0x57dac): _freeres_list
    <d8727>   DW_AT_decl_file   : 9
    <d8728>   DW_AT_decl_line   : 93
    <d8729>   DW_AT_decl_column : 20
    <d872a>   DW_AT_type        : <0xd8782>
    <d872e>   DW_AT_data_member_location: 168
 <2><d872f>: Abbrev Number: 3 (DW_TAG_member)
    <d8730>   DW_AT_name        : (indirect string, offset: 0x591d6): _freeres_buf
    <d8734>   DW_AT_decl_file   : 9
    <d8735>   DW_AT_decl_line   : 94
    <d8736>   DW_AT_decl_column : 9
    <d8737>   DW_AT_type        : <0xd6999>
    <d873b>   DW_AT_data_member_location: 176
 <2><d873c>: Abbrev Number: 3 (DW_TAG_member)
    <d873d>   DW_AT_name        : (indirect string, offset: 0x34234): __pad5
    <d8741>   DW_AT_decl_file   : 9
    <d8742>   DW_AT_decl_line   : 95
    <d8743>   DW_AT_decl_column : 10
    <d8744>   DW_AT_type        : <0xd69b2>
    <d8748>   DW_AT_data_member_location: 184
 <2><d8749>: Abbrev Number: 3 (DW_TAG_member)
    <d874a>   DW_AT_name        : (indirect string, offset: 0x7e617): _mode
    <d874e>   DW_AT_decl_file   : 9
    <d874f>   DW_AT_decl_line   : 96
    <d8750>   DW_AT_decl_column : 7
    <d8751>   DW_AT_type        : <0xd6957>
    <d8755>   DW_AT_data_member_location: 192
 <2><d8756>: Abbrev Number: 3 (DW_TAG_member)
    <d8757>   DW_AT_name        : (indirect string, offset: 0x217fe): _unused2
    <d875b>   DW_AT_decl_file   : 9
    <d875c>   DW_AT_decl_line   : 98
    <d875d>   DW_AT_decl_column : 8
    <d875e>   DW_AT_type        : <0xd804a>
    <d8762>   DW_AT_data_member_location: 196
 <2><d8763>: Abbrev Number: 0
 <1><d8764>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8765>   DW_AT_name        : (indirect string, offset: 0x5ccf1): FILE
    <d8769>   DW_AT_decl_file   : 10
    <d876a>   DW_AT_decl_line   : 7
    <d876b>   DW_AT_decl_column : 25
    <d876c>   DW_AT_type        : <0xd85dd>
 <1><d8770>: Abbrev Number: 73 (DW_TAG_typedef)
    <d8771>   DW_AT_name        : (indirect string, offset: 0x5cafc): _IO_lock_t
    <d8775>   DW_AT_decl_file   : 9
    <d8776>   DW_AT_decl_line   : 43
    <d8777>   DW_AT_decl_column : 14
 <1><d8778>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d8779>   DW_AT_name        : (indirect string, offset: 0xa74b): _IO_marker
    <d877d>   DW_AT_declaration : 1
 <1><d877d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d877e>   DW_AT_byte_size   : 8
    <d877e>   DW_AT_type        : <0xd8778>
 <1><d8782>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8783>   DW_AT_byte_size   : 8
    <d8783>   DW_AT_type        : <0xd85dd>
 <1><d8787>: Abbrev Number: 18 (DW_TAG_array_type)
    <d8788>   DW_AT_type        : <0xd69a0>
    <d878c>   DW_AT_sibling     : <0xd8797>
 <2><d8790>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d8791>   DW_AT_type        : <0xd6973>
    <d8795>   DW_AT_upper_bound : 0
 <2><d8796>: Abbrev Number: 0
 <1><d8797>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8798>   DW_AT_byte_size   : 8
    <d8798>   DW_AT_type        : <0xd8770>
 <1><d879c>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d879d>   DW_AT_name        : (indirect string, offset: 0x522da): _IO_codecvt
    <d87a1>   DW_AT_declaration : 1
 <1><d87a1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87a2>   DW_AT_byte_size   : 8
    <d87a2>   DW_AT_type        : <0xd879c>
 <1><d87a6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d87a7>   DW_AT_name        : (indirect string, offset: 0xdef1): _IO_wide_data
    <d87ab>   DW_AT_declaration : 1
 <1><d87ab>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87ac>   DW_AT_byte_size   : 8
    <d87ac>   DW_AT_type        : <0xd87a6>
 <1><d87b0>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87b1>   DW_AT_byte_size   : 8
    <d87b1>   DW_AT_type        : <0xd8764>
 <1><d87b5>: Abbrev Number: 49 (DW_TAG_restrict_type)
    <d87b6>   DW_AT_type        : <0xd87b0>
 <1><d87ba>: Abbrev Number: 74 (DW_TAG_variable)
    <d87bb>   DW_AT_name        : (indirect string, offset: 0x8e995): stderr
    <d87bf>   DW_AT_decl_file   : 12
    <d87c0>   DW_AT_decl_line   : 139
    <d87c1>   DW_AT_decl_column : 14
    <d87c2>   DW_AT_type        : <0xd87b0>
    <d87c6>   DW_AT_external    : 1
    <d87c6>   DW_AT_declaration : 1
 <1><d87c6>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87c7>   DW_AT_byte_size   : 8
    <d87c7>   DW_AT_type        : <0xd87cb>
 <1><d87cb>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <d87cc>   DW_AT_prototyped  : 1
    <d87cc>   DW_AT_sibling     : <0xd87db>
 <2><d87d0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d87d1>   DW_AT_type        : <0xd6957>
 <2><d87d5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d87d6>   DW_AT_type        : <0xd6957>
 <2><d87da>: Abbrev Number: 0
 <1><d87db>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87dc>   DW_AT_byte_size   : 8
    <d87dc>   DW_AT_type        : <0xd87e0>
 <1><d87e0>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <d87e1>   DW_AT_prototyped  : 1
    <d87e1>   DW_AT_sibling     : <0xd87eb>
 <2><d87e5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d87e6>   DW_AT_type        : <0xd6957>
 <2><d87ea>: Abbrev Number: 0
 <1><d87eb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d87ec>   DW_AT_byte_size   : 8
    <d87ec>   DW_AT_type        : <0xd87f0>
 <1><d87f0>: Abbrev Number: 39 (DW_TAG_subroutine_type)
    <d87f1>   DW_AT_prototyped  : 1
    <d87f1>   DW_AT_sibling     : <0xd8805>
 <2><d87f5>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d87f6>   DW_AT_type        : <0xd6957>
 <2><d87fa>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d87fb>   DW_AT_type        : <0xd6957>
 <2><d87ff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d8800>   DW_AT_type        : <0xd6957>
 <2><d8804>: Abbrev Number: 0
 <1><d8805>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8806>   DW_AT_name        : (indirect string, offset: 0x8fbdf): FGCBSpaceMotion
    <d880a>   DW_AT_decl_file   : 11
    <d880b>   DW_AT_decl_line   : 232
    <d880c>   DW_AT_decl_column : 17
    <d880d>   DW_AT_type        : <0xd87eb>
 <1><d8811>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8812>   DW_AT_name        : (indirect string, offset: 0x8fcc1): FGCBSpaceRotation
    <d8816>   DW_AT_decl_file   : 11
    <d8817>   DW_AT_decl_line   : 233
    <d8818>   DW_AT_decl_column : 17
    <d8819>   DW_AT_type        : <0xd87eb>
 <1><d881d>: Abbrev Number: 11 (DW_TAG_typedef)
    <d881e>   DW_AT_name        : (indirect string, offset: 0x8fc8b): FGCBSpaceButton
    <d8822>   DW_AT_decl_file   : 11
    <d8823>   DW_AT_decl_line   : 234
    <d8824>   DW_AT_decl_column : 17
    <d8825>   DW_AT_type        : <0xd87c6>
 <1><d8829>: Abbrev Number: 11 (DW_TAG_typedef)
    <d882a>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <d882e>   DW_AT_decl_file   : 11
    <d882f>   DW_AT_decl_line   : 239
    <d8830>   DW_AT_decl_column : 17
    <d8831>   DW_AT_type        : <0xd69ac>
 <1><d8835>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8836>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <d883a>   DW_AT_decl_file   : 11
    <d883b>   DW_AT_decl_line   : 253
    <d883c>   DW_AT_decl_column : 17
    <d883d>   DW_AT_type        : <0xd87db>
 <1><d8841>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8842>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <d8846>   DW_AT_decl_file   : 11
    <d8847>   DW_AT_decl_line   : 261
    <d8849>   DW_AT_decl_column : 28
    <d884a>   DW_AT_type        : <0xd884e>
 <1><d884e>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d884f>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <d8853>   DW_AT_byte_size   : 16
    <d8854>   DW_AT_decl_file   : 11
    <d8854>   DW_AT_decl_line   : 262
    <d8856>   DW_AT_decl_column : 8
    <d8856>   DW_AT_sibling     : <0xd8877>
 <2><d885a>: Abbrev Number: 1 (DW_TAG_member)
    <d885b>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <d885f>   DW_AT_decl_file   : 11
    <d8860>   DW_AT_decl_line   : 264
    <d8862>   DW_AT_decl_column : 11
    <d8863>   DW_AT_type        : <0xd6999>
    <d8867>   DW_AT_data_member_location: 0
 <2><d8868>: Abbrev Number: 1 (DW_TAG_member)
    <d8869>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <d886d>   DW_AT_decl_file   : 11
    <d886e>   DW_AT_decl_line   : 265
    <d8870>   DW_AT_decl_column : 11
    <d8871>   DW_AT_type        : <0xd6999>
    <d8875>   DW_AT_data_member_location: 8
 <2><d8876>: Abbrev Number: 0
 <1><d8877>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8878>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <d887c>   DW_AT_decl_file   : 11
    <d887d>   DW_AT_decl_line   : 269
    <d887f>   DW_AT_decl_column : 28
    <d8880>   DW_AT_type        : <0xd8884>
 <1><d8884>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d8885>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <d8889>   DW_AT_byte_size   : 16
    <d888a>   DW_AT_decl_file   : 11
    <d888a>   DW_AT_decl_line   : 270
    <d888c>   DW_AT_decl_column : 8
    <d888c>   DW_AT_sibling     : <0xd88ad>
 <2><d8890>: Abbrev Number: 1 (DW_TAG_member)
    <d8891>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <d8895>   DW_AT_decl_file   : 11
    <d8896>   DW_AT_decl_line   : 272
    <d8898>   DW_AT_decl_column : 11
    <d8899>   DW_AT_type        : <0xd6999>
    <d889d>   DW_AT_data_member_location: 0
 <2><d889e>: Abbrev Number: 1 (DW_TAG_member)
    <d889f>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <d88a3>   DW_AT_decl_file   : 11
    <d88a4>   DW_AT_decl_line   : 273
    <d88a6>   DW_AT_decl_column : 11
    <d88a7>   DW_AT_type        : <0xd6999>
    <d88ab>   DW_AT_data_member_location: 8
 <2><d88ac>: Abbrev Number: 0
 <1><d88ad>: Abbrev Number: 4 (DW_TAG_typedef)
    <d88ae>   DW_AT_name        : (indirect string, offset: 0x8e79c): SFG_Display
    <d88b2>   DW_AT_decl_file   : 11
    <d88b3>   DW_AT_decl_line   : 356
    <d88b5>   DW_AT_decl_column : 31
    <d88b6>   DW_AT_type        : <0xd88ba>
 <1><d88ba>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d88bb>   DW_AT_name        : (indirect string, offset: 0x8e799): tagSFG_Display
    <d88bf>   DW_AT_byte_size   : 80
    <d88c0>   DW_AT_decl_file   : 11
    <d88c0>   DW_AT_decl_line   : 357
    <d88c2>   DW_AT_decl_column : 8
    <d88c2>   DW_AT_sibling     : <0xd897d>
 <2><d88c6>: Abbrev Number: 1 (DW_TAG_member)
    <d88c7>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <d88cb>   DW_AT_decl_file   : 11
    <d88cc>   DW_AT_decl_line   : 360
    <d88ce>   DW_AT_decl_column : 21
    <d88cf>   DW_AT_type        : <0xd70cd>
    <d88d3>   DW_AT_data_member_location: 0
 <2><d88d4>: Abbrev Number: 1 (DW_TAG_member)
    <d88d5>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <d88d9>   DW_AT_decl_file   : 11
    <d88da>   DW_AT_decl_line   : 361
    <d88dc>   DW_AT_decl_column : 21
    <d88dd>   DW_AT_type        : <0xd6957>
    <d88e1>   DW_AT_data_member_location: 8
 <2><d88e2>: Abbrev Number: 1 (DW_TAG_member)
    <d88e3>   DW_AT_name        : (indirect string, offset: 0x8e7ee): RootWindow
    <d88e7>   DW_AT_decl_file   : 11
    <d88e8>   DW_AT_decl_line   : 362
    <d88ea>   DW_AT_decl_column : 21
    <d88eb>   DW_AT_type        : <0xd6a18>
    <d88ef>   DW_AT_data_member_location: 16
 <2><d88f0>: Abbrev Number: 1 (DW_TAG_member)
    <d88f1>   DW_AT_name        : (indirect string, offset: 0x8e855): Connection
    <d88f5>   DW_AT_decl_file   : 11
    <d88f6>   DW_AT_decl_line   : 363
    <d88f8>   DW_AT_decl_column : 21
    <d88f9>   DW_AT_type        : <0xd6957>
    <d88fd>   DW_AT_data_member_location: 24
 <2><d88fe>: Abbrev Number: 1 (DW_TAG_member)
    <d88ff>   DW_AT_name        : (indirect string, offset: 0x8e8cc): DeleteWindow
    <d8903>   DW_AT_decl_file   : 11
    <d8904>   DW_AT_decl_line   : 364
    <d8906>   DW_AT_decl_column : 21
    <d8907>   DW_AT_type        : <0xd69f4>
    <d890b>   DW_AT_data_member_location: 32
 <2><d890c>: Abbrev Number: 1 (DW_TAG_member)
    <d890d>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <d8911>   DW_AT_decl_file   : 11
    <d8912>   DW_AT_decl_line   : 365
    <d8914>   DW_AT_decl_column : 21
    <d8915>   DW_AT_type        : <0xd69f4>
    <d8919>   DW_AT_data_member_location: 40
 <2><d891a>: Abbrev Number: 1 (DW_TAG_member)
    <d891b>   DW_AT_name        : (indirect string, offset: 0x8e8e6): StateFullScreen
    <d891f>   DW_AT_decl_file   : 11
    <d8920>   DW_AT_decl_line   : 366
    <d8922>   DW_AT_decl_column : 21
    <d8923>   DW_AT_type        : <0xd69f4>
    <d8927>   DW_AT_data_member_location: 48
 <2><d8928>: Abbrev Number: 1 (DW_TAG_member)
    <d8929>   DW_AT_name        : (indirect string, offset: 0x8e7de): DisplayPointerX
    <d892d>   DW_AT_decl_file   : 11
    <d892e>   DW_AT_decl_line   : 386
    <d8930>   DW_AT_decl_column : 21
    <d8931>   DW_AT_type        : <0xd6957>
    <d8935>   DW_AT_data_member_location: 56
 <2><d8936>: Abbrev Number: 1 (DW_TAG_member)
    <d8937>   DW_AT_name        : (indirect string, offset: 0x8e938): DisplayPointerY
    <d893b>   DW_AT_decl_file   : 11
    <d893c>   DW_AT_decl_line   : 387
    <d893e>   DW_AT_decl_column : 21
    <d893f>   DW_AT_type        : <0xd6957>
    <d8943>   DW_AT_data_member_location: 60
 <2><d8944>: Abbrev Number: 1 (DW_TAG_member)
    <d8945>   DW_AT_name        : (indirect string, offset: 0x8e849): ScreenWidth
    <d8949>   DW_AT_decl_file   : 11
    <d894a>   DW_AT_decl_line   : 396
    <d894c>   DW_AT_decl_column : 21
    <d894d>   DW_AT_type        : <0xd6957>
    <d8951>   DW_AT_data_member_location: 64
 <2><d8952>: Abbrev Number: 1 (DW_TAG_member)
    <d8953>   DW_AT_name        : (indirect string, offset: 0x8e7b7): ScreenHeight
    <d8957>   DW_AT_decl_file   : 11
    <d8958>   DW_AT_decl_line   : 397
    <d895a>   DW_AT_decl_column : 21
    <d895b>   DW_AT_type        : <0xd6957>
    <d895f>   DW_AT_data_member_location: 68
 <2><d8960>: Abbrev Number: 1 (DW_TAG_member)
    <d8961>   DW_AT_name        : (indirect string, offset: 0x8e8be): ScreenWidthMM
    <d8965>   DW_AT_decl_file   : 11
    <d8966>   DW_AT_decl_line   : 398
    <d8968>   DW_AT_decl_column : 21
    <d8969>   DW_AT_type        : <0xd6957>
    <d896d>   DW_AT_data_member_location: 72
 <2><d896e>: Abbrev Number: 1 (DW_TAG_member)
    <d896f>   DW_AT_name        : (indirect string, offset: 0x8e7f9): ScreenHeightMM
    <d8973>   DW_AT_decl_file   : 11
    <d8974>   DW_AT_decl_line   : 399
    <d8976>   DW_AT_decl_column : 21
    <d8977>   DW_AT_type        : <0xd6957>
    <d897b>   DW_AT_data_member_location: 76
 <2><d897c>: Abbrev Number: 0
 <1><d897d>: Abbrev Number: 4 (DW_TAG_typedef)
    <d897e>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <d8982>   DW_AT_decl_file   : 11
    <d8983>   DW_AT_decl_line   : 419
    <d8985>   DW_AT_decl_column : 20
    <d8986>   DW_AT_type        : <0xd6a18>
 <1><d898a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d898b>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <d898f>   DW_AT_decl_file   : 11
    <d8990>   DW_AT_decl_line   : 420
    <d8992>   DW_AT_decl_column : 20
    <d8993>   DW_AT_type        : <0xd8598>
 <1><d8997>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8998>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <d899c>   DW_AT_decl_file   : 11
    <d899d>   DW_AT_decl_line   : 433
    <d899f>   DW_AT_decl_column : 31
    <d89a0>   DW_AT_type        : <0xd89a4>
 <1><d89a4>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d89a5>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <d89a9>   DW_AT_byte_size   : 32
    <d89aa>   DW_AT_decl_file   : 11
    <d89aa>   DW_AT_decl_line   : 434
    <d89ac>   DW_AT_decl_column : 8
    <d89ac>   DW_AT_sibling     : <0xd89e9>
 <2><d89b0>: Abbrev Number: 1 (DW_TAG_member)
    <d89b1>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <d89b5>   DW_AT_decl_file   : 11
    <d89b6>   DW_AT_decl_line   : 436
    <d89b8>   DW_AT_decl_column : 27
    <d89b9>   DW_AT_type        : <0xd897d>
    <d89bd>   DW_AT_data_member_location: 0
 <2><d89be>: Abbrev Number: 1 (DW_TAG_member)
    <d89bf>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <d89c3>   DW_AT_decl_file   : 11
    <d89c4>   DW_AT_decl_line   : 437
    <d89c6>   DW_AT_decl_column : 27
    <d89c7>   DW_AT_type        : <0xd898a>
    <d89cb>   DW_AT_data_member_location: 8
 <2><d89cc>: Abbrev Number: 1 (DW_TAG_member)
    <d89cd>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <d89d1>   DW_AT_decl_file   : 11
    <d89d2>   DW_AT_decl_line   : 440
    <d89d4>   DW_AT_decl_column : 21
    <d89d5>   DW_AT_type        : <0xd85c4>
    <d89d9>   DW_AT_data_member_location: 16
 <2><d89da>: Abbrev Number: 1 (DW_TAG_member)
    <d89db>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <d89df>   DW_AT_decl_file   : 11
    <d89e0>   DW_AT_decl_line   : 445
    <d89e2>   DW_AT_decl_column : 21
    <d89e3>   DW_AT_type        : <0xd6957>
    <d89e7>   DW_AT_data_member_location: 24
 <2><d89e8>: Abbrev Number: 0
 <1><d89e9>: Abbrev Number: 4 (DW_TAG_typedef)
    <d89ea>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <d89ee>   DW_AT_decl_file   : 11
    <d89ef>   DW_AT_decl_line   : 449
    <d89f1>   DW_AT_decl_column : 35
    <d89f2>   DW_AT_type        : <0xd89f6>
 <1><d89f6>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d89f7>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <d89fb>   DW_AT_byte_size   : 56
    <d89fc>   DW_AT_decl_file   : 11
    <d89fc>   DW_AT_decl_line   : 450
    <d89fe>   DW_AT_decl_column : 8
    <d89fe>   DW_AT_sibling     : <0xd8ad5>
 <2><d8a02>: Abbrev Number: 1 (DW_TAG_member)
    <d8a03>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <d8a07>   DW_AT_decl_file   : 11
    <d8a08>   DW_AT_decl_line   : 453
    <d8a0a>   DW_AT_decl_column : 21
    <d8a0b>   DW_AT_type        : <0xd6957>
    <d8a0f>   DW_AT_data_member_location: 0
 <2><d8a10>: Abbrev Number: 1 (DW_TAG_member)
    <d8a11>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <d8a15>   DW_AT_decl_file   : 11
    <d8a16>   DW_AT_decl_line   : 454
    <d8a18>   DW_AT_decl_column : 21
    <d8a19>   DW_AT_type        : <0xd6957>
    <d8a1d>   DW_AT_data_member_location: 4
 <2><d8a1e>: Abbrev Number: 1 (DW_TAG_member)
    <d8a1f>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <d8a23>   DW_AT_decl_file   : 11
    <d8a24>   DW_AT_decl_line   : 456
    <d8a26>   DW_AT_decl_column : 21
    <d8a27>   DW_AT_type        : <0xd6957>
    <d8a2b>   DW_AT_data_member_location: 8
 <2><d8a2c>: Abbrev Number: 1 (DW_TAG_member)
    <d8a2d>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <d8a31>   DW_AT_decl_file   : 11
    <d8a32>   DW_AT_decl_line   : 457
    <d8a34>   DW_AT_decl_column : 21
    <d8a35>   DW_AT_type        : <0xd6957>
    <d8a39>   DW_AT_data_member_location: 12
 <2><d8a3a>: Abbrev Number: 1 (DW_TAG_member)
    <d8a3b>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <d8a3f>   DW_AT_decl_file   : 11
    <d8a40>   DW_AT_decl_line   : 463
    <d8a42>   DW_AT_decl_column : 21
    <d8a43>   DW_AT_type        : <0xd6936>
    <d8a47>   DW_AT_data_member_location: 16
 <2><d8a48>: Abbrev Number: 1 (DW_TAG_member)
    <d8a49>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <d8a4d>   DW_AT_decl_file   : 11
    <d8a4e>   DW_AT_decl_line   : 464
    <d8a50>   DW_AT_decl_column : 21
    <d8a51>   DW_AT_type        : <0xd6936>
    <d8a55>   DW_AT_data_member_location: 17
 <2><d8a56>: Abbrev Number: 1 (DW_TAG_member)
    <d8a57>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <d8a5b>   DW_AT_decl_file   : 11
    <d8a5c>   DW_AT_decl_line   : 466
    <d8a5e>   DW_AT_decl_column : 21
    <d8a5f>   DW_AT_type        : <0xd6957>
    <d8a63>   DW_AT_data_member_location: 20
 <2><d8a64>: Abbrev Number: 1 (DW_TAG_member)
    <d8a65>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <d8a69>   DW_AT_decl_file   : 11
    <d8a6a>   DW_AT_decl_line   : 468
    <d8a6c>   DW_AT_decl_column : 21
    <d8a6d>   DW_AT_type        : <0xd697a>
    <d8a71>   DW_AT_data_member_location: 24
 <2><d8a72>: Abbrev Number: 1 (DW_TAG_member)
    <d8a73>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <d8a77>   DW_AT_decl_file   : 11
    <d8a78>   DW_AT_decl_line   : 469
    <d8a7a>   DW_AT_decl_column : 21
    <d8a7b>   DW_AT_type        : <0xd697a>
    <d8a7f>   DW_AT_data_member_location: 32
 <2><d8a80>: Abbrev Number: 1 (DW_TAG_member)
    <d8a81>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <d8a85>   DW_AT_decl_file   : 11
    <d8a86>   DW_AT_decl_line   : 471
    <d8a88>   DW_AT_decl_column : 21
    <d8a89>   DW_AT_type        : <0xd6957>
    <d8a8d>   DW_AT_data_member_location: 40
 <2><d8a8e>: Abbrev Number: 1 (DW_TAG_member)
    <d8a8f>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <d8a93>   DW_AT_decl_file   : 11
    <d8a94>   DW_AT_decl_line   : 471
    <d8a96>   DW_AT_decl_column : 29
    <d8a97>   DW_AT_type        : <0xd6957>
    <d8a9b>   DW_AT_data_member_location: 44
 <2><d8a9c>: Abbrev Number: 1 (DW_TAG_member)
    <d8a9d>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <d8aa1>   DW_AT_decl_file   : 11
    <d8aa2>   DW_AT_decl_line   : 473
    <d8aa4>   DW_AT_decl_column : 21
    <d8aa5>   DW_AT_type        : <0xd6936>
    <d8aa9>   DW_AT_data_member_location: 48
 <2><d8aaa>: Abbrev Number: 1 (DW_TAG_member)
    <d8aab>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <d8aaf>   DW_AT_decl_file   : 11
    <d8ab0>   DW_AT_decl_line   : 474
    <d8ab2>   DW_AT_decl_column : 21
    <d8ab3>   DW_AT_type        : <0xd6936>
    <d8ab7>   DW_AT_data_member_location: 49
 <2><d8ab8>: Abbrev Number: 1 (DW_TAG_member)
    <d8ab9>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <d8abd>   DW_AT_decl_file   : 11
    <d8abe>   DW_AT_decl_line   : 476
    <d8ac0>   DW_AT_decl_column : 21
    <d8ac1>   DW_AT_type        : <0xd6936>
    <d8ac5>   DW_AT_data_member_location: 50
 <2><d8ac6>: Abbrev Number: 1 (DW_TAG_member)
    <d8ac7>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <d8acb>   DW_AT_decl_file   : 11
    <d8acc>   DW_AT_decl_line   : 478
    <d8ace>   DW_AT_decl_column : 21
    <d8acf>   DW_AT_type        : <0xd6936>
    <d8ad3>   DW_AT_data_member_location: 51
 <2><d8ad4>: Abbrev Number: 0
 <1><d8ad5>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8ad6>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <d8ada>   DW_AT_decl_file   : 11
    <d8adb>   DW_AT_decl_line   : 487
    <d8add>   DW_AT_decl_column : 16
    <d8ade>   DW_AT_type        : <0xd69dc>
 <1><d8ae2>: Abbrev Number: 75 (DW_TAG_enumeration_type)
    <d8ae3>   DW_AT_encoding    : 7	(unsigned)
    <d8ae4>   DW_AT_byte_size   : 4
    <d8ae5>   DW_AT_type        : <0xd692f>
    <d8ae9>   DW_AT_decl_file   : 11
    <d8aea>   DW_AT_decl_line   : 587
    <d8aec>   DW_AT_decl_column : 1
    <d8aed>   DW_AT_sibling     : <0xd8ba0>
 <2><d8af1>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8af2>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <d8af6>   DW_AT_const_value : 0
 <2><d8af7>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8af8>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <d8afc>   DW_AT_const_value : 1
 <2><d8afd>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8afe>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <d8b02>   DW_AT_const_value : 2
 <2><d8b03>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b04>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <d8b08>   DW_AT_const_value : 3
 <2><d8b09>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b0a>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <d8b0e>   DW_AT_const_value : 4
 <2><d8b0f>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b10>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <d8b14>   DW_AT_const_value : 5
 <2><d8b15>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b16>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <d8b1a>   DW_AT_const_value : 6
 <2><d8b1b>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b1c>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <d8b20>   DW_AT_const_value : 7
 <2><d8b21>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b22>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <d8b26>   DW_AT_const_value : 8
 <2><d8b27>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b28>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <d8b2c>   DW_AT_const_value : 9
 <2><d8b2d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b2e>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <d8b32>   DW_AT_const_value : 10
 <2><d8b33>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b34>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <d8b38>   DW_AT_const_value : 11
 <2><d8b39>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b3a>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <d8b3e>   DW_AT_const_value : 12
 <2><d8b3f>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b40>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <d8b44>   DW_AT_const_value : 13
 <2><d8b45>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b46>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <d8b4a>   DW_AT_const_value : 14
 <2><d8b4b>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b4c>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <d8b50>   DW_AT_const_value : 15
 <2><d8b51>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b52>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <d8b56>   DW_AT_const_value : 16
 <2><d8b57>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b58>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <d8b5c>   DW_AT_const_value : 17
 <2><d8b5d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b5e>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <d8b62>   DW_AT_const_value : 18
 <2><d8b63>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b64>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <d8b68>   DW_AT_const_value : 19
 <2><d8b69>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b6a>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <d8b6e>   DW_AT_const_value : 20
 <2><d8b6f>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b70>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <d8b74>   DW_AT_const_value : 21
 <2><d8b75>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b76>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <d8b7a>   DW_AT_const_value : 22
 <2><d8b7b>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b7c>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <d8b80>   DW_AT_const_value : 23
 <2><d8b81>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b82>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <d8b86>   DW_AT_const_value : 24
 <2><d8b87>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b88>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <d8b8c>   DW_AT_const_value : 25
 <2><d8b8d>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b8e>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <d8b92>   DW_AT_const_value : 26
 <2><d8b93>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b94>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <d8b98>   DW_AT_const_value : 27
 <2><d8b99>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8b9a>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <d8b9e>   DW_AT_const_value : 28
 <2><d8b9f>: Abbrev Number: 0
 <1><d8ba0>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8ba1>   DW_AT_name        : (indirect string, offset: 0x8e56b): SFG_MenuContext
    <d8ba5>   DW_AT_decl_file   : 11
    <d8ba6>   DW_AT_decl_line   : 627
    <d8ba8>   DW_AT_decl_column : 35
    <d8ba9>   DW_AT_type        : <0xd8bad>
 <1><d8bad>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d8bae>   DW_AT_name        : (indirect string, offset: 0x8e568): tagSFG_MenuContext
    <d8bb2>   DW_AT_byte_size   : 8
    <d8bb3>   DW_AT_decl_file   : 11
    <d8bb3>   DW_AT_decl_line   : 628
    <d8bb5>   DW_AT_decl_column : 8
    <d8bb5>   DW_AT_sibling     : <0xd8bc8>
 <2><d8bb9>: Abbrev Number: 1 (DW_TAG_member)
    <d8bba>   DW_AT_name        : (indirect string, offset: 0x8e24f): MContext
    <d8bbe>   DW_AT_decl_file   : 11
    <d8bbf>   DW_AT_decl_line   : 630
    <d8bc1>   DW_AT_decl_column : 27
    <d8bc2>   DW_AT_type        : <0xd898a>
    <d8bc6>   DW_AT_data_member_location: 0
 <2><d8bc7>: Abbrev Number: 0
 <1><d8bc8>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8bc9>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <d8bcd>   DW_AT_decl_file   : 11
    <d8bce>   DW_AT_decl_line   : 634
    <d8bd0>   DW_AT_decl_column : 30
    <d8bd1>   DW_AT_type        : <0xd8bd5>
 <1><d8bd5>: Abbrev Number: 76 (DW_TAG_structure_type)
    <d8bd6>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <d8bda>   DW_AT_byte_size   : 408
    <d8bdc>   DW_AT_decl_file   : 11
    <d8bdd>   DW_AT_decl_line   : 673
    <d8bdf>   DW_AT_decl_column : 8
    <d8be0>   DW_AT_sibling     : <0xd8c84>
 <2><d8be4>: Abbrev Number: 1 (DW_TAG_member)
    <d8be5>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <d8be9>   DW_AT_decl_file   : 11
    <d8bea>   DW_AT_decl_line   : 675
    <d8bec>   DW_AT_decl_column : 25
    <d8bed>   DW_AT_type        : <0xd8877>
    <d8bf1>   DW_AT_data_member_location: 0
 <2><d8bf2>: Abbrev Number: 10 (DW_TAG_member)
    <d8bf3>   DW_AT_name        : ID
    <d8bf6>   DW_AT_decl_file   : 11
    <d8bf7>   DW_AT_decl_line   : 676
    <d8bf9>   DW_AT_decl_column : 25
    <d8bfa>   DW_AT_type        : <0xd6957>
    <d8bfe>   DW_AT_data_member_location: 16
 <2><d8bff>: Abbrev Number: 1 (DW_TAG_member)
    <d8c00>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <d8c04>   DW_AT_decl_file   : 11
    <d8c05>   DW_AT_decl_line   : 678
    <d8c07>   DW_AT_decl_column : 25
    <d8c08>   DW_AT_type        : <0xd8997>
    <d8c0c>   DW_AT_data_member_location: 24
 <2><d8c0d>: Abbrev Number: 1 (DW_TAG_member)
    <d8c0e>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <d8c12>   DW_AT_decl_file   : 11
    <d8c13>   DW_AT_decl_line   : 679
    <d8c15>   DW_AT_decl_column : 25
    <d8c16>   DW_AT_type        : <0xd89e9>
    <d8c1a>   DW_AT_data_member_location: 56
 <2><d8c1b>: Abbrev Number: 1 (DW_TAG_member)
    <d8c1c>   DW_AT_name        : (indirect string, offset: 0x900ce): CallBacks
    <d8c20>   DW_AT_decl_file   : 11
    <d8c21>   DW_AT_decl_line   : 680
    <d8c23>   DW_AT_decl_column : 25
    <d8c24>   DW_AT_type        : <0xd8de7>
    <d8c28>   DW_AT_data_member_location: 112
 <2><d8c29>: Abbrev Number: 14 (DW_TAG_member)
    <d8c2a>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <d8c2e>   DW_AT_decl_file   : 11
    <d8c2f>   DW_AT_decl_line   : 681
    <d8c31>   DW_AT_decl_column : 25
    <d8c32>   DW_AT_type        : <0xd6999>
    <d8c36>   DW_AT_data_member_location: 336
 <2><d8c38>: Abbrev Number: 14 (DW_TAG_member)
    <d8c39>   DW_AT_name        : (indirect string, offset: 0x8df1d): Menu
    <d8c3d>   DW_AT_decl_file   : 11
    <d8c3e>   DW_AT_decl_line   : 683
    <d8c40>   DW_AT_decl_column : 21
    <d8c41>   DW_AT_type        : <0xd8df7>
    <d8c45>   DW_AT_data_member_location: 344
 <2><d8c47>: Abbrev Number: 14 (DW_TAG_member)
    <d8c48>   DW_AT_name        : (indirect string, offset: 0x8f46f): ActiveMenu
    <d8c4c>   DW_AT_decl_file   : 11
    <d8c4d>   DW_AT_decl_line   : 684
    <d8c4f>   DW_AT_decl_column : 21
    <d8c50>   DW_AT_type        : <0xd8de2>
    <d8c54>   DW_AT_data_member_location: 368
 <2><d8c56>: Abbrev Number: 14 (DW_TAG_member)
    <d8c57>   DW_AT_name        : (indirect string, offset: 0x8e0e5): Parent
    <d8c5b>   DW_AT_decl_file   : 11
    <d8c5c>   DW_AT_decl_line   : 686
    <d8c5e>   DW_AT_decl_column : 25
    <d8c5f>   DW_AT_type        : <0xd8ddd>
    <d8c63>   DW_AT_data_member_location: 376
 <2><d8c65>: Abbrev Number: 14 (DW_TAG_member)
    <d8c66>   DW_AT_name        : (indirect string, offset: 0x8dfdc): Children
    <d8c6a>   DW_AT_decl_file   : 11
    <d8c6b>   DW_AT_decl_line   : 687
    <d8c6d>   DW_AT_decl_column : 25
    <d8c6e>   DW_AT_type        : <0xd8841>
    <d8c72>   DW_AT_data_member_location: 384
 <2><d8c74>: Abbrev Number: 14 (DW_TAG_member)
    <d8c75>   DW_AT_name        : (indirect string, offset: 0x8e06d): IsMenu
    <d8c79>   DW_AT_decl_file   : 11
    <d8c7a>   DW_AT_decl_line   : 689
    <d8c7c>   DW_AT_decl_column : 25
    <d8c7d>   DW_AT_type        : <0xd6936>
    <d8c81>   DW_AT_data_member_location: 400
 <2><d8c83>: Abbrev Number: 0
 <1><d8c84>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8c85>   DW_AT_name        : (indirect string, offset: 0x8e762): SFG_MenuEntry
    <d8c89>   DW_AT_decl_file   : 11
    <d8c8a>   DW_AT_decl_line   : 635
    <d8c8c>   DW_AT_decl_column : 33
    <d8c8d>   DW_AT_type        : <0xd8c91>
 <1><d8c91>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d8c92>   DW_AT_name        : (indirect string, offset: 0x8e75f): tagSFG_MenuEntry
    <d8c96>   DW_AT_byte_size   : 48
    <d8c97>   DW_AT_decl_file   : 11
    <d8c97>   DW_AT_decl_line   : 656
    <d8c99>   DW_AT_decl_column : 8
    <d8c99>   DW_AT_sibling     : <0xd8cff>
 <2><d8c9d>: Abbrev Number: 1 (DW_TAG_member)
    <d8c9e>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <d8ca2>   DW_AT_decl_file   : 11
    <d8ca3>   DW_AT_decl_line   : 658
    <d8ca5>   DW_AT_decl_column : 25
    <d8ca6>   DW_AT_type        : <0xd8877>
    <d8caa>   DW_AT_data_member_location: 0
 <2><d8cab>: Abbrev Number: 10 (DW_TAG_member)
    <d8cac>   DW_AT_name        : ID
    <d8caf>   DW_AT_decl_file   : 11
    <d8cb0>   DW_AT_decl_line   : 659
    <d8cb2>   DW_AT_decl_column : 25
    <d8cb3>   DW_AT_type        : <0xd6957>
    <d8cb7>   DW_AT_data_member_location: 16
 <2><d8cb8>: Abbrev Number: 1 (DW_TAG_member)
    <d8cb9>   DW_AT_name        : (indirect string, offset: 0x8e00a): Ordinal
    <d8cbd>   DW_AT_decl_file   : 11
    <d8cbe>   DW_AT_decl_line   : 660
    <d8cc0>   DW_AT_decl_column : 25
    <d8cc1>   DW_AT_type        : <0xd6957>
    <d8cc5>   DW_AT_data_member_location: 20
 <2><d8cc6>: Abbrev Number: 1 (DW_TAG_member)
    <d8cc7>   DW_AT_name        : (indirect string, offset: 0x8fc1b): Text
    <d8ccb>   DW_AT_decl_file   : 11
    <d8ccc>   DW_AT_decl_line   : 661
    <d8cce>   DW_AT_decl_column : 25
    <d8ccf>   DW_AT_type        : <0xd699b>
    <d8cd3>   DW_AT_data_member_location: 24
 <2><d8cd4>: Abbrev Number: 1 (DW_TAG_member)
    <d8cd5>   DW_AT_name        : (indirect string, offset: 0x8f9db): SubMenu
    <d8cd9>   DW_AT_decl_file   : 11
    <d8cda>   DW_AT_decl_line   : 662
    <d8cdc>   DW_AT_decl_column : 25
    <d8cdd>   DW_AT_type        : <0xd8de2>
    <d8ce1>   DW_AT_data_member_location: 32
 <2><d8ce2>: Abbrev Number: 1 (DW_TAG_member)
    <d8ce3>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <d8ce7>   DW_AT_decl_file   : 11
    <d8ce8>   DW_AT_decl_line   : 663
    <d8cea>   DW_AT_decl_column : 25
    <d8ceb>   DW_AT_type        : <0xd6936>
    <d8cef>   DW_AT_data_member_location: 40
 <2><d8cf0>: Abbrev Number: 1 (DW_TAG_member)
    <d8cf1>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <d8cf5>   DW_AT_decl_file   : 11
    <d8cf6>   DW_AT_decl_line   : 664
    <d8cf8>   DW_AT_decl_column : 25
    <d8cf9>   DW_AT_type        : <0xd6957>
    <d8cfd>   DW_AT_data_member_location: 44
 <2><d8cfe>: Abbrev Number: 0
 <1><d8cff>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8d00>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <d8d04>   DW_AT_decl_file   : 11
    <d8d05>   DW_AT_decl_line   : 636
    <d8d07>   DW_AT_decl_column : 28
    <d8d08>   DW_AT_type        : <0xd8d0c>
 <1><d8d0c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d8d0d>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <d8d11>   DW_AT_byte_size   : 112
    <d8d12>   DW_AT_decl_file   : 11
    <d8d12>   DW_AT_decl_line   : 637
    <d8d14>   DW_AT_decl_column : 8
    <d8d14>   DW_AT_sibling     : <0xd8dd8>
 <2><d8d18>: Abbrev Number: 1 (DW_TAG_member)
    <d8d19>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <d8d1d>   DW_AT_decl_file   : 11
    <d8d1e>   DW_AT_decl_line   : 639
    <d8d20>   DW_AT_decl_column : 25
    <d8d21>   DW_AT_type        : <0xd8877>
    <d8d25>   DW_AT_data_member_location: 0
 <2><d8d26>: Abbrev Number: 1 (DW_TAG_member)
    <d8d27>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <d8d2b>   DW_AT_decl_file   : 11
    <d8d2c>   DW_AT_decl_line   : 640
    <d8d2e>   DW_AT_decl_column : 25
    <d8d2f>   DW_AT_type        : <0xd6999>
    <d8d33>   DW_AT_data_member_location: 16
 <2><d8d34>: Abbrev Number: 10 (DW_TAG_member)
    <d8d35>   DW_AT_name        : ID
    <d8d38>   DW_AT_decl_file   : 11
    <d8d39>   DW_AT_decl_line   : 641
    <d8d3b>   DW_AT_decl_column : 25
    <d8d3c>   DW_AT_type        : <0xd6957>
    <d8d40>   DW_AT_data_member_location: 24
 <2><d8d41>: Abbrev Number: 1 (DW_TAG_member)
    <d8d42>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <d8d46>   DW_AT_decl_file   : 11
    <d8d47>   DW_AT_decl_line   : 642
    <d8d49>   DW_AT_decl_column : 25
    <d8d4a>   DW_AT_type        : <0xd8841>
    <d8d4e>   DW_AT_data_member_location: 32
 <2><d8d4f>: Abbrev Number: 1 (DW_TAG_member)
    <d8d50>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <d8d54>   DW_AT_decl_file   : 11
    <d8d55>   DW_AT_decl_line   : 643
    <d8d57>   DW_AT_decl_column : 25
    <d8d58>   DW_AT_type        : <0xd8835>
    <d8d5c>   DW_AT_data_member_location: 48
 <2><d8d5d>: Abbrev Number: 1 (DW_TAG_member)
    <d8d5e>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <d8d62>   DW_AT_decl_file   : 11
    <d8d63>   DW_AT_decl_line   : 644
    <d8d65>   DW_AT_decl_column : 25
    <d8d66>   DW_AT_type        : <0xd8829>
    <d8d6a>   DW_AT_data_member_location: 56
 <2><d8d6b>: Abbrev Number: 1 (DW_TAG_member)
    <d8d6c>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <d8d70>   DW_AT_decl_file   : 11
    <d8d71>   DW_AT_decl_line   : 645
    <d8d73>   DW_AT_decl_column : 25
    <d8d74>   DW_AT_type        : <0xd6936>
    <d8d78>   DW_AT_data_member_location: 64
 <2><d8d79>: Abbrev Number: 1 (DW_TAG_member)
    <d8d7a>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <d8d7e>   DW_AT_decl_file   : 11
    <d8d7f>   DW_AT_decl_line   : 646
    <d8d81>   DW_AT_decl_column : 25
    <d8d82>   DW_AT_type        : <0xd6957>
    <d8d86>   DW_AT_data_member_location: 68
 <2><d8d87>: Abbrev Number: 1 (DW_TAG_member)
    <d8d88>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <d8d8c>   DW_AT_decl_file   : 11
    <d8d8d>   DW_AT_decl_line   : 647
    <d8d8f>   DW_AT_decl_column : 25
    <d8d90>   DW_AT_type        : <0xd6957>
    <d8d94>   DW_AT_data_member_location: 72
 <2><d8d95>: Abbrev Number: 10 (DW_TAG_member)
    <d8d96>   DW_AT_name        : X
    <d8d98>   DW_AT_decl_file   : 11
    <d8d99>   DW_AT_decl_line   : 648
    <d8d9b>   DW_AT_decl_column : 25
    <d8d9c>   DW_AT_type        : <0xd6957>
    <d8da0>   DW_AT_data_member_location: 76
 <2><d8da1>: Abbrev Number: 10 (DW_TAG_member)
    <d8da2>   DW_AT_name        : Y
    <d8da4>   DW_AT_decl_file   : 11
    <d8da5>   DW_AT_decl_line   : 648
    <d8da7>   DW_AT_decl_column : 28
    <d8da8>   DW_AT_type        : <0xd6957>
    <d8dac>   DW_AT_data_member_location: 80
 <2><d8dad>: Abbrev Number: 1 (DW_TAG_member)
    <d8dae>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <d8db2>   DW_AT_decl_file   : 11
    <d8db3>   DW_AT_decl_line   : 650
    <d8db5>   DW_AT_decl_column : 25
    <d8db6>   DW_AT_type        : <0xd8dd8>
    <d8dba>   DW_AT_data_member_location: 88
 <2><d8dbb>: Abbrev Number: 1 (DW_TAG_member)
    <d8dbc>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <d8dc0>   DW_AT_decl_file   : 11
    <d8dc1>   DW_AT_decl_line   : 651
    <d8dc3>   DW_AT_decl_column : 25
    <d8dc4>   DW_AT_type        : <0xd8ddd>
    <d8dc8>   DW_AT_data_member_location: 96
 <2><d8dc9>: Abbrev Number: 1 (DW_TAG_member)
    <d8dca>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <d8dce>   DW_AT_decl_file   : 11
    <d8dcf>   DW_AT_decl_line   : 652
    <d8dd1>   DW_AT_decl_column : 25
    <d8dd2>   DW_AT_type        : <0xd8ddd>
    <d8dd6>   DW_AT_data_member_location: 104
 <2><d8dd7>: Abbrev Number: 0
 <1><d8dd8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8dd9>   DW_AT_byte_size   : 8
    <d8dd9>   DW_AT_type        : <0xd8c84>
 <1><d8ddd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8dde>   DW_AT_byte_size   : 8
    <d8dde>   DW_AT_type        : <0xd8bc8>
 <1><d8de2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8de3>   DW_AT_byte_size   : 8
    <d8de3>   DW_AT_type        : <0xd8cff>
 <1><d8de7>: Abbrev Number: 18 (DW_TAG_array_type)
    <d8de8>   DW_AT_type        : <0xd8ad5>
    <d8dec>   DW_AT_sibling     : <0xd8df7>
 <2><d8df0>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d8df1>   DW_AT_type        : <0xd6973>
    <d8df5>   DW_AT_upper_bound : 27
 <2><d8df6>: Abbrev Number: 0
 <1><d8df7>: Abbrev Number: 18 (DW_TAG_array_type)
    <d8df8>   DW_AT_type        : <0xd8de2>
    <d8dfc>   DW_AT_sibling     : <0xd8e07>
 <2><d8e00>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d8e01>   DW_AT_type        : <0xd6973>
    <d8e05>   DW_AT_upper_bound : 2
 <2><d8e06>: Abbrev Number: 0
 <1><d8e07>: Abbrev Number: 4 (DW_TAG_typedef)
    <d8e08>   DW_AT_name        : (indirect string, offset: 0x8e11b): SFG_Structure
    <d8e0c>   DW_AT_decl_file   : 11
    <d8e0d>   DW_AT_decl_line   : 702
    <d8e0f>   DW_AT_decl_column : 33
    <d8e10>   DW_AT_type        : <0xd8e14>
 <1><d8e14>: Abbrev Number: 21 (DW_TAG_structure_type)
    <d8e15>   DW_AT_name        : (indirect string, offset: 0x8e118): tagSFG_Structure
    <d8e19>   DW_AT_byte_size   : 88
    <d8e1a>   DW_AT_decl_file   : 11
    <d8e1a>   DW_AT_decl_line   : 703
    <d8e1c>   DW_AT_decl_column : 8
    <d8e1c>   DW_AT_sibling     : <0xd8e9f>
 <2><d8e20>: Abbrev Number: 1 (DW_TAG_member)
    <d8e21>   DW_AT_name        : (indirect string, offset: 0x8f090): Windows
    <d8e25>   DW_AT_decl_file   : 11
    <d8e26>   DW_AT_decl_line   : 705
    <d8e28>   DW_AT_decl_column : 21
    <d8e29>   DW_AT_type        : <0xd8841>
    <d8e2d>   DW_AT_data_member_location: 0
 <2><d8e2e>: Abbrev Number: 1 (DW_TAG_member)
    <d8e2f>   DW_AT_name        : (indirect string, offset: 0x8e25e): Menus
    <d8e33>   DW_AT_decl_file   : 11
    <d8e34>   DW_AT_decl_line   : 706
    <d8e36>   DW_AT_decl_column : 21
    <d8e37>   DW_AT_type        : <0xd8841>
    <d8e3b>   DW_AT_data_member_location: 16
 <2><d8e3c>: Abbrev Number: 1 (DW_TAG_member)
    <d8e3d>   DW_AT_name        : (indirect string, offset: 0x8e65c): WindowsToDestroy
    <d8e41>   DW_AT_decl_file   : 11
    <d8e42>   DW_AT_decl_line   : 707
    <d8e44>   DW_AT_decl_column : 21
    <d8e45>   DW_AT_type        : <0xd8841>
    <d8e49>   DW_AT_data_member_location: 32
 <2><d8e4a>: Abbrev Number: 1 (DW_TAG_member)
    <d8e4b>   DW_AT_name        : (indirect string, offset: 0x8e343): CurrentWindow
    <d8e4f>   DW_AT_decl_file   : 11
    <d8e50>   DW_AT_decl_line   : 709
    <d8e52>   DW_AT_decl_column : 21
    <d8e53>   DW_AT_type        : <0xd8ddd>
    <d8e57>   DW_AT_data_member_location: 48
 <2><d8e58>: Abbrev Number: 1 (DW_TAG_member)
    <d8e59>   DW_AT_name        : (indirect string, offset: 0x8e07f): CurrentMenu
    <d8e5d>   DW_AT_decl_file   : 11
    <d8e5e>   DW_AT_decl_line   : 710
    <d8e60>   DW_AT_decl_column : 21
    <d8e61>   DW_AT_type        : <0xd8de2>
    <d8e65>   DW_AT_data_member_location: 56
 <2><d8e66>: Abbrev Number: 1 (DW_TAG_member)
    <d8e67>   DW_AT_name        : (indirect string, offset: 0x8e56f): MenuContext
    <d8e6b>   DW_AT_decl_file   : 11
    <d8e6c>   DW_AT_decl_line   : 712
    <d8e6e>   DW_AT_decl_column : 22
    <d8e6f>   DW_AT_type        : <0xd8e9f>
    <d8e73>   DW_AT_data_member_location: 64
 <2><d8e74>: Abbrev Number: 1 (DW_TAG_member)
    <d8e75>   DW_AT_name        : (indirect string, offset: 0x8e5bb): GameModeWindow
    <d8e79>   DW_AT_decl_file   : 11
    <d8e7a>   DW_AT_decl_line   : 714
    <d8e7c>   DW_AT_decl_column : 22
    <d8e7d>   DW_AT_type        : <0xd8ddd>
    <d8e81>   DW_AT_data_member_location: 72
 <2><d8e82>: Abbrev Number: 1 (DW_TAG_member)
    <d8e83>   DW_AT_name        : (indirect string, offset: 0x8e2ad): WindowID
    <d8e87>   DW_AT_decl_file   : 11
    <d8e88>   DW_AT_decl_line   : 716
    <d8e8a>   DW_AT_decl_column : 22
    <d8e8b>   DW_AT_type        : <0xd6957>
    <d8e8f>   DW_AT_data_member_location: 80
 <2><d8e90>: Abbrev Number: 1 (DW_TAG_member)
    <d8e91>   DW_AT_name        : (indirect string, offset: 0x8f878): MenuID
    <d8e95>   DW_AT_decl_file   : 11
    <d8e96>   DW_AT_decl_line   : 717
    <d8e98>   DW_AT_decl_column : 22
    <d8e99>   DW_AT_type        : <0xd6957>
    <d8e9d>   DW_AT_data_member_location: 84
 <2><d8e9e>: Abbrev Number: 0
 <1><d8e9f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d8ea0>   DW_AT_byte_size   : 8
    <d8ea0>   DW_AT_type        : <0xd8ba0>
 <1><d8ea4>: Abbrev Number: 50 (DW_TAG_variable)
    <d8ea5>   DW_AT_name        : (indirect string, offset: 0x8e82f): fgDisplay
    <d8ea9>   DW_AT_decl_file   : 11
    <d8ea9>   DW_AT_decl_line   : 781
    <d8eab>   DW_AT_decl_column : 20
    <d8eac>   DW_AT_type        : <0xd88ad>
    <d8eb0>   DW_AT_external    : 1
    <d8eb0>   DW_AT_declaration : 1
 <1><d8eb0>: Abbrev Number: 50 (DW_TAG_variable)
    <d8eb1>   DW_AT_name        : (indirect string, offset: 0x8e3ad): fgStructure
    <d8eb5>   DW_AT_decl_file   : 11
    <d8eb5>   DW_AT_decl_line   : 784
    <d8eb7>   DW_AT_decl_column : 22
    <d8eb8>   DW_AT_type        : <0xd8e07>
    <d8ebc>   DW_AT_external    : 1
    <d8ebc>   DW_AT_declaration : 1
 <1><d8ebc>: Abbrev Number: 51 (DW_TAG_enumeration_type)
    <d8ebd>   DW_AT_encoding    : 7	(void)
    <d8ebd>   DW_AT_byte_size   : 4
    <d8ebd>   DW_AT_type        : <0xd692f>
    <d8ec1>   DW_AT_decl_file   : 1
    <d8ec1>   DW_AT_decl_line   : 21
    <d8ec2>   DW_AT_decl_column : 6
    <d8ec2>   DW_AT_sibling     : <0xd8ed9>
 <2><d8ec6>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8ec7>   DW_AT_name        : (indirect string, offset: 0x8fd38): SPNAV_EVENT_ANY
    <d8ecb>   DW_AT_const_value : 0
 <2><d8ecc>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8ecd>   DW_AT_name        : (indirect string, offset: 0x8fd50): SPNAV_EVENT_MOTION
    <d8ed1>   DW_AT_const_value : 1
 <2><d8ed2>: Abbrev Number: 9 (DW_TAG_enumerator)
    <d8ed3>   DW_AT_name        : (indirect string, offset: 0x8fc29): SPNAV_EVENT_BUTTON
    <d8ed7>   DW_AT_const_value : 2
 <2><d8ed8>: Abbrev Number: 0
 <1><d8ed9>: Abbrev Number: 30 (DW_TAG_structure_type)
    <d8eda>   DW_AT_name        : (indirect string, offset: 0x8fc78): spnav_event_motion
    <d8ede>   DW_AT_byte_size   : 40
    <d8edf>   DW_AT_decl_file   : 1
    <d8ee0>   DW_AT_decl_line   : 27
    <d8ee1>   DW_AT_decl_column : 8
    <d8ee2>   DW_AT_sibling     : <0xd8f4d>
 <2><d8ee6>: Abbrev Number: 3 (DW_TAG_member)
    <d8ee7>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d8eeb>   DW_AT_decl_file   : 1
    <d8eec>   DW_AT_decl_line   : 28
    <d8eed>   DW_AT_decl_column : 9
    <d8eee>   DW_AT_type        : <0xd6957>
    <d8ef2>   DW_AT_data_member_location: 0
 <2><d8ef3>: Abbrev Number: 26 (DW_TAG_member)
    <d8ef4>   DW_AT_name        : x
    <d8ef6>   DW_AT_decl_file   : 1
    <d8ef6>   DW_AT_decl_line   : 29
    <d8ef7>   DW_AT_decl_column : 9
    <d8ef8>   DW_AT_type        : <0xd6957>
    <d8efc>   DW_AT_data_member_location: 4
 <2><d8efd>: Abbrev Number: 26 (DW_TAG_member)
    <d8efe>   DW_AT_name        : y
    <d8f00>   DW_AT_decl_file   : 1
    <d8f00>   DW_AT_decl_line   : 29
    <d8f01>   DW_AT_decl_column : 12
    <d8f02>   DW_AT_type        : <0xd6957>
    <d8f06>   DW_AT_data_member_location: 8
 <2><d8f07>: Abbrev Number: 26 (DW_TAG_member)
    <d8f08>   DW_AT_name        : z
    <d8f0a>   DW_AT_decl_file   : 1
    <d8f0a>   DW_AT_decl_line   : 29
    <d8f0b>   DW_AT_decl_column : 15
    <d8f0c>   DW_AT_type        : <0xd6957>
    <d8f10>   DW_AT_data_member_location: 12
 <2><d8f11>: Abbrev Number: 26 (DW_TAG_member)
    <d8f12>   DW_AT_name        : rx
    <d8f15>   DW_AT_decl_file   : 1
    <d8f15>   DW_AT_decl_line   : 30
    <d8f16>   DW_AT_decl_column : 9
    <d8f17>   DW_AT_type        : <0xd6957>
    <d8f1b>   DW_AT_data_member_location: 16
 <2><d8f1c>: Abbrev Number: 26 (DW_TAG_member)
    <d8f1d>   DW_AT_name        : ry
    <d8f20>   DW_AT_decl_file   : 1
    <d8f20>   DW_AT_decl_line   : 30
    <d8f21>   DW_AT_decl_column : 13
    <d8f22>   DW_AT_type        : <0xd6957>
    <d8f26>   DW_AT_data_member_location: 20
 <2><d8f27>: Abbrev Number: 26 (DW_TAG_member)
    <d8f28>   DW_AT_name        : rz
    <d8f2b>   DW_AT_decl_file   : 1
    <d8f2b>   DW_AT_decl_line   : 30
    <d8f2c>   DW_AT_decl_column : 17
    <d8f2d>   DW_AT_type        : <0xd6957>
    <d8f31>   DW_AT_data_member_location: 24
 <2><d8f32>: Abbrev Number: 3 (DW_TAG_member)
    <d8f33>   DW_AT_name        : (indirect string, offset: 0x8fd31): period
    <d8f37>   DW_AT_decl_file   : 1
    <d8f38>   DW_AT_decl_line   : 31
    <d8f39>   DW_AT_decl_column : 18
    <d8f3a>   DW_AT_type        : <0xd692f>
    <d8f3e>   DW_AT_data_member_location: 28
 <2><d8f3f>: Abbrev Number: 3 (DW_TAG_member)
    <d8f40>   DW_AT_name        : (indirect string, offset: 0x82a17): data
    <d8f44>   DW_AT_decl_file   : 1
    <d8f45>   DW_AT_decl_line   : 32
    <d8f46>   DW_AT_decl_column : 10
    <d8f47>   DW_AT_type        : <0xd85c9>
    <d8f4b>   DW_AT_data_member_location: 32
 <2><d8f4c>: Abbrev Number: 0
 <1><d8f4d>: Abbrev Number: 30 (DW_TAG_structure_type)
    <d8f4e>   DW_AT_name        : (indirect string, offset: 0x8fb66): spnav_event_button
    <d8f52>   DW_AT_byte_size   : 12
    <d8f53>   DW_AT_decl_file   : 1
    <d8f54>   DW_AT_decl_line   : 35
    <d8f55>   DW_AT_decl_column : 8
    <d8f56>   DW_AT_sibling     : <0xd8f82>
 <2><d8f5a>: Abbrev Number: 3 (DW_TAG_member)
    <d8f5b>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d8f5f>   DW_AT_decl_file   : 1
    <d8f60>   DW_AT_decl_line   : 36
    <d8f61>   DW_AT_decl_column : 9
    <d8f62>   DW_AT_type        : <0xd6957>
    <d8f66>   DW_AT_data_member_location: 0
 <2><d8f67>: Abbrev Number: 3 (DW_TAG_member)
    <d8f68>   DW_AT_name        : (indirect string, offset: 0x8fbf4): press
    <d8f6c>   DW_AT_decl_file   : 1
    <d8f6d>   DW_AT_decl_line   : 37
    <d8f6e>   DW_AT_decl_column : 9
    <d8f6f>   DW_AT_type        : <0xd6957>
    <d8f73>   DW_AT_data_member_location: 4
 <2><d8f74>: Abbrev Number: 3 (DW_TAG_member)
    <d8f75>   DW_AT_name        : (indirect string, offset: 0x8fb32): bnum
    <d8f79>   DW_AT_decl_file   : 1
    <d8f7a>   DW_AT_decl_line   : 38
    <d8f7b>   DW_AT_decl_column : 9
    <d8f7c>   DW_AT_type        : <0xd6957>
    <d8f80>   DW_AT_data_member_location: 8
 <2><d8f81>: Abbrev Number: 0
 <1><d8f82>: Abbrev Number: 77 (DW_TAG_union_type)
    <d8f83>   DW_AT_name        : (indirect string, offset: 0x8fcd3): spnav_event
    <d8f87>   DW_AT_byte_size   : 40
    <d8f88>   DW_AT_decl_file   : 1
    <d8f89>   DW_AT_decl_line   : 41
    <d8f8a>   DW_AT_decl_column : 15
    <d8f8b>   DW_AT_sibling     : <0xd8fb1>
 <2><d8f8f>: Abbrev Number: 40 (DW_TAG_member)
    <d8f90>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d8f94>   DW_AT_decl_file   : 1
    <d8f94>   DW_AT_decl_line   : 42
    <d8f95>   DW_AT_decl_column : 9
    <d8f96>   DW_AT_type        : <0xd6957>
 <2><d8f9a>: Abbrev Number: 40 (DW_TAG_member)
    <d8f9b>   DW_AT_name        : (indirect string, offset: 0x8fc84): motion
    <d8f9f>   DW_AT_decl_file   : 1
    <d8f9f>   DW_AT_decl_line   : 43
    <d8fa0>   DW_AT_decl_column : 31
    <d8fa1>   DW_AT_type        : <0xd8ed9>
 <2><d8fa5>: Abbrev Number: 40 (DW_TAG_member)
    <d8fa6>   DW_AT_name        : (indirect string, offset: 0x48b67): button
    <d8faa>   DW_AT_decl_file   : 1
    <d8faa>   DW_AT_decl_line   : 44
    <d8fab>   DW_AT_decl_column : 31
    <d8fac>   DW_AT_type        : <0xd8f4d>
 <2><d8fb0>: Abbrev Number: 0
 <1><d8fb1>: Abbrev Number: 11 (DW_TAG_typedef)
    <d8fb2>   DW_AT_name        : (indirect string, offset: 0x8fcd3): spnav_event
    <d8fb6>   DW_AT_decl_file   : 1
    <d8fb7>   DW_AT_decl_line   : 45
    <d8fb8>   DW_AT_decl_column : 3
    <d8fb9>   DW_AT_type        : <0xd8f82>
 <1><d8fbd>: Abbrev Number: 27 (DW_TAG_variable)
    <d8fbe>   DW_AT_name        : (indirect string, offset: 0x8fcad): spnav_win
    <d8fc2>   DW_AT_decl_file   : 1
    <d8fc2>   DW_AT_decl_line   : 55
    <d8fc3>   DW_AT_decl_column : 20
    <d8fc4>   DW_AT_type        : <0xd8ddd>
    <d8fc8>   DW_AT_location    : 9 byte block: 3 20 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a20)
 <1><d8fd2>: Abbrev Number: 27 (DW_TAG_variable)
    <d8fd3>   DW_AT_name        : (indirect string, offset: 0x8fbb2): sball_initialized
    <d8fd7>   DW_AT_decl_file   : 1
    <d8fd7>   DW_AT_decl_line   : 63
    <d8fd8>   DW_AT_decl_column : 12
    <d8fd9>   DW_AT_type        : <0xd6957>
    <d8fdd>   DW_AT_location    : 9 byte block: 3 18 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a18)
 <1><d8fe7>: Abbrev Number: 41 (DW_TAG_variable)
    <d8fe8>   DW_AT_name        : dpy
    <d8fec>   DW_AT_decl_file   : 1
    <d8fec>   DW_AT_decl_line   : 246
    <d8fed>   DW_AT_decl_column : 17
    <d8fed>   DW_AT_type        : <0xd70cd>
    <d8ff1>   DW_AT_location    : 9 byte block: 3 10 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a10)
 <1><d8ffb>: Abbrev Number: 78 (DW_TAG_variable)
    <d8ffc>   DW_AT_name        : (indirect string, offset: 0x8fd48): app_win
    <d9000>   DW_AT_decl_file   : 1
    <d9001>   DW_AT_decl_line   : 247
    <d9002>   DW_AT_decl_column : 15
    <d9003>   DW_AT_type        : <0xd6a18>
 <1><d9007>: Abbrev Number: 27 (DW_TAG_variable)
    <d9008>   DW_AT_name        : (indirect string, offset: 0x8fbfa): motion_event
    <d900c>   DW_AT_decl_file   : 1
    <d900c>   DW_AT_decl_line   : 248
    <d900d>   DW_AT_decl_column : 13
    <d900e>   DW_AT_type        : <0xd69f4>
    <d9012>   DW_AT_location    : 9 byte block: 3 8 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a08)
 <1><d901c>: Abbrev Number: 27 (DW_TAG_variable)
    <d901d>   DW_AT_name        : (indirect string, offset: 0x8fd01): button_press_event
    <d9021>   DW_AT_decl_file   : 1
    <d9021>   DW_AT_decl_line   : 248
    <d9022>   DW_AT_decl_column : 27
    <d9023>   DW_AT_type        : <0xd69f4>
    <d9027>   DW_AT_location    : 9 byte block: 3 0 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109a00)
 <1><d9031>: Abbrev Number: 27 (DW_TAG_variable)
    <d9032>   DW_AT_name        : (indirect string, offset: 0x8fb79): button_release_event
    <d9036>   DW_AT_decl_file   : 1
    <d9036>   DW_AT_decl_line   : 248
    <d9037>   DW_AT_decl_column : 47
    <d9038>   DW_AT_type        : <0xd69f4>
    <d903c>   DW_AT_location    : 9 byte block: 3 f8 99 10 1 0 0 0 0 	(DW_OP_addr: 11099f8)
 <1><d9046>: Abbrev Number: 27 (DW_TAG_variable)
    <d9047>   DW_AT_name        : (indirect string, offset: 0x8fc4d): command_event
    <d904b>   DW_AT_decl_file   : 1
    <d904b>   DW_AT_decl_line   : 248
    <d904c>   DW_AT_decl_column : 69
    <d904d>   DW_AT_type        : <0xd69f4>
    <d9051>   DW_AT_location    : 9 byte block: 3 f0 99 10 1 0 0 0 0 	(DW_OP_addr: 11099f0)
 <1><d905b>: Abbrev Number: 51 (DW_TAG_enumeration_type)
    <d905c>   DW_AT_encoding    : 7	(void)
    <d905c>   DW_AT_byte_size   : 4
    <d905c>   DW_AT_type        : <0xd692f>
    <d9060>   DW_AT_decl_file   : 1
    <d9060>   DW_AT_decl_line   : 250
    <d9061>   DW_AT_decl_column : 6
    <d9061>   DW_AT_sibling     : <0xd9074>
 <2><d9065>: Abbrev Number: 52 (DW_TAG_enumerator)
    <d9066>   DW_AT_name        : (indirect string, offset: 0x8fc69): CMD_APP_WINDOW
    <d906a>   DW_AT_const_value : 27695
 <2><d906c>: Abbrev Number: 52 (DW_TAG_enumerator)
    <d906d>   DW_AT_name        : (indirect string, offset: 0x8fb0a): CMD_APP_SENS
    <d9071>   DW_AT_const_value : 27696
 <2><d9073>: Abbrev Number: 0
 <1><d9074>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d9075>   DW_AT_external    : 1
    <d9075>   DW_AT_name        : (indirect string, offset: 0x8fba4): XCheckIfEvent
    <d9079>   DW_AT_decl_file   : 6
    <d907a>   DW_AT_decl_line   : 2102
    <d907c>   DW_AT_decl_column : 13
    <d907d>   DW_AT_prototyped  : 1
    <d907d>   DW_AT_type        : <0xd6957>
    <d9081>   DW_AT_declaration : 1
    <d9081>   DW_AT_sibling     : <0xd909a>
 <2><d9085>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9086>   DW_AT_type        : <0xd70cd>
 <2><d908a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d908b>   DW_AT_type        : <0xd909a>
 <2><d908f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9090>   DW_AT_type        : <0xd909f>
 <2><d9094>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9095>   DW_AT_type        : <0xd6a43>
 <2><d9099>: Abbrev Number: 0
 <1><d909a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d909b>   DW_AT_byte_size   : 8
    <d909b>   DW_AT_type        : <0xd850d>
 <1><d909f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d90a0>   DW_AT_byte_size   : 8
    <d90a0>   DW_AT_type        : <0xd90a4>
 <1><d90a4>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <d90a5>   DW_AT_prototyped  : 1
    <d90a5>   DW_AT_type        : <0xd6957>
    <d90a9>   DW_AT_sibling     : <0xd90bd>
 <2><d90ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90ae>   DW_AT_type        : <0xd70cd>
 <2><d90b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90b3>   DW_AT_type        : <0xd909a>
 <2><d90b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90b8>   DW_AT_type        : <0xd6a43>
 <2><d90bc>: Abbrev Number: 0
 <1><d90bd>: Abbrev Number: 53 (DW_TAG_subprogram)
    <d90be>   DW_AT_external    : 1
    <d90be>   DW_AT_name        : (indirect string, offset: 0x8dfe5): fgSetWindow
    <d90c2>   DW_AT_decl_file   : 11
    <d90c2>   DW_AT_decl_line   : 878
    <d90c4>   DW_AT_decl_column : 13
    <d90c5>   DW_AT_prototyped  : 1
    <d90c5>   DW_AT_declaration : 1
    <d90c5>   DW_AT_sibling     : <0xd90cf>
 <2><d90c9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90ca>   DW_AT_type        : <0xd8ddd>
 <2><d90ce>: Abbrev Number: 0
 <1><d90cf>: Abbrev Number: 53 (DW_TAG_subprogram)
    <d90d0>   DW_AT_external    : 1
    <d90d0>   DW_AT_name        : (indirect string, offset: 0x8ee0b): fgWarning
    <d90d4>   DW_AT_decl_file   : 11
    <d90d4>   DW_AT_decl_line   : 999
    <d90d6>   DW_AT_decl_column : 6
    <d90d7>   DW_AT_prototyped  : 1
    <d90d7>   DW_AT_declaration : 1
    <d90d7>   DW_AT_sibling     : <0xd90e2>
 <2><d90db>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90dc>   DW_AT_type        : <0xd85d3>
 <2><d90e0>: Abbrev Number: 37 (DW_TAG_unspecified_parameters)
 <2><d90e1>: Abbrev Number: 0
 <1><d90e2>: Abbrev Number: 79 (DW_TAG_subprogram)
    <d90e3>   DW_AT_external    : 1
    <d90e3>   DW_AT_name        : (indirect string, offset: 0x8ef86): strcmp
    <d90e7>   DW_AT_decl_file   : 13
    <d90e8>   DW_AT_decl_line   : 140
    <d90e9>   DW_AT_decl_column : 12
    <d90ea>   DW_AT_prototyped  : 1
    <d90ea>   DW_AT_type        : <0xd6957>
    <d90ee>   DW_AT_declaration : 1
    <d90ee>   DW_AT_sibling     : <0xd90fd>
 <2><d90f2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90f3>   DW_AT_type        : <0xd85d3>
 <2><d90f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d90f8>   DW_AT_type        : <0xd85d3>
 <2><d90fc>: Abbrev Number: 0
 <1><d90fd>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d90fe>   DW_AT_external    : 1
    <d90fe>   DW_AT_name        : (indirect string, offset: 0x8fc07): XGetWMName
    <d9102>   DW_AT_decl_file   : 7
    <d9103>   DW_AT_decl_line   : 495
    <d9105>   DW_AT_decl_column : 15
    <d9106>   DW_AT_prototyped  : 1
    <d9106>   DW_AT_type        : <0xd6957>
    <d910a>   DW_AT_declaration : 1
    <d910a>   DW_AT_sibling     : <0xd911e>
 <2><d910e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d910f>   DW_AT_type        : <0xd70cd>
 <2><d9113>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9114>   DW_AT_type        : <0xd6a18>
 <2><d9118>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9119>   DW_AT_type        : <0xd911e>
 <2><d911d>: Abbrev Number: 0
 <1><d911e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d911f>   DW_AT_byte_size   : 8
    <d911f>   DW_AT_type        : <0xd858c>
 <1><d9123>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d9124>   DW_AT_external    : 1
    <d9124>   DW_AT_name        : (indirect string, offset: 0x6974c): XFree
    <d9128>   DW_AT_decl_file   : 6
    <d9129>   DW_AT_decl_line   : 2526
    <d912b>   DW_AT_decl_column : 12
    <d912c>   DW_AT_prototyped  : 1
    <d912c>   DW_AT_type        : <0xd6957>
    <d9130>   DW_AT_declaration : 1
    <d9130>   DW_AT_sibling     : <0xd913a>
 <2><d9134>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9135>   DW_AT_type        : <0xd6999>
 <2><d9139>: Abbrev Number: 0
 <1><d913a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d913b>   DW_AT_external    : 1
    <d913b>   DW_AT_name        : (indirect string, offset: 0x73e83): XGetWindowProperty
    <d913f>   DW_AT_decl_file   : 6
    <d9140>   DW_AT_decl_line   : 2686
    <d9142>   DW_AT_decl_column : 12
    <d9143>   DW_AT_prototyped  : 1
    <d9143>   DW_AT_type        : <0xd6957>
    <d9147>   DW_AT_declaration : 1
    <d9147>   DW_AT_sibling     : <0xd9188>
 <2><d914b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d914c>   DW_AT_type        : <0xd70cd>
 <2><d9150>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9151>   DW_AT_type        : <0xd6a18>
 <2><d9155>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9156>   DW_AT_type        : <0xd69f4>
 <2><d915a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d915b>   DW_AT_type        : <0xd697a>
 <2><d915f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9160>   DW_AT_type        : <0xd697a>
 <2><d9164>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9165>   DW_AT_type        : <0xd6957>
 <2><d9169>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d916a>   DW_AT_type        : <0xd69f4>
 <2><d916e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d916f>   DW_AT_type        : <0xd9188>
 <2><d9173>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9174>   DW_AT_type        : <0xd85c9>
 <2><d9178>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9179>   DW_AT_type        : <0xd85ce>
 <2><d917d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d917e>   DW_AT_type        : <0xd85ce>
 <2><d9182>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d9183>   DW_AT_type        : <0xd918d>
 <2><d9187>: Abbrev Number: 0
 <1><d9188>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d9189>   DW_AT_byte_size   : 8
    <d9189>   DW_AT_type        : <0xd69f4>
 <1><d918d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d918e>   DW_AT_byte_size   : 8
    <d918e>   DW_AT_type        : <0xd8587>
 <1><d9192>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d9193>   DW_AT_external    : 1
    <d9193>   DW_AT_name        : (indirect string, offset: 0x8e966): fprintf
    <d9197>   DW_AT_decl_file   : 12
    <d9198>   DW_AT_decl_line   : 326
    <d919a>   DW_AT_decl_column : 12
    <d919b>   DW_AT_prototyped  : 1
    <d919b>   DW_AT_type        : <0xd6957>
    <d919f>   DW_AT_declaration : 1
    <d919f>   DW_AT_sibling     : <0xd91af>
 <2><d91a3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d91a4>   DW_AT_type        : <0xd87b5>
 <2><d91a8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d91a9>   DW_AT_type        : <0xd85d8>
 <2><d91ad>: Abbrev Number: 37 (DW_TAG_unspecified_parameters)
 <2><d91ae>: Abbrev Number: 0
 <1><d91af>: Abbrev Number: 17 (DW_TAG_subprogram)
    <d91b0>   DW_AT_external    : 1
    <d91b0>   DW_AT_name        : (indirect string, offset: 0x8fc12): XGetErrorText
    <d91b4>   DW_AT_decl_file   : 6
    <d91b5>   DW_AT_decl_line   : 2610
    <d91b7>   DW_AT_decl_column : 12
    <d91b8>   DW_AT_prototyped  : 1
    <d91b8>   DW_AT_type        : <0xd6957>
    <d91bc>   DW_AT_declaration : 1
    <d91bc>   DW_AT_sibling     : <0xd91d5>
