    <fa696>   DW_AT_decl_line   : 418
    <fa698>   DW_AT_decl_column : 40
    <fa699>   DW_AT_type        : <0xf5031>
    <fa69d>   DW_AT_location    : 0x8ab7 (location list)
    <fa6a1>   DW_AT_GNU_locviews: 0x8aad
 <2><fa6a5>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fa6a6>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <fa6aa>   DW_AT_decl_file   : 1
    <fa6aa>   DW_AT_decl_line   : 418
    <fa6ac>   DW_AT_decl_column : 55
    <fa6ad>   DW_AT_type        : <0xf5031>
    <fa6b1>   DW_AT_location    : 0x8ae7 (location list)
    <fa6b5>   DW_AT_GNU_locviews: 0x8adf
 <2><fa6b9>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fa6ba>   DW_AT_name        : (indirect string, offset: 0x9c35c): slices
    <fa6be>   DW_AT_decl_file   : 1
    <fa6be>   DW_AT_decl_line   : 418
    <fa6c0>   DW_AT_decl_column : 69
    <fa6c1>   DW_AT_type        : <0xf4fff>
    <fa6c5>   DW_AT_location    : 0x8b16 (location list)
    <fa6c9>   DW_AT_GNU_locviews: 0x8b08
 <2><fa6cd>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <fa6ce>   DW_AT_name        : (indirect string, offset: 0x9c315): stacks
    <fa6d2>   DW_AT_decl_file   : 1
    <fa6d2>   DW_AT_decl_line   : 418
    <fa6d4>   DW_AT_decl_column : 83
    <fa6d5>   DW_AT_type        : <0xf4fff>
    <fa6d9>   DW_AT_location    : 0x8b57 (location list)
    <fa6dd>   DW_AT_GNU_locviews: 0x8b4b
 <2><fa6e1>: Abbrev Number: 4 (DW_TAG_variable)
    <fa6e2>   DW_AT_name        : i
    <fa6e4>   DW_AT_decl_file   : 1

 <1><fc3c5>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fc3c6>   DW_AT_byte_size   : 8
    <fc3c6>   DW_AT_type        : <0xfc3a5>
 <1><fc3ca>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <fc3cb>   DW_AT_encoding    : 7	(unsigned)
    <fc3cc>   DW_AT_byte_size   : 4
    <fc3cd>   DW_AT_type        : <0xfc351>
    <fc3d1>   DW_AT_decl_file   : 2
    <fc3d2>   DW_AT_decl_line   : 587
    <fc3d4>   DW_AT_decl_column : 1
    <fc3d5>   DW_AT_sibling     : <0xfc488>
 <2><fc3d9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3da>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <fc3de>   DW_AT_const_value : 0
 <2><fc3df>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3e0>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <fc3e4>   DW_AT_const_value : 1
 <2><fc3e5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3e6>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <fc3ea>   DW_AT_const_value : 2
 <2><fc3eb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3ec>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <fc3f0>   DW_AT_const_value : 3
 <2><fc3f1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3f2>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <fc3f6>   DW_AT_const_value : 4
 <2><fc3f7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3f8>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <fc3fc>   DW_AT_const_value : 5
 <2><fc3fd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc3fe>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <fc402>   DW_AT_const_value : 6
 <2><fc403>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc404>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <fc408>   DW_AT_const_value : 7
 <2><fc409>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc40a>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <fc40e>   DW_AT_const_value : 8
 <2><fc40f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc410>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <fc414>   DW_AT_const_value : 9
 <2><fc415>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc416>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <fc41a>   DW_AT_const_value : 10
 <2><fc41b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc41c>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <fc420>   DW_AT_const_value : 11
 <2><fc421>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc422>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <fc426>   DW_AT_const_value : 12
 <2><fc427>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc428>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <fc42c>   DW_AT_const_value : 13
 <2><fc42d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc42e>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <fc432>   DW_AT_const_value : 14
 <2><fc433>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc434>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <fc438>   DW_AT_const_value : 15
 <2><fc439>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc43a>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <fc43e>   DW_AT_const_value : 16
 <2><fc43f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc440>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <fc444>   DW_AT_const_value : 17
 <2><fc445>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc446>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <fc44a>   DW_AT_const_value : 18
 <2><fc44b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc44c>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <fc450>   DW_AT_const_value : 19
 <2><fc451>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc452>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <fc456>   DW_AT_const_value : 20
 <2><fc457>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc458>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <fc45c>   DW_AT_const_value : 21
 <2><fc45d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc45e>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <fc462>   DW_AT_const_value : 22
 <2><fc463>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc464>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <fc468>   DW_AT_const_value : 23
 <2><fc469>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc46a>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <fc46e>   DW_AT_const_value : 24
 <2><fc46f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc470>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <fc474>   DW_AT_const_value : 25
 <2><fc475>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc476>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <fc47a>   DW_AT_const_value : 26
 <2><fc47b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc47c>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <fc480>   DW_AT_const_value : 27
 <2><fc481>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fc482>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <fc486>   DW_AT_const_value : 28
 <2><fc487>: Abbrev Number: 0
 <1><fc488>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fc489>   DW_AT_name        : (indirect string, offset: 0x9c36a): freeglutStrokeFont
    <fc48d>   DW_AT_byte_size   : 32
    <fc48e>   DW_AT_decl_file   : 1
    <fc48e>   DW_AT_decl_line   : 81
    <fc48f>   DW_AT_decl_column : 8
    <fc48f>   DW_AT_sibling     : <0xfc4cf>
 <2><fc493>: Abbrev Number: 4 (DW_TAG_member)
    <fc494>   DW_AT_name        : (indirect string, offset: 0x7fdd5): name
    <fc498>   DW_AT_decl_file   : 1
    <fc498>   DW_AT_decl_line   : 83
    <fc499>   DW_AT_decl_column : 15
    <fc49a>   DW_AT_type        : <0xfc3c5>
    <fc49e>   DW_AT_data_member_location: 0
 <2><fc49f>: Abbrev Number: 4 (DW_TAG_member)
    <fc4a0>   DW_AT_name        : (indirect string, offset: 0x9c37d): num_chars
    <fc4a4>   DW_AT_decl_file   : 1
    <fc4a4>   DW_AT_decl_line   : 84
    <fc4a5>   DW_AT_decl_column : 7
    <fc4a6>   DW_AT_type        : <0xfc36d>
    <fc4aa>   DW_AT_data_member_location: 8
 <2><fc4ab>: Abbrev Number: 5 (DW_TAG_member)
    <fc4ac>   DW_AT_name        : ch
    <fc4af>   DW_AT_decl_file   : 1
    <fc4af>   DW_AT_decl_line   : 85
    <fc4b0>   DW_AT_decl_column : 9
    <fc4b1>   DW_AT_type        : <0xfc39c>
    <fc4b5>   DW_AT_data_member_location: 16
 <2><fc4b6>: Abbrev Number: 5 (DW_TAG_member)
    <fc4b7>   DW_AT_name        : top
    <fc4bb>   DW_AT_decl_file   : 1
    <fc4bb>   DW_AT_decl_line   : 86
    <fc4bc>   DW_AT_decl_column : 9
    <fc4bd>   DW_AT_type        : <0xfc380>
    <fc4c1>   DW_AT_data_member_location: 24
 <2><fc4c2>: Abbrev Number: 4 (DW_TAG_member)
    <fc4c3>   DW_AT_name        : (indirect string, offset: 0x7a157): bottom
    <fc4c7>   DW_AT_decl_file   : 1
    <fc4c7>   DW_AT_decl_line   : 87
    <fc4c8>   DW_AT_decl_column : 9
    <fc4c9>   DW_AT_type        : <0xfc380>
    <fc4cd>   DW_AT_data_member_location: 28
 <2><fc4ce>: Abbrev Number: 0
 <1><fc4cf>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fc4d0>   DW_AT_name        : (indirect string, offset: 0x9c387): freeglutBitmapFont
    <fc4d4>   DW_AT_byte_size   : 24
    <fc4d5>   DW_AT_decl_file   : 1
    <fc4d5>   DW_AT_decl_line   : 90
    <fc4d6>   DW_AT_decl_column : 8
    <fc4d6>   DW_AT_sibling     : <0xfc50a>
 <2><fc4da>: Abbrev Number: 4 (DW_TAG_member)
    <fc4db>   DW_AT_name        : (indirect string, offset: 0x7fdd5): name
    <fc4df>   DW_AT_decl_file   : 1
    <fc4df>   DW_AT_decl_line   : 92
    <fc4e0>   DW_AT_decl_column : 15
    <fc4e1>   DW_AT_type        : <0xfc3c5>
    <fc4e5>   DW_AT_data_member_location: 0
 <2><fc4e6>: Abbrev Number: 4 (DW_TAG_member)
    <fc4e7>   DW_AT_name        : (indirect string, offset: 0x9c37d): num_chars
    <fc4eb>   DW_AT_decl_file   : 1
    <fc4eb>   DW_AT_decl_line   : 93
    <fc4ec>   DW_AT_decl_column : 13
    <fc4ed>   DW_AT_type        : <0xfc374>
    <fc4f1>   DW_AT_data_member_location: 8
 <2><fc4f2>: Abbrev Number: 4 (DW_TAG_member)
    <fc4f3>   DW_AT_name        : (indirect string, offset: 0x6b32d): first
    <fc4f7>   DW_AT_decl_file   : 1
    <fc4f7>   DW_AT_decl_line   : 94
    <fc4f8>   DW_AT_decl_column : 13
    <fc4f9>   DW_AT_type        : <0xfc374>
    <fc4fd>   DW_AT_data_member_location: 12
 <2><fc4fe>: Abbrev Number: 5 (DW_TAG_member)
    <fc4ff>   DW_AT_name        : ch
    <fc502>   DW_AT_decl_file   : 1
    <fc502>   DW_AT_decl_line   : 95
    <fc503>   DW_AT_decl_column : 15
    <fc504>   DW_AT_type        : <0xfc3aa>
    <fc508>   DW_AT_data_member_location: 16
 <2><fc509>: Abbrev Number: 0
 <1><fc50a>: Abbrev Number: 3 (DW_TAG_variable)
    <fc50b>   DW_AT_name        : (indirect string, offset: 0x90c25): glutStrokeRoman
    <fc50f>   DW_AT_decl_file   : 1
    <fc50f>   DW_AT_decl_line   : 99
    <fc510>   DW_AT_decl_column : 27
    <fc510>   DW_AT_type        : <0xfc488>
    <fc514>   DW_AT_external    : 1
    <fc514>   DW_AT_location    : 9 byte block: 3 a0 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109ba0)
 <1><fc51e>: Abbrev Number: 3 (DW_TAG_variable)
    <fc51f>   DW_AT_name        : (indirect string, offset: 0x90be1): glutStrokeMonoRoman
    <fc523>   DW_AT_decl_file   : 1
    <fc523>   DW_AT_decl_line   : 100
    <fc524>   DW_AT_decl_column : 27
    <fc524>   DW_AT_type        : <0xfc488>
    <fc528>   DW_AT_external    : 1
    <fc528>   DW_AT_location    : 9 byte block: 3 80 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109b80)
 <1><fc532>: Abbrev Number: 3 (DW_TAG_variable)
    <fc533>   DW_AT_name        : (indirect string, offset: 0x90b12): glutBitmap9By15
    <fc537>   DW_AT_decl_file   : 1
    <fc537>   DW_AT_decl_line   : 102
    <fc538>   DW_AT_decl_column : 27
    <fc538>   DW_AT_type        : <0xfc4cf>
    <fc53c>   DW_AT_external    : 1
    <fc53c>   DW_AT_location    : 9 byte block: 3 60 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109b60)
 <1><fc546>: Abbrev Number: 3 (DW_TAG_variable)
    <fc547>   DW_AT_name        : (indirect string, offset: 0x90b9b): glutBitmap8By13
    <fc54b>   DW_AT_decl_file   : 1
    <fc54b>   DW_AT_decl_line   : 103
    <fc54c>   DW_AT_decl_column : 27
    <fc54c>   DW_AT_type        : <0xfc4cf>
    <fc550>   DW_AT_external    : 1
    <fc550>   DW_AT_location    : 9 byte block: 3 40 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109b40)
 <1><fc55a>: Abbrev Number: 3 (DW_TAG_variable)
    <fc55b>   DW_AT_name        : (indirect string, offset: 0x90ae3): glutBitmapTimesRoman10
    <fc55f>   DW_AT_decl_file   : 1
    <fc55f>   DW_AT_decl_line   : 104
    <fc560>   DW_AT_decl_column : 27
    <fc560>   DW_AT_type        : <0xfc4cf>
    <fc564>   DW_AT_external    : 1
    <fc564>   DW_AT_location    : 9 byte block: 3 20 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109b20)
 <1><fc56e>: Abbrev Number: 3 (DW_TAG_variable)
    <fc56f>   DW_AT_name        : (indirect string, offset: 0x90bca): glutBitmapTimesRoman24
    <fc573>   DW_AT_decl_file   : 1
    <fc573>   DW_AT_decl_line   : 105
    <fc574>   DW_AT_decl_column : 27
    <fc574>   DW_AT_type        : <0xfc4cf>
    <fc578>   DW_AT_external    : 1
    <fc578>   DW_AT_location    : 9 byte block: 3 0 9b 10 1 0 0 0 0 	(DW_OP_addr: 1109b00)
 <1><fc582>: Abbrev Number: 3 (DW_TAG_variable)
    <fc583>   DW_AT_name        : (indirect string, offset: 0x90a58): glutBitmapHelvetica10
    <fc587>   DW_AT_decl_file   : 1
    <fc587>   DW_AT_decl_line   : 106
    <fc588>   DW_AT_decl_column : 27
    <fc588>   DW_AT_type        : <0xfc4cf>
    <fc58c>   DW_AT_external    : 1
    <fc58c>   DW_AT_location    : 9 byte block: 3 e0 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109ae0)
 <1><fc596>: Abbrev Number: 3 (DW_TAG_variable)
    <fc597>   DW_AT_name        : (indirect string, offset: 0x90a81): glutBitmapHelvetica12
    <fc59b>   DW_AT_decl_file   : 1
    <fc59b>   DW_AT_decl_line   : 107
    <fc59c>   DW_AT_decl_column : 27
    <fc59c>   DW_AT_type        : <0xfc4cf>
    <fc5a0>   DW_AT_external    : 1
    <fc5a0>   DW_AT_location    : 9 byte block: 3 c0 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109ac0)
 <1><fc5aa>: Abbrev Number: 3 (DW_TAG_variable)
    <fc5ab>   DW_AT_name        : (indirect string, offset: 0x8f967): glutBitmapHelvetica18
    <fc5af>   DW_AT_decl_file   : 1
    <fc5af>   DW_AT_decl_line   : 108
    <fc5b0>   DW_AT_decl_column : 27
    <fc5b0>   DW_AT_type        : <0xfc4cf>
    <fc5b4>   DW_AT_external    : 1
    <fc5b4>   DW_AT_location    : 9 byte block: 3 a0 9a 10 1 0 0 0 0 	(DW_OP_addr: 1109aa0)
 <1><fc5be>: Abbrev Number: 0
  Compilation Unit @ offset 0xfc5bf:
   Length:        0xf5a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x5b02
   Pointer Size:  8
 <0><fc5cb>: Abbrev Number: 32 (DW_TAG_compile_unit)
    <fc5cc>   DW_AT_producer    : (indirect string, offset: 0x8e3e7): GNU C17 11.1.0 -mtune=generic -march=x86-64 -g -O2
    <fc5d0>   DW_AT_language    : 29	(C11)
    <fc5d1>   DW_AT_name        : (indirect line string, offset: 0x1ba1): ../../src/freeglut_misc.c
    <fc5d5>   DW_AT_comp_dir    : (indirect line string, offset: 0x18af): /home/main/qb64/internal/c/parts/core/os/lnx
    <fc5d9>   DW_AT_low_pc      : 0x9deba0
    <fc5e1>   DW_AT_high_pc     : 0x3d5
    <fc5e9>   DW_AT_stmt_list   : 0x2a2b4c
 <1><fc5ed>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc5ee>   DW_AT_byte_size   : 4
    <fc5ef>   DW_AT_encoding    : 4	(float)
    <fc5f0>   DW_AT_name        : (indirect string, offset: 0x75b47): float
 <1><fc5f4>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc5f5>   DW_AT_name        : (indirect string, offset: 0x642d7): GLenum
    <fc5f9>   DW_AT_decl_file   : 2
    <fc5fa>   DW_AT_decl_line   : 116
    <fc5fb>   DW_AT_decl_column : 22
    <fc5fc>   DW_AT_type        : <0xfc600>
 <1><fc600>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc601>   DW_AT_byte_size   : 4
    <fc602>   DW_AT_encoding    : 7	(unsigned)
    <fc603>   DW_AT_name        : (indirect string, offset: 0x21686): unsigned int
 <1><fc607>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc608>   DW_AT_name        : (indirect string, offset: 0x7ffc7): GLboolean
    <fc60c>   DW_AT_decl_file   : 2
    <fc60d>   DW_AT_decl_line   : 117
    <fc60e>   DW_AT_decl_column : 23
    <fc60f>   DW_AT_type        : <0xfc613>
 <1><fc613>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc614>   DW_AT_byte_size   : 1
    <fc615>   DW_AT_encoding    : 8	(unsigned char)
    <fc616>   DW_AT_name        : (indirect string, offset: 0x26886): unsigned char
 <1><fc61a>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc61b>   DW_AT_byte_size   : 1
    <fc61c>   DW_AT_encoding    : 6	(signed char)
    <fc61d>   DW_AT_name        : (indirect string, offset: 0x26888): signed char
 <1><fc621>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc622>   DW_AT_byte_size   : 2
    <fc623>   DW_AT_encoding    : 5	(signed)
    <fc624>   DW_AT_name        : (indirect string, offset: 0x4cc6f): short int
 <1><fc628>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc629>   DW_AT_name        : (indirect string, offset: 0x7ec75): GLint
    <fc62d>   DW_AT_decl_file   : 2
    <fc62e>   DW_AT_decl_line   : 122
    <fc62f>   DW_AT_decl_column : 14
    <fc630>   DW_AT_type        : <0xfc634>
 <1><fc634>: Abbrev Number: 33 (DW_TAG_base_type)
    <fc635>   DW_AT_byte_size   : 4
    <fc636>   DW_AT_encoding    : 5	(signed)
    <fc637>   DW_AT_name        : int
 <1><fc63b>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc63c>   DW_AT_name        : (indirect string, offset: 0x87985): GLubyte
    <fc640>   DW_AT_decl_file   : 2
    <fc641>   DW_AT_decl_line   : 123
    <fc642>   DW_AT_decl_column : 23
    <fc643>   DW_AT_type        : <0xfc613>
 <1><fc647>: Abbrev Number: 17 (DW_TAG_const_type)
    <fc648>   DW_AT_type        : <0xfc63b>
 <1><fc64c>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc64d>   DW_AT_byte_size   : 2
    <fc64e>   DW_AT_encoding    : 7	(unsigned)
    <fc64f>   DW_AT_name        : (indirect string, offset: 0x1a101): short unsigned int
 <1><fc653>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc654>   DW_AT_name        : (indirect string, offset: 0x7003b): GLuint
    <fc658>   DW_AT_decl_file   : 2
    <fc659>   DW_AT_decl_line   : 125
    <fc65a>   DW_AT_decl_column : 22
    <fc65b>   DW_AT_type        : <0xfc600>
 <1><fc65f>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc660>   DW_AT_name        : (indirect string, offset: 0x75b45): GLfloat
    <fc664>   DW_AT_decl_file   : 2
    <fc665>   DW_AT_decl_line   : 127
    <fc666>   DW_AT_decl_column : 16
    <fc667>   DW_AT_type        : <0xfc5ed>
 <1><fc66b>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc66c>   DW_AT_byte_size   : 8
    <fc66d>   DW_AT_encoding    : 4	(float)
    <fc66e>   DW_AT_name        : (indirect string, offset: 0x2d232): double
 <1><fc672>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc673>   DW_AT_byte_size   : 8
    <fc674>   DW_AT_encoding    : 7	(unsigned)
    <fc675>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><fc679>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc67a>   DW_AT_byte_size   : 8
    <fc67b>   DW_AT_encoding    : 5	(signed)
    <fc67c>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><fc680>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <fc681>   DW_AT_byte_size   : 8
 <1><fc682>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc683>   DW_AT_byte_size   : 8
    <fc683>   DW_AT_type        : <0xfc687>
 <1><fc687>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc688>   DW_AT_byte_size   : 1
    <fc689>   DW_AT_encoding    : 6	(signed char)
    <fc68a>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><fc68e>: Abbrev Number: 17 (DW_TAG_const_type)
    <fc68f>   DW_AT_type        : <0xfc687>
 <1><fc693>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc694>   DW_AT_byte_size   : 8
    <fc694>   DW_AT_type        : <0xfc647>
 <1><fc698>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc699>   DW_AT_byte_size   : 8
    <fc699>   DW_AT_type        : <0xfc69d>
 <1><fc69d>: Abbrev Number: 35 (DW_TAG_subroutine_type)
    <fc69e>   DW_AT_prototyped  : 1
 <1><fc69e>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc69f>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <fc6a3>   DW_AT_decl_file   : 3
    <fc6a4>   DW_AT_decl_line   : 209
    <fc6a5>   DW_AT_decl_column : 23
    <fc6a6>   DW_AT_type        : <0xfc672>
 <1><fc6aa>: Abbrev Number: 17 (DW_TAG_const_type)
    <fc6ab>   DW_AT_type        : <0xfc69e>
 <1><fc6af>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc6b0>   DW_AT_byte_size   : 8
    <fc6b1>   DW_AT_encoding    : 5	(signed)
    <fc6b2>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><fc6b6>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc6b7>   DW_AT_byte_size   : 8
    <fc6b8>   DW_AT_encoding    : 7	(unsigned)
    <fc6b9>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><fc6bd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc6be>   DW_AT_byte_size   : 8
    <fc6be>   DW_AT_type        : <0xfc6c2>
 <1><fc6c2>: Abbrev Number: 36 (DW_TAG_subroutine_type)
    <fc6c3>   DW_AT_sibling     : <0xfc6c9>
 <2><fc6c7>: Abbrev Number: 18 (DW_TAG_unspecified_parameters)
 <2><fc6c8>: Abbrev Number: 0
 <1><fc6c9>: Abbrev Number: 37 (DW_TAG_structure_type)
    <fc6ca>   DW_AT_name        : (indirect string, offset: 0x52c67): __va_list_tag
    <fc6ce>   DW_AT_byte_size   : 24
    <fc6cf>   DW_AT_decl_file   : 4
    <fc6d0>   DW_AT_decl_line   : 0
    <fc6d1>   DW_AT_sibling     : <0xfc6fe>
 <2><fc6d5>: Abbrev Number: 16 (DW_TAG_member)
    <fc6d6>   DW_AT_name        : (indirect string, offset: 0x63d8c): gp_offset
    <fc6da>   DW_AT_decl_file   : 4
    <fc6da>   DW_AT_decl_line   : 0
    <fc6da>   DW_AT_type        : <0xfc600>
    <fc6de>   DW_AT_data_member_location: 0
 <2><fc6df>: Abbrev Number: 16 (DW_TAG_member)
    <fc6e0>   DW_AT_name        : (indirect string, offset: 0x29f3e): fp_offset
    <fc6e4>   DW_AT_decl_file   : 4
    <fc6e4>   DW_AT_decl_line   : 0
    <fc6e4>   DW_AT_type        : <0xfc600>
    <fc6e8>   DW_AT_data_member_location: 4
 <2><fc6e9>: Abbrev Number: 16 (DW_TAG_member)
    <fc6ea>   DW_AT_name        : (indirect string, offset: 0x2ad47): overflow_arg_area
    <fc6ee>   DW_AT_decl_file   : 4
    <fc6ee>   DW_AT_decl_line   : 0
    <fc6ee>   DW_AT_type        : <0xfc680>
    <fc6f2>   DW_AT_data_member_location: 8
 <2><fc6f3>: Abbrev Number: 16 (DW_TAG_member)
    <fc6f4>   DW_AT_name        : (indirect string, offset: 0x354d6): reg_save_area
    <fc6f8>   DW_AT_decl_file   : 4
    <fc6f8>   DW_AT_decl_line   : 0
    <fc6f8>   DW_AT_type        : <0xfc680>
    <fc6fc>   DW_AT_data_member_location: 16
 <2><fc6fd>: Abbrev Number: 0
 <1><fc6fe>: Abbrev Number: 38 (DW_TAG_typedef)
    <fc6ff>   DW_AT_name        : XID
    <fc703>   DW_AT_decl_file   : 5
    <fc704>   DW_AT_decl_line   : 66
    <fc705>   DW_AT_decl_column : 23
    <fc706>   DW_AT_type        : <0xfc672>
 <1><fc70a>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc70b>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <fc70f>   DW_AT_decl_file   : 5
    <fc710>   DW_AT_decl_line   : 96
    <fc711>   DW_AT_decl_column : 13
    <fc712>   DW_AT_type        : <0xfc6fe>
 <1><fc716>: Abbrev Number: 8 (DW_TAG_base_type)
    <fc717>   DW_AT_byte_size   : 16
    <fc718>   DW_AT_encoding    : 4	(float)
    <fc719>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><fc71d>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc71e>   DW_AT_name        : (indirect string, offset: 0x7aac9): GLXContext
    <fc722>   DW_AT_decl_file   : 6
    <fc723>   DW_AT_decl_line   : 165
    <fc724>   DW_AT_decl_column : 33
    <fc725>   DW_AT_type        : <0xfc729>
 <1><fc729>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc72a>   DW_AT_byte_size   : 8
    <fc72a>   DW_AT_type        : <0xfc72e>
 <1><fc72e>: Abbrev Number: 23 (DW_TAG_structure_type)
    <fc72f>   DW_AT_name        : (indirect string, offset: 0x69cf9): __GLXcontextRec
    <fc733>   DW_AT_declaration : 1
 <1><fc733>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc734>   DW_AT_name        : (indirect string, offset: 0x84a59): GLXFBConfig
    <fc738>   DW_AT_decl_file   : 6
    <fc739>   DW_AT_decl_line   : 169
    <fc73a>   DW_AT_decl_column : 34
    <fc73b>   DW_AT_type        : <0xfc73f>
 <1><fc73f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc740>   DW_AT_byte_size   : 8
    <fc740>   DW_AT_type        : <0xfc744>
 <1><fc744>: Abbrev Number: 23 (DW_TAG_structure_type)
    <fc745>   DW_AT_name        : (indirect string, offset: 0x5d971): __GLXFBConfigRec
    <fc749>   DW_AT_declaration : 1
 <1><fc749>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc74a>   DW_AT_byte_size   : 8
    <fc74a>   DW_AT_type        : <0xfc733>
 <1><fc74e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc74f>   DW_AT_byte_size   : 8
    <fc74f>   DW_AT_type        : <0xfc68e>
 <1><fc753>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc754>   DW_AT_byte_size   : 8
    <fc754>   DW_AT_type        : <0xfc758>
 <1><fc758>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <fc759>   DW_AT_prototyped  : 1
    <fc759>   DW_AT_sibling     : <0xfc763>
 <2><fc75d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc75e>   DW_AT_type        : <0xfc634>
 <2><fc762>: Abbrev Number: 0
 <1><fc763>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc764>   DW_AT_byte_size   : 8
    <fc764>   DW_AT_type        : <0xfc768>
 <1><fc768>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <fc769>   DW_AT_prototyped  : 1
    <fc769>   DW_AT_sibling     : <0xfc77d>
 <2><fc76d>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc76e>   DW_AT_type        : <0xfc634>
 <2><fc772>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc773>   DW_AT_type        : <0xfc634>
 <2><fc777>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc778>   DW_AT_type        : <0xfc634>
 <2><fc77c>: Abbrev Number: 0
 <1><fc77d>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc77e>   DW_AT_name        : (indirect string, offset: 0x8e2b6): FGCBDestroy
    <fc782>   DW_AT_decl_file   : 7
    <fc783>   DW_AT_decl_line   : 239
    <fc784>   DW_AT_decl_column : 17
    <fc785>   DW_AT_type        : <0xfc698>
 <1><fc789>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc78a>   DW_AT_name        : (indirect string, offset: 0x8e198): FGCBIdle
    <fc78e>   DW_AT_decl_file   : 7
    <fc78f>   DW_AT_decl_line   : 247
    <fc790>   DW_AT_decl_column : 17
    <fc791>   DW_AT_type        : <0xfc698>
 <1><fc795>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc796>   DW_AT_name        : (indirect string, offset: 0x8df35): FGCBMenuState
    <fc79a>   DW_AT_decl_file   : 7
    <fc79b>   DW_AT_decl_line   : 249
    <fc79c>   DW_AT_decl_column : 17
    <fc79d>   DW_AT_type        : <0xfc753>
 <1><fc7a1>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc7a2>   DW_AT_name        : (indirect string, offset: 0x8e6bc): FGCBMenuStatus
    <fc7a6>   DW_AT_decl_file   : 7
    <fc7a7>   DW_AT_decl_line   : 250
    <fc7a8>   DW_AT_decl_column : 17
    <fc7a9>   DW_AT_type        : <0xfc763>
 <1><fc7ad>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc7ae>   DW_AT_name        : (indirect string, offset: 0x8df19): FGCBMenu
    <fc7b2>   DW_AT_decl_file   : 7
    <fc7b3>   DW_AT_decl_line   : 253
    <fc7b4>   DW_AT_decl_column : 17
    <fc7b5>   DW_AT_type        : <0xfc753>
 <1><fc7b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc7ba>   DW_AT_name        : (indirect string, offset: 0x8e1f6): FGError
    <fc7be>   DW_AT_decl_file   : 7
    <fc7be>   DW_AT_decl_line   : 256
    <fc7c0>   DW_AT_decl_column : 17
    <fc7c1>   DW_AT_type        : <0xfc7c5>
 <1><fc7c5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc7c6>   DW_AT_byte_size   : 8
    <fc7c6>   DW_AT_type        : <0xfc7ca>
 <1><fc7ca>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <fc7cb>   DW_AT_prototyped  : 1
    <fc7cb>   DW_AT_sibling     : <0xfc7da>
 <2><fc7cf>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc7d0>   DW_AT_type        : <0xfc74e>
 <2><fc7d4>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fc7d5>   DW_AT_type        : <0xfc7da>
 <2><fc7d9>: Abbrev Number: 0
 <1><fc7da>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fc7db>   DW_AT_byte_size   : 8
    <fc7db>   DW_AT_type        : <0xfc6c9>
 <1><fc7df>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc7e0>   DW_AT_name        : (indirect string, offset: 0x8e129): FGWarning
    <fc7e4>   DW_AT_decl_file   : 7
    <fc7e4>   DW_AT_decl_line   : 257
    <fc7e6>   DW_AT_decl_column : 17
    <fc7e7>   DW_AT_type        : <0xfc7c5>
 <1><fc7eb>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc7ec>   DW_AT_name        : (indirect string, offset: 0x8e43d): SFG_List
    <fc7f0>   DW_AT_decl_file   : 7
    <fc7f0>   DW_AT_decl_line   : 261
    <fc7f2>   DW_AT_decl_column : 28
    <fc7f3>   DW_AT_type        : <0xfc7f7>
 <1><fc7f7>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fc7f8>   DW_AT_name        : (indirect string, offset: 0x8e43a): tagSFG_List
    <fc7fc>   DW_AT_byte_size   : 16
    <fc7fd>   DW_AT_decl_file   : 7
    <fc7fd>   DW_AT_decl_line   : 262
    <fc7ff>   DW_AT_decl_column : 8
    <fc7ff>   DW_AT_sibling     : <0xfc81e>
 <2><fc803>: Abbrev Number: 1 (DW_TAG_member)
    <fc804>   DW_AT_name        : (indirect string, offset: 0x8e434): First
    <fc808>   DW_AT_decl_file   : 7
    <fc808>   DW_AT_decl_line   : 264
    <fc80a>   DW_AT_decl_column : 11
    <fc80b>   DW_AT_type        : <0xfc680>
    <fc80f>   DW_AT_data_member_location: 0
 <2><fc810>: Abbrev Number: 1 (DW_TAG_member)
    <fc811>   DW_AT_name        : (indirect string, offset: 0x8e0d2): Last
    <fc815>   DW_AT_decl_file   : 7
    <fc815>   DW_AT_decl_line   : 265
    <fc817>   DW_AT_decl_column : 11
    <fc818>   DW_AT_type        : <0xfc680>
    <fc81c>   DW_AT_data_member_location: 8
 <2><fc81d>: Abbrev Number: 0
 <1><fc81e>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc81f>   DW_AT_name        : (indirect string, offset: 0x8e756): SFG_Node
    <fc823>   DW_AT_decl_file   : 7
    <fc823>   DW_AT_decl_line   : 269
    <fc825>   DW_AT_decl_column : 28
    <fc826>   DW_AT_type        : <0xfc82a>
 <1><fc82a>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fc82b>   DW_AT_name        : (indirect string, offset: 0x8e753): tagSFG_Node
    <fc82f>   DW_AT_byte_size   : 16
    <fc830>   DW_AT_decl_file   : 7
    <fc830>   DW_AT_decl_line   : 270
    <fc832>   DW_AT_decl_column : 8
    <fc832>   DW_AT_sibling     : <0xfc851>
 <2><fc836>: Abbrev Number: 1 (DW_TAG_member)
    <fc837>   DW_AT_name        : (indirect string, offset: 0x8e446): Next
    <fc83b>   DW_AT_decl_file   : 7
    <fc83b>   DW_AT_decl_line   : 272
    <fc83d>   DW_AT_decl_column : 11
    <fc83e>   DW_AT_type        : <0xfc680>
    <fc842>   DW_AT_data_member_location: 0
 <2><fc843>: Abbrev Number: 1 (DW_TAG_member)
    <fc844>   DW_AT_name        : (indirect string, offset: 0x8e36e): Prev
    <fc848>   DW_AT_decl_file   : 7
    <fc848>   DW_AT_decl_line   : 273
    <fc84a>   DW_AT_decl_column : 11
    <fc84b>   DW_AT_type        : <0xfc680>
    <fc84f>   DW_AT_data_member_location: 8
 <2><fc850>: Abbrev Number: 0
 <1><fc851>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc852>   DW_AT_name        : (indirect string, offset: 0x8dfba): SFG_XYUse
    <fc856>   DW_AT_decl_file   : 7
    <fc856>   DW_AT_decl_line   : 277
    <fc858>   DW_AT_decl_column : 29
    <fc859>   DW_AT_type        : <0xfc85d>
 <1><fc85d>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fc85e>   DW_AT_name        : (indirect string, offset: 0x8dfb7): tagSFG_XYUse
    <fc862>   DW_AT_byte_size   : 12
    <fc863>   DW_AT_decl_file   : 7
    <fc863>   DW_AT_decl_line   : 278
    <fc865>   DW_AT_decl_column : 8
    <fc865>   DW_AT_sibling     : <0xfc88d>
 <2><fc869>: Abbrev Number: 11 (DW_TAG_member)
    <fc86a>   DW_AT_name        : X
    <fc86c>   DW_AT_decl_file   : 7
    <fc86c>   DW_AT_decl_line   : 280
    <fc86e>   DW_AT_decl_column : 21
    <fc86f>   DW_AT_type        : <0xfc628>
    <fc873>   DW_AT_data_member_location: 0
 <2><fc874>: Abbrev Number: 11 (DW_TAG_member)
    <fc875>   DW_AT_name        : Y
    <fc877>   DW_AT_decl_file   : 7
    <fc877>   DW_AT_decl_line   : 280
    <fc879>   DW_AT_decl_column : 24
    <fc87a>   DW_AT_type        : <0xfc628>
    <fc87e>   DW_AT_data_member_location: 4
 <2><fc87f>: Abbrev Number: 11 (DW_TAG_member)
    <fc880>   DW_AT_name        : Use
    <fc884>   DW_AT_decl_file   : 7
    <fc884>   DW_AT_decl_line   : 281
    <fc886>   DW_AT_decl_column : 21
    <fc887>   DW_AT_type        : <0xfc607>
    <fc88b>   DW_AT_data_member_location: 8
 <2><fc88c>: Abbrev Number: 0
 <1><fc88d>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <fc88e>   DW_AT_encoding    : 7	(void)
    <fc88e>   DW_AT_byte_size   : 4
    <fc88e>   DW_AT_type        : <0xfc600>
    <fc892>   DW_AT_decl_file   : 7
    <fc892>   DW_AT_decl_line   : 289
    <fc894>   DW_AT_decl_column : 1
    <fc894>   DW_AT_sibling     : <0xfc8ab>
 <2><fc898>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc899>   DW_AT_name        : (indirect string, offset: 0x8e6dd): GLUT_EXEC_STATE_INIT
    <fc89d>   DW_AT_const_value : 0
 <2><fc89e>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc89f>   DW_AT_name        : (indirect string, offset: 0x8e2c2): GLUT_EXEC_STATE_RUNNING
    <fc8a3>   DW_AT_const_value : 1
 <2><fc8a4>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fc8a5>   DW_AT_name        : (indirect string, offset: 0x8e0f5): GLUT_EXEC_STATE_STOP
    <fc8a9>   DW_AT_const_value : 2
 <2><fc8aa>: Abbrev Number: 0
 <1><fc8ab>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc8ac>   DW_AT_name        : (indirect string, offset: 0x8e133): fgExecutionState
    <fc8b0>   DW_AT_decl_file   : 7
    <fc8b0>   DW_AT_decl_line   : 293
    <fc8b2>   DW_AT_decl_column : 3
    <fc8b3>   DW_AT_type        : <0xfc88d>
 <1><fc8b7>: Abbrev Number: 4 (DW_TAG_typedef)
    <fc8b8>   DW_AT_name        : (indirect string, offset: 0x8e554): SFG_State
    <fc8bc>   DW_AT_decl_file   : 7
    <fc8bc>   DW_AT_decl_line   : 296
    <fc8be>   DW_AT_decl_column : 29
    <fc8bf>   DW_AT_type        : <0xfc8c3>
 <1><fc8c3>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fc8c4>   DW_AT_name        : (indirect string, offset: 0x8e551): tagSFG_State
    <fc8c8>   DW_AT_byte_size   : 232
    <fc8c9>   DW_AT_decl_file   : 7
    <fc8c9>   DW_AT_decl_line   : 297
    <fc8cb>   DW_AT_decl_column : 8
    <fc8cb>   DW_AT_sibling     : <0xfcacb>
 <2><fc8cf>: Abbrev Number: 1 (DW_TAG_member)
    <fc8d0>   DW_AT_name        : (indirect string, offset: 0x8ef40): Position
    <fc8d4>   DW_AT_decl_file   : 7
    <fc8d4>   DW_AT_decl_line   : 299
    <fc8d6>   DW_AT_decl_column : 22
    <fc8d7>   DW_AT_type        : <0xfc851>
    <fc8db>   DW_AT_data_member_location: 0
 <2><fc8dc>: Abbrev Number: 1 (DW_TAG_member)
    <fc8dd>   DW_AT_name        : (indirect string, offset: 0x6e14c): Size
    <fc8e1>   DW_AT_decl_file   : 7
    <fc8e1>   DW_AT_decl_line   : 300
    <fc8e3>   DW_AT_decl_column : 22
    <fc8e4>   DW_AT_type        : <0xfc851>
    <fc8e8>   DW_AT_data_member_location: 12
 <2><fc8e9>: Abbrev Number: 1 (DW_TAG_member)
    <fc8ea>   DW_AT_name        : (indirect string, offset: 0x901d5): DisplayMode
    <fc8ee>   DW_AT_decl_file   : 7
    <fc8ee>   DW_AT_decl_line   : 301
    <fc8f0>   DW_AT_decl_column : 22
    <fc8f1>   DW_AT_type        : <0xfc600>
    <fc8f5>   DW_AT_data_member_location: 24
 <2><fc8f6>: Abbrev Number: 1 (DW_TAG_member)
    <fc8f7>   DW_AT_name        : (indirect string, offset: 0x8e475): Initialised
    <fc8fb>   DW_AT_decl_file   : 7
    <fc8fb>   DW_AT_decl_line   : 303
    <fc8fd>   DW_AT_decl_column : 22
    <fc8fe>   DW_AT_type        : <0xfc607>
    <fc902>   DW_AT_data_member_location: 28
 <2><fc903>: Abbrev Number: 1 (DW_TAG_member)
    <fc904>   DW_AT_name        : (indirect string, offset: 0x8e012): DirectContext
    <fc908>   DW_AT_decl_file   : 7
    <fc908>   DW_AT_decl_line   : 305
    <fc90a>   DW_AT_decl_column : 22
    <fc90b>   DW_AT_type        : <0xfc634>
    <fc90f>   DW_AT_data_member_location: 32
 <2><fc910>: Abbrev Number: 1 (DW_TAG_member)
    <fc911>   DW_AT_name        : (indirect string, offset: 0x8e02d): ForceIconic
    <fc915>   DW_AT_decl_file   : 7
    <fc915>   DW_AT_decl_line   : 307
    <fc917>   DW_AT_decl_column : 22
    <fc918>   DW_AT_type        : <0xfc607>
    <fc91c>   DW_AT_data_member_location: 36
 <2><fc91d>: Abbrev Number: 1 (DW_TAG_member)
    <fc91e>   DW_AT_name        : (indirect string, offset: 0x8e57b): UseCurrentContext
    <fc922>   DW_AT_decl_file   : 7
    <fc922>   DW_AT_decl_line   : 308
    <fc924>   DW_AT_decl_column : 22
    <fc925>   DW_AT_type        : <0xfc607>
    <fc929>   DW_AT_data_member_location: 37
 <2><fc92a>: Abbrev Number: 1 (DW_TAG_member)
    <fc92b>   DW_AT_name        : (indirect string, offset: 0x8e5d7): GLDebugSwitch
    <fc92f>   DW_AT_decl_file   : 7
    <fc92f>   DW_AT_decl_line   : 310
    <fc931>   DW_AT_decl_column : 22
    <fc932>   DW_AT_type        : <0xfc607>
    <fc936>   DW_AT_data_member_location: 38
 <2><fc937>: Abbrev Number: 1 (DW_TAG_member)
    <fc938>   DW_AT_name        : (indirect string, offset: 0x8e0a0): XSyncSwitch
    <fc93c>   DW_AT_decl_file   : 7
    <fc93c>   DW_AT_decl_line   : 311
    <fc93e>   DW_AT_decl_column : 22
    <fc93f>   DW_AT_type        : <0xfc607>
    <fc943>   DW_AT_data_member_location: 39
 <2><fc944>: Abbrev Number: 1 (DW_TAG_member)
    <fc945>   DW_AT_name        : (indirect string, offset: 0x90925): KeyRepeat
    <fc949>   DW_AT_decl_file   : 7
    <fc949>   DW_AT_decl_line   : 313
    <fc94b>   DW_AT_decl_column : 22
    <fc94c>   DW_AT_type        : <0xfc634>
    <fc950>   DW_AT_data_member_location: 40
 <2><fc951>: Abbrev Number: 1 (DW_TAG_member)
    <fc952>   DW_AT_name        : (indirect string, offset: 0x8f72d): Modifiers
    <fc956>   DW_AT_decl_file   : 7
    <fc956>   DW_AT_decl_line   : 314
    <fc958>   DW_AT_decl_column : 22
    <fc959>   DW_AT_type        : <0xfc634>
    <fc95d>   DW_AT_data_member_location: 44
 <2><fc95e>: Abbrev Number: 1 (DW_TAG_member)
    <fc95f>   DW_AT_name        : (indirect string, offset: 0x8e618): FPSInterval
    <fc963>   DW_AT_decl_file   : 7
    <fc963>   DW_AT_decl_line   : 316
    <fc965>   DW_AT_decl_column : 22
    <fc966>   DW_AT_type        : <0xfc653>
    <fc96a>   DW_AT_data_member_location: 48
 <2><fc96b>: Abbrev Number: 1 (DW_TAG_member)
    <fc96c>   DW_AT_name        : (indirect string, offset: 0x8e0c8): SwapCount
    <fc970>   DW_AT_decl_file   : 7
    <fc970>   DW_AT_decl_line   : 317
    <fc972>   DW_AT_decl_column : 22
    <fc973>   DW_AT_type        : <0xfc653>
    <fc977>   DW_AT_data_member_location: 52
 <2><fc978>: Abbrev Number: 1 (DW_TAG_member)
    <fc979>   DW_AT_name        : (indirect string, offset: 0x8e728): SwapTime
    <fc97d>   DW_AT_decl_file   : 7
    <fc97d>   DW_AT_decl_line   : 318
    <fc97f>   DW_AT_decl_column : 22
    <fc980>   DW_AT_type        : <0xfc653>
    <fc984>   DW_AT_data_member_location: 56
 <2><fc985>: Abbrev Number: 1 (DW_TAG_member)
    <fc986>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <fc98a>   DW_AT_decl_file   : 7
    <fc98a>   DW_AT_decl_line   : 320
    <fc98c>   DW_AT_decl_column : 22
    <fc98d>   DW_AT_type        : <0xfc672>
    <fc991>   DW_AT_data_member_location: 64
 <2><fc992>: Abbrev Number: 1 (DW_TAG_member)
    <fc993>   DW_AT_name        : (indirect string, offset: 0x8e078): Timers
    <fc997>   DW_AT_decl_file   : 7
    <fc997>   DW_AT_decl_line   : 321
    <fc999>   DW_AT_decl_column : 22
    <fc99a>   DW_AT_type        : <0xfc7eb>
    <fc99e>   DW_AT_data_member_location: 72
 <2><fc99f>: Abbrev Number: 1 (DW_TAG_member)
    <fc9a0>   DW_AT_name        : (indirect string, offset: 0x8e074): FreeTimers
    <fc9a4>   DW_AT_decl_file   : 7
    <fc9a4>   DW_AT_decl_line   : 322
    <fc9a6>   DW_AT_decl_column : 22
    <fc9a7>   DW_AT_type        : <0xfc7eb>
    <fc9ab>   DW_AT_data_member_location: 88
 <2><fc9ac>: Abbrev Number: 1 (DW_TAG_member)
    <fc9ad>   DW_AT_name        : (indirect string, offset: 0x8e336): IdleCallback
    <fc9b1>   DW_AT_decl_file   : 7
    <fc9b1>   DW_AT_decl_line   : 324
    <fc9b3>   DW_AT_decl_column : 22
    <fc9b4>   DW_AT_type        : <0xfc789>
    <fc9b8>   DW_AT_data_member_location: 104
 <2><fc9b9>: Abbrev Number: 1 (DW_TAG_member)
    <fc9ba>   DW_AT_name        : (indirect string, offset: 0x8e258): ActiveMenus
    <fc9be>   DW_AT_decl_file   : 7
    <fc9be>   DW_AT_decl_line   : 326
    <fc9c0>   DW_AT_decl_column : 22
    <fc9c1>   DW_AT_type        : <0xfc634>
    <fc9c5>   DW_AT_data_member_location: 112
 <2><fc9c6>: Abbrev Number: 1 (DW_TAG_member)
    <fc9c7>   DW_AT_name        : (indirect string, offset: 0x8e69e): MenuStateCallback
    <fc9cb>   DW_AT_decl_file   : 7
    <fc9cb>   DW_AT_decl_line   : 327
    <fc9cd>   DW_AT_decl_column : 22
    <fc9ce>   DW_AT_type        : <0xfc795>
    <fc9d2>   DW_AT_data_member_location: 120
 <2><fc9d3>: Abbrev Number: 1 (DW_TAG_member)
    <fc9d4>   DW_AT_name        : (indirect string, offset: 0x8e179): MenuStatusCallback
    <fc9d8>   DW_AT_decl_file   : 7
    <fc9d8>   DW_AT_decl_line   : 328
    <fc9da>   DW_AT_decl_column : 22
    <fc9db>   DW_AT_type        : <0xfc7a1>
    <fc9df>   DW_AT_data_member_location: 128
 <2><fc9e0>: Abbrev Number: 1 (DW_TAG_member)
    <fc9e1>   DW_AT_name        : (indirect string, offset: 0x8e5f5): GameModeSize
    <fc9e5>   DW_AT_decl_file   : 7
    <fc9e5>   DW_AT_decl_line   : 330
    <fc9e7>   DW_AT_decl_column : 22
    <fc9e8>   DW_AT_type        : <0xfc851>
    <fc9ec>   DW_AT_data_member_location: 136
 <2><fc9ed>: Abbrev Number: 1 (DW_TAG_member)
    <fc9ee>   DW_AT_name        : (indirect string, offset: 0x8e264): GameModeDepth
    <fc9f2>   DW_AT_decl_file   : 7
    <fc9f2>   DW_AT_decl_line   : 331
    <fc9f4>   DW_AT_decl_column : 22
    <fc9f5>   DW_AT_type        : <0xfc634>
    <fc9f9>   DW_AT_data_member_location: 148
 <2><fc9fa>: Abbrev Number: 1 (DW_TAG_member)
    <fc9fb>   DW_AT_name        : (indirect string, offset: 0x8df43): GameModeRefresh
    <fc9ff>   DW_AT_decl_file   : 7
    <fc9ff>   DW_AT_decl_line   : 332
    <fca01>   DW_AT_decl_column : 22
    <fca02>   DW_AT_type        : <0xfc634>
    <fca06>   DW_AT_data_member_location: 152
 <2><fca07>: Abbrev Number: 1 (DW_TAG_member)
    <fca08>   DW_AT_name        : (indirect string, offset: 0x8e38d): ActionOnWindowClose
    <fca0c>   DW_AT_decl_file   : 7
    <fca0c>   DW_AT_decl_line   : 334
    <fca0e>   DW_AT_decl_column : 22
    <fca0f>   DW_AT_type        : <0xfc634>
    <fca13>   DW_AT_data_member_location: 156
 <2><fca14>: Abbrev Number: 1 (DW_TAG_member)
    <fca15>   DW_AT_name        : (indirect string, offset: 0x8e23d): ExecState
    <fca19>   DW_AT_decl_file   : 7
    <fca19>   DW_AT_decl_line   : 336
    <fca1b>   DW_AT_decl_column : 22
    <fca1c>   DW_AT_type        : <0xfc8ab>
    <fca20>   DW_AT_data_member_location: 160
 <2><fca21>: Abbrev Number: 1 (DW_TAG_member)
    <fca22>   DW_AT_name        : (indirect string, offset: 0x8e373): ProgramName
    <fca26>   DW_AT_decl_file   : 7
    <fca26>   DW_AT_decl_line   : 337
    <fca28>   DW_AT_decl_column : 22
    <fca29>   DW_AT_type        : <0xfc682>
    <fca2d>   DW_AT_data_member_location: 168
 <2><fca2e>: Abbrev Number: 1 (DW_TAG_member)
    <fca2f>   DW_AT_name        : (indirect string, offset: 0x8e46c): JoysticksInitialised
    <fca33>   DW_AT_decl_file   : 7
    <fca33>   DW_AT_decl_line   : 338
    <fca35>   DW_AT_decl_column : 22
    <fca36>   DW_AT_type        : <0xfc607>
    <fca3a>   DW_AT_data_member_location: 176
 <2><fca3b>: Abbrev Number: 1 (DW_TAG_member)
    <fca3c>   DW_AT_name        : (indirect string, offset: 0x8e1fe): NumActiveJoysticks
    <fca40>   DW_AT_decl_file   : 7
    <fca40>   DW_AT_decl_line   : 339
    <fca42>   DW_AT_decl_column : 22
    <fca43>   DW_AT_type        : <0xfc634>
    <fca47>   DW_AT_data_member_location: 180
 <2><fca48>: Abbrev Number: 1 (DW_TAG_member)
    <fca49>   DW_AT_name        : (indirect string, offset: 0x8e08b): InputDevsInitialised
    <fca4d>   DW_AT_decl_file   : 7
    <fca4d>   DW_AT_decl_line   : 340
    <fca4f>   DW_AT_decl_column : 22
    <fca50>   DW_AT_type        : <0xfc607>
    <fca54>   DW_AT_data_member_location: 184
 <2><fca55>: Abbrev Number: 1 (DW_TAG_member)
    <fca56>   DW_AT_name        : (indirect string, offset: 0x8e5e5): MouseWheelTicks
    <fca5a>   DW_AT_decl_file   : 7
    <fca5a>   DW_AT_decl_line   : 342
    <fca5c>   DW_AT_decl_column : 19
    <fca5d>   DW_AT_type        : <0xfc634>
    <fca61>   DW_AT_data_member_location: 188
 <2><fca62>: Abbrev Number: 1 (DW_TAG_member)
    <fca63>   DW_AT_name        : (indirect string, offset: 0x8e297): AuxiliaryBufferNumber
    <fca67>   DW_AT_decl_file   : 7
    <fca67>   DW_AT_decl_line   : 344
    <fca69>   DW_AT_decl_column : 22
    <fca6a>   DW_AT_type        : <0xfc634>
    <fca6e>   DW_AT_data_member_location: 192
 <2><fca6f>: Abbrev Number: 1 (DW_TAG_member)
    <fca70>   DW_AT_name        : (indirect string, offset: 0x8e31b): SampleNumber
    <fca74>   DW_AT_decl_file   : 7
    <fca74>   DW_AT_decl_line   : 345
    <fca76>   DW_AT_decl_column : 22
    <fca77>   DW_AT_type        : <0xfc634>
    <fca7b>   DW_AT_data_member_location: 196
 <2><fca7c>: Abbrev Number: 1 (DW_TAG_member)
    <fca7d>   DW_AT_name        : (indirect string, offset: 0x8e1b4): MajorVersion
    <fca81>   DW_AT_decl_file   : 7
    <fca81>   DW_AT_decl_line   : 347
    <fca83>   DW_AT_decl_column : 22
    <fca84>   DW_AT_type        : <0xfc634>
    <fca88>   DW_AT_data_member_location: 200
 <2><fca89>: Abbrev Number: 1 (DW_TAG_member)
    <fca8a>   DW_AT_name        : (indirect string, offset: 0x8e351): MinorVersion
    <fca8e>   DW_AT_decl_file   : 7
    <fca8e>   DW_AT_decl_line   : 348
    <fca90>   DW_AT_decl_column : 22
    <fca91>   DW_AT_type        : <0xfc634>
    <fca95>   DW_AT_data_member_location: 204
 <2><fca96>: Abbrev Number: 1 (DW_TAG_member)
    <fca97>   DW_AT_name        : (indirect string, offset: 0x8ead0): ContextFlags
    <fca9b>   DW_AT_decl_file   : 7
    <fca9b>   DW_AT_decl_line   : 349
    <fca9d>   DW_AT_decl_column : 22
    <fca9e>   DW_AT_type        : <0xfc634>
    <fcaa2>   DW_AT_data_member_location: 208
 <2><fcaa3>: Abbrev Number: 1 (DW_TAG_member)
    <fcaa4>   DW_AT_name        : (indirect string, offset: 0x8ebdb): ContextProfile
    <fcaa8>   DW_AT_decl_file   : 7
    <fcaa8>   DW_AT_decl_line   : 350
    <fcaaa>   DW_AT_decl_column : 22
    <fcaab>   DW_AT_type        : <0xfc634>
    <fcaaf>   DW_AT_data_member_location: 212
 <2><fcab0>: Abbrev Number: 1 (DW_TAG_member)
    <fcab1>   DW_AT_name        : (indirect string, offset: 0x8ed75): ErrorFunc
    <fcab5>   DW_AT_decl_file   : 7
    <fcab5>   DW_AT_decl_line   : 351
    <fcab7>   DW_AT_decl_column : 22
    <fcab8>   DW_AT_type        : <0xfc7b9>
    <fcabc>   DW_AT_data_member_location: 216
 <2><fcabd>: Abbrev Number: 1 (DW_TAG_member)
    <fcabe>   DW_AT_name        : (indirect string, offset: 0x8ec50): WarningFunc
    <fcac2>   DW_AT_decl_file   : 7
    <fcac2>   DW_AT_decl_line   : 352
    <fcac4>   DW_AT_decl_column : 22
    <fcac5>   DW_AT_type        : <0xfc7df>
    <fcac9>   DW_AT_data_member_location: 224
 <2><fcaca>: Abbrev Number: 0
 <1><fcacb>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcacc>   DW_AT_name        : (indirect string, offset: 0x8e707): SFG_WindowHandleType
    <fcad0>   DW_AT_decl_file   : 7
    <fcad0>   DW_AT_decl_line   : 419
    <fcad2>   DW_AT_decl_column : 20
    <fcad3>   DW_AT_type        : <0xfc70a>
 <1><fcad7>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcad8>   DW_AT_name        : (indirect string, offset: 0x8e4a2): SFG_WindowContextType
    <fcadc>   DW_AT_decl_file   : 7
    <fcadc>   DW_AT_decl_line   : 420
    <fcade>   DW_AT_decl_column : 20
    <fcadf>   DW_AT_type        : <0xfc71d>
 <1><fcae3>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcae4>   DW_AT_name        : (indirect string, offset: 0x8e3c7): SFG_Context
    <fcae8>   DW_AT_decl_file   : 7
    <fcae8>   DW_AT_decl_line   : 433
    <fcaea>   DW_AT_decl_column : 31
    <fcaeb>   DW_AT_type        : <0xfcaef>
 <1><fcaef>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fcaf0>   DW_AT_name        : (indirect string, offset: 0x8e3c4): tagSFG_Context
    <fcaf4>   DW_AT_byte_size   : 32
    <fcaf5>   DW_AT_decl_file   : 7
    <fcaf5>   DW_AT_decl_line   : 434
    <fcaf7>   DW_AT_decl_column : 8
    <fcaf7>   DW_AT_sibling     : <0xfcb30>
 <2><fcafb>: Abbrev Number: 1 (DW_TAG_member)
    <fcafc>   DW_AT_name        : (indirect string, offset: 0x77d8e): Handle
    <fcb00>   DW_AT_decl_file   : 7
    <fcb00>   DW_AT_decl_line   : 436
    <fcb02>   DW_AT_decl_column : 27
    <fcb03>   DW_AT_type        : <0xfcacb>
    <fcb07>   DW_AT_data_member_location: 0
 <2><fcb08>: Abbrev Number: 1 (DW_TAG_member)
    <fcb09>   DW_AT_name        : (indirect string, offset: 0x8e250): Context
    <fcb0d>   DW_AT_decl_file   : 7
    <fcb0d>   DW_AT_decl_line   : 437
    <fcb0f>   DW_AT_decl_column : 27
    <fcb10>   DW_AT_type        : <0xfcad7>
    <fcb14>   DW_AT_data_member_location: 8
 <2><fcb15>: Abbrev Number: 1 (DW_TAG_member)
    <fcb16>   DW_AT_name        : (indirect string, offset: 0x84a5c): FBConfig
    <fcb1a>   DW_AT_decl_file   : 7
    <fcb1a>   DW_AT_decl_line   : 440
    <fcb1c>   DW_AT_decl_column : 21
    <fcb1d>   DW_AT_type        : <0xfc749>
    <fcb21>   DW_AT_data_member_location: 16
 <2><fcb22>: Abbrev Number: 1 (DW_TAG_member)
    <fcb23>   DW_AT_name        : (indirect string, offset: 0x8df9d): DoubleBuffered
    <fcb27>   DW_AT_decl_file   : 7
    <fcb27>   DW_AT_decl_line   : 445
    <fcb29>   DW_AT_decl_column : 21
    <fcb2a>   DW_AT_type        : <0xfc634>
    <fcb2e>   DW_AT_data_member_location: 24
 <2><fcb2f>: Abbrev Number: 0
 <1><fcb30>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcb31>   DW_AT_name        : (indirect string, offset: 0x8e214): SFG_WindowState
    <fcb35>   DW_AT_decl_file   : 7
    <fcb35>   DW_AT_decl_line   : 449
    <fcb37>   DW_AT_decl_column : 35
    <fcb38>   DW_AT_type        : <0xfcb3c>
 <1><fcb3c>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fcb3d>   DW_AT_name        : (indirect string, offset: 0x8e211): tagSFG_WindowState
    <fcb41>   DW_AT_byte_size   : 56
    <fcb42>   DW_AT_decl_file   : 7
    <fcb42>   DW_AT_decl_line   : 450
    <fcb44>   DW_AT_decl_column : 8
    <fcb44>   DW_AT_sibling     : <0xfcc0c>
 <2><fcb48>: Abbrev Number: 1 (DW_TAG_member)
    <fcb49>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <fcb4d>   DW_AT_decl_file   : 7
    <fcb4d>   DW_AT_decl_line   : 453
    <fcb4f>   DW_AT_decl_column : 21
    <fcb50>   DW_AT_type        : <0xfc634>
    <fcb54>   DW_AT_data_member_location: 0
 <2><fcb55>: Abbrev Number: 1 (DW_TAG_member)
    <fcb56>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <fcb5a>   DW_AT_decl_file   : 7
    <fcb5a>   DW_AT_decl_line   : 454
    <fcb5c>   DW_AT_decl_column : 21
    <fcb5d>   DW_AT_type        : <0xfc634>
    <fcb61>   DW_AT_data_member_location: 4
 <2><fcb62>: Abbrev Number: 1 (DW_TAG_member)
    <fcb63>   DW_AT_name        : (indirect string, offset: 0x8e481): OldWidth
    <fcb67>   DW_AT_decl_file   : 7
    <fcb67>   DW_AT_decl_line   : 456
    <fcb69>   DW_AT_decl_column : 21
    <fcb6a>   DW_AT_type        : <0xfc634>
    <fcb6e>   DW_AT_data_member_location: 8
 <2><fcb6f>: Abbrev Number: 1 (DW_TAG_member)
    <fcb70>   DW_AT_name        : (indirect string, offset: 0x8e039): OldHeight
    <fcb74>   DW_AT_decl_file   : 7
    <fcb74>   DW_AT_decl_line   : 457
    <fcb76>   DW_AT_decl_column : 21
    <fcb77>   DW_AT_type        : <0xfc634>
    <fcb7b>   DW_AT_data_member_location: 12
 <2><fcb7c>: Abbrev Number: 1 (DW_TAG_member)
    <fcb7d>   DW_AT_name        : (indirect string, offset: 0x6455b): Redisplay
    <fcb81>   DW_AT_decl_file   : 7
    <fcb81>   DW_AT_decl_line   : 463
    <fcb83>   DW_AT_decl_column : 21
    <fcb84>   DW_AT_type        : <0xfc607>
    <fcb88>   DW_AT_data_member_location: 16
 <2><fcb89>: Abbrev Number: 1 (DW_TAG_member)
    <fcb8a>   DW_AT_name        : (indirect string, offset: 0x90185): Visible
    <fcb8e>   DW_AT_decl_file   : 7
    <fcb8e>   DW_AT_decl_line   : 464
    <fcb90>   DW_AT_decl_column : 21
    <fcb91>   DW_AT_type        : <0xfc607>
    <fcb95>   DW_AT_data_member_location: 17
 <2><fcb96>: Abbrev Number: 1 (DW_TAG_member)
    <fcb97>   DW_AT_name        : (indirect string, offset: 0x8e908): Cursor
    <fcb9b>   DW_AT_decl_file   : 7
    <fcb9b>   DW_AT_decl_line   : 466
    <fcb9d>   DW_AT_decl_column : 21
    <fcb9e>   DW_AT_type        : <0xfc634>
    <fcba2>   DW_AT_data_member_location: 20
 <2><fcba3>: Abbrev Number: 1 (DW_TAG_member)
    <fcba4>   DW_AT_name        : (indirect string, offset: 0x8dff1): JoystickPollRate
    <fcba8>   DW_AT_decl_file   : 7
    <fcba8>   DW_AT_decl_line   : 468
    <fcbaa>   DW_AT_decl_column : 21
    <fcbab>   DW_AT_type        : <0xfc679>
    <fcbaf>   DW_AT_data_member_location: 24
 <2><fcbb0>: Abbrev Number: 1 (DW_TAG_member)
    <fcbb1>   DW_AT_name        : (indirect string, offset: 0x8e4d7): JoystickLastPoll
    <fcbb5>   DW_AT_decl_file   : 7
    <fcbb5>   DW_AT_decl_line   : 469
    <fcbb7>   DW_AT_decl_column : 21
    <fcbb8>   DW_AT_type        : <0xfc679>
    <fcbbc>   DW_AT_data_member_location: 32
 <2><fcbbd>: Abbrev Number: 1 (DW_TAG_member)
    <fcbbe>   DW_AT_name        : (indirect string, offset: 0x8e10a): MouseX
    <fcbc2>   DW_AT_decl_file   : 7
    <fcbc2>   DW_AT_decl_line   : 471
    <fcbc4>   DW_AT_decl_column : 21
    <fcbc5>   DW_AT_type        : <0xfc634>
    <fcbc9>   DW_AT_data_member_location: 40
 <2><fcbca>: Abbrev Number: 1 (DW_TAG_member)
    <fcbcb>   DW_AT_name        : (indirect string, offset: 0x8e111): MouseY
    <fcbcf>   DW_AT_decl_file   : 7
    <fcbcf>   DW_AT_decl_line   : 471
    <fcbd1>   DW_AT_decl_column : 29
    <fcbd2>   DW_AT_type        : <0xfc634>
    <fcbd6>   DW_AT_data_member_location: 44
 <2><fcbd7>: Abbrev Number: 1 (DW_TAG_member)
    <fcbd8>   DW_AT_name        : (indirect string, offset: 0x9091f): IgnoreKeyRepeat
    <fcbdc>   DW_AT_decl_file   : 7
    <fcbdc>   DW_AT_decl_line   : 473
    <fcbde>   DW_AT_decl_column : 21
    <fcbdf>   DW_AT_type        : <0xfc607>
    <fcbe3>   DW_AT_data_member_location: 48
 <2><fcbe4>: Abbrev Number: 1 (DW_TAG_member)
    <fcbe5>   DW_AT_name        : (indirect string, offset: 0x8e60b): KeyRepeating
    <fcbe9>   DW_AT_decl_file   : 7
    <fcbe9>   DW_AT_decl_line   : 474
    <fcbeb>   DW_AT_decl_column : 21
    <fcbec>   DW_AT_type        : <0xfc607>
    <fcbf0>   DW_AT_data_member_location: 49
 <2><fcbf1>: Abbrev Number: 1 (DW_TAG_member)
    <fcbf2>   DW_AT_name        : (indirect string, offset: 0x8e6fa): NeedToResize
    <fcbf6>   DW_AT_decl_file   : 7
    <fcbf6>   DW_AT_decl_line   : 476
    <fcbf8>   DW_AT_decl_column : 21
    <fcbf9>   DW_AT_type        : <0xfc607>
    <fcbfd>   DW_AT_data_member_location: 50
 <2><fcbfe>: Abbrev Number: 1 (DW_TAG_member)
    <fcbff>   DW_AT_name        : (indirect string, offset: 0x8e060): IsFullscreen
    <fcc03>   DW_AT_decl_file   : 7
    <fcc03>   DW_AT_decl_line   : 478
    <fcc05>   DW_AT_decl_column : 21
    <fcc06>   DW_AT_type        : <0xfc607>
    <fcc0a>   DW_AT_data_member_location: 51
 <2><fcc0b>: Abbrev Number: 0
 <1><fcc0c>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcc0d>   DW_AT_name        : (indirect string, offset: 0x8e3de): SFG_Proc
    <fcc11>   DW_AT_decl_file   : 7
    <fcc11>   DW_AT_decl_line   : 487
    <fcc13>   DW_AT_decl_column : 16
    <fcc14>   DW_AT_type        : <0xfc6bd>
 <1><fcc18>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <fcc19>   DW_AT_encoding    : 7	(void)
    <fcc19>   DW_AT_byte_size   : 4
    <fcc19>   DW_AT_type        : <0xfc600>
    <fcc1d>   DW_AT_decl_file   : 7
    <fcc1d>   DW_AT_decl_line   : 587
    <fcc1f>   DW_AT_decl_column : 1
    <fcc1f>   DW_AT_sibling     : <0xfccd2>
 <2><fcc23>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc24>   DW_AT_name        : (indirect string, offset: 0x8dfac): CB_Display
    <fcc28>   DW_AT_const_value : 0
 <2><fcc29>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc2a>   DW_AT_name        : (indirect string, offset: 0x8e3b9): CB_Reshape
    <fcc2e>   DW_AT_const_value : 1
 <2><fcc2f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc30>   DW_AT_name        : (indirect string, offset: 0x8e1c1): CB_Keyboard
    <fcc34>   DW_AT_const_value : 2
 <2><fcc35>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc36>   DW_AT_name        : (indirect string, offset: 0x8e2fd): CB_KeyboardUp
    <fcc3a>   DW_AT_const_value : 3
 <2><fcc3b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc3c>   DW_AT_name        : (indirect string, offset: 0x8e523): CB_Special
    <fcc40>   DW_AT_const_value : 4
 <2><fcc41>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc42>   DW_AT_name        : (indirect string, offset: 0x8e0bb): CB_SpecialUp
    <fcc46>   DW_AT_const_value : 5
 <2><fcc47>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc48>   DW_AT_name        : (indirect string, offset: 0x8dfc4): CB_Mouse
    <fcc4c>   DW_AT_const_value : 6
 <2><fcc4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc4e>   DW_AT_name        : (indirect string, offset: 0x8e37f): CB_MouseWheel
    <fcc52>   DW_AT_const_value : 7
 <2><fcc53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc54>   DW_AT_name        : (indirect string, offset: 0x8e624): CB_Motion
    <fcc58>   DW_AT_const_value : 8
 <2><fcc59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc5a>   DW_AT_name        : (indirect string, offset: 0x8e3d3): CB_Passive
    <fcc5e>   DW_AT_const_value : 9
 <2><fcc5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc60>   DW_AT_name        : (indirect string, offset: 0x8e0ec): CB_Entry
    <fcc64>   DW_AT_const_value : 10
 <2><fcc65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc66>   DW_AT_name        : (indirect string, offset: 0x8df63): CB_Visibility
    <fcc6a>   DW_AT_const_value : 11
 <2><fcc6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc6c>   DW_AT_name        : (indirect string, offset: 0x8e66d): CB_WindowStatus
    <fcc70>   DW_AT_const_value : 12
 <2><fcc71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc72>   DW_AT_name        : (indirect string, offset: 0x8e18c): CB_Joystick
    <fcc76>   DW_AT_const_value : 13
 <2><fcc77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc78>   DW_AT_name        : (indirect string, offset: 0x8e731): CB_Destroy
    <fcc7c>   DW_AT_const_value : 14
 <2><fcc7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc7e>   DW_AT_name        : (indirect string, offset: 0x8e0d7): CB_MultiEntry
    <fcc82>   DW_AT_const_value : 15
 <2><fcc83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc84>   DW_AT_name        : (indirect string, offset: 0x8e0ac): CB_MultiButton
    <fcc88>   DW_AT_const_value : 16
 <2><fcc89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc8a>   DW_AT_name        : (indirect string, offset: 0x8e744): CB_MultiMotion
    <fcc8e>   DW_AT_const_value : 17
 <2><fcc8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc90>   DW_AT_name        : (indirect string, offset: 0x8e272): CB_MultiPassive
    <fcc94>   DW_AT_const_value : 18
 <2><fcc95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc96>   DW_AT_name        : (indirect string, offset: 0x8e41a): CB_Select
    <fcc9a>   DW_AT_const_value : 19
 <2><fcc9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcc9c>   DW_AT_name        : (indirect string, offset: 0x8e59b): CB_OverlayDisplay
    <fcca0>   DW_AT_const_value : 20
 <2><fcca1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcca2>   DW_AT_name        : (indirect string, offset: 0x8dfcd): CB_SpaceMotion
    <fcca6>   DW_AT_const_value : 21
 <2><fcca7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcca8>   DW_AT_name        : (indirect string, offset: 0x8df8c): CB_SpaceRotation
    <fccac>   DW_AT_const_value : 22
 <2><fccad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fccae>   DW_AT_name        : (indirect string, offset: 0x8e16a): CB_SpaceButton
    <fccb2>   DW_AT_const_value : 23
 <2><fccb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fccb4>   DW_AT_name        : (indirect string, offset: 0x8e602): CB_Dials
    <fccb8>   DW_AT_const_value : 24
 <2><fccb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fccba>   DW_AT_name        : (indirect string, offset: 0x8e020): CB_ButtonBox
    <fccbe>   DW_AT_const_value : 25
 <2><fccbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fccc0>   DW_AT_name        : (indirect string, offset: 0x8e30b): CB_TabletMotion
    <fccc4>   DW_AT_const_value : 26
 <2><fccc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fccc6>   DW_AT_name        : (indirect string, offset: 0x8df53): CB_TabletButton
    <fccca>   DW_AT_const_value : 27
 <2><fcccb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <fcccc>   DW_AT_name        : (indirect string, offset: 0x8e424): TOTAL_CALLBACKS
    <fccd0>   DW_AT_const_value : 28
 <2><fccd1>: Abbrev Number: 0
 <1><fccd2>: Abbrev Number: 4 (DW_TAG_typedef)
    <fccd3>   DW_AT_name        : (indirect string, offset: 0x8e56b): SFG_MenuContext
    <fccd7>   DW_AT_decl_file   : 7
    <fccd7>   DW_AT_decl_line   : 627
    <fccd9>   DW_AT_decl_column : 35
    <fccda>   DW_AT_type        : <0xfccde>
 <1><fccde>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fccdf>   DW_AT_name        : (indirect string, offset: 0x8e568): tagSFG_MenuContext
    <fcce3>   DW_AT_byte_size   : 8
    <fcce4>   DW_AT_decl_file   : 7
    <fcce4>   DW_AT_decl_line   : 628
    <fcce6>   DW_AT_decl_column : 8
    <fcce6>   DW_AT_sibling     : <0xfccf8>
 <2><fccea>: Abbrev Number: 1 (DW_TAG_member)
    <fcceb>   DW_AT_name        : (indirect string, offset: 0x8e24f): MContext
    <fccef>   DW_AT_decl_file   : 7
    <fccef>   DW_AT_decl_line   : 630
    <fccf1>   DW_AT_decl_column : 27
    <fccf2>   DW_AT_type        : <0xfcad7>
    <fccf6>   DW_AT_data_member_location: 0
 <2><fccf7>: Abbrev Number: 0
 <1><fccf8>: Abbrev Number: 4 (DW_TAG_typedef)
    <fccf9>   DW_AT_name        : (indirect string, offset: 0x8e5b0): SFG_Window
    <fccfd>   DW_AT_decl_file   : 7
    <fccfd>   DW_AT_decl_line   : 634
    <fccff>   DW_AT_decl_column : 30
    <fcd00>   DW_AT_type        : <0xfcd04>
 <1><fcd04>: Abbrev Number: 39 (DW_TAG_structure_type)
    <fcd05>   DW_AT_name        : (indirect string, offset: 0x8e5ad): tagSFG_Window
    <fcd09>   DW_AT_byte_size   : 408
    <fcd0b>   DW_AT_decl_file   : 7
    <fcd0c>   DW_AT_decl_line   : 673
    <fcd0e>   DW_AT_decl_column : 8
    <fcd0f>   DW_AT_sibling     : <0xfcda8>
 <2><fcd13>: Abbrev Number: 1 (DW_TAG_member)
    <fcd14>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <fcd18>   DW_AT_decl_file   : 7
    <fcd18>   DW_AT_decl_line   : 675
    <fcd1a>   DW_AT_decl_column : 25
    <fcd1b>   DW_AT_type        : <0xfc81e>
    <fcd1f>   DW_AT_data_member_location: 0
 <2><fcd20>: Abbrev Number: 11 (DW_TAG_member)
    <fcd21>   DW_AT_name        : ID
    <fcd24>   DW_AT_decl_file   : 7
    <fcd24>   DW_AT_decl_line   : 676
    <fcd26>   DW_AT_decl_column : 25
    <fcd27>   DW_AT_type        : <0xfc634>
    <fcd2b>   DW_AT_data_member_location: 16
 <2><fcd2c>: Abbrev Number: 1 (DW_TAG_member)
    <fcd2d>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <fcd31>   DW_AT_decl_file   : 7
    <fcd31>   DW_AT_decl_line   : 678
    <fcd33>   DW_AT_decl_column : 25
    <fcd34>   DW_AT_type        : <0xfcae3>
    <fcd38>   DW_AT_data_member_location: 24
 <2><fcd39>: Abbrev Number: 1 (DW_TAG_member)
    <fcd3a>   DW_AT_name        : (indirect string, offset: 0x8e558): State
    <fcd3e>   DW_AT_decl_file   : 7
    <fcd3e>   DW_AT_decl_line   : 679
    <fcd40>   DW_AT_decl_column : 25
    <fcd41>   DW_AT_type        : <0xfcb30>
    <fcd45>   DW_AT_data_member_location: 56
 <2><fcd46>: Abbrev Number: 1 (DW_TAG_member)
    <fcd47>   DW_AT_name        : (indirect string, offset: 0x900ce): CallBacks
    <fcd4b>   DW_AT_decl_file   : 7
    <fcd4b>   DW_AT_decl_line   : 680
    <fcd4d>   DW_AT_decl_column : 25
    <fcd4e>   DW_AT_type        : <0xfcef4>
    <fcd52>   DW_AT_data_member_location: 112
 <2><fcd53>: Abbrev Number: 12 (DW_TAG_member)
    <fcd54>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <fcd58>   DW_AT_decl_file   : 7
    <fcd58>   DW_AT_decl_line   : 681
    <fcd5a>   DW_AT_decl_column : 25
    <fcd5b>   DW_AT_type        : <0xfc680>
    <fcd5f>   DW_AT_data_member_location: 336
 <2><fcd61>: Abbrev Number: 12 (DW_TAG_member)
    <fcd62>   DW_AT_name        : (indirect string, offset: 0x8df1d): Menu
    <fcd66>   DW_AT_decl_file   : 7
    <fcd66>   DW_AT_decl_line   : 683
    <fcd68>   DW_AT_decl_column : 21
    <fcd69>   DW_AT_type        : <0xfcf04>
    <fcd6d>   DW_AT_data_member_location: 344
 <2><fcd6f>: Abbrev Number: 12 (DW_TAG_member)
    <fcd70>   DW_AT_name        : (indirect string, offset: 0x8f46f): ActiveMenu
    <fcd74>   DW_AT_decl_file   : 7
    <fcd74>   DW_AT_decl_line   : 684
    <fcd76>   DW_AT_decl_column : 21
    <fcd77>   DW_AT_type        : <0xfceef>
    <fcd7b>   DW_AT_data_member_location: 368
 <2><fcd7d>: Abbrev Number: 12 (DW_TAG_member)
    <fcd7e>   DW_AT_name        : (indirect string, offset: 0x8e0e5): Parent
    <fcd82>   DW_AT_decl_file   : 7
    <fcd82>   DW_AT_decl_line   : 686
    <fcd84>   DW_AT_decl_column : 25
    <fcd85>   DW_AT_type        : <0xfceea>
    <fcd89>   DW_AT_data_member_location: 376
 <2><fcd8b>: Abbrev Number: 12 (DW_TAG_member)
    <fcd8c>   DW_AT_name        : (indirect string, offset: 0x8dfdc): Children
    <fcd90>   DW_AT_decl_file   : 7
    <fcd90>   DW_AT_decl_line   : 687
    <fcd92>   DW_AT_decl_column : 25
    <fcd93>   DW_AT_type        : <0xfc7eb>
    <fcd97>   DW_AT_data_member_location: 384
 <2><fcd99>: Abbrev Number: 12 (DW_TAG_member)
    <fcd9a>   DW_AT_name        : (indirect string, offset: 0x8e06d): IsMenu
    <fcd9e>   DW_AT_decl_file   : 7
    <fcd9e>   DW_AT_decl_line   : 689
    <fcda0>   DW_AT_decl_column : 25
    <fcda1>   DW_AT_type        : <0xfc607>
    <fcda5>   DW_AT_data_member_location: 400
 <2><fcda7>: Abbrev Number: 0
 <1><fcda8>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcda9>   DW_AT_name        : (indirect string, offset: 0x8e762): SFG_MenuEntry
    <fcdad>   DW_AT_decl_file   : 7
    <fcdad>   DW_AT_decl_line   : 635
    <fcdaf>   DW_AT_decl_column : 33
    <fcdb0>   DW_AT_type        : <0xfcdb4>
 <1><fcdb4>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fcdb5>   DW_AT_name        : (indirect string, offset: 0x8e75f): tagSFG_MenuEntry
    <fcdb9>   DW_AT_byte_size   : 48
    <fcdba>   DW_AT_decl_file   : 7
    <fcdba>   DW_AT_decl_line   : 656
    <fcdbc>   DW_AT_decl_column : 8
    <fcdbc>   DW_AT_sibling     : <0xfce1b>
 <2><fcdc0>: Abbrev Number: 1 (DW_TAG_member)
    <fcdc1>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <fcdc5>   DW_AT_decl_file   : 7
    <fcdc5>   DW_AT_decl_line   : 658
    <fcdc7>   DW_AT_decl_column : 25
    <fcdc8>   DW_AT_type        : <0xfc81e>
    <fcdcc>   DW_AT_data_member_location: 0
 <2><fcdcd>: Abbrev Number: 11 (DW_TAG_member)
    <fcdce>   DW_AT_name        : ID
    <fcdd1>   DW_AT_decl_file   : 7
    <fcdd1>   DW_AT_decl_line   : 659
    <fcdd3>   DW_AT_decl_column : 25
    <fcdd4>   DW_AT_type        : <0xfc634>
    <fcdd8>   DW_AT_data_member_location: 16
 <2><fcdd9>: Abbrev Number: 1 (DW_TAG_member)
    <fcdda>   DW_AT_name        : (indirect string, offset: 0x8e00a): Ordinal
    <fcdde>   DW_AT_decl_file   : 7
    <fcdde>   DW_AT_decl_line   : 660
    <fcde0>   DW_AT_decl_column : 25
    <fcde1>   DW_AT_type        : <0xfc634>
    <fcde5>   DW_AT_data_member_location: 20
 <2><fcde6>: Abbrev Number: 1 (DW_TAG_member)
    <fcde7>   DW_AT_name        : (indirect string, offset: 0x8fc1b): Text
    <fcdeb>   DW_AT_decl_file   : 7
    <fcdeb>   DW_AT_decl_line   : 661
    <fcded>   DW_AT_decl_column : 25
    <fcdee>   DW_AT_type        : <0xfc682>
    <fcdf2>   DW_AT_data_member_location: 24
 <2><fcdf3>: Abbrev Number: 1 (DW_TAG_member)
    <fcdf4>   DW_AT_name        : (indirect string, offset: 0x8f9db): SubMenu
    <fcdf8>   DW_AT_decl_file   : 7
    <fcdf8>   DW_AT_decl_line   : 662
    <fcdfa>   DW_AT_decl_column : 25
    <fcdfb>   DW_AT_type        : <0xfceef>
    <fcdff>   DW_AT_data_member_location: 32
 <2><fce00>: Abbrev Number: 1 (DW_TAG_member)
    <fce01>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <fce05>   DW_AT_decl_file   : 7
    <fce05>   DW_AT_decl_line   : 663
    <fce07>   DW_AT_decl_column : 25
    <fce08>   DW_AT_type        : <0xfc607>
    <fce0c>   DW_AT_data_member_location: 40
 <2><fce0d>: Abbrev Number: 1 (DW_TAG_member)
    <fce0e>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <fce12>   DW_AT_decl_file   : 7
    <fce12>   DW_AT_decl_line   : 664
    <fce14>   DW_AT_decl_column : 25
    <fce15>   DW_AT_type        : <0xfc634>
    <fce19>   DW_AT_data_member_location: 44
 <2><fce1a>: Abbrev Number: 0
 <1><fce1b>: Abbrev Number: 4 (DW_TAG_typedef)
    <fce1c>   DW_AT_name        : (indirect string, offset: 0x8e3a4): SFG_Menu
    <fce20>   DW_AT_decl_file   : 7
    <fce20>   DW_AT_decl_line   : 636
    <fce22>   DW_AT_decl_column : 28
    <fce23>   DW_AT_type        : <0xfce27>
 <1><fce27>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fce28>   DW_AT_name        : (indirect string, offset: 0x8e3a1): tagSFG_Menu
    <fce2c>   DW_AT_byte_size   : 112
    <fce2d>   DW_AT_decl_file   : 7
    <fce2d>   DW_AT_decl_line   : 637
    <fce2f>   DW_AT_decl_column : 8
    <fce2f>   DW_AT_sibling     : <0xfcee5>
 <2><fce33>: Abbrev Number: 1 (DW_TAG_member)
    <fce34>   DW_AT_name        : (indirect string, offset: 0x8e75a): Node
    <fce38>   DW_AT_decl_file   : 7
    <fce38>   DW_AT_decl_line   : 639
    <fce3a>   DW_AT_decl_column : 25
    <fce3b>   DW_AT_type        : <0xfc81e>
    <fce3f>   DW_AT_data_member_location: 0
 <2><fce40>: Abbrev Number: 1 (DW_TAG_member)
    <fce41>   DW_AT_name        : (indirect string, offset: 0x8e58d): UserData
    <fce45>   DW_AT_decl_file   : 7
    <fce45>   DW_AT_decl_line   : 640
    <fce47>   DW_AT_decl_column : 25
    <fce48>   DW_AT_type        : <0xfc680>
    <fce4c>   DW_AT_data_member_location: 16
 <2><fce4d>: Abbrev Number: 11 (DW_TAG_member)
    <fce4e>   DW_AT_name        : ID
    <fce51>   DW_AT_decl_file   : 7
    <fce51>   DW_AT_decl_line   : 641
    <fce53>   DW_AT_decl_column : 25
    <fce54>   DW_AT_type        : <0xfc634>
    <fce58>   DW_AT_data_member_location: 24
 <2><fce59>: Abbrev Number: 1 (DW_TAG_member)
    <fce5a>   DW_AT_name        : (indirect string, offset: 0x8e247): Entries
    <fce5e>   DW_AT_decl_file   : 7
    <fce5e>   DW_AT_decl_line   : 642
    <fce60>   DW_AT_decl_column : 25
    <fce61>   DW_AT_type        : <0xfc7eb>
    <fce65>   DW_AT_data_member_location: 32
 <2><fce66>: Abbrev Number: 1 (DW_TAG_member)
    <fce67>   DW_AT_name        : (indirect string, offset: 0x86371): Callback
    <fce6b>   DW_AT_decl_file   : 7
    <fce6b>   DW_AT_decl_line   : 643
    <fce6d>   DW_AT_decl_column : 25
    <fce6e>   DW_AT_type        : <0xfc7ad>
    <fce72>   DW_AT_data_member_location: 48
 <2><fce73>: Abbrev Number: 1 (DW_TAG_member)
    <fce74>   DW_AT_name        : (indirect string, offset: 0x8e2ba): Destroy
    <fce78>   DW_AT_decl_file   : 7
    <fce78>   DW_AT_decl_line   : 644
    <fce7a>   DW_AT_decl_column : 25
    <fce7b>   DW_AT_type        : <0xfc77d>
    <fce7f>   DW_AT_data_member_location: 56
 <2><fce80>: Abbrev Number: 1 (DW_TAG_member)
    <fce81>   DW_AT_name        : (indirect string, offset: 0x8e043): IsActive
    <fce85>   DW_AT_decl_file   : 7
    <fce85>   DW_AT_decl_line   : 645
    <fce87>   DW_AT_decl_column : 25
    <fce88>   DW_AT_type        : <0xfc607>
    <fce8c>   DW_AT_data_member_location: 64
 <2><fce8d>: Abbrev Number: 1 (DW_TAG_member)
    <fce8e>   DW_AT_name        : (indirect string, offset: 0x8ebf0): Width
    <fce92>   DW_AT_decl_file   : 7
    <fce92>   DW_AT_decl_line   : 646
    <fce94>   DW_AT_decl_column : 25
    <fce95>   DW_AT_type        : <0xfc634>
    <fce99>   DW_AT_data_member_location: 68
 <2><fce9a>: Abbrev Number: 1 (DW_TAG_member)
    <fce9b>   DW_AT_name        : (indirect string, offset: 0x8eece): Height
    <fce9f>   DW_AT_decl_file   : 7
    <fce9f>   DW_AT_decl_line   : 647
    <fcea1>   DW_AT_decl_column : 25
    <fcea2>   DW_AT_type        : <0xfc634>
    <fcea6>   DW_AT_data_member_location: 72
 <2><fcea7>: Abbrev Number: 11 (DW_TAG_member)
    <fcea8>   DW_AT_name        : X
    <fceaa>   DW_AT_decl_file   : 7
    <fceaa>   DW_AT_decl_line   : 648
    <fceac>   DW_AT_decl_column : 25
    <fcead>   DW_AT_type        : <0xfc634>
    <fceb1>   DW_AT_data_member_location: 76
 <2><fceb2>: Abbrev Number: 11 (DW_TAG_member)
    <fceb3>   DW_AT_name        : Y
    <fceb5>   DW_AT_decl_file   : 7
    <fceb5>   DW_AT_decl_line   : 648
    <fceb7>   DW_AT_decl_column : 28
    <fceb8>   DW_AT_type        : <0xfc634>
    <fcebc>   DW_AT_data_member_location: 80
 <2><fcebd>: Abbrev Number: 1 (DW_TAG_member)
    <fcebe>   DW_AT_name        : (indirect string, offset: 0x8e71c): ActiveEntry
    <fcec2>   DW_AT_decl_file   : 7
    <fcec2>   DW_AT_decl_line   : 650
    <fcec4>   DW_AT_decl_column : 25
    <fcec5>   DW_AT_type        : <0xfcee5>
    <fcec9>   DW_AT_data_member_location: 88
 <2><fceca>: Abbrev Number: 1 (DW_TAG_member)
    <fcecb>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <fcecf>   DW_AT_decl_file   : 7
    <fcecf>   DW_AT_decl_line   : 651
    <fced1>   DW_AT_decl_column : 25
    <fced2>   DW_AT_type        : <0xfceea>
    <fced6>   DW_AT_data_member_location: 96
 <2><fced7>: Abbrev Number: 1 (DW_TAG_member)
    <fced8>   DW_AT_name        : (indirect string, offset: 0x8fae6): ParentWindow
    <fcedc>   DW_AT_decl_file   : 7
    <fcedc>   DW_AT_decl_line   : 652
    <fcede>   DW_AT_decl_column : 25
    <fcedf>   DW_AT_type        : <0xfceea>
    <fcee3>   DW_AT_data_member_location: 104
 <2><fcee4>: Abbrev Number: 0
 <1><fcee5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fcee6>   DW_AT_byte_size   : 8
    <fcee6>   DW_AT_type        : <0xfcda8>
 <1><fceea>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fceeb>   DW_AT_byte_size   : 8
    <fceeb>   DW_AT_type        : <0xfccf8>
 <1><fceef>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fcef0>   DW_AT_byte_size   : 8
    <fcef0>   DW_AT_type        : <0xfce1b>
 <1><fcef4>: Abbrev Number: 25 (DW_TAG_array_type)
    <fcef5>   DW_AT_type        : <0xfcc0c>
    <fcef9>   DW_AT_sibling     : <0xfcf04>
 <2><fcefd>: Abbrev Number: 26 (DW_TAG_subrange_type)
    <fcefe>   DW_AT_type        : <0xfc672>
    <fcf02>   DW_AT_upper_bound : 27
 <2><fcf03>: Abbrev Number: 0
 <1><fcf04>: Abbrev Number: 25 (DW_TAG_array_type)
    <fcf05>   DW_AT_type        : <0xfceef>
    <fcf09>   DW_AT_sibling     : <0xfcf14>
 <2><fcf0d>: Abbrev Number: 26 (DW_TAG_subrange_type)
    <fcf0e>   DW_AT_type        : <0xfc672>
    <fcf12>   DW_AT_upper_bound : 2
 <2><fcf13>: Abbrev Number: 0
 <1><fcf14>: Abbrev Number: 4 (DW_TAG_typedef)
    <fcf15>   DW_AT_name        : (indirect string, offset: 0x8e11b): SFG_Structure
    <fcf19>   DW_AT_decl_file   : 7
    <fcf19>   DW_AT_decl_line   : 702
    <fcf1b>   DW_AT_decl_column : 33
    <fcf1c>   DW_AT_type        : <0xfcf20>
 <1><fcf20>: Abbrev Number: 9 (DW_TAG_structure_type)
    <fcf21>   DW_AT_name        : (indirect string, offset: 0x8e118): tagSFG_Structure
    <fcf25>   DW_AT_byte_size   : 88
    <fcf26>   DW_AT_decl_file   : 7
    <fcf26>   DW_AT_decl_line   : 703
    <fcf28>   DW_AT_decl_column : 8
    <fcf28>   DW_AT_sibling     : <0xfcfa2>
 <2><fcf2c>: Abbrev Number: 1 (DW_TAG_member)
    <fcf2d>   DW_AT_name        : (indirect string, offset: 0x8f090): Windows
    <fcf31>   DW_AT_decl_file   : 7
    <fcf31>   DW_AT_decl_line   : 705
    <fcf33>   DW_AT_decl_column : 21
    <fcf34>   DW_AT_type        : <0xfc7eb>
    <fcf38>   DW_AT_data_member_location: 0
 <2><fcf39>: Abbrev Number: 1 (DW_TAG_member)
    <fcf3a>   DW_AT_name        : (indirect string, offset: 0x8e25e): Menus
    <fcf3e>   DW_AT_decl_file   : 7
    <fcf3e>   DW_AT_decl_line   : 706
    <fcf40>   DW_AT_decl_column : 21
    <fcf41>   DW_AT_type        : <0xfc7eb>
    <fcf45>   DW_AT_data_member_location: 16
 <2><fcf46>: Abbrev Number: 1 (DW_TAG_member)
    <fcf47>   DW_AT_name        : (indirect string, offset: 0x8e65c): WindowsToDestroy
    <fcf4b>   DW_AT_decl_file   : 7
    <fcf4b>   DW_AT_decl_line   : 707
    <fcf4d>   DW_AT_decl_column : 21
    <fcf4e>   DW_AT_type        : <0xfc7eb>
    <fcf52>   DW_AT_data_member_location: 32
 <2><fcf53>: Abbrev Number: 1 (DW_TAG_member)
    <fcf54>   DW_AT_name        : (indirect string, offset: 0x8e343): CurrentWindow
    <fcf58>   DW_AT_decl_file   : 7
    <fcf58>   DW_AT_decl_line   : 709
    <fcf5a>   DW_AT_decl_column : 21
    <fcf5b>   DW_AT_type        : <0xfceea>
    <fcf5f>   DW_AT_data_member_location: 48
 <2><fcf60>: Abbrev Number: 1 (DW_TAG_member)
    <fcf61>   DW_AT_name        : (indirect string, offset: 0x8e07f): CurrentMenu
    <fcf65>   DW_AT_decl_file   : 7
    <fcf65>   DW_AT_decl_line   : 710
    <fcf67>   DW_AT_decl_column : 21
    <fcf68>   DW_AT_type        : <0xfceef>
    <fcf6c>   DW_AT_data_member_location: 56
 <2><fcf6d>: Abbrev Number: 1 (DW_TAG_member)
    <fcf6e>   DW_AT_name        : (indirect string, offset: 0x8e56f): MenuContext
    <fcf72>   DW_AT_decl_file   : 7
    <fcf72>   DW_AT_decl_line   : 712
    <fcf74>   DW_AT_decl_column : 22
    <fcf75>   DW_AT_type        : <0xfcfa2>
    <fcf79>   DW_AT_data_member_location: 64
 <2><fcf7a>: Abbrev Number: 1 (DW_TAG_member)
    <fcf7b>   DW_AT_name        : (indirect string, offset: 0x8e5bb): GameModeWindow
    <fcf7f>   DW_AT_decl_file   : 7
    <fcf7f>   DW_AT_decl_line   : 714
    <fcf81>   DW_AT_decl_column : 22
    <fcf82>   DW_AT_type        : <0xfceea>
    <fcf86>   DW_AT_data_member_location: 72
 <2><fcf87>: Abbrev Number: 1 (DW_TAG_member)
    <fcf88>   DW_AT_name        : (indirect string, offset: 0x8e2ad): WindowID
    <fcf8c>   DW_AT_decl_file   : 7
    <fcf8c>   DW_AT_decl_line   : 716
    <fcf8e>   DW_AT_decl_column : 22
    <fcf8f>   DW_AT_type        : <0xfc634>
    <fcf93>   DW_AT_data_member_location: 80
 <2><fcf94>: Abbrev Number: 1 (DW_TAG_member)
    <fcf95>   DW_AT_name        : (indirect string, offset: 0x8f878): MenuID
    <fcf99>   DW_AT_decl_file   : 7
    <fcf99>   DW_AT_decl_line   : 717
    <fcf9b>   DW_AT_decl_column : 22
    <fcf9c>   DW_AT_type        : <0xfc634>
    <fcfa0>   DW_AT_data_member_location: 84
 <2><fcfa1>: Abbrev Number: 0
 <1><fcfa2>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <fcfa3>   DW_AT_byte_size   : 8
    <fcfa3>   DW_AT_type        : <0xfccd2>
 <1><fcfa7>: Abbrev Number: 27 (DW_TAG_variable)
    <fcfa8>   DW_AT_name        : (indirect string, offset: 0x8e3ad): fgStructure
    <fcfac>   DW_AT_decl_file   : 7
    <fcfac>   DW_AT_decl_line   : 784
    <fcfae>   DW_AT_decl_column : 22
    <fcfaf>   DW_AT_type        : <0xfcf14>
    <fcfb3>   DW_AT_external    : 1
    <fcfb3>   DW_AT_declaration : 1
 <1><fcfb3>: Abbrev Number: 27 (DW_TAG_variable)
    <fcfb4>   DW_AT_name        : (indirect string, offset: 0x8e73c): fgState
    <fcfb8>   DW_AT_decl_file   : 7
    <fcfb8>   DW_AT_decl_line   : 787
    <fcfba>   DW_AT_decl_column : 18
    <fcfbb>   DW_AT_type        : <0xfc8b7>
    <fcfbf>   DW_AT_external    : 1
    <fcfbf>   DW_AT_declaration : 1
 <1><fcfbf>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fcfc0>   DW_AT_external    : 1
    <fcfc0>   DW_AT_name        : (indirect string, offset: 0x8f35f): fgJoystickPollWindow
    <fcfc4>   DW_AT_decl_file   : 7
    <fcfc4>   DW_AT_decl_line   : 896
    <fcfc6>   DW_AT_decl_column : 13
    <fcfc7>   DW_AT_prototyped  : 1
    <fcfc7>   DW_AT_declaration : 1
    <fcfc7>   DW_AT_sibling     : <0xfcfd1>
 <2><fcfcb>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fcfcc>   DW_AT_type        : <0xfceea>
 <2><fcfd0>: Abbrev Number: 0
 <1><fcfd1>: Abbrev Number: 40 (DW_TAG_subprogram)
    <fcfd2>   DW_AT_external    : 1
    <fcfd2>   DW_AT_name        : (indirect string, offset: 0x63d12): glGetError
    <fcfd6>   DW_AT_decl_file   : 2
    <fcfd7>   DW_AT_decl_line   : 824
    <fcfd9>   DW_AT_decl_column : 25
    <fcfda>   DW_AT_prototyped  : 1
    <fcfda>   DW_AT_type        : <0xfc5f4>
    <fcfde>   DW_AT_declaration : 1
 <1><fcfde>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fcfdf>   DW_AT_external    : 1
    <fcfdf>   DW_AT_name        : (indirect string, offset: 0x8ee0b): fgWarning
    <fcfe3>   DW_AT_decl_file   : 7
    <fcfe3>   DW_AT_decl_line   : 999
    <fcfe5>   DW_AT_decl_column : 6
    <fcfe6>   DW_AT_prototyped  : 1
    <fcfe6>   DW_AT_declaration : 1
    <fcfe6>   DW_AT_sibling     : <0xfcff1>
 <2><fcfea>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fcfeb>   DW_AT_type        : <0xfc74e>
 <2><fcfef>: Abbrev Number: 18 (DW_TAG_unspecified_parameters)
 <2><fcff0>: Abbrev Number: 0
 <1><fcff1>: Abbrev Number: 21 (DW_TAG_subprogram)
    <fcff2>   DW_AT_external    : 1
    <fcff2>   DW_AT_name        : (indirect string, offset: 0x9c3a5): strstr
    <fcff6>   DW_AT_decl_file   : 8
    <fcff7>   DW_AT_decl_line   : 334
    <fcff9>   DW_AT_decl_column : 14
    <fcffa>   DW_AT_prototyped  : 1
    <fcffa>   DW_AT_type        : <0xfc682>
    <fcffe>   DW_AT_declaration : 1
    <fcffe>   DW_AT_sibling     : <0xfd00d>
 <2><fd002>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd003>   DW_AT_type        : <0xfc74e>
 <2><fd007>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd008>   DW_AT_type        : <0xfc74e>
 <2><fd00c>: Abbrev Number: 0
 <1><fd00d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <fd00e>   DW_AT_external    : 1
    <fd00e>   DW_AT_name        : (indirect string, offset: 0x70f2e): glGetString
    <fd012>   DW_AT_decl_file   : 2
    <fd013>   DW_AT_decl_line   : 826
    <fd015>   DW_AT_decl_column : 34
    <fd016>   DW_AT_prototyped  : 1
    <fd016>   DW_AT_type        : <0xfc693>
    <fd01a>   DW_AT_declaration : 1
    <fd01a>   DW_AT_sibling     : <0xfd024>
 <2><fd01e>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd01f>   DW_AT_type        : <0xfc5f4>
 <2><fd023>: Abbrev Number: 0
 <1><fd024>: Abbrev Number: 41 (DW_TAG_subprogram)
    <fd025>   DW_AT_external    : 1
    <fd025>   DW_AT_name        : (indirect string, offset: 0x9c3bb): strchr
    <fd029>   DW_AT_decl_file   : 8
    <fd02a>   DW_AT_decl_line   : 230
    <fd02b>   DW_AT_decl_column : 14
    <fd02c>   DW_AT_prototyped  : 1
    <fd02c>   DW_AT_type        : <0xfc682>
    <fd030>   DW_AT_declaration : 1
    <fd030>   DW_AT_sibling     : <0xfd03f>
 <2><fd034>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd035>   DW_AT_type        : <0xfc74e>
 <2><fd039>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd03a>   DW_AT_type        : <0xfc634>
 <2><fd03e>: Abbrev Number: 0
 <1><fd03f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fd040>   DW_AT_external    : 1
    <fd040>   DW_AT_name        : (indirect string, offset: 0x8e9c9): fgError
    <fd044>   DW_AT_decl_file   : 7
    <fd044>   DW_AT_decl_line   : 998
    <fd046>   DW_AT_decl_column : 6
    <fd047>   DW_AT_prototyped  : 1
    <fd047>   DW_AT_declaration : 1
    <fd047>   DW_AT_sibling     : <0xfd052>
 <2><fd04b>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd04c>   DW_AT_type        : <0xfc74e>
 <2><fd050>: Abbrev Number: 18 (DW_TAG_unspecified_parameters)
 <2><fd051>: Abbrev Number: 0
 <1><fd052>: Abbrev Number: 21 (DW_TAG_subprogram)
    <fd053>   DW_AT_external    : 1
    <fd053>   DW_AT_name        : (indirect string, offset: 0x6e0fe): strlen
    <fd057>   DW_AT_decl_file   : 8
    <fd058>   DW_AT_decl_line   : 391
    <fd05a>   DW_AT_decl_column : 15
    <fd05b>   DW_AT_prototyped  : 1
    <fd05b>   DW_AT_type        : <0xfc69e>
    <fd05f>   DW_AT_declaration : 1
    <fd05f>   DW_AT_sibling     : <0xfd069>
 <2><fd063>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <fd064>   DW_AT_type        : <0xfc74e>
 <2><fd068>: Abbrev Number: 0
 <1><fd069>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd06a>   DW_AT_external    : 1
    <fd06a>   DW_AT_name        : (indirect string, offset: 0x907b6): glutCopyColormap
    <fd06e>   DW_AT_decl_file   : 1
    <fd06e>   DW_AT_decl_line   : 211
    <fd06f>   DW_AT_decl_column : 17
    <fd06f>   DW_AT_prototyped  : 1
    <fd06f>   DW_AT_low_pc      : 0x9def50
    <fd077>   DW_AT_high_pc     : 0x25
    <fd07f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd081>   DW_AT_call_all_calls: 1
    <fd081>   DW_AT_sibling     : <0xfd0c1>
 <2><fd085>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd086>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <fd08a>   DW_AT_decl_file   : 1
    <fd08a>   DW_AT_decl_line   : 211
    <fd08b>   DW_AT_decl_column : 39
    <fd08c>   DW_AT_type        : <0xfc634>
    <fd090>   DW_AT_location    : 0x9551 (location list)
    <fd094>   DW_AT_GNU_locviews: 0x954d
 <2><fd098>: Abbrev Number: 28 (DW_TAG_call_site)
    <fd099>   DW_AT_call_return_pc: 0x9def75
    <fd0a1>   DW_AT_call_tail_call: 1
    <fd0a1>   DW_AT_call_origin : <0xfd03f>
 <3><fd0a5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd0a6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd0a8>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd0b2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd0b3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd0b5>   DW_AT_call_value  : 9 byte block: 3 c8 d0 a3 0 0 0 0 0 	(DW_OP_addr: a3d0c8)
 <3><fd0bf>: Abbrev Number: 0
 <2><fd0c0>: Abbrev Number: 0
 <1><fd0c1>: Abbrev Number: 42 (DW_TAG_subprogram)
    <fd0c2>   DW_AT_external    : 1
    <fd0c2>   DW_AT_name        : (indirect string, offset: 0x909cc): glutGetColor
    <fd0c6>   DW_AT_decl_file   : 1
    <fd0c7>   DW_AT_decl_line   : 201
    <fd0c8>   DW_AT_decl_column : 20
    <fd0c9>   DW_AT_prototyped  : 1
    <fd0c9>   DW_AT_type        : <0xfc65f>
    <fd0cd>   DW_AT_low_pc      : 0x9def10
    <fd0d5>   DW_AT_high_pc     : 0x32
    <fd0dd>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd0df>   DW_AT_call_all_calls: 1
    <fd0df>   DW_AT_sibling     : <0xfd132>
 <2><fd0e3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd0e4>   DW_AT_name        : (indirect string, offset: 0x23bba): color
    <fd0e8>   DW_AT_decl_file   : 1
    <fd0e8>   DW_AT_decl_line   : 201
    <fd0e9>   DW_AT_decl_column : 38
    <fd0ea>   DW_AT_type        : <0xfc634>
    <fd0ee>   DW_AT_location    : 0x9567 (location list)
    <fd0f2>   DW_AT_GNU_locviews: 0x9563
 <2><fd0f6>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd0f7>   DW_AT_name        : (indirect string, offset: 0x9c3c2): component
    <fd0fb>   DW_AT_decl_file   : 1
    <fd0fb>   DW_AT_decl_line   : 201
    <fd0fc>   DW_AT_decl_column : 49
    <fd0fd>   DW_AT_type        : <0xfc634>
    <fd101>   DW_AT_location    : 0x957d (location list)
    <fd105>   DW_AT_GNU_locviews: 0x9579
 <2><fd109>: Abbrev Number: 14 (DW_TAG_call_site)
    <fd10a>   DW_AT_call_return_pc: 0x9def39
    <fd112>   DW_AT_call_origin : <0xfd03f>
 <3><fd116>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd117>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd119>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd123>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd124>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd126>   DW_AT_call_value  : 9 byte block: 3 bb d0 a3 0 0 0 0 0 	(DW_OP_addr: a3d0bb)
 <3><fd130>: Abbrev Number: 0
 <2><fd131>: Abbrev Number: 0
 <1><fd132>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd133>   DW_AT_external    : 1
    <fd133>   DW_AT_name        : (indirect string, offset: 0x90773): glutSetColor
    <fd137>   DW_AT_decl_file   : 1
    <fd137>   DW_AT_decl_line   : 192
    <fd138>   DW_AT_decl_column : 17
    <fd138>   DW_AT_prototyped  : 1
    <fd138>   DW_AT_low_pc      : 0x9deee0
    <fd140>   DW_AT_high_pc     : 0x25
    <fd148>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd14a>   DW_AT_call_all_calls: 1
    <fd14a>   DW_AT_sibling     : <0xfd1c4>
 <2><fd14e>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd14f>   DW_AT_name        : (indirect string, offset: 0x9c3cc): nColor
    <fd153>   DW_AT_decl_file   : 1
    <fd153>   DW_AT_decl_line   : 192
    <fd154>   DW_AT_decl_column : 35
    <fd155>   DW_AT_type        : <0xfc634>
    <fd159>   DW_AT_location    : 0x9593 (location list)
    <fd15d>   DW_AT_GNU_locviews: 0x958f
 <2><fd161>: Abbrev Number: 43 (DW_TAG_formal_parameter)
    <fd162>   DW_AT_name        : red
    <fd166>   DW_AT_decl_file   : 1
    <fd167>   DW_AT_decl_line   : 192
    <fd168>   DW_AT_decl_column : 51
    <fd169>   DW_AT_type        : <0xfc65f>
    <fd16d>   DW_AT_location    : 0x95a9 (location list)
    <fd171>   DW_AT_GNU_locviews: 0x95a5
 <2><fd175>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd176>   DW_AT_name        : (indirect string, offset: 0x18189): green
    <fd17a>   DW_AT_decl_file   : 1
    <fd17a>   DW_AT_decl_line   : 192
    <fd17b>   DW_AT_decl_column : 64
    <fd17c>   DW_AT_type        : <0xfc65f>
    <fd180>   DW_AT_location    : 0x95c1 (location list)
    <fd184>   DW_AT_GNU_locviews: 0x95bd
 <2><fd188>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd189>   DW_AT_name        : (indirect string, offset: 0x30780): blue
    <fd18d>   DW_AT_decl_file   : 1
    <fd18d>   DW_AT_decl_line   : 192
    <fd18e>   DW_AT_decl_column : 79
    <fd18f>   DW_AT_type        : <0xfc65f>
    <fd193>   DW_AT_location    : 0x95d9 (location list)
    <fd197>   DW_AT_GNU_locviews: 0x95d5
 <2><fd19b>: Abbrev Number: 28 (DW_TAG_call_site)
    <fd19c>   DW_AT_call_return_pc: 0x9def05
    <fd1a4>   DW_AT_call_tail_call: 1
    <fd1a4>   DW_AT_call_origin : <0xfd03f>
 <3><fd1a8>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd1a9>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd1ab>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd1b5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd1b6>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd1b8>   DW_AT_call_value  : 9 byte block: 3 ae d0 a3 0 0 0 0 0 	(DW_OP_addr: a3d0ae)
 <3><fd1c2>: Abbrev Number: 0
 <2><fd1c3>: Abbrev Number: 0
 <1><fd1c4>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd1c5>   DW_AT_external    : 1
    <fd1c5>   DW_AT_name        : (indirect string, offset: 0x908a6): glutForceJoystickFunc
    <fd1c9>   DW_AT_decl_file   : 1
    <fd1c9>   DW_AT_decl_line   : 179
    <fd1ca>   DW_AT_decl_column : 17
    <fd1ca>   DW_AT_prototyped  : 1
    <fd1ca>   DW_AT_low_pc      : 0x9dee60
    <fd1d2>   DW_AT_high_pc     : 0x75
    <fd1da>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd1dc>   DW_AT_call_all_calls: 1
    <fd1dc>   DW_AT_sibling     : <0xfd227>
 <2><fd1e0>: Abbrev Number: 29 (DW_TAG_call_site)
    <fd1e1>   DW_AT_call_return_pc: 0x9dee84
    <fd1e9>   DW_AT_call_tail_call: 1
    <fd1e9>   DW_AT_call_origin : <0xfcfbf>
 <2><fd1ed>: Abbrev Number: 15 (DW_TAG_call_site)
    <fd1ee>   DW_AT_call_return_pc: 0x9deea9
    <fd1f6>   DW_AT_call_origin : <0xfd03f>
    <fd1fa>   DW_AT_sibling     : <0xfd219>
 <3><fd1fe>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd1ff>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd201>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd20b>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd20c>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd20e>   DW_AT_call_value  : 9 byte block: 3 3 d3 a3 0 0 0 0 0 	(DW_OP_addr: a3d303)
 <3><fd218>: Abbrev Number: 0
 <2><fd219>: Abbrev Number: 29 (DW_TAG_call_site)
    <fd21a>   DW_AT_call_return_pc: 0x9deec8
    <fd222>   DW_AT_call_tail_call: 1
    <fd222>   DW_AT_call_origin : <0xfcfbf>
 <2><fd226>: Abbrev Number: 0
 <1><fd227>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd228>   DW_AT_external    : 1
    <fd228>   DW_AT_name        : (indirect string, offset: 0x90994): glutSetKeyRepeat
    <fd22c>   DW_AT_decl_file   : 1
    <fd22c>   DW_AT_decl_line   : 155
    <fd22d>   DW_AT_decl_column : 17
    <fd22d>   DW_AT_prototyped  : 1
    <fd22d>   DW_AT_low_pc      : 0x9dedf0
    <fd235>   DW_AT_high_pc     : 0x67
    <fd23d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd23f>   DW_AT_call_all_calls: 1
    <fd23f>   DW_AT_sibling     : <0xfd2a5>
 <2><fd243>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd244>   DW_AT_name        : (indirect string, offset: 0x9c39a): repeatMode
    <fd248>   DW_AT_decl_file   : 1
    <fd248>   DW_AT_decl_line   : 155
    <fd249>   DW_AT_decl_column : 39
    <fd24a>   DW_AT_type        : <0xfc634>
    <fd24e>   DW_AT_location    : 0x95ff (location list)
    <fd252>   DW_AT_GNU_locviews: 0x95ed
 <2><fd256>: Abbrev Number: 44 (DW_TAG_call_site)
    <fd257>   DW_AT_call_return_pc: 0x9dee2d
    <fd25f>   DW_AT_call_tail_call: 1
    <fd25f>   DW_AT_call_origin : <0xfd03f>
    <fd263>   DW_AT_sibling     : <0xfd27c>
 <3><fd267>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd268>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd26a>   DW_AT_call_value  : 9 byte block: 3 0 b0 a4 0 0 0 0 0 	(DW_OP_addr: a4b000)
 <3><fd274>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd275>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd277>   DW_AT_call_value  : 3 byte block: a3 1 55 	(DW_OP_entry_value: (DW_OP_reg5 (rdi)))
 <3><fd27b>: Abbrev Number: 0
 <2><fd27c>: Abbrev Number: 14 (DW_TAG_call_site)
    <fd27d>   DW_AT_call_return_pc: 0x9dee55
    <fd285>   DW_AT_call_origin : <0xfd03f>
 <3><fd289>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd28a>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd28c>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd296>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd297>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd299>   DW_AT_call_value  : 9 byte block: 3 f2 d2 a3 0 0 0 0 0 	(DW_OP_addr: a3d2f2)
 <3><fd2a3>: Abbrev Number: 0
 <2><fd2a4>: Abbrev Number: 0
 <1><fd2a5>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd2a6>   DW_AT_external    : 1
    <fd2a6>   DW_AT_name        : (indirect string, offset: 0x9091b): glutIgnoreKeyRepeat
    <fd2aa>   DW_AT_decl_file   : 1
    <fd2aa>   DW_AT_decl_line   : 139
    <fd2ab>   DW_AT_decl_column : 17
    <fd2ab>   DW_AT_prototyped  : 1
    <fd2ab>   DW_AT_low_pc      : 0x9ded80
    <fd2b3>   DW_AT_high_pc     : 0x6c
    <fd2bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd2bd>   DW_AT_call_all_calls: 1
    <fd2bd>   DW_AT_sibling     : <0xfd329>
 <2><fd2c1>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <fd2c2>   DW_AT_name        : (indirect string, offset: 0x3e042): ignore
    <fd2c6>   DW_AT_decl_file   : 1
    <fd2c6>   DW_AT_decl_line   : 139
    <fd2c7>   DW_AT_decl_column : 42
    <fd2c8>   DW_AT_type        : <0xfc634>
    <fd2cc>   DW_AT_location    : 0x964f (location list)
    <fd2d0>   DW_AT_GNU_locviews: 0x9645
 <2><fd2d4>: Abbrev Number: 15 (DW_TAG_call_site)
    <fd2d5>   DW_AT_call_return_pc: 0x9dedb5
    <fd2dd>   DW_AT_call_origin : <0xfd03f>
    <fd2e1>   DW_AT_sibling     : <0xfd300>
 <3><fd2e5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd2e6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd2e8>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd2f2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd2f3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd2f5>   DW_AT_call_value  : 9 byte block: 3 de d2 a3 0 0 0 0 0 	(DW_OP_addr: a3d2de)
 <3><fd2ff>: Abbrev Number: 0
 <2><fd300>: Abbrev Number: 14 (DW_TAG_call_site)
    <fd301>   DW_AT_call_return_pc: 0x9deddd
    <fd309>   DW_AT_call_origin : <0xfd03f>
 <3><fd30d>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd30e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd310>   DW_AT_call_value  : 9 byte block: 3 a0 b9 a3 0 0 0 0 0 	(DW_OP_addr: a3b9a0)
 <3><fd31a>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd31b>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd31d>   DW_AT_call_value  : 9 byte block: 3 de d2 a3 0 0 0 0 0 	(DW_OP_addr: a3d2de)
 <3><fd327>: Abbrev Number: 0
 <2><fd328>: Abbrev Number: 0
 <1><fd329>: Abbrev Number: 13 (DW_TAG_subprogram)
    <fd32a>   DW_AT_external    : 1
    <fd32a>   DW_AT_name        : (indirect string, offset: 0x9090a): glutReportErrors
    <fd32e>   DW_AT_decl_file   : 1
    <fd32e>   DW_AT_decl_line   : 128
    <fd32f>   DW_AT_decl_column : 17
    <fd32f>   DW_AT_prototyped  : 1
    <fd32f>   DW_AT_low_pc      : 0x9dec40
    <fd337>   DW_AT_high_pc     : 0x13a
    <fd33f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fd341>   DW_AT_call_all_calls: 1
    <fd341>   DW_AT_sibling     : <0xfd3e1>
 <2><fd345>: Abbrev Number: 22 (DW_TAG_variable)
    <fd346>   DW_AT_name        : (indirect string, offset: 0x38b5d): error
    <fd34a>   DW_AT_decl_file   : 1
    <fd34a>   DW_AT_decl_line   : 130
    <fd34b>   DW_AT_decl_column : 12
    <fd34c>   DW_AT_type        : <0xfc5f4>
    <fd350>   DW_AT_location    : 0x967f (location list)
    <fd354>   DW_AT_GNU_locviews: 0x9679
 <2><fd358>: Abbrev Number: 45 (DW_TAG_inlined_subroutine)
    <fd359>   DW_AT_abstract_origin: <0xfd3e1>
    <fd35d>   DW_AT_entry_pc    : 0x9dec80
    <fd365>   DW_AT_GNU_entry_view: 1
    <fd366>   DW_AT_ranges      : 0x1274
    <fd36a>   DW_AT_call_file   : 1
    <fd36b>   DW_AT_call_line   : 133
    <fd36c>   DW_AT_call_column : 9
    <fd36d>   DW_AT_sibling     : <0xfd37f>
 <3><fd371>: Abbrev Number: 46 (DW_TAG_formal_parameter)
    <fd372>   DW_AT_abstract_origin: <0xfd3f2>
    <fd376>   DW_AT_location    : 0x9699 (location list)
    <fd37a>   DW_AT_GNU_locviews: 0x9695
 <3><fd37e>: Abbrev Number: 0
 <2><fd37f>: Abbrev Number: 30 (DW_TAG_call_site)
    <fd380>   DW_AT_call_return_pc: 0x9dec78
    <fd388>   DW_AT_call_origin : <0xfcfd1>
 <2><fd38c>: Abbrev Number: 15 (DW_TAG_call_site)
    <fd38d>   DW_AT_call_return_pc: 0x9decce
    <fd395>   DW_AT_call_origin : <0xfcfde>
    <fd399>   DW_AT_sibling     : <0xfd3ab>
 <3><fd39d>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd39e>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd3a0>   DW_AT_call_value  : 9 byte block: 3 f0 af a4 0 0 0 0 0 	(DW_OP_addr: a4aff0)
 <3><fd3aa>: Abbrev Number: 0
 <2><fd3ab>: Abbrev Number: 30 (DW_TAG_call_site)
    <fd3ac>   DW_AT_call_return_pc: 0x9decd3
    <fd3b4>   DW_AT_call_origin : <0xfcfd1>
 <2><fd3b8>: Abbrev Number: 14 (DW_TAG_call_site)
    <fd3b9>   DW_AT_call_return_pc: 0x9ded75
    <fd3c1>   DW_AT_call_origin : <0xfd03f>
 <3><fd3c5>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd3c6>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <fd3c8>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><fd3d2>: Abbrev Number: 3 (DW_TAG_call_site_parameter)
    <fd3d3>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <fd3d5>   DW_AT_call_value  : 9 byte block: 3 cd d2 a3 0 0 0 0 0 	(DW_OP_addr: a3d2cd)
 <3><fd3df>: Abbrev Number: 0
 <2><fd3e0>: Abbrev Number: 0
 <1><fd3e1>: Abbrev Number: 47 (DW_TAG_subprogram)
    <fd3e2>   DW_AT_name        : (indirect string, offset: 0x9c3ac): fghErrorString
    <fd3e6>   DW_AT_decl_file   : 1
    <fd3e7>   DW_AT_decl_line   : 109
    <fd3e8>   DW_AT_decl_column : 20
    <fd3e9>   DW_AT_prototyped  : 1
    <fd3e9>   DW_AT_type        : <0xfc74e>
    <fd3ed>   DW_AT_inline      : 1	(inlined)
    <fd3ee>   DW_AT_sibling     : <0xfd3ff>
 <2><fd3f2>: Abbrev Number: 48 (DW_TAG_formal_parameter)
    <fd3f3>   DW_AT_name        : (indirect string, offset: 0x38b5d): error
    <fd3f7>   DW_AT_decl_file   : 1
    <fd3f8>   DW_AT_decl_line   : 109
    <fd3f9>   DW_AT_decl_column : 43
    <fd3fa>   DW_AT_type        : <0xfc5f4>
 <2><fd3fe>: Abbrev Number: 0
 <1><fd3ff>: Abbrev Number: 49 (DW_TAG_subprogram)
    <fd400>   DW_AT_external    : 1
    <fd400>   DW_AT_name        : (indirect string, offset: 0x909d9): glutExtensionSupported
    <fd404>   DW_AT_decl_file   : 1
