    <d528f>   DW_AT_decl_column : 15
    <d5290>   DW_AT_type        : <0xd467d>
    <d5294>   DW_AT_location    : 0x296d (location list)
    <d5298>   DW_AT_GNU_locviews: 0x2969
 <2><d529c>: Abbrev Number: 3 (DW_TAG_call_site)
    <d529d>   DW_AT_call_return_pc: 0x9d3453
    <d52a5>   DW_AT_call_origin : <0xd4850>
    <d52a9>   DW_AT_sibling     : <0xd52b4>
 <3><d52ad>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d52ae>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d52b0>   DW_AT_call_value  : 2 byte block: 76 0 	(DW_OP_breg6 (rbp): 0)
 <3><d52b3>: Abbrev Number: 0
 <2><d52b4>: Abbrev Number: 24 (DW_TAG_call_site)
    <d52b5>   DW_AT_call_return_pc: 0x9d3461
    <d52bd>   DW_AT_call_tail_call: 1
    <d52bd>   DW_AT_call_origin : <0xd483d>
 <2><d52c1>: Abbrev Number: 3 (DW_TAG_call_site)
    <d52c2>   DW_AT_call_return_pc: 0x9d347d
    <d52ca>   DW_AT_call_origin : <0xd4aaf>
    <d52ce>   DW_AT_sibling     : <0xd52ed>
 <3><d52d2>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d52d3>   DW_AT_location    : 1 byte block: 55 	(DW_OP_reg5 (rdi))
    <d52d5>   DW_AT_call_value  : 9 byte block: 3 78 b8 a3 0 0 0 0 0 	(DW_OP_addr: a3b878)
 <3><d52df>: Abbrev Number: 1 (DW_TAG_call_site_parameter)
    <d52e0>   DW_AT_location    : 1 byte block: 54 	(DW_OP_reg4 (rsi))
    <d52e2>   DW_AT_call_value  : 9 byte block: 3 4 c3 a3 0 0 0 0 0 	(DW_OP_addr: a3c304)
 <3><d52ec>: Abbrev Number: 0
 <2><d52ed>: Abbrev Number: 9 (DW_TAG_call_site)

    <d6975>   DW_AT_encoding    : 7	(unsigned)
    <d6976>   DW_AT_name        : (indirect string, offset: 0x21681): long unsigned int
 <1><d697a>: Abbrev Number: 13 (DW_TAG_base_type)
    <d697b>   DW_AT_byte_size   : 8
    <d697c>   DW_AT_encoding    : 5	(signed)
    <d697d>   DW_AT_name        : (indirect string, offset: 0x1d563): long int
 <1><d6981>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6982>   DW_AT_name        : (indirect string, offset: 0x310b5): __off_t
    <d6986>   DW_AT_decl_file   : 3
    <d6987>   DW_AT_decl_line   : 152
    <d6988>   DW_AT_decl_column : 25
    <d6989>   DW_AT_type        : <0xd697a>
 <1><d698d>: Abbrev Number: 11 (DW_TAG_typedef)
    <d698e>   DW_AT_name        : (indirect string, offset: 0x30472): __off64_t
    <d6992>   DW_AT_decl_file   : 3
    <d6993>   DW_AT_decl_line   : 153
    <d6994>   DW_AT_decl_column : 27
    <d6995>   DW_AT_type        : <0xd697a>
 <1><d6999>: Abbrev Number: 67 (DW_TAG_pointer_type)
    <d699a>   DW_AT_byte_size   : 8
 <1><d699b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d699c>   DW_AT_byte_size   : 8
    <d699c>   DW_AT_type        : <0xd69a0>
 <1><d69a0>: Abbrev Number: 13 (DW_TAG_base_type)
    <d69a1>   DW_AT_byte_size   : 1
    <d69a2>   DW_AT_encoding    : 6	(signed char)
    <d69a3>   DW_AT_name        : (indirect string, offset: 0x2688f): char
 <1><d69a7>: Abbrev Number: 47 (DW_TAG_const_type)
    <d69a8>   DW_AT_type        : <0xd69a0>
 <1><d69ac>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d69ad>   DW_AT_byte_size   : 8
    <d69ad>   DW_AT_type        : <0xd69b1>
 <1><d69b1>: Abbrev Number: 68 (DW_TAG_subroutine_type)
    <d69b2>   DW_AT_prototyped  : 1
 <1><d69b2>: Abbrev Number: 11 (DW_TAG_typedef)
    <d69b3>   DW_AT_name        : (indirect string, offset: 0x79343): size_t
    <d69b7>   DW_AT_decl_file   : 4
    <d69b8>   DW_AT_decl_line   : 209
    <d69b9>   DW_AT_decl_column : 23
    <d69ba>   DW_AT_type        : <0xd6973>
 <1><d69be>: Abbrev Number: 13 (DW_TAG_base_type)
    <d69bf>   DW_AT_byte_size   : 8
    <d69c0>   DW_AT_encoding    : 5	(signed)
    <d69c1>   DW_AT_name        : (indirect string, offset: 0x1d55e): long long int
 <1><d69c5>: Abbrev Number: 13 (DW_TAG_base_type)
    <d69c6>   DW_AT_byte_size   : 8
    <d69c7>   DW_AT_encoding    : 7	(unsigned)
    <d69c8>   DW_AT_name        : (indirect string, offset: 0x2167c): long long unsigned int
 <1><d69cc>: Abbrev Number: 18 (DW_TAG_array_type)
    <d69cd>   DW_AT_type        : <0xd69a0>
    <d69d1>   DW_AT_sibling     : <0xd69dc>
 <2><d69d5>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d69d6>   DW_AT_type        : <0xd6973>
    <d69da>   DW_AT_upper_bound : 31
 <2><d69db>: Abbrev Number: 0
 <1><d69dc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d69dd>   DW_AT_byte_size   : 8
    <d69dd>   DW_AT_type        : <0xd69e1>
 <1><d69e1>: Abbrev Number: 69 (DW_TAG_subroutine_type)
    <d69e2>   DW_AT_sibling     : <0xd69e8>
 <2><d69e6>: Abbrev Number: 37 (DW_TAG_unspecified_parameters)
 <2><d69e7>: Abbrev Number: 0
 <1><d69e8>: Abbrev Number: 48 (DW_TAG_typedef)
    <d69e9>   DW_AT_name        : XID
    <d69ed>   DW_AT_decl_file   : 5
    <d69ee>   DW_AT_decl_line   : 66
    <d69ef>   DW_AT_decl_column : 23
    <d69f0>   DW_AT_type        : <0xd6973>
 <1><d69f4>: Abbrev Number: 11 (DW_TAG_typedef)
    <d69f5>   DW_AT_name        : (indirect string, offset: 0x6eb27): Atom
    <d69f9>   DW_AT_decl_file   : 5
    <d69fa>   DW_AT_decl_line   : 74
    <d69fb>   DW_AT_decl_column : 23
    <d69fc>   DW_AT_type        : <0xd6973>
 <1><d6a00>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a01>   DW_AT_name        : (indirect string, offset: 0x7c79a): VisualID
    <d6a05>   DW_AT_decl_file   : 5
    <d6a06>   DW_AT_decl_line   : 76
    <d6a07>   DW_AT_decl_column : 23
    <d6a08>   DW_AT_type        : <0xd6973>
 <1><d6a0c>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a0d>   DW_AT_name        : (indirect string, offset: 0x8e331): Time
    <d6a11>   DW_AT_decl_file   : 5
    <d6a12>   DW_AT_decl_line   : 77
    <d6a13>   DW_AT_decl_column : 23
    <d6a14>   DW_AT_type        : <0xd6973>
 <1><d6a18>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a19>   DW_AT_name        : (indirect string, offset: 0x6f298): Window
    <d6a1d>   DW_AT_decl_file   : 5
    <d6a1e>   DW_AT_decl_line   : 96
    <d6a1f>   DW_AT_decl_column : 13
    <d6a20>   DW_AT_type        : <0xd69e8>
 <1><d6a24>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a25>   DW_AT_name        : (indirect string, offset: 0x7f5b4): Drawable
    <d6a29>   DW_AT_decl_file   : 5
    <d6a2a>   DW_AT_decl_line   : 97
    <d6a2b>   DW_AT_decl_column : 13
    <d6a2c>   DW_AT_type        : <0xd69e8>
 <1><d6a30>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a31>   DW_AT_name        : (indirect string, offset: 0x90395): Colormap
    <d6a35>   DW_AT_decl_file   : 5
    <d6a36>   DW_AT_decl_line   : 104
    <d6a37>   DW_AT_decl_column : 13
    <d6a38>   DW_AT_type        : <0xd69e8>
 <1><d6a3c>: Abbrev Number: 13 (DW_TAG_base_type)
    <d6a3d>   DW_AT_byte_size   : 16
    <d6a3e>   DW_AT_encoding    : 4	(float)
    <d6a3f>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><d6a43>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6a44>   DW_AT_name        : (indirect string, offset: 0x7030a): XPointer
    <d6a48>   DW_AT_decl_file   : 6
    <d6a49>   DW_AT_decl_line   : 80
    <d6a4a>   DW_AT_decl_column : 15
    <d6a4b>   DW_AT_type        : <0xd699b>
 <1><d6a4f>: Abbrev Number: 30 (DW_TAG_structure_type)
    <d6a50>   DW_AT_name        : (indirect string, offset: 0x7fc01): _XExtData
    <d6a54>   DW_AT_byte_size   : 32
    <d6a55>   DW_AT_decl_file   : 6
    <d6a56>   DW_AT_decl_line   : 148
    <d6a57>   DW_AT_decl_column : 16
    <d6a58>   DW_AT_sibling     : <0xd6a91>
 <2><d6a5c>: Abbrev Number: 3 (DW_TAG_member)
    <d6a5d>   DW_AT_name        : (indirect string, offset: 0x8f519): number
    <d6a61>   DW_AT_decl_file   : 6
    <d6a62>   DW_AT_decl_line   : 149
    <d6a63>   DW_AT_decl_column : 6
    <d6a64>   DW_AT_type        : <0xd6957>
    <d6a68>   DW_AT_data_member_location: 0
 <2><d6a69>: Abbrev Number: 3 (DW_TAG_member)
    <d6a6a>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <d6a6e>   DW_AT_decl_file   : 6
    <d6a6f>   DW_AT_decl_line   : 150
    <d6a70>   DW_AT_decl_column : 20
    <d6a71>   DW_AT_type        : <0xd6a91>
    <d6a75>   DW_AT_data_member_location: 8
 <2><d6a76>: Abbrev Number: 3 (DW_TAG_member)
    <d6a77>   DW_AT_name        : (indirect string, offset: 0x8b0b7): free_private
    <d6a7b>   DW_AT_decl_file   : 6
    <d6a7c>   DW_AT_decl_line   : 151
    <d6a7d>   DW_AT_decl_column : 8
    <d6a7e>   DW_AT_type        : <0xd6aa5>
    <d6a82>   DW_AT_data_member_location: 16
 <2><d6a83>: Abbrev Number: 3 (DW_TAG_member)
    <d6a84>   DW_AT_name        : (indirect string, offset: 0x6bca1): private_data
    <d6a88>   DW_AT_decl_file   : 6
    <d6a89>   DW_AT_decl_line   : 154
    <d6a8a>   DW_AT_decl_column : 11
    <d6a8b>   DW_AT_type        : <0xd6a43>
    <d6a8f>   DW_AT_data_member_location: 24
 <2><d6a90>: Abbrev Number: 0
 <1><d6a91>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6a92>   DW_AT_byte_size   : 8
    <d6a92>   DW_AT_type        : <0xd6a4f>
 <1><d6a96>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <d6a97>   DW_AT_prototyped  : 1
    <d6a97>   DW_AT_type        : <0xd6957>
    <d6a9b>   DW_AT_sibling     : <0xd6aa5>
 <2><d6a9f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d6aa0>   DW_AT_type        : <0xd6a91>
 <2><d6aa4>: Abbrev Number: 0
 <1><d6aa5>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6aa6>   DW_AT_byte_size   : 8
    <d6aa6>   DW_AT_type        : <0xd6a96>
 <1><d6aaa>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6aab>   DW_AT_name        : (indirect string, offset: 0x7fc02): XExtData
    <d6aaf>   DW_AT_decl_file   : 6
    <d6ab0>   DW_AT_decl_line   : 155
    <d6ab1>   DW_AT_decl_column : 3
    <d6ab2>   DW_AT_type        : <0xd6a4f>
 <1><d6ab6>: Abbrev Number: 48 (DW_TAG_typedef)
    <d6ab7>   DW_AT_name        : GC
    <d6aba>   DW_AT_decl_file   : 6
    <d6abb>   DW_AT_decl_line   : 222
    <d6abc>   DW_AT_decl_column : 2
    <d6abd>   DW_AT_type        : <0xd6ac1>
 <1><d6ac1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6ac2>   DW_AT_byte_size   : 8
    <d6ac2>   DW_AT_type        : <0xd6ac6>
 <1><d6ac6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d6ac7>   DW_AT_name        : (indirect string, offset: 0x8e99c): _XGC
    <d6acb>   DW_AT_declaration : 1
 <1><d6acb>: Abbrev Number: 38 (DW_TAG_structure_type)
    <d6acc>   DW_AT_byte_size   : 56
    <d6acd>   DW_AT_decl_file   : 6
    <d6ace>   DW_AT_decl_line   : 227
    <d6acf>   DW_AT_decl_column : 9
    <d6acf>   DW_AT_sibling     : <0xd6b3c>
 <2><d6ad3>: Abbrev Number: 3 (DW_TAG_member)
    <d6ad4>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d6ad8>   DW_AT_decl_file   : 6
    <d6ad9>   DW_AT_decl_line   : 228
    <d6ada>   DW_AT_decl_column : 12
    <d6adb>   DW_AT_type        : <0xd6b3c>
    <d6adf>   DW_AT_data_member_location: 0
 <2><d6ae0>: Abbrev Number: 3 (DW_TAG_member)
    <d6ae1>   DW_AT_name        : (indirect string, offset: 0x6994f): visualid
    <d6ae5>   DW_AT_decl_file   : 6
    <d6ae6>   DW_AT_decl_line   : 229
    <d6ae7>   DW_AT_decl_column : 11
    <d6ae8>   DW_AT_type        : <0xd6a00>
    <d6aec>   DW_AT_data_member_location: 8
 <2><d6aed>: Abbrev Number: 3 (DW_TAG_member)
    <d6aee>   DW_AT_name        : (indirect string, offset: 0x7e4d3): class
    <d6af2>   DW_AT_decl_file   : 6
    <d6af3>   DW_AT_decl_line   : 233
    <d6af4>   DW_AT_decl_column : 6
    <d6af5>   DW_AT_type        : <0xd6957>
    <d6af9>   DW_AT_data_member_location: 16
 <2><d6afa>: Abbrev Number: 3 (DW_TAG_member)
    <d6afb>   DW_AT_name        : (indirect string, offset: 0x86da8): red_mask
    <d6aff>   DW_AT_decl_file   : 6
    <d6b00>   DW_AT_decl_line   : 235
    <d6b01>   DW_AT_decl_column : 16
    <d6b02>   DW_AT_type        : <0xd6973>
    <d6b06>   DW_AT_data_member_location: 24
 <2><d6b07>: Abbrev Number: 3 (DW_TAG_member)
    <d6b08>   DW_AT_name        : (indirect string, offset: 0x6943c): green_mask
    <d6b0c>   DW_AT_decl_file   : 6
    <d6b0d>   DW_AT_decl_line   : 235
    <d6b0e>   DW_AT_decl_column : 26
    <d6b0f>   DW_AT_type        : <0xd6973>
    <d6b13>   DW_AT_data_member_location: 32
 <2><d6b14>: Abbrev Number: 3 (DW_TAG_member)
    <d6b15>   DW_AT_name        : (indirect string, offset: 0x679ce): blue_mask
    <d6b19>   DW_AT_decl_file   : 6
    <d6b1a>   DW_AT_decl_line   : 235
    <d6b1b>   DW_AT_decl_column : 38
    <d6b1c>   DW_AT_type        : <0xd6973>
    <d6b20>   DW_AT_data_member_location: 40
 <2><d6b21>: Abbrev Number: 3 (DW_TAG_member)
    <d6b22>   DW_AT_name        : (indirect string, offset: 0x88e77): bits_per_rgb
    <d6b26>   DW_AT_decl_file   : 6
    <d6b27>   DW_AT_decl_line   : 236
    <d6b28>   DW_AT_decl_column : 6
    <d6b29>   DW_AT_type        : <0xd6957>
    <d6b2d>   DW_AT_data_member_location: 48
 <2><d6b2e>: Abbrev Number: 3 (DW_TAG_member)
    <d6b2f>   DW_AT_name        : (indirect string, offset: 0x85773): map_entries
    <d6b33>   DW_AT_decl_file   : 6
    <d6b34>   DW_AT_decl_line   : 237
    <d6b35>   DW_AT_decl_column : 6
    <d6b36>   DW_AT_type        : <0xd6957>
    <d6b3a>   DW_AT_data_member_location: 52
 <2><d6b3b>: Abbrev Number: 0
 <1><d6b3c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6b3d>   DW_AT_byte_size   : 8
    <d6b3d>   DW_AT_type        : <0xd6aaa>
 <1><d6b41>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6b42>   DW_AT_name        : (indirect string, offset: 0x8721d): Visual
    <d6b46>   DW_AT_decl_file   : 6
    <d6b47>   DW_AT_decl_line   : 238
    <d6b48>   DW_AT_decl_column : 3
    <d6b49>   DW_AT_type        : <0xd6acb>
 <1><d6b4d>: Abbrev Number: 38 (DW_TAG_structure_type)
    <d6b4e>   DW_AT_byte_size   : 16
    <d6b4f>   DW_AT_decl_file   : 6
    <d6b50>   DW_AT_decl_line   : 243
    <d6b51>   DW_AT_decl_column : 9
    <d6b51>   DW_AT_sibling     : <0xd6b7d>
 <2><d6b55>: Abbrev Number: 3 (DW_TAG_member)
    <d6b56>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <d6b5a>   DW_AT_decl_file   : 6
    <d6b5b>   DW_AT_decl_line   : 244
    <d6b5c>   DW_AT_decl_column : 6
    <d6b5d>   DW_AT_type        : <0xd6957>
    <d6b61>   DW_AT_data_member_location: 0
 <2><d6b62>: Abbrev Number: 3 (DW_TAG_member)
    <d6b63>   DW_AT_name        : (indirect string, offset: 0x8ee30): nvisuals
    <d6b67>   DW_AT_decl_file   : 6
    <d6b68>   DW_AT_decl_line   : 245
    <d6b69>   DW_AT_decl_column : 6
    <d6b6a>   DW_AT_type        : <0xd6957>
    <d6b6e>   DW_AT_data_member_location: 4
 <2><d6b6f>: Abbrev Number: 3 (DW_TAG_member)
    <d6b70>   DW_AT_name        : (indirect string, offset: 0x8ee31): visuals
    <d6b74>   DW_AT_decl_file   : 6
    <d6b75>   DW_AT_decl_line   : 246
    <d6b76>   DW_AT_decl_column : 10
    <d6b77>   DW_AT_type        : <0xd6b7d>
    <d6b7b>   DW_AT_data_member_location: 8
 <2><d6b7c>: Abbrev Number: 0
 <1><d6b7d>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6b7e>   DW_AT_byte_size   : 8
    <d6b7e>   DW_AT_type        : <0xd6b41>
 <1><d6b82>: Abbrev Number: 11 (DW_TAG_typedef)
    <d6b83>   DW_AT_name        : (indirect string, offset: 0x8e26c): Depth
    <d6b87>   DW_AT_decl_file   : 6
    <d6b88>   DW_AT_decl_line   : 247
    <d6b89>   DW_AT_decl_column : 3
    <d6b8a>   DW_AT_type        : <0xd6b4d>
 <1><d6b8e>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d6b8f>   DW_AT_byte_size   : 128
    <d6b90>   DW_AT_decl_file   : 6
    <d6b90>   DW_AT_decl_line   : 257
    <d6b92>   DW_AT_decl_column : 9
    <d6b92>   DW_AT_sibling     : <0xd6caf>
 <2><d6b96>: Abbrev Number: 1 (DW_TAG_member)
    <d6b97>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d6b9b>   DW_AT_decl_file   : 6
    <d6b9c>   DW_AT_decl_line   : 258
    <d6b9e>   DW_AT_decl_column : 12
    <d6b9f>   DW_AT_type        : <0xd6b3c>
    <d6ba3>   DW_AT_data_member_location: 0
 <2><d6ba4>: Abbrev Number: 1 (DW_TAG_member)
    <d6ba5>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d6ba9>   DW_AT_decl_file   : 6
    <d6baa>   DW_AT_decl_line   : 259
    <d6bac>   DW_AT_decl_column : 20
    <d6bad>   DW_AT_type        : <0xd6cb4>
    <d6bb1>   DW_AT_data_member_location: 8
 <2><d6bb2>: Abbrev Number: 1 (DW_TAG_member)
    <d6bb3>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d6bb7>   DW_AT_decl_file   : 6
    <d6bb8>   DW_AT_decl_line   : 260
    <d6bba>   DW_AT_decl_column : 9
    <d6bbb>   DW_AT_type        : <0xd6a18>
    <d6bbf>   DW_AT_data_member_location: 16
 <2><d6bc0>: Abbrev Number: 1 (DW_TAG_member)
    <d6bc1>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d6bc5>   DW_AT_decl_file   : 6
    <d6bc6>   DW_AT_decl_line   : 261
    <d6bc8>   DW_AT_decl_column : 6
    <d6bc9>   DW_AT_type        : <0xd6957>
    <d6bcd>   DW_AT_data_member_location: 24
 <2><d6bce>: Abbrev Number: 1 (DW_TAG_member)
    <d6bcf>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d6bd3>   DW_AT_decl_file   : 6
    <d6bd4>   DW_AT_decl_line   : 261
    <d6bd6>   DW_AT_decl_column : 13
    <d6bd7>   DW_AT_type        : <0xd6957>
    <d6bdb>   DW_AT_data_member_location: 28
 <2><d6bdc>: Abbrev Number: 1 (DW_TAG_member)
    <d6bdd>   DW_AT_name        : (indirect string, offset: 0x8ef5b): mwidth
    <d6be1>   DW_AT_decl_file   : 6
    <d6be2>   DW_AT_decl_line   : 262
    <d6be4>   DW_AT_decl_column : 6
    <d6be5>   DW_AT_type        : <0xd6957>
    <d6be9>   DW_AT_data_member_location: 32
 <2><d6bea>: Abbrev Number: 1 (DW_TAG_member)
    <d6beb>   DW_AT_name        : (indirect string, offset: 0x8ec40): mheight
    <d6bef>   DW_AT_decl_file   : 6
    <d6bf0>   DW_AT_decl_line   : 262
    <d6bf2>   DW_AT_decl_column : 14
    <d6bf3>   DW_AT_type        : <0xd6957>
    <d6bf7>   DW_AT_data_member_location: 36
 <2><d6bf8>: Abbrev Number: 1 (DW_TAG_member)
    <d6bf9>   DW_AT_name        : (indirect string, offset: 0x8ed65): ndepths
    <d6bfd>   DW_AT_decl_file   : 6
    <d6bfe>   DW_AT_decl_line   : 263
    <d6c00>   DW_AT_decl_column : 6
    <d6c01>   DW_AT_type        : <0xd6957>
    <d6c05>   DW_AT_data_member_location: 40
 <2><d6c06>: Abbrev Number: 1 (DW_TAG_member)
    <d6c07>   DW_AT_name        : (indirect string, offset: 0x8ed66): depths
    <d6c0b>   DW_AT_decl_file   : 6
    <d6c0c>   DW_AT_decl_line   : 264
    <d6c0e>   DW_AT_decl_column : 9
    <d6c0f>   DW_AT_type        : <0xd6cb9>
    <d6c13>   DW_AT_data_member_location: 48
 <2><d6c14>: Abbrev Number: 1 (DW_TAG_member)
    <d6c15>   DW_AT_name        : (indirect string, offset: 0x8ea6b): root_depth
    <d6c19>   DW_AT_decl_file   : 6
    <d6c1a>   DW_AT_decl_line   : 265
    <d6c1c>   DW_AT_decl_column : 6
    <d6c1d>   DW_AT_type        : <0xd6957>
    <d6c21>   DW_AT_data_member_location: 56
 <2><d6c22>: Abbrev Number: 1 (DW_TAG_member)
    <d6c23>   DW_AT_name        : (indirect string, offset: 0x8ebbe): root_visual
    <d6c27>   DW_AT_decl_file   : 6
    <d6c28>   DW_AT_decl_line   : 266
    <d6c2a>   DW_AT_decl_column : 10
    <d6c2b>   DW_AT_type        : <0xd6b7d>
    <d6c2f>   DW_AT_data_member_location: 64
 <2><d6c30>: Abbrev Number: 1 (DW_TAG_member)
    <d6c31>   DW_AT_name        : (indirect string, offset: 0x8ed1a): default_gc
    <d6c35>   DW_AT_decl_file   : 6
    <d6c36>   DW_AT_decl_line   : 267
    <d6c38>   DW_AT_decl_column : 5
    <d6c39>   DW_AT_type        : <0xd6ab6>
    <d6c3d>   DW_AT_data_member_location: 72
 <2><d6c3e>: Abbrev Number: 1 (DW_TAG_member)
    <d6c3f>   DW_AT_name        : (indirect string, offset: 0x8ebf6): cmap
    <d6c43>   DW_AT_decl_file   : 6
    <d6c44>   DW_AT_decl_line   : 268
    <d6c46>   DW_AT_decl_column : 11
    <d6c47>   DW_AT_type        : <0xd6a30>
    <d6c4b>   DW_AT_data_member_location: 80
 <2><d6c4c>: Abbrev Number: 1 (DW_TAG_member)
    <d6c4d>   DW_AT_name        : (indirect string, offset: 0x8edfe): white_pixel
    <d6c51>   DW_AT_decl_file   : 6
    <d6c52>   DW_AT_decl_line   : 269
    <d6c54>   DW_AT_decl_column : 16
    <d6c55>   DW_AT_type        : <0xd6973>
    <d6c59>   DW_AT_data_member_location: 88
 <2><d6c5a>: Abbrev Number: 1 (DW_TAG_member)
    <d6c5b>   DW_AT_name        : (indirect string, offset: 0x8ae26): black_pixel
    <d6c5f>   DW_AT_decl_file   : 6
    <d6c60>   DW_AT_decl_line   : 270
    <d6c62>   DW_AT_decl_column : 16
    <d6c63>   DW_AT_type        : <0xd6973>
    <d6c67>   DW_AT_data_member_location: 96
 <2><d6c68>: Abbrev Number: 1 (DW_TAG_member)
    <d6c69>   DW_AT_name        : (indirect string, offset: 0x8ec81): max_maps
    <d6c6d>   DW_AT_decl_file   : 6
    <d6c6e>   DW_AT_decl_line   : 271
    <d6c70>   DW_AT_decl_column : 6
    <d6c71>   DW_AT_type        : <0xd6957>
    <d6c75>   DW_AT_data_member_location: 104
 <2><d6c76>: Abbrev Number: 1 (DW_TAG_member)
    <d6c77>   DW_AT_name        : (indirect string, offset: 0x8ee27): min_maps
    <d6c7b>   DW_AT_decl_file   : 6
    <d6c7c>   DW_AT_decl_line   : 271
    <d6c7e>   DW_AT_decl_column : 16
    <d6c7f>   DW_AT_type        : <0xd6957>
    <d6c83>   DW_AT_data_member_location: 108
 <2><d6c84>: Abbrev Number: 1 (DW_TAG_member)
    <d6c85>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <d6c89>   DW_AT_decl_file   : 6
    <d6c8a>   DW_AT_decl_line   : 272
    <d6c8c>   DW_AT_decl_column : 6
    <d6c8d>   DW_AT_type        : <0xd6957>
    <d6c91>   DW_AT_data_member_location: 112
 <2><d6c92>: Abbrev Number: 1 (DW_TAG_member)
    <d6c93>   DW_AT_name        : (indirect string, offset: 0x8eb52): save_unders
    <d6c97>   DW_AT_decl_file   : 6
    <d6c98>   DW_AT_decl_line   : 273
    <d6c9a>   DW_AT_decl_column : 7
    <d6c9b>   DW_AT_type        : <0xd6957>
    <d6c9f>   DW_AT_data_member_location: 116
 <2><d6ca0>: Abbrev Number: 1 (DW_TAG_member)
    <d6ca1>   DW_AT_name        : (indirect string, offset: 0x8ea5b): root_input_mask
    <d6ca5>   DW_AT_decl_file   : 6
    <d6ca6>   DW_AT_decl_line   : 274
    <d6ca8>   DW_AT_decl_column : 7
    <d6ca9>   DW_AT_type        : <0xd697a>
    <d6cad>   DW_AT_data_member_location: 120
 <2><d6cae>: Abbrev Number: 0
 <1><d6caf>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d6cb0>   DW_AT_name        : (indirect string, offset: 0x8bb46): _XDisplay
    <d6cb4>   DW_AT_declaration : 1
 <1><d6cb4>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6cb5>   DW_AT_byte_size   : 8
    <d6cb5>   DW_AT_type        : <0xd6caf>
 <1><d6cb9>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6cba>   DW_AT_byte_size   : 8
    <d6cba>   DW_AT_type        : <0xd6b82>
 <1><d6cbe>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6cbf>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <d6cc3>   DW_AT_decl_file   : 6
    <d6cc4>   DW_AT_decl_line   : 275
    <d6cc6>   DW_AT_decl_column : 3
    <d6cc7>   DW_AT_type        : <0xd6b8e>
 <1><d6ccb>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d6ccc>   DW_AT_byte_size   : 24
    <d6ccd>   DW_AT_decl_file   : 6
    <d6ccd>   DW_AT_decl_line   : 280
    <d6ccf>   DW_AT_decl_column : 9
    <d6ccf>   DW_AT_sibling     : <0xd6d0c>
 <2><d6cd3>: Abbrev Number: 1 (DW_TAG_member)
    <d6cd4>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d6cd8>   DW_AT_decl_file   : 6
    <d6cd9>   DW_AT_decl_line   : 281
    <d6cdb>   DW_AT_decl_column : 12
    <d6cdc>   DW_AT_type        : <0xd6b3c>
    <d6ce0>   DW_AT_data_member_location: 0
 <2><d6ce1>: Abbrev Number: 1 (DW_TAG_member)
    <d6ce2>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <d6ce6>   DW_AT_decl_file   : 6
    <d6ce7>   DW_AT_decl_line   : 282
    <d6ce9>   DW_AT_decl_column : 6
    <d6cea>   DW_AT_type        : <0xd6957>
    <d6cee>   DW_AT_data_member_location: 8
 <2><d6cef>: Abbrev Number: 1 (DW_TAG_member)
    <d6cf0>   DW_AT_name        : (indirect string, offset: 0x6313a): bits_per_pixel
    <d6cf4>   DW_AT_decl_file   : 6
    <d6cf5>   DW_AT_decl_line   : 283
    <d6cf7>   DW_AT_decl_column : 6
    <d6cf8>   DW_AT_type        : <0xd6957>
    <d6cfc>   DW_AT_data_member_location: 12
 <2><d6cfd>: Abbrev Number: 1 (DW_TAG_member)
    <d6cfe>   DW_AT_name        : (indirect string, offset: 0x8edf1): scanline_pad
    <d6d02>   DW_AT_decl_file   : 6
    <d6d03>   DW_AT_decl_line   : 284
    <d6d05>   DW_AT_decl_column : 6
    <d6d06>   DW_AT_type        : <0xd6957>
    <d6d0a>   DW_AT_data_member_location: 16
 <2><d6d0b>: Abbrev Number: 0
 <1><d6d0c>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6d0d>   DW_AT_name        : (indirect string, offset: 0x8ebb1): ScreenFormat
    <d6d11>   DW_AT_decl_file   : 6
    <d6d12>   DW_AT_decl_line   : 285
    <d6d14>   DW_AT_decl_column : 3
    <d6d15>   DW_AT_type        : <0xd6ccb>
 <1><d6d19>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6d1a>   DW_AT_byte_size   : 8
    <d6d1a>   DW_AT_type        : <0xd6cbe>
 <1><d6d1e>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6d1f>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <d6d23>   DW_AT_decl_file   : 6
    <d6d24>   DW_AT_decl_line   : 487
    <d6d26>   DW_AT_decl_column : 26
    <d6d27>   DW_AT_type        : <0xd6caf>
 <1><d6d2b>: Abbrev Number: 70 (DW_TAG_structure_type)
    <d6d2c>   DW_AT_byte_size   : 296
    <d6d2e>   DW_AT_decl_file   : 6
    <d6d2f>   DW_AT_decl_line   : 493
    <d6d31>   DW_AT_decl_column : 9
    <d6d32>   DW_AT_sibling     : <0xd6fa3>
 <2><d6d36>: Abbrev Number: 1 (DW_TAG_member)
    <d6d37>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <d6d3b>   DW_AT_decl_file   : 6
    <d6d3c>   DW_AT_decl_line   : 498
    <d6d3e>   DW_AT_decl_column : 12
    <d6d3f>   DW_AT_type        : <0xd6b3c>
    <d6d43>   DW_AT_data_member_location: 0
 <2><d6d44>: Abbrev Number: 1 (DW_TAG_member)
    <d6d45>   DW_AT_name        : (indirect string, offset: 0x8eabf): private1
    <d6d49>   DW_AT_decl_file   : 6
    <d6d4a>   DW_AT_decl_line   : 499
    <d6d4c>   DW_AT_decl_column : 20
    <d6d4d>   DW_AT_type        : <0xd6fa8>
    <d6d51>   DW_AT_data_member_location: 8
 <2><d6d52>: Abbrev Number: 10 (DW_TAG_member)
    <d6d53>   DW_AT_name        : fd
    <d6d56>   DW_AT_decl_file   : 6
    <d6d57>   DW_AT_decl_line   : 500
    <d6d59>   DW_AT_decl_column : 6
    <d6d5a>   DW_AT_type        : <0xd6957>
    <d6d5e>   DW_AT_data_member_location: 16
 <2><d6d5f>: Abbrev Number: 1 (DW_TAG_member)
    <d6d60>   DW_AT_name        : (indirect string, offset: 0x8ed89): private2
    <d6d64>   DW_AT_decl_file   : 6
    <d6d65>   DW_AT_decl_line   : 501
    <d6d67>   DW_AT_decl_column : 6
    <d6d68>   DW_AT_type        : <0xd6957>
    <d6d6c>   DW_AT_data_member_location: 20
 <2><d6d6d>: Abbrev Number: 1 (DW_TAG_member)
    <d6d6e>   DW_AT_name        : (indirect string, offset: 0x8ecc8): proto_major_version
    <d6d72>   DW_AT_decl_file   : 6
    <d6d73>   DW_AT_decl_line   : 502
    <d6d75>   DW_AT_decl_column : 6
    <d6d76>   DW_AT_type        : <0xd6957>
    <d6d7a>   DW_AT_data_member_location: 24
 <2><d6d7b>: Abbrev Number: 1 (DW_TAG_member)
    <d6d7c>   DW_AT_name        : (indirect string, offset: 0x8ed06): proto_minor_version
    <d6d80>   DW_AT_decl_file   : 6
    <d6d81>   DW_AT_decl_line   : 503
    <d6d83>   DW_AT_decl_column : 6
    <d6d84>   DW_AT_type        : <0xd6957>
    <d6d88>   DW_AT_data_member_location: 28
 <2><d6d89>: Abbrev Number: 1 (DW_TAG_member)
    <d6d8a>   DW_AT_name        : (indirect string, offset: 0x8eb36): vendor
    <d6d8e>   DW_AT_decl_file   : 6
    <d6d8f>   DW_AT_decl_line   : 504
    <d6d91>   DW_AT_decl_column : 8
    <d6d92>   DW_AT_type        : <0xd699b>
    <d6d96>   DW_AT_data_member_location: 32
 <2><d6d97>: Abbrev Number: 1 (DW_TAG_member)
    <d6d98>   DW_AT_name        : (indirect string, offset: 0x8ed92): private3
    <d6d9c>   DW_AT_decl_file   : 6
    <d6d9d>   DW_AT_decl_line   : 505
    <d6d9f>   DW_AT_decl_column : 13
    <d6da0>   DW_AT_type        : <0xd69e8>
    <d6da4>   DW_AT_data_member_location: 40
 <2><d6da5>: Abbrev Number: 1 (DW_TAG_member)
    <d6da6>   DW_AT_name        : (indirect string, offset: 0x8ed9b): private4
    <d6daa>   DW_AT_decl_file   : 6
    <d6dab>   DW_AT_decl_line   : 506
    <d6dad>   DW_AT_decl_column : 6
    <d6dae>   DW_AT_type        : <0xd69e8>
    <d6db2>   DW_AT_data_member_location: 48
 <2><d6db3>: Abbrev Number: 1 (DW_TAG_member)
    <d6db4>   DW_AT_name        : (indirect string, offset: 0x8ee81): private5
    <d6db8>   DW_AT_decl_file   : 6
    <d6db9>   DW_AT_decl_line   : 507
    <d6dbb>   DW_AT_decl_column : 6
    <d6dbc>   DW_AT_type        : <0xd69e8>
    <d6dc0>   DW_AT_data_member_location: 56
 <2><d6dc1>: Abbrev Number: 1 (DW_TAG_member)
    <d6dc2>   DW_AT_name        : (indirect string, offset: 0x8edaf): private6
    <d6dc6>   DW_AT_decl_file   : 6
    <d6dc7>   DW_AT_decl_line   : 508
    <d6dc9>   DW_AT_decl_column : 6
    <d6dca>   DW_AT_type        : <0xd6957>
    <d6dce>   DW_AT_data_member_location: 64
 <2><d6dcf>: Abbrev Number: 1 (DW_TAG_member)
    <d6dd0>   DW_AT_name        : (indirect string, offset: 0x8eb5e): resource_alloc
    <d6dd4>   DW_AT_decl_file   : 6
    <d6dd5>   DW_AT_decl_line   : 509
    <d6dd7>   DW_AT_decl_column : 8
    <d6dd8>   DW_AT_type        : <0xd6fbc>
    <d6ddc>   DW_AT_data_member_location: 72
 <2><d6ddd>: Abbrev Number: 1 (DW_TAG_member)
    <d6dde>   DW_AT_name        : (indirect string, offset: 0x8ecdc): byte_order
    <d6de2>   DW_AT_decl_file   : 6
    <d6de3>   DW_AT_decl_line   : 512
    <d6de5>   DW_AT_decl_column : 6
    <d6de6>   DW_AT_type        : <0xd6957>
    <d6dea>   DW_AT_data_member_location: 80
 <2><d6deb>: Abbrev Number: 1 (DW_TAG_member)
    <d6dec>   DW_AT_name        : (indirect string, offset: 0x8ec75): bitmap_unit
    <d6df0>   DW_AT_decl_file   : 6
    <d6df1>   DW_AT_decl_line   : 513
    <d6df3>   DW_AT_decl_column : 6
    <d6df4>   DW_AT_type        : <0xd6957>
    <d6df8>   DW_AT_data_member_location: 84
 <2><d6df9>: Abbrev Number: 1 (DW_TAG_member)
    <d6dfa>   DW_AT_name        : (indirect string, offset: 0x8ee60): bitmap_pad
    <d6dfe>   DW_AT_decl_file   : 6
    <d6dff>   DW_AT_decl_line   : 514
    <d6e01>   DW_AT_decl_column : 6
    <d6e02>   DW_AT_type        : <0xd6957>
    <d6e06>   DW_AT_data_member_location: 88
 <2><d6e07>: Abbrev Number: 1 (DW_TAG_member)
    <d6e08>   DW_AT_name        : (indirect string, offset: 0x8ea33): bitmap_bit_order
    <d6e0c>   DW_AT_decl_file   : 6
    <d6e0d>   DW_AT_decl_line   : 515
    <d6e0f>   DW_AT_decl_column : 6
    <d6e10>   DW_AT_type        : <0xd6957>
    <d6e14>   DW_AT_data_member_location: 92
 <2><d6e15>: Abbrev Number: 1 (DW_TAG_member)
    <d6e16>   DW_AT_name        : (indirect string, offset: 0x8eddc): nformats
    <d6e1a>   DW_AT_decl_file   : 6
    <d6e1b>   DW_AT_decl_line   : 516
    <d6e1d>   DW_AT_decl_column : 6
    <d6e1e>   DW_AT_type        : <0xd6957>
    <d6e22>   DW_AT_data_member_location: 96
 <2><d6e23>: Abbrev Number: 1 (DW_TAG_member)
    <d6e24>   DW_AT_name        : (indirect string, offset: 0x8ec9d): pixmap_format
    <d6e28>   DW_AT_decl_file   : 6
    <d6e29>   DW_AT_decl_line   : 517
    <d6e2b>   DW_AT_decl_column : 16
    <d6e2c>   DW_AT_type        : <0xd6fc1>
    <d6e30>   DW_AT_data_member_location: 104
 <2><d6e31>: Abbrev Number: 1 (DW_TAG_member)
    <d6e32>   DW_AT_name        : (indirect string, offset: 0x8edca): private8
    <d6e36>   DW_AT_decl_file   : 6
    <d6e37>   DW_AT_decl_line   : 518
    <d6e39>   DW_AT_decl_column : 6
    <d6e3a>   DW_AT_type        : <0xd6957>
    <d6e3e>   DW_AT_data_member_location: 112
 <2><d6e3f>: Abbrev Number: 1 (DW_TAG_member)
    <d6e40>   DW_AT_name        : (indirect string, offset: 0xa9ad): release
    <d6e44>   DW_AT_decl_file   : 6
    <d6e45>   DW_AT_decl_line   : 519
    <d6e47>   DW_AT_decl_column : 6
    <d6e48>   DW_AT_type        : <0xd6957>
    <d6e4c>   DW_AT_data_member_location: 116
 <2><d6e4d>: Abbrev Number: 1 (DW_TAG_member)
    <d6e4e>   DW_AT_name        : (indirect string, offset: 0x8edd3): private9
    <d6e52>   DW_AT_decl_file   : 6
    <d6e53>   DW_AT_decl_line   : 520
    <d6e55>   DW_AT_decl_column : 20
    <d6e56>   DW_AT_type        : <0xd6fa8>
    <d6e5a>   DW_AT_data_member_location: 120
 <2><d6e5b>: Abbrev Number: 1 (DW_TAG_member)
    <d6e5c>   DW_AT_name        : (indirect string, offset: 0x8eea2): private10
    <d6e60>   DW_AT_decl_file   : 6
    <d6e61>   DW_AT_decl_line   : 520
    <d6e63>   DW_AT_decl_column : 31
    <d6e64>   DW_AT_type        : <0xd6fa8>
    <d6e68>   DW_AT_data_member_location: 128
 <2><d6e69>: Abbrev Number: 1 (DW_TAG_member)
    <d6e6a>   DW_AT_name        : (indirect string, offset: 0x8eb9f): qlen
    <d6e6e>   DW_AT_decl_file   : 6
    <d6e6f>   DW_AT_decl_line   : 521
    <d6e71>   DW_AT_decl_column : 6
    <d6e72>   DW_AT_type        : <0xd6957>
    <d6e76>   DW_AT_data_member_location: 136
 <2><d6e77>: Abbrev Number: 1 (DW_TAG_member)
    <d6e78>   DW_AT_name        : (indirect string, offset: 0x8ea04): last_request_read
    <d6e7c>   DW_AT_decl_file   : 6
    <d6e7d>   DW_AT_decl_line   : 522
    <d6e7f>   DW_AT_decl_column : 16
    <d6e80>   DW_AT_type        : <0xd6973>
    <d6e84>   DW_AT_data_member_location: 144
 <2><d6e85>: Abbrev Number: 1 (DW_TAG_member)
    <d6e86>   DW_AT_name        : (indirect string, offset: 0x7ad1f): request
    <d6e8a>   DW_AT_decl_file   : 6
    <d6e8b>   DW_AT_decl_line   : 523
    <d6e8d>   DW_AT_decl_column : 16
    <d6e8e>   DW_AT_type        : <0xd6973>
    <d6e92>   DW_AT_data_member_location: 152
 <2><d6e93>: Abbrev Number: 1 (DW_TAG_member)
    <d6e94>   DW_AT_name        : (indirect string, offset: 0x8eeac): private11
    <d6e98>   DW_AT_decl_file   : 6
    <d6e99>   DW_AT_decl_line   : 524
    <d6e9b>   DW_AT_decl_column : 11
    <d6e9c>   DW_AT_type        : <0xd6a43>
    <d6ea0>   DW_AT_data_member_location: 160
 <2><d6ea1>: Abbrev Number: 1 (DW_TAG_member)
    <d6ea2>   DW_AT_name        : (indirect string, offset: 0x8eed5): private12
    <d6ea6>   DW_AT_decl_file   : 6
    <d6ea7>   DW_AT_decl_line   : 525
    <d6ea9>   DW_AT_decl_column : 11
    <d6eaa>   DW_AT_type        : <0xd6a43>
    <d6eae>   DW_AT_data_member_location: 168
 <2><d6eaf>: Abbrev Number: 1 (DW_TAG_member)
    <d6eb0>   DW_AT_name        : (indirect string, offset: 0x8eedf): private13
    <d6eb4>   DW_AT_decl_file   : 6
    <d6eb5>   DW_AT_decl_line   : 526
    <d6eb7>   DW_AT_decl_column : 11
    <d6eb8>   DW_AT_type        : <0xd6a43>
    <d6ebc>   DW_AT_data_member_location: 176
 <2><d6ebd>: Abbrev Number: 1 (DW_TAG_member)
    <d6ebe>   DW_AT_name        : (indirect string, offset: 0x8eee9): private14
    <d6ec2>   DW_AT_decl_file   : 6
    <d6ec3>   DW_AT_decl_line   : 527
    <d6ec5>   DW_AT_decl_column : 11
    <d6ec6>   DW_AT_type        : <0xd6a43>
    <d6eca>   DW_AT_data_member_location: 184
 <2><d6ecb>: Abbrev Number: 1 (DW_TAG_member)
    <d6ecc>   DW_AT_name        : (indirect string, offset: 0x8e9a1): max_request_size
    <d6ed0>   DW_AT_decl_file   : 6
    <d6ed1>   DW_AT_decl_line   : 528
    <d6ed3>   DW_AT_decl_column : 11
    <d6ed4>   DW_AT_type        : <0xd692f>
    <d6ed8>   DW_AT_data_member_location: 192
 <2><d6ed9>: Abbrev Number: 10 (DW_TAG_member)
    <d6eda>   DW_AT_name        : db
    <d6edd>   DW_AT_decl_file   : 6
    <d6ede>   DW_AT_decl_line   : 529
    <d6ee0>   DW_AT_decl_column : 28
    <d6ee1>   DW_AT_type        : <0xd6fcb>
    <d6ee5>   DW_AT_data_member_location: 200
 <2><d6ee6>: Abbrev Number: 1 (DW_TAG_member)
    <d6ee7>   DW_AT_name        : (indirect string, offset: 0x8eef3): private15
    <d6eeb>   DW_AT_decl_file   : 6
    <d6eec>   DW_AT_decl_line   : 530
    <d6eee>   DW_AT_decl_column : 8
    <d6eef>   DW_AT_type        : <0xd6fdf>
    <d6ef3>   DW_AT_data_member_location: 208
 <2><d6ef4>: Abbrev Number: 1 (DW_TAG_member)
    <d6ef5>   DW_AT_name        : (indirect string, offset: 0x8ea9d): display_name
    <d6ef9>   DW_AT_decl_file   : 6
    <d6efa>   DW_AT_decl_line   : 533
    <d6efc>   DW_AT_decl_column : 8
    <d6efd>   DW_AT_type        : <0xd699b>
    <d6f01>   DW_AT_data_member_location: 216
 <2><d6f02>: Abbrev Number: 1 (DW_TAG_member)
    <d6f03>   DW_AT_name        : (indirect string, offset: 0x8ee93): default_screen
    <d6f07>   DW_AT_decl_file   : 6
    <d6f08>   DW_AT_decl_line   : 534
    <d6f0a>   DW_AT_decl_column : 6
    <d6f0b>   DW_AT_type        : <0xd6957>
    <d6f0f>   DW_AT_data_member_location: 224
 <2><d6f10>: Abbrev Number: 1 (DW_TAG_member)
    <d6f11>   DW_AT_name        : (indirect string, offset: 0x8ebca): nscreens
    <d6f15>   DW_AT_decl_file   : 6
    <d6f16>   DW_AT_decl_line   : 535
    <d6f18>   DW_AT_decl_column : 6
    <d6f19>   DW_AT_type        : <0xd6957>
    <d6f1d>   DW_AT_data_member_location: 228
 <2><d6f1e>: Abbrev Number: 1 (DW_TAG_member)
    <d6f1f>   DW_AT_name        : (indirect string, offset: 0x8ebcb): screens
    <d6f23>   DW_AT_decl_file   : 6
    <d6f24>   DW_AT_decl_line   : 536
    <d6f26>   DW_AT_decl_column : 10
    <d6f27>   DW_AT_type        : <0xd6d19>
    <d6f2b>   DW_AT_data_member_location: 232
 <2><d6f2c>: Abbrev Number: 1 (DW_TAG_member)
    <d6f2d>   DW_AT_name        : (indirect string, offset: 0x8eb6d): motion_buffer
    <d6f31>   DW_AT_decl_file   : 6
    <d6f32>   DW_AT_decl_line   : 537
    <d6f34>   DW_AT_decl_column : 16
    <d6f35>   DW_AT_type        : <0xd6973>
    <d6f39>   DW_AT_data_member_location: 240
 <2><d6f3a>: Abbrev Number: 1 (DW_TAG_member)
    <d6f3b>   DW_AT_name        : (indirect string, offset: 0x8eefd): private16
    <d6f3f>   DW_AT_decl_file   : 6
    <d6f40>   DW_AT_decl_line   : 538
    <d6f42>   DW_AT_decl_column : 16
    <d6f43>   DW_AT_type        : <0xd6973>
    <d6f47>   DW_AT_data_member_location: 248
 <2><d6f48>: Abbrev Number: 14 (DW_TAG_member)
    <d6f49>   DW_AT_name        : (indirect string, offset: 0x8eb7b): min_keycode
    <d6f4d>   DW_AT_decl_file   : 6
    <d6f4e>   DW_AT_decl_line   : 539
    <d6f50>   DW_AT_decl_column : 6
    <d6f51>   DW_AT_type        : <0xd6957>
    <d6f55>   DW_AT_data_member_location: 256
 <2><d6f57>: Abbrev Number: 14 (DW_TAG_member)
    <d6f58>   DW_AT_name        : (indirect string, offset: 0x8eb46): max_keycode
    <d6f5c>   DW_AT_decl_file   : 6
    <d6f5d>   DW_AT_decl_line   : 540
    <d6f5f>   DW_AT_decl_column : 6
    <d6f60>   DW_AT_type        : <0xd6957>
    <d6f64>   DW_AT_data_member_location: 260
 <2><d6f66>: Abbrev Number: 14 (DW_TAG_member)
    <d6f67>   DW_AT_name        : (indirect string, offset: 0x8ef07): private17
    <d6f6b>   DW_AT_decl_file   : 6
    <d6f6c>   DW_AT_decl_line   : 541
    <d6f6e>   DW_AT_decl_column : 11
    <d6f6f>   DW_AT_type        : <0xd6a43>
    <d6f73>   DW_AT_data_member_location: 264
 <2><d6f75>: Abbrev Number: 14 (DW_TAG_member)
    <d6f76>   DW_AT_name        : (indirect string, offset: 0x8ef11): private18
    <d6f7a>   DW_AT_decl_file   : 6
    <d6f7b>   DW_AT_decl_line   : 542
    <d6f7d>   DW_AT_decl_column : 11
    <d6f7e>   DW_AT_type        : <0xd6a43>
    <d6f82>   DW_AT_data_member_location: 272
 <2><d6f84>: Abbrev Number: 14 (DW_TAG_member)
    <d6f85>   DW_AT_name        : (indirect string, offset: 0x8ef1b): private19
    <d6f89>   DW_AT_decl_file   : 6
    <d6f8a>   DW_AT_decl_line   : 543
    <d6f8c>   DW_AT_decl_column : 6
    <d6f8d>   DW_AT_type        : <0xd6957>
    <d6f91>   DW_AT_data_member_location: 280
 <2><d6f93>: Abbrev Number: 14 (DW_TAG_member)
    <d6f94>   DW_AT_name        : (indirect string, offset: 0x8ea16): xdefaults
    <d6f98>   DW_AT_decl_file   : 6
    <d6f99>   DW_AT_decl_line   : 544
    <d6f9b>   DW_AT_decl_column : 8
    <d6f9c>   DW_AT_type        : <0xd699b>
    <d6fa0>   DW_AT_data_member_location: 288
 <2><d6fa2>: Abbrev Number: 0
 <1><d6fa3>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d6fa4>   DW_AT_name        : (indirect string, offset: 0x8ed7f): _XPrivate
    <d6fa8>   DW_AT_declaration : 1
 <1><d6fa8>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6fa9>   DW_AT_byte_size   : 8
    <d6fa9>   DW_AT_type        : <0xd6fa3>
 <1><d6fad>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <d6fae>   DW_AT_prototyped  : 1
    <d6fae>   DW_AT_type        : <0xd69e8>
    <d6fb2>   DW_AT_sibling     : <0xd6fbc>
 <2><d6fb6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d6fb7>   DW_AT_type        : <0xd6cb4>
 <2><d6fbb>: Abbrev Number: 0
 <1><d6fbc>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6fbd>   DW_AT_byte_size   : 8
    <d6fbd>   DW_AT_type        : <0xd6fad>
 <1><d6fc1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6fc2>   DW_AT_byte_size   : 8
    <d6fc2>   DW_AT_type        : <0xd6d0c>
 <1><d6fc6>: Abbrev Number: 20 (DW_TAG_structure_type)
    <d6fc7>   DW_AT_name        : (indirect string, offset: 0x8ef49): _XrmHashBucketRec
    <d6fcb>   DW_AT_declaration : 1
 <1><d6fcb>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6fcc>   DW_AT_byte_size   : 8
    <d6fcc>   DW_AT_type        : <0xd6fc6>
 <1><d6fd0>: Abbrev Number: 29 (DW_TAG_subroutine_type)
    <d6fd1>   DW_AT_prototyped  : 1
    <d6fd1>   DW_AT_type        : <0xd6957>
    <d6fd5>   DW_AT_sibling     : <0xd6fdf>
 <2><d6fd9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d6fda>   DW_AT_type        : <0xd6cb4>
 <2><d6fde>: Abbrev Number: 0
 <1><d6fdf>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6fe0>   DW_AT_byte_size   : 8
    <d6fe0>   DW_AT_type        : <0xd6fd0>
 <1><d6fe4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d6fe5>   DW_AT_name        : (indirect string, offset: 0x8ed46): _XPrivDisplay
    <d6fe9>   DW_AT_decl_file   : 6
    <d6fea>   DW_AT_decl_line   : 550
    <d6fec>   DW_AT_decl_column : 2
    <d6fed>   DW_AT_type        : <0xd6ff1>
 <1><d6ff1>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d6ff2>   DW_AT_byte_size   : 8
    <d6ff2>   DW_AT_type        : <0xd6d2b>
 <1><d6ff6>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d6ff7>   DW_AT_byte_size   : 96
    <d6ff8>   DW_AT_decl_file   : 6
    <d6ff8>   DW_AT_decl_line   : 557
    <d6ffa>   DW_AT_decl_column : 9
    <d6ffa>   DW_AT_sibling     : <0xd70cd>
 <2><d6ffe>: Abbrev Number: 1 (DW_TAG_member)
    <d6fff>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d7003>   DW_AT_decl_file   : 6
    <d7004>   DW_AT_decl_line   : 558
    <d7006>   DW_AT_decl_column : 6
    <d7007>   DW_AT_type        : <0xd6957>
    <d700b>   DW_AT_data_member_location: 0
 <2><d700c>: Abbrev Number: 1 (DW_TAG_member)
    <d700d>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d7011>   DW_AT_decl_file   : 6
    <d7012>   DW_AT_decl_line   : 559
    <d7014>   DW_AT_decl_column : 16
    <d7015>   DW_AT_type        : <0xd6973>
    <d7019>   DW_AT_data_member_location: 8
 <2><d701a>: Abbrev Number: 1 (DW_TAG_member)
    <d701b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d701f>   DW_AT_decl_file   : 6
    <d7020>   DW_AT_decl_line   : 560
    <d7022>   DW_AT_decl_column : 7
    <d7023>   DW_AT_type        : <0xd6957>
    <d7027>   DW_AT_data_member_location: 16
 <2><d7028>: Abbrev Number: 1 (DW_TAG_member)
    <d7029>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d702d>   DW_AT_decl_file   : 6
    <d702e>   DW_AT_decl_line   : 561
    <d7030>   DW_AT_decl_column : 11
    <d7031>   DW_AT_type        : <0xd70cd>
    <d7035>   DW_AT_data_member_location: 24
 <2><d7036>: Abbrev Number: 1 (DW_TAG_member)
    <d7037>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d703b>   DW_AT_decl_file   : 6
    <d703c>   DW_AT_decl_line   : 562
    <d703e>   DW_AT_decl_column : 9
    <d703f>   DW_AT_type        : <0xd6a18>
    <d7043>   DW_AT_data_member_location: 32
 <2><d7044>: Abbrev Number: 1 (DW_TAG_member)
    <d7045>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d7049>   DW_AT_decl_file   : 6
    <d704a>   DW_AT_decl_line   : 563
    <d704c>   DW_AT_decl_column : 9
    <d704d>   DW_AT_type        : <0xd6a18>
    <d7051>   DW_AT_data_member_location: 40
 <2><d7052>: Abbrev Number: 1 (DW_TAG_member)
    <d7053>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d7057>   DW_AT_decl_file   : 6
    <d7058>   DW_AT_decl_line   : 564
    <d705a>   DW_AT_decl_column : 9
    <d705b>   DW_AT_type        : <0xd6a18>
    <d705f>   DW_AT_data_member_location: 48
 <2><d7060>: Abbrev Number: 1 (DW_TAG_member)
    <d7061>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d7065>   DW_AT_decl_file   : 6
    <d7066>   DW_AT_decl_line   : 565
    <d7068>   DW_AT_decl_column : 7
    <d7069>   DW_AT_type        : <0xd6a0c>
    <d706d>   DW_AT_data_member_location: 56
 <2><d706e>: Abbrev Number: 10 (DW_TAG_member)
    <d706f>   DW_AT_name        : x
    <d7071>   DW_AT_decl_file   : 6
    <d7072>   DW_AT_decl_line   : 566
    <d7074>   DW_AT_decl_column : 6
    <d7075>   DW_AT_type        : <0xd6957>
    <d7079>   DW_AT_data_member_location: 64
 <2><d707a>: Abbrev Number: 10 (DW_TAG_member)
    <d707b>   DW_AT_name        : y
    <d707d>   DW_AT_decl_file   : 6
    <d707e>   DW_AT_decl_line   : 566
    <d7080>   DW_AT_decl_column : 9
    <d7081>   DW_AT_type        : <0xd6957>
    <d7085>   DW_AT_data_member_location: 68
 <2><d7086>: Abbrev Number: 1 (DW_TAG_member)
    <d7087>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d708b>   DW_AT_decl_file   : 6
    <d708c>   DW_AT_decl_line   : 567
    <d708e>   DW_AT_decl_column : 6
    <d708f>   DW_AT_type        : <0xd6957>
    <d7093>   DW_AT_data_member_location: 72
 <2><d7094>: Abbrev Number: 1 (DW_TAG_member)
    <d7095>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d7099>   DW_AT_decl_file   : 6
    <d709a>   DW_AT_decl_line   : 567
    <d709c>   DW_AT_decl_column : 14
    <d709d>   DW_AT_type        : <0xd6957>
    <d70a1>   DW_AT_data_member_location: 76
 <2><d70a2>: Abbrev Number: 1 (DW_TAG_member)
    <d70a3>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d70a7>   DW_AT_decl_file   : 6
    <d70a8>   DW_AT_decl_line   : 568
    <d70aa>   DW_AT_decl_column : 15
    <d70ab>   DW_AT_type        : <0xd692f>
    <d70af>   DW_AT_data_member_location: 80
 <2><d70b0>: Abbrev Number: 1 (DW_TAG_member)
    <d70b1>   DW_AT_name        : (indirect string, offset: 0x8eb7f): keycode
    <d70b5>   DW_AT_decl_file   : 6
    <d70b6>   DW_AT_decl_line   : 569
    <d70b8>   DW_AT_decl_column : 15
    <d70b9>   DW_AT_type        : <0xd692f>
    <d70bd>   DW_AT_data_member_location: 84
 <2><d70be>: Abbrev Number: 1 (DW_TAG_member)
    <d70bf>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d70c3>   DW_AT_decl_file   : 6
    <d70c4>   DW_AT_decl_line   : 570
    <d70c6>   DW_AT_decl_column : 7
    <d70c7>   DW_AT_type        : <0xd6957>
    <d70cb>   DW_AT_data_member_location: 88
 <2><d70cc>: Abbrev Number: 0
 <1><d70cd>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <d70ce>   DW_AT_byte_size   : 8
    <d70ce>   DW_AT_type        : <0xd6d1e>
 <1><d70d2>: Abbrev Number: 4 (DW_TAG_typedef)
    <d70d3>   DW_AT_name        : (indirect string, offset: 0x6d211): XKeyEvent
    <d70d7>   DW_AT_decl_file   : 6
    <d70d8>   DW_AT_decl_line   : 571
    <d70da>   DW_AT_decl_column : 3
    <d70db>   DW_AT_type        : <0xd6ff6>
 <1><d70df>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d70e0>   DW_AT_byte_size   : 96
    <d70e1>   DW_AT_decl_file   : 6
    <d70e1>   DW_AT_decl_line   : 575
    <d70e3>   DW_AT_decl_column : 9
    <d70e3>   DW_AT_sibling     : <0xd71b6>
 <2><d70e7>: Abbrev Number: 1 (DW_TAG_member)
    <d70e8>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d70ec>   DW_AT_decl_file   : 6
    <d70ed>   DW_AT_decl_line   : 576
    <d70ef>   DW_AT_decl_column : 6
    <d70f0>   DW_AT_type        : <0xd6957>
    <d70f4>   DW_AT_data_member_location: 0
 <2><d70f5>: Abbrev Number: 1 (DW_TAG_member)
    <d70f6>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d70fa>   DW_AT_decl_file   : 6
    <d70fb>   DW_AT_decl_line   : 577
    <d70fd>   DW_AT_decl_column : 16
    <d70fe>   DW_AT_type        : <0xd6973>
    <d7102>   DW_AT_data_member_location: 8
 <2><d7103>: Abbrev Number: 1 (DW_TAG_member)
    <d7104>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7108>   DW_AT_decl_file   : 6
    <d7109>   DW_AT_decl_line   : 578
    <d710b>   DW_AT_decl_column : 7
    <d710c>   DW_AT_type        : <0xd6957>
    <d7110>   DW_AT_data_member_location: 16
 <2><d7111>: Abbrev Number: 1 (DW_TAG_member)
    <d7112>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7116>   DW_AT_decl_file   : 6
    <d7117>   DW_AT_decl_line   : 579
    <d7119>   DW_AT_decl_column : 11
    <d711a>   DW_AT_type        : <0xd70cd>
    <d711e>   DW_AT_data_member_location: 24
 <2><d711f>: Abbrev Number: 1 (DW_TAG_member)
    <d7120>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d7124>   DW_AT_decl_file   : 6
    <d7125>   DW_AT_decl_line   : 580
    <d7127>   DW_AT_decl_column : 9
    <d7128>   DW_AT_type        : <0xd6a18>
    <d712c>   DW_AT_data_member_location: 32
 <2><d712d>: Abbrev Number: 1 (DW_TAG_member)
    <d712e>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d7132>   DW_AT_decl_file   : 6
    <d7133>   DW_AT_decl_line   : 581
    <d7135>   DW_AT_decl_column : 9
    <d7136>   DW_AT_type        : <0xd6a18>
    <d713a>   DW_AT_data_member_location: 40
 <2><d713b>: Abbrev Number: 1 (DW_TAG_member)
    <d713c>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d7140>   DW_AT_decl_file   : 6
    <d7141>   DW_AT_decl_line   : 582
    <d7143>   DW_AT_decl_column : 9
    <d7144>   DW_AT_type        : <0xd6a18>
    <d7148>   DW_AT_data_member_location: 48
 <2><d7149>: Abbrev Number: 1 (DW_TAG_member)
    <d714a>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d714e>   DW_AT_decl_file   : 6
    <d714f>   DW_AT_decl_line   : 583
    <d7151>   DW_AT_decl_column : 7
    <d7152>   DW_AT_type        : <0xd6a0c>
    <d7156>   DW_AT_data_member_location: 56
 <2><d7157>: Abbrev Number: 10 (DW_TAG_member)
    <d7158>   DW_AT_name        : x
    <d715a>   DW_AT_decl_file   : 6
    <d715b>   DW_AT_decl_line   : 584
    <d715d>   DW_AT_decl_column : 6
    <d715e>   DW_AT_type        : <0xd6957>
    <d7162>   DW_AT_data_member_location: 64
 <2><d7163>: Abbrev Number: 10 (DW_TAG_member)
    <d7164>   DW_AT_name        : y
    <d7166>   DW_AT_decl_file   : 6
    <d7167>   DW_AT_decl_line   : 584
    <d7169>   DW_AT_decl_column : 9
    <d716a>   DW_AT_type        : <0xd6957>
    <d716e>   DW_AT_data_member_location: 68
 <2><d716f>: Abbrev Number: 1 (DW_TAG_member)
    <d7170>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d7174>   DW_AT_decl_file   : 6
    <d7175>   DW_AT_decl_line   : 585
    <d7177>   DW_AT_decl_column : 6
    <d7178>   DW_AT_type        : <0xd6957>
    <d717c>   DW_AT_data_member_location: 72
 <2><d717d>: Abbrev Number: 1 (DW_TAG_member)
    <d717e>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d7182>   DW_AT_decl_file   : 6
    <d7183>   DW_AT_decl_line   : 585
    <d7185>   DW_AT_decl_column : 14
    <d7186>   DW_AT_type        : <0xd6957>
    <d718a>   DW_AT_data_member_location: 76
 <2><d718b>: Abbrev Number: 1 (DW_TAG_member)
    <d718c>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d7190>   DW_AT_decl_file   : 6
    <d7191>   DW_AT_decl_line   : 586
    <d7193>   DW_AT_decl_column : 15
    <d7194>   DW_AT_type        : <0xd692f>
    <d7198>   DW_AT_data_member_location: 80
 <2><d7199>: Abbrev Number: 1 (DW_TAG_member)
    <d719a>   DW_AT_name        : (indirect string, offset: 0x48b67): button
    <d719e>   DW_AT_decl_file   : 6
    <d719f>   DW_AT_decl_line   : 587
    <d71a1>   DW_AT_decl_column : 15
    <d71a2>   DW_AT_type        : <0xd692f>
    <d71a6>   DW_AT_data_member_location: 84
 <2><d71a7>: Abbrev Number: 1 (DW_TAG_member)
    <d71a8>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d71ac>   DW_AT_decl_file   : 6
    <d71ad>   DW_AT_decl_line   : 588
    <d71af>   DW_AT_decl_column : 7
    <d71b0>   DW_AT_type        : <0xd6957>
    <d71b4>   DW_AT_data_member_location: 88
 <2><d71b5>: Abbrev Number: 0
 <1><d71b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <d71b7>   DW_AT_name        : (indirect string, offset: 0x84cdb): XButtonEvent
    <d71bb>   DW_AT_decl_file   : 6
    <d71bc>   DW_AT_decl_line   : 589
    <d71be>   DW_AT_decl_column : 3
    <d71bf>   DW_AT_type        : <0xd70df>
 <1><d71c3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d71c4>   DW_AT_byte_size   : 96
    <d71c5>   DW_AT_decl_file   : 6
    <d71c5>   DW_AT_decl_line   : 593
    <d71c7>   DW_AT_decl_column : 9
    <d71c7>   DW_AT_sibling     : <0xd729a>
 <2><d71cb>: Abbrev Number: 1 (DW_TAG_member)
    <d71cc>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d71d0>   DW_AT_decl_file   : 6
    <d71d1>   DW_AT_decl_line   : 594
    <d71d3>   DW_AT_decl_column : 6
    <d71d4>   DW_AT_type        : <0xd6957>
    <d71d8>   DW_AT_data_member_location: 0
 <2><d71d9>: Abbrev Number: 1 (DW_TAG_member)
    <d71da>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d71de>   DW_AT_decl_file   : 6
    <d71df>   DW_AT_decl_line   : 595
    <d71e1>   DW_AT_decl_column : 16
    <d71e2>   DW_AT_type        : <0xd6973>
    <d71e6>   DW_AT_data_member_location: 8
 <2><d71e7>: Abbrev Number: 1 (DW_TAG_member)
    <d71e8>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d71ec>   DW_AT_decl_file   : 6
    <d71ed>   DW_AT_decl_line   : 596
    <d71ef>   DW_AT_decl_column : 7
    <d71f0>   DW_AT_type        : <0xd6957>
    <d71f4>   DW_AT_data_member_location: 16
 <2><d71f5>: Abbrev Number: 1 (DW_TAG_member)
    <d71f6>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d71fa>   DW_AT_decl_file   : 6
    <d71fb>   DW_AT_decl_line   : 597
    <d71fd>   DW_AT_decl_column : 11
    <d71fe>   DW_AT_type        : <0xd70cd>
    <d7202>   DW_AT_data_member_location: 24
 <2><d7203>: Abbrev Number: 1 (DW_TAG_member)
    <d7204>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d7208>   DW_AT_decl_file   : 6
    <d7209>   DW_AT_decl_line   : 598
    <d720b>   DW_AT_decl_column : 9
    <d720c>   DW_AT_type        : <0xd6a18>
    <d7210>   DW_AT_data_member_location: 32
 <2><d7211>: Abbrev Number: 1 (DW_TAG_member)
    <d7212>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d7216>   DW_AT_decl_file   : 6
    <d7217>   DW_AT_decl_line   : 599
    <d7219>   DW_AT_decl_column : 9
    <d721a>   DW_AT_type        : <0xd6a18>
    <d721e>   DW_AT_data_member_location: 40
 <2><d721f>: Abbrev Number: 1 (DW_TAG_member)
    <d7220>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d7224>   DW_AT_decl_file   : 6
    <d7225>   DW_AT_decl_line   : 600
    <d7227>   DW_AT_decl_column : 9
    <d7228>   DW_AT_type        : <0xd6a18>
    <d722c>   DW_AT_data_member_location: 48
 <2><d722d>: Abbrev Number: 1 (DW_TAG_member)
    <d722e>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d7232>   DW_AT_decl_file   : 6
    <d7233>   DW_AT_decl_line   : 601
    <d7235>   DW_AT_decl_column : 7
    <d7236>   DW_AT_type        : <0xd6a0c>
    <d723a>   DW_AT_data_member_location: 56
 <2><d723b>: Abbrev Number: 10 (DW_TAG_member)
    <d723c>   DW_AT_name        : x
    <d723e>   DW_AT_decl_file   : 6
    <d723f>   DW_AT_decl_line   : 602
    <d7241>   DW_AT_decl_column : 6
    <d7242>   DW_AT_type        : <0xd6957>
    <d7246>   DW_AT_data_member_location: 64
 <2><d7247>: Abbrev Number: 10 (DW_TAG_member)
    <d7248>   DW_AT_name        : y
    <d724a>   DW_AT_decl_file   : 6
    <d724b>   DW_AT_decl_line   : 602
    <d724d>   DW_AT_decl_column : 9
    <d724e>   DW_AT_type        : <0xd6957>
    <d7252>   DW_AT_data_member_location: 68
 <2><d7253>: Abbrev Number: 1 (DW_TAG_member)
    <d7254>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d7258>   DW_AT_decl_file   : 6
    <d7259>   DW_AT_decl_line   : 603
    <d725b>   DW_AT_decl_column : 6
    <d725c>   DW_AT_type        : <0xd6957>
    <d7260>   DW_AT_data_member_location: 72
 <2><d7261>: Abbrev Number: 1 (DW_TAG_member)
    <d7262>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d7266>   DW_AT_decl_file   : 6
    <d7267>   DW_AT_decl_line   : 603
    <d7269>   DW_AT_decl_column : 14
    <d726a>   DW_AT_type        : <0xd6957>
    <d726e>   DW_AT_data_member_location: 76
 <2><d726f>: Abbrev Number: 1 (DW_TAG_member)
    <d7270>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d7274>   DW_AT_decl_file   : 6
    <d7275>   DW_AT_decl_line   : 604
    <d7277>   DW_AT_decl_column : 15
    <d7278>   DW_AT_type        : <0xd692f>
    <d727c>   DW_AT_data_member_location: 80
 <2><d727d>: Abbrev Number: 1 (DW_TAG_member)
    <d727e>   DW_AT_name        : (indirect string, offset: 0x5e6a8): is_hint
    <d7282>   DW_AT_decl_file   : 6
    <d7283>   DW_AT_decl_line   : 605
    <d7285>   DW_AT_decl_column : 7
    <d7286>   DW_AT_type        : <0xd69a0>
    <d728a>   DW_AT_data_member_location: 84
 <2><d728b>: Abbrev Number: 1 (DW_TAG_member)
    <d728c>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d7290>   DW_AT_decl_file   : 6
    <d7291>   DW_AT_decl_line   : 606
    <d7293>   DW_AT_decl_column : 7
    <d7294>   DW_AT_type        : <0xd6957>
    <d7298>   DW_AT_data_member_location: 88
 <2><d7299>: Abbrev Number: 0
 <1><d729a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d729b>   DW_AT_name        : (indirect string, offset: 0x6223d): XMotionEvent
    <d729f>   DW_AT_decl_file   : 6
    <d72a0>   DW_AT_decl_line   : 607
    <d72a2>   DW_AT_decl_column : 3
    <d72a3>   DW_AT_type        : <0xd71c3>
 <1><d72a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d72a8>   DW_AT_byte_size   : 104
    <d72a9>   DW_AT_decl_file   : 6
    <d72a9>   DW_AT_decl_line   : 610
    <d72ab>   DW_AT_decl_column : 9
    <d72ab>   DW_AT_sibling     : <0xd739a>
 <2><d72af>: Abbrev Number: 1 (DW_TAG_member)
    <d72b0>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d72b4>   DW_AT_decl_file   : 6
    <d72b5>   DW_AT_decl_line   : 611
    <d72b7>   DW_AT_decl_column : 6
    <d72b8>   DW_AT_type        : <0xd6957>
    <d72bc>   DW_AT_data_member_location: 0
 <2><d72bd>: Abbrev Number: 1 (DW_TAG_member)
    <d72be>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d72c2>   DW_AT_decl_file   : 6
    <d72c3>   DW_AT_decl_line   : 612
    <d72c5>   DW_AT_decl_column : 16
    <d72c6>   DW_AT_type        : <0xd6973>
    <d72ca>   DW_AT_data_member_location: 8
 <2><d72cb>: Abbrev Number: 1 (DW_TAG_member)
    <d72cc>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d72d0>   DW_AT_decl_file   : 6
    <d72d1>   DW_AT_decl_line   : 613
    <d72d3>   DW_AT_decl_column : 7
    <d72d4>   DW_AT_type        : <0xd6957>
    <d72d8>   DW_AT_data_member_location: 16
 <2><d72d9>: Abbrev Number: 1 (DW_TAG_member)
    <d72da>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d72de>   DW_AT_decl_file   : 6
    <d72df>   DW_AT_decl_line   : 614
    <d72e1>   DW_AT_decl_column : 11
    <d72e2>   DW_AT_type        : <0xd70cd>
    <d72e6>   DW_AT_data_member_location: 24
 <2><d72e7>: Abbrev Number: 1 (DW_TAG_member)
    <d72e8>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d72ec>   DW_AT_decl_file   : 6
    <d72ed>   DW_AT_decl_line   : 615
    <d72ef>   DW_AT_decl_column : 9
    <d72f0>   DW_AT_type        : <0xd6a18>
    <d72f4>   DW_AT_data_member_location: 32
 <2><d72f5>: Abbrev Number: 1 (DW_TAG_member)
    <d72f6>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <d72fa>   DW_AT_decl_file   : 6
    <d72fb>   DW_AT_decl_line   : 616
    <d72fd>   DW_AT_decl_column : 9
    <d72fe>   DW_AT_type        : <0xd6a18>
    <d7302>   DW_AT_data_member_location: 40
 <2><d7303>: Abbrev Number: 1 (DW_TAG_member)
    <d7304>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <d7308>   DW_AT_decl_file   : 6
    <d7309>   DW_AT_decl_line   : 617
    <d730b>   DW_AT_decl_column : 9
    <d730c>   DW_AT_type        : <0xd6a18>
    <d7310>   DW_AT_data_member_location: 48
 <2><d7311>: Abbrev Number: 1 (DW_TAG_member)
    <d7312>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <d7316>   DW_AT_decl_file   : 6
    <d7317>   DW_AT_decl_line   : 618
    <d7319>   DW_AT_decl_column : 7
    <d731a>   DW_AT_type        : <0xd6a0c>
    <d731e>   DW_AT_data_member_location: 56
 <2><d731f>: Abbrev Number: 10 (DW_TAG_member)
    <d7320>   DW_AT_name        : x
    <d7322>   DW_AT_decl_file   : 6
    <d7323>   DW_AT_decl_line   : 619
    <d7325>   DW_AT_decl_column : 6
    <d7326>   DW_AT_type        : <0xd6957>
    <d732a>   DW_AT_data_member_location: 64
 <2><d732b>: Abbrev Number: 10 (DW_TAG_member)
    <d732c>   DW_AT_name        : y
    <d732e>   DW_AT_decl_file   : 6
    <d732f>   DW_AT_decl_line   : 619
    <d7331>   DW_AT_decl_column : 9
    <d7332>   DW_AT_type        : <0xd6957>
    <d7336>   DW_AT_data_member_location: 68
 <2><d7337>: Abbrev Number: 1 (DW_TAG_member)
    <d7338>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <d733c>   DW_AT_decl_file   : 6
    <d733d>   DW_AT_decl_line   : 620
    <d733f>   DW_AT_decl_column : 6
    <d7340>   DW_AT_type        : <0xd6957>
    <d7344>   DW_AT_data_member_location: 72
 <2><d7345>: Abbrev Number: 1 (DW_TAG_member)
    <d7346>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <d734a>   DW_AT_decl_file   : 6
    <d734b>   DW_AT_decl_line   : 620
    <d734d>   DW_AT_decl_column : 14
    <d734e>   DW_AT_type        : <0xd6957>
    <d7352>   DW_AT_data_member_location: 76
 <2><d7353>: Abbrev Number: 1 (DW_TAG_member)
    <d7354>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <d7358>   DW_AT_decl_file   : 6
    <d7359>   DW_AT_decl_line   : 621
    <d735b>   DW_AT_decl_column : 6
    <d735c>   DW_AT_type        : <0xd6957>
    <d7360>   DW_AT_data_member_location: 80
 <2><d7361>: Abbrev Number: 1 (DW_TAG_member)
    <d7362>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <d7366>   DW_AT_decl_file   : 6
    <d7367>   DW_AT_decl_line   : 622
    <d7369>   DW_AT_decl_column : 6
    <d736a>   DW_AT_type        : <0xd6957>
    <d736e>   DW_AT_data_member_location: 84
 <2><d736f>: Abbrev Number: 1 (DW_TAG_member)
    <d7370>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <d7374>   DW_AT_decl_file   : 6
    <d7375>   DW_AT_decl_line   : 627
    <d7377>   DW_AT_decl_column : 7
    <d7378>   DW_AT_type        : <0xd6957>
    <d737c>   DW_AT_data_member_location: 88
 <2><d737d>: Abbrev Number: 1 (DW_TAG_member)
    <d737e>   DW_AT_name        : (indirect string, offset: 0x5a0d9): focus
    <d7382>   DW_AT_decl_file   : 6
    <d7383>   DW_AT_decl_line   : 628
    <d7385>   DW_AT_decl_column : 7
    <d7386>   DW_AT_type        : <0xd6957>
    <d738a>   DW_AT_data_member_location: 92
 <2><d738b>: Abbrev Number: 1 (DW_TAG_member)
    <d738c>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d7390>   DW_AT_decl_file   : 6
    <d7391>   DW_AT_decl_line   : 629
    <d7393>   DW_AT_decl_column : 15
    <d7394>   DW_AT_type        : <0xd692f>
    <d7398>   DW_AT_data_member_location: 96
 <2><d7399>: Abbrev Number: 0
 <1><d739a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d739b>   DW_AT_name        : (indirect string, offset: 0x735e4): XCrossingEvent
    <d739f>   DW_AT_decl_file   : 6
    <d73a0>   DW_AT_decl_line   : 630
    <d73a2>   DW_AT_decl_column : 3
    <d73a3>   DW_AT_type        : <0xd72a7>
 <1><d73a7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d73a8>   DW_AT_byte_size   : 48
    <d73a9>   DW_AT_decl_file   : 6
    <d73a9>   DW_AT_decl_line   : 634
    <d73ab>   DW_AT_decl_column : 9
    <d73ab>   DW_AT_sibling     : <0xd7412>
 <2><d73af>: Abbrev Number: 1 (DW_TAG_member)
    <d73b0>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d73b4>   DW_AT_decl_file   : 6
    <d73b5>   DW_AT_decl_line   : 635
    <d73b7>   DW_AT_decl_column : 6
    <d73b8>   DW_AT_type        : <0xd6957>
    <d73bc>   DW_AT_data_member_location: 0
 <2><d73bd>: Abbrev Number: 1 (DW_TAG_member)
    <d73be>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d73c2>   DW_AT_decl_file   : 6
    <d73c3>   DW_AT_decl_line   : 636
    <d73c5>   DW_AT_decl_column : 16
    <d73c6>   DW_AT_type        : <0xd6973>
    <d73ca>   DW_AT_data_member_location: 8
 <2><d73cb>: Abbrev Number: 1 (DW_TAG_member)
    <d73cc>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d73d0>   DW_AT_decl_file   : 6
    <d73d1>   DW_AT_decl_line   : 637
    <d73d3>   DW_AT_decl_column : 7
    <d73d4>   DW_AT_type        : <0xd6957>
    <d73d8>   DW_AT_data_member_location: 16
 <2><d73d9>: Abbrev Number: 1 (DW_TAG_member)
    <d73da>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d73de>   DW_AT_decl_file   : 6
    <d73df>   DW_AT_decl_line   : 638
    <d73e1>   DW_AT_decl_column : 11
    <d73e2>   DW_AT_type        : <0xd70cd>
    <d73e6>   DW_AT_data_member_location: 24
 <2><d73e7>: Abbrev Number: 1 (DW_TAG_member)
    <d73e8>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d73ec>   DW_AT_decl_file   : 6
    <d73ed>   DW_AT_decl_line   : 639
    <d73ef>   DW_AT_decl_column : 9
    <d73f0>   DW_AT_type        : <0xd6a18>
    <d73f4>   DW_AT_data_member_location: 32
 <2><d73f5>: Abbrev Number: 1 (DW_TAG_member)
    <d73f6>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <d73fa>   DW_AT_decl_file   : 6
    <d73fb>   DW_AT_decl_line   : 640
    <d73fd>   DW_AT_decl_column : 6
    <d73fe>   DW_AT_type        : <0xd6957>
    <d7402>   DW_AT_data_member_location: 40
 <2><d7403>: Abbrev Number: 1 (DW_TAG_member)
    <d7404>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <d7408>   DW_AT_decl_file   : 6
    <d7409>   DW_AT_decl_line   : 642
    <d740b>   DW_AT_decl_column : 6
    <d740c>   DW_AT_type        : <0xd6957>
    <d7410>   DW_AT_data_member_location: 44
 <2><d7411>: Abbrev Number: 0
 <1><d7412>: Abbrev Number: 4 (DW_TAG_typedef)
    <d7413>   DW_AT_name        : (indirect string, offset: 0x7178a): XFocusChangeEvent
    <d7417>   DW_AT_decl_file   : 6
    <d7418>   DW_AT_decl_line   : 648
    <d741a>   DW_AT_decl_column : 3
    <d741b>   DW_AT_type        : <0xd73a7>
 <1><d741f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d7420>   DW_AT_byte_size   : 72
    <d7421>   DW_AT_decl_file   : 6
    <d7421>   DW_AT_decl_line   : 653
    <d7423>   DW_AT_decl_column : 9
    <d7423>   DW_AT_sibling     : <0xd747c>
 <2><d7427>: Abbrev Number: 1 (DW_TAG_member)
    <d7428>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d742c>   DW_AT_decl_file   : 6
    <d742d>   DW_AT_decl_line   : 654
    <d742f>   DW_AT_decl_column : 6
    <d7430>   DW_AT_type        : <0xd6957>
    <d7434>   DW_AT_data_member_location: 0
 <2><d7435>: Abbrev Number: 1 (DW_TAG_member)
    <d7436>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d743a>   DW_AT_decl_file   : 6
    <d743b>   DW_AT_decl_line   : 655
    <d743d>   DW_AT_decl_column : 16
    <d743e>   DW_AT_type        : <0xd6973>
    <d7442>   DW_AT_data_member_location: 8
 <2><d7443>: Abbrev Number: 1 (DW_TAG_member)
    <d7444>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7448>   DW_AT_decl_file   : 6
    <d7449>   DW_AT_decl_line   : 656
    <d744b>   DW_AT_decl_column : 7
    <d744c>   DW_AT_type        : <0xd6957>
    <d7450>   DW_AT_data_member_location: 16
 <2><d7451>: Abbrev Number: 1 (DW_TAG_member)
    <d7452>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7456>   DW_AT_decl_file   : 6
    <d7457>   DW_AT_decl_line   : 657
    <d7459>   DW_AT_decl_column : 11
    <d745a>   DW_AT_type        : <0xd70cd>
    <d745e>   DW_AT_data_member_location: 24
 <2><d745f>: Abbrev Number: 1 (DW_TAG_member)
    <d7460>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d7464>   DW_AT_decl_file   : 6
    <d7465>   DW_AT_decl_line   : 658
    <d7467>   DW_AT_decl_column : 9
    <d7468>   DW_AT_type        : <0xd6a18>
    <d746c>   DW_AT_data_member_location: 32
 <2><d746d>: Abbrev Number: 1 (DW_TAG_member)
    <d746e>   DW_AT_name        : (indirect string, offset: 0x70daa): key_vector
    <d7472>   DW_AT_decl_file   : 6
    <d7473>   DW_AT_decl_line   : 659
    <d7475>   DW_AT_decl_column : 7
    <d7476>   DW_AT_type        : <0xd69cc>
    <d747a>   DW_AT_data_member_location: 40
 <2><d747b>: Abbrev Number: 0
 <1><d747c>: Abbrev Number: 4 (DW_TAG_typedef)
    <d747d>   DW_AT_name        : (indirect string, offset: 0x6b358): XKeymapEvent
    <d7481>   DW_AT_decl_file   : 6
    <d7482>   DW_AT_decl_line   : 660
    <d7484>   DW_AT_decl_column : 3
    <d7485>   DW_AT_type        : <0xd741f>
 <1><d7489>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d748a>   DW_AT_byte_size   : 64
    <d748b>   DW_AT_decl_file   : 6
    <d748b>   DW_AT_decl_line   : 662
    <d748d>   DW_AT_decl_column : 9
    <d748d>   DW_AT_sibling     : <0xd751a>
 <2><d7491>: Abbrev Number: 1 (DW_TAG_member)
    <d7492>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d7496>   DW_AT_decl_file   : 6
    <d7497>   DW_AT_decl_line   : 663
    <d7499>   DW_AT_decl_column : 6
    <d749a>   DW_AT_type        : <0xd6957>
    <d749e>   DW_AT_data_member_location: 0
 <2><d749f>: Abbrev Number: 1 (DW_TAG_member)
    <d74a0>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d74a4>   DW_AT_decl_file   : 6
    <d74a5>   DW_AT_decl_line   : 664
    <d74a7>   DW_AT_decl_column : 16
    <d74a8>   DW_AT_type        : <0xd6973>
    <d74ac>   DW_AT_data_member_location: 8
 <2><d74ad>: Abbrev Number: 1 (DW_TAG_member)
    <d74ae>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d74b2>   DW_AT_decl_file   : 6
    <d74b3>   DW_AT_decl_line   : 665
    <d74b5>   DW_AT_decl_column : 7
    <d74b6>   DW_AT_type        : <0xd6957>
    <d74ba>   DW_AT_data_member_location: 16
 <2><d74bb>: Abbrev Number: 1 (DW_TAG_member)
    <d74bc>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d74c0>   DW_AT_decl_file   : 6
    <d74c1>   DW_AT_decl_line   : 666
    <d74c3>   DW_AT_decl_column : 11
    <d74c4>   DW_AT_type        : <0xd70cd>
    <d74c8>   DW_AT_data_member_location: 24
 <2><d74c9>: Abbrev Number: 1 (DW_TAG_member)
    <d74ca>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d74ce>   DW_AT_decl_file   : 6
    <d74cf>   DW_AT_decl_line   : 667
    <d74d1>   DW_AT_decl_column : 9
    <d74d2>   DW_AT_type        : <0xd6a18>
    <d74d6>   DW_AT_data_member_location: 32
 <2><d74d7>: Abbrev Number: 10 (DW_TAG_member)
    <d74d8>   DW_AT_name        : x
    <d74da>   DW_AT_decl_file   : 6
    <d74db>   DW_AT_decl_line   : 668
    <d74dd>   DW_AT_decl_column : 6
    <d74de>   DW_AT_type        : <0xd6957>
    <d74e2>   DW_AT_data_member_location: 40
 <2><d74e3>: Abbrev Number: 10 (DW_TAG_member)
    <d74e4>   DW_AT_name        : y
    <d74e6>   DW_AT_decl_file   : 6
    <d74e7>   DW_AT_decl_line   : 668
    <d74e9>   DW_AT_decl_column : 9
    <d74ea>   DW_AT_type        : <0xd6957>
    <d74ee>   DW_AT_data_member_location: 44
 <2><d74ef>: Abbrev Number: 1 (DW_TAG_member)
    <d74f0>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d74f4>   DW_AT_decl_file   : 6
    <d74f5>   DW_AT_decl_line   : 669
    <d74f7>   DW_AT_decl_column : 6
    <d74f8>   DW_AT_type        : <0xd6957>
    <d74fc>   DW_AT_data_member_location: 48
 <2><d74fd>: Abbrev Number: 1 (DW_TAG_member)
    <d74fe>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d7502>   DW_AT_decl_file   : 6
    <d7503>   DW_AT_decl_line   : 669
    <d7505>   DW_AT_decl_column : 13
    <d7506>   DW_AT_type        : <0xd6957>
    <d750a>   DW_AT_data_member_location: 52
 <2><d750b>: Abbrev Number: 1 (DW_TAG_member)
    <d750c>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <d7510>   DW_AT_decl_file   : 6
    <d7511>   DW_AT_decl_line   : 670
    <d7513>   DW_AT_decl_column : 6
    <d7514>   DW_AT_type        : <0xd6957>
    <d7518>   DW_AT_data_member_location: 56
 <2><d7519>: Abbrev Number: 0
 <1><d751a>: Abbrev Number: 4 (DW_TAG_typedef)
    <d751b>   DW_AT_name        : (indirect string, offset: 0x834d6): XExposeEvent
    <d751f>   DW_AT_decl_file   : 6
    <d7520>   DW_AT_decl_line   : 671
    <d7522>   DW_AT_decl_column : 3
    <d7523>   DW_AT_type        : <0xd7489>
 <1><d7527>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d7528>   DW_AT_byte_size   : 72
    <d7529>   DW_AT_decl_file   : 6
    <d7529>   DW_AT_decl_line   : 673
    <d752b>   DW_AT_decl_column : 9
    <d752b>   DW_AT_sibling     : <0xd75d4>
 <2><d752f>: Abbrev Number: 1 (DW_TAG_member)
    <d7530>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d7534>   DW_AT_decl_file   : 6
    <d7535>   DW_AT_decl_line   : 674
    <d7537>   DW_AT_decl_column : 6
    <d7538>   DW_AT_type        : <0xd6957>
    <d753c>   DW_AT_data_member_location: 0
 <2><d753d>: Abbrev Number: 1 (DW_TAG_member)
    <d753e>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d7542>   DW_AT_decl_file   : 6
    <d7543>   DW_AT_decl_line   : 675
    <d7545>   DW_AT_decl_column : 16
    <d7546>   DW_AT_type        : <0xd6973>
    <d754a>   DW_AT_data_member_location: 8
 <2><d754b>: Abbrev Number: 1 (DW_TAG_member)
    <d754c>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7550>   DW_AT_decl_file   : 6
    <d7551>   DW_AT_decl_line   : 676
    <d7553>   DW_AT_decl_column : 7
    <d7554>   DW_AT_type        : <0xd6957>
    <d7558>   DW_AT_data_member_location: 16
 <2><d7559>: Abbrev Number: 1 (DW_TAG_member)
    <d755a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d755e>   DW_AT_decl_file   : 6
    <d755f>   DW_AT_decl_line   : 677
    <d7561>   DW_AT_decl_column : 11
    <d7562>   DW_AT_type        : <0xd70cd>
    <d7566>   DW_AT_data_member_location: 24
 <2><d7567>: Abbrev Number: 1 (DW_TAG_member)
    <d7568>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <d756c>   DW_AT_decl_file   : 6
    <d756d>   DW_AT_decl_line   : 678
    <d756f>   DW_AT_decl_column : 11
    <d7570>   DW_AT_type        : <0xd6a24>
    <d7574>   DW_AT_data_member_location: 32
 <2><d7575>: Abbrev Number: 10 (DW_TAG_member)
    <d7576>   DW_AT_name        : x
    <d7578>   DW_AT_decl_file   : 6
    <d7579>   DW_AT_decl_line   : 679
    <d757b>   DW_AT_decl_column : 6
    <d757c>   DW_AT_type        : <0xd6957>
    <d7580>   DW_AT_data_member_location: 40
 <2><d7581>: Abbrev Number: 10 (DW_TAG_member)
    <d7582>   DW_AT_name        : y
    <d7584>   DW_AT_decl_file   : 6
    <d7585>   DW_AT_decl_line   : 679
    <d7587>   DW_AT_decl_column : 9
    <d7588>   DW_AT_type        : <0xd6957>
    <d758c>   DW_AT_data_member_location: 44
 <2><d758d>: Abbrev Number: 1 (DW_TAG_member)
    <d758e>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d7592>   DW_AT_decl_file   : 6
    <d7593>   DW_AT_decl_line   : 680
    <d7595>   DW_AT_decl_column : 6
    <d7596>   DW_AT_type        : <0xd6957>
    <d759a>   DW_AT_data_member_location: 48
 <2><d759b>: Abbrev Number: 1 (DW_TAG_member)
    <d759c>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d75a0>   DW_AT_decl_file   : 6
    <d75a1>   DW_AT_decl_line   : 680
    <d75a3>   DW_AT_decl_column : 13
    <d75a4>   DW_AT_type        : <0xd6957>
    <d75a8>   DW_AT_data_member_location: 52
 <2><d75a9>: Abbrev Number: 1 (DW_TAG_member)
    <d75aa>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <d75ae>   DW_AT_decl_file   : 6
    <d75af>   DW_AT_decl_line   : 681
    <d75b1>   DW_AT_decl_column : 6
    <d75b2>   DW_AT_type        : <0xd6957>
    <d75b6>   DW_AT_data_member_location: 56
 <2><d75b7>: Abbrev Number: 1 (DW_TAG_member)
    <d75b8>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <d75bc>   DW_AT_decl_file   : 6
    <d75bd>   DW_AT_decl_line   : 682
    <d75bf>   DW_AT_decl_column : 6
    <d75c0>   DW_AT_type        : <0xd6957>
    <d75c4>   DW_AT_data_member_location: 60
 <2><d75c5>: Abbrev Number: 1 (DW_TAG_member)
    <d75c6>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <d75ca>   DW_AT_decl_file   : 6
    <d75cb>   DW_AT_decl_line   : 683
    <d75cd>   DW_AT_decl_column : 6
    <d75ce>   DW_AT_type        : <0xd6957>
    <d75d2>   DW_AT_data_member_location: 64
 <2><d75d3>: Abbrev Number: 0
 <1><d75d4>: Abbrev Number: 4 (DW_TAG_typedef)
    <d75d5>   DW_AT_name        : (indirect string, offset: 0x8beb5): XGraphicsExposeEvent
    <d75d9>   DW_AT_decl_file   : 6
    <d75da>   DW_AT_decl_line   : 684
    <d75dc>   DW_AT_decl_column : 3
    <d75dd>   DW_AT_type        : <0xd7527>
 <1><d75e1>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d75e2>   DW_AT_byte_size   : 48
    <d75e3>   DW_AT_decl_file   : 6
    <d75e3>   DW_AT_decl_line   : 686
    <d75e5>   DW_AT_decl_column : 9
    <d75e5>   DW_AT_sibling     : <0xd764c>
 <2><d75e9>: Abbrev Number: 1 (DW_TAG_member)
    <d75ea>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d75ee>   DW_AT_decl_file   : 6
    <d75ef>   DW_AT_decl_line   : 687
    <d75f1>   DW_AT_decl_column : 6
    <d75f2>   DW_AT_type        : <0xd6957>
    <d75f6>   DW_AT_data_member_location: 0
 <2><d75f7>: Abbrev Number: 1 (DW_TAG_member)
    <d75f8>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d75fc>   DW_AT_decl_file   : 6
    <d75fd>   DW_AT_decl_line   : 688
    <d75ff>   DW_AT_decl_column : 16
    <d7600>   DW_AT_type        : <0xd6973>
    <d7604>   DW_AT_data_member_location: 8
 <2><d7605>: Abbrev Number: 1 (DW_TAG_member)
    <d7606>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d760a>   DW_AT_decl_file   : 6
    <d760b>   DW_AT_decl_line   : 689
    <d760d>   DW_AT_decl_column : 7
    <d760e>   DW_AT_type        : <0xd6957>
    <d7612>   DW_AT_data_member_location: 16
 <2><d7613>: Abbrev Number: 1 (DW_TAG_member)
    <d7614>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7618>   DW_AT_decl_file   : 6
    <d7619>   DW_AT_decl_line   : 690
    <d761b>   DW_AT_decl_column : 11
    <d761c>   DW_AT_type        : <0xd70cd>
    <d7620>   DW_AT_data_member_location: 24
 <2><d7621>: Abbrev Number: 1 (DW_TAG_member)
    <d7622>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <d7626>   DW_AT_decl_file   : 6
    <d7627>   DW_AT_decl_line   : 691
    <d7629>   DW_AT_decl_column : 11
    <d762a>   DW_AT_type        : <0xd6a24>
    <d762e>   DW_AT_data_member_location: 32
 <2><d762f>: Abbrev Number: 1 (DW_TAG_member)
    <d7630>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <d7634>   DW_AT_decl_file   : 6
    <d7635>   DW_AT_decl_line   : 692
    <d7637>   DW_AT_decl_column : 6
    <d7638>   DW_AT_type        : <0xd6957>
    <d763c>   DW_AT_data_member_location: 40
 <2><d763d>: Abbrev Number: 1 (DW_TAG_member)
    <d763e>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <d7642>   DW_AT_decl_file   : 6
    <d7643>   DW_AT_decl_line   : 693
    <d7645>   DW_AT_decl_column : 6
    <d7646>   DW_AT_type        : <0xd6957>
    <d764a>   DW_AT_data_member_location: 44
 <2><d764b>: Abbrev Number: 0
 <1><d764c>: Abbrev Number: 4 (DW_TAG_typedef)
    <d764d>   DW_AT_name        : (indirect string, offset: 0x70fba): XNoExposeEvent
    <d7651>   DW_AT_decl_file   : 6
    <d7652>   DW_AT_decl_line   : 694
    <d7654>   DW_AT_decl_column : 3
    <d7655>   DW_AT_type        : <0xd75e1>
 <1><d7659>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d765a>   DW_AT_byte_size   : 48
    <d765b>   DW_AT_decl_file   : 6
    <d765b>   DW_AT_decl_line   : 696
    <d765d>   DW_AT_decl_column : 9
    <d765d>   DW_AT_sibling     : <0xd76b6>
 <2><d7661>: Abbrev Number: 1 (DW_TAG_member)
    <d7662>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d7666>   DW_AT_decl_file   : 6
    <d7667>   DW_AT_decl_line   : 697
    <d7669>   DW_AT_decl_column : 6
    <d766a>   DW_AT_type        : <0xd6957>
    <d766e>   DW_AT_data_member_location: 0
 <2><d766f>: Abbrev Number: 1 (DW_TAG_member)
    <d7670>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d7674>   DW_AT_decl_file   : 6
    <d7675>   DW_AT_decl_line   : 698
    <d7677>   DW_AT_decl_column : 16
    <d7678>   DW_AT_type        : <0xd6973>
    <d767c>   DW_AT_data_member_location: 8
 <2><d767d>: Abbrev Number: 1 (DW_TAG_member)
    <d767e>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7682>   DW_AT_decl_file   : 6
    <d7683>   DW_AT_decl_line   : 699
    <d7685>   DW_AT_decl_column : 7
    <d7686>   DW_AT_type        : <0xd6957>
    <d768a>   DW_AT_data_member_location: 16
 <2><d768b>: Abbrev Number: 1 (DW_TAG_member)
    <d768c>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7690>   DW_AT_decl_file   : 6
    <d7691>   DW_AT_decl_line   : 700
    <d7693>   DW_AT_decl_column : 11
    <d7694>   DW_AT_type        : <0xd70cd>
    <d7698>   DW_AT_data_member_location: 24
 <2><d7699>: Abbrev Number: 1 (DW_TAG_member)
    <d769a>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d769e>   DW_AT_decl_file   : 6
    <d769f>   DW_AT_decl_line   : 701
    <d76a1>   DW_AT_decl_column : 9
    <d76a2>   DW_AT_type        : <0xd6a18>
    <d76a6>   DW_AT_data_member_location: 32
 <2><d76a7>: Abbrev Number: 1 (DW_TAG_member)
    <d76a8>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <d76ac>   DW_AT_decl_file   : 6
    <d76ad>   DW_AT_decl_line   : 702
    <d76af>   DW_AT_decl_column : 6
    <d76b0>   DW_AT_type        : <0xd6957>
    <d76b4>   DW_AT_data_member_location: 40
 <2><d76b5>: Abbrev Number: 0
 <1><d76b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <d76b7>   DW_AT_name        : (indirect string, offset: 0x62f5c): XVisibilityEvent
    <d76bb>   DW_AT_decl_file   : 6
    <d76bc>   DW_AT_decl_line   : 703
    <d76be>   DW_AT_decl_column : 3
    <d76bf>   DW_AT_type        : <0xd7659>
 <1><d76c3>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d76c4>   DW_AT_byte_size   : 72
    <d76c5>   DW_AT_decl_file   : 6
    <d76c5>   DW_AT_decl_line   : 705
    <d76c7>   DW_AT_decl_column : 9
    <d76c7>   DW_AT_sibling     : <0xd7770>
 <2><d76cb>: Abbrev Number: 1 (DW_TAG_member)
    <d76cc>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d76d0>   DW_AT_decl_file   : 6
    <d76d1>   DW_AT_decl_line   : 706
    <d76d3>   DW_AT_decl_column : 6
    <d76d4>   DW_AT_type        : <0xd6957>
    <d76d8>   DW_AT_data_member_location: 0
 <2><d76d9>: Abbrev Number: 1 (DW_TAG_member)
    <d76da>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d76de>   DW_AT_decl_file   : 6
    <d76df>   DW_AT_decl_line   : 707
    <d76e1>   DW_AT_decl_column : 16
    <d76e2>   DW_AT_type        : <0xd6973>
    <d76e6>   DW_AT_data_member_location: 8
 <2><d76e7>: Abbrev Number: 1 (DW_TAG_member)
    <d76e8>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d76ec>   DW_AT_decl_file   : 6
    <d76ed>   DW_AT_decl_line   : 708
    <d76ef>   DW_AT_decl_column : 7
    <d76f0>   DW_AT_type        : <0xd6957>
    <d76f4>   DW_AT_data_member_location: 16
 <2><d76f5>: Abbrev Number: 1 (DW_TAG_member)
    <d76f6>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d76fa>   DW_AT_decl_file   : 6
    <d76fb>   DW_AT_decl_line   : 709
    <d76fd>   DW_AT_decl_column : 11
    <d76fe>   DW_AT_type        : <0xd70cd>
    <d7702>   DW_AT_data_member_location: 24
 <2><d7703>: Abbrev Number: 1 (DW_TAG_member)
    <d7704>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <d7708>   DW_AT_decl_file   : 6
    <d7709>   DW_AT_decl_line   : 710
    <d770b>   DW_AT_decl_column : 9
    <d770c>   DW_AT_type        : <0xd6a18>
    <d7710>   DW_AT_data_member_location: 32
 <2><d7711>: Abbrev Number: 1 (DW_TAG_member)
    <d7712>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d7716>   DW_AT_decl_file   : 6
    <d7717>   DW_AT_decl_line   : 711
    <d7719>   DW_AT_decl_column : 9
    <d771a>   DW_AT_type        : <0xd6a18>
    <d771e>   DW_AT_data_member_location: 40
 <2><d771f>: Abbrev Number: 10 (DW_TAG_member)
    <d7720>   DW_AT_name        : x
    <d7722>   DW_AT_decl_file   : 6
    <d7723>   DW_AT_decl_line   : 712
    <d7725>   DW_AT_decl_column : 6
    <d7726>   DW_AT_type        : <0xd6957>
    <d772a>   DW_AT_data_member_location: 48
 <2><d772b>: Abbrev Number: 10 (DW_TAG_member)
    <d772c>   DW_AT_name        : y
    <d772e>   DW_AT_decl_file   : 6
    <d772f>   DW_AT_decl_line   : 712
    <d7731>   DW_AT_decl_column : 9
    <d7732>   DW_AT_type        : <0xd6957>
    <d7736>   DW_AT_data_member_location: 52
 <2><d7737>: Abbrev Number: 1 (DW_TAG_member)
    <d7738>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <d773c>   DW_AT_decl_file   : 6
    <d773d>   DW_AT_decl_line   : 713
    <d773f>   DW_AT_decl_column : 6
    <d7740>   DW_AT_type        : <0xd6957>
    <d7744>   DW_AT_data_member_location: 56
 <2><d7745>: Abbrev Number: 1 (DW_TAG_member)
    <d7746>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <d774a>   DW_AT_decl_file   : 6
    <d774b>   DW_AT_decl_line   : 713
    <d774d>   DW_AT_decl_column : 13
    <d774e>   DW_AT_type        : <0xd6957>
    <d7752>   DW_AT_data_member_location: 60
 <2><d7753>: Abbrev Number: 1 (DW_TAG_member)
    <d7754>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <d7758>   DW_AT_decl_file   : 6
    <d7759>   DW_AT_decl_line   : 714
    <d775b>   DW_AT_decl_column : 6
    <d775c>   DW_AT_type        : <0xd6957>
    <d7760>   DW_AT_data_member_location: 64
 <2><d7761>: Abbrev Number: 1 (DW_TAG_member)
    <d7762>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <d7766>   DW_AT_decl_file   : 6
    <d7767>   DW_AT_decl_line   : 715
    <d7769>   DW_AT_decl_column : 7
    <d776a>   DW_AT_type        : <0xd6957>
    <d776e>   DW_AT_data_member_location: 68
 <2><d776f>: Abbrev Number: 0
 <1><d7770>: Abbrev Number: 4 (DW_TAG_typedef)
    <d7771>   DW_AT_name        : (indirect string, offset: 0x88215): XCreateWindowEvent
    <d7775>   DW_AT_decl_file   : 6
    <d7776>   DW_AT_decl_line   : 716
    <d7778>   DW_AT_decl_column : 3
    <d7779>   DW_AT_type        : <0xd76c3>
 <1><d777d>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d777e>   DW_AT_byte_size   : 48
    <d777f>   DW_AT_decl_file   : 6
    <d777f>   DW_AT_decl_line   : 718
    <d7781>   DW_AT_decl_column : 9
    <d7781>   DW_AT_sibling     : <0xd77da>
 <2><d7785>: Abbrev Number: 1 (DW_TAG_member)
    <d7786>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d778a>   DW_AT_decl_file   : 6
    <d778b>   DW_AT_decl_line   : 719
    <d778d>   DW_AT_decl_column : 6
    <d778e>   DW_AT_type        : <0xd6957>
    <d7792>   DW_AT_data_member_location: 0
 <2><d7793>: Abbrev Number: 1 (DW_TAG_member)
    <d7794>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d7798>   DW_AT_decl_file   : 6
    <d7799>   DW_AT_decl_line   : 720
    <d779b>   DW_AT_decl_column : 16
    <d779c>   DW_AT_type        : <0xd6973>
    <d77a0>   DW_AT_data_member_location: 8
 <2><d77a1>: Abbrev Number: 1 (DW_TAG_member)
    <d77a2>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d77a6>   DW_AT_decl_file   : 6
    <d77a7>   DW_AT_decl_line   : 721
    <d77a9>   DW_AT_decl_column : 7
    <d77aa>   DW_AT_type        : <0xd6957>
    <d77ae>   DW_AT_data_member_location: 16
 <2><d77af>: Abbrev Number: 1 (DW_TAG_member)
    <d77b0>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d77b4>   DW_AT_decl_file   : 6
    <d77b5>   DW_AT_decl_line   : 722
    <d77b7>   DW_AT_decl_column : 11
    <d77b8>   DW_AT_type        : <0xd70cd>
    <d77bc>   DW_AT_data_member_location: 24
 <2><d77bd>: Abbrev Number: 1 (DW_TAG_member)
    <d77be>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d77c2>   DW_AT_decl_file   : 6
    <d77c3>   DW_AT_decl_line   : 723
    <d77c5>   DW_AT_decl_column : 9
    <d77c6>   DW_AT_type        : <0xd6a18>
    <d77ca>   DW_AT_data_member_location: 32
 <2><d77cb>: Abbrev Number: 1 (DW_TAG_member)
    <d77cc>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d77d0>   DW_AT_decl_file   : 6
    <d77d1>   DW_AT_decl_line   : 724
    <d77d3>   DW_AT_decl_column : 9
    <d77d4>   DW_AT_type        : <0xd6a18>
    <d77d8>   DW_AT_data_member_location: 40
 <2><d77d9>: Abbrev Number: 0
 <1><d77da>: Abbrev Number: 4 (DW_TAG_typedef)
    <d77db>   DW_AT_name        : (indirect string, offset: 0x7994b): XDestroyWindowEvent
    <d77df>   DW_AT_decl_file   : 6
    <d77e0>   DW_AT_decl_line   : 725
    <d77e2>   DW_AT_decl_column : 3
    <d77e3>   DW_AT_type        : <0xd777d>
 <1><d77e7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d77e8>   DW_AT_byte_size   : 56
    <d77e9>   DW_AT_decl_file   : 6
    <d77e9>   DW_AT_decl_line   : 727
    <d77eb>   DW_AT_decl_column : 9
    <d77eb>   DW_AT_sibling     : <0xd7852>
 <2><d77ef>: Abbrev Number: 1 (DW_TAG_member)
    <d77f0>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d77f4>   DW_AT_decl_file   : 6
    <d77f5>   DW_AT_decl_line   : 728
    <d77f7>   DW_AT_decl_column : 6
    <d77f8>   DW_AT_type        : <0xd6957>
    <d77fc>   DW_AT_data_member_location: 0
 <2><d77fd>: Abbrev Number: 1 (DW_TAG_member)
    <d77fe>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d7802>   DW_AT_decl_file   : 6
    <d7803>   DW_AT_decl_line   : 729
    <d7805>   DW_AT_decl_column : 16
    <d7806>   DW_AT_type        : <0xd6973>
    <d780a>   DW_AT_data_member_location: 8
 <2><d780b>: Abbrev Number: 1 (DW_TAG_member)
    <d780c>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7810>   DW_AT_decl_file   : 6
    <d7811>   DW_AT_decl_line   : 730
    <d7813>   DW_AT_decl_column : 7
    <d7814>   DW_AT_type        : <0xd6957>
    <d7818>   DW_AT_data_member_location: 16
 <2><d7819>: Abbrev Number: 1 (DW_TAG_member)
    <d781a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d781e>   DW_AT_decl_file   : 6
    <d781f>   DW_AT_decl_line   : 731
    <d7821>   DW_AT_decl_column : 11
    <d7822>   DW_AT_type        : <0xd70cd>
    <d7826>   DW_AT_data_member_location: 24
 <2><d7827>: Abbrev Number: 1 (DW_TAG_member)
    <d7828>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d782c>   DW_AT_decl_file   : 6
    <d782d>   DW_AT_decl_line   : 732
    <d782f>   DW_AT_decl_column : 9
    <d7830>   DW_AT_type        : <0xd6a18>
    <d7834>   DW_AT_data_member_location: 32
 <2><d7835>: Abbrev Number: 1 (DW_TAG_member)
    <d7836>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d783a>   DW_AT_decl_file   : 6
    <d783b>   DW_AT_decl_line   : 733
    <d783d>   DW_AT_decl_column : 9
    <d783e>   DW_AT_type        : <0xd6a18>
    <d7842>   DW_AT_data_member_location: 40
 <2><d7843>: Abbrev Number: 1 (DW_TAG_member)
    <d7844>   DW_AT_name        : (indirect string, offset: 0x6ee8a): from_configure
    <d7848>   DW_AT_decl_file   : 6
    <d7849>   DW_AT_decl_line   : 734
    <d784b>   DW_AT_decl_column : 7
    <d784c>   DW_AT_type        : <0xd6957>
    <d7850>   DW_AT_data_member_location: 48
 <2><d7851>: Abbrev Number: 0
 <1><d7852>: Abbrev Number: 4 (DW_TAG_typedef)
    <d7853>   DW_AT_name        : (indirect string, offset: 0x6fb44): XUnmapEvent
    <d7857>   DW_AT_decl_file   : 6
    <d7858>   DW_AT_decl_line   : 735
    <d785a>   DW_AT_decl_column : 3
    <d785b>   DW_AT_type        : <0xd77e7>
 <1><d785f>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d7860>   DW_AT_byte_size   : 56
    <d7861>   DW_AT_decl_file   : 6
    <d7861>   DW_AT_decl_line   : 737
    <d7863>   DW_AT_decl_column : 9
    <d7863>   DW_AT_sibling     : <0xd78ca>
 <2><d7867>: Abbrev Number: 1 (DW_TAG_member)
    <d7868>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d786c>   DW_AT_decl_file   : 6
    <d786d>   DW_AT_decl_line   : 738
    <d786f>   DW_AT_decl_column : 6
    <d7870>   DW_AT_type        : <0xd6957>
    <d7874>   DW_AT_data_member_location: 0
 <2><d7875>: Abbrev Number: 1 (DW_TAG_member)
    <d7876>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d787a>   DW_AT_decl_file   : 6
    <d787b>   DW_AT_decl_line   : 739
    <d787d>   DW_AT_decl_column : 16
    <d787e>   DW_AT_type        : <0xd6973>
    <d7882>   DW_AT_data_member_location: 8
 <2><d7883>: Abbrev Number: 1 (DW_TAG_member)
    <d7884>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7888>   DW_AT_decl_file   : 6
    <d7889>   DW_AT_decl_line   : 740
    <d788b>   DW_AT_decl_column : 7
    <d788c>   DW_AT_type        : <0xd6957>
    <d7890>   DW_AT_data_member_location: 16
 <2><d7891>: Abbrev Number: 1 (DW_TAG_member)
    <d7892>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7896>   DW_AT_decl_file   : 6
    <d7897>   DW_AT_decl_line   : 741
    <d7899>   DW_AT_decl_column : 11
    <d789a>   DW_AT_type        : <0xd70cd>
    <d789e>   DW_AT_data_member_location: 24
 <2><d789f>: Abbrev Number: 1 (DW_TAG_member)
    <d78a0>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d78a4>   DW_AT_decl_file   : 6
    <d78a5>   DW_AT_decl_line   : 742
    <d78a7>   DW_AT_decl_column : 9
    <d78a8>   DW_AT_type        : <0xd6a18>
    <d78ac>   DW_AT_data_member_location: 32
 <2><d78ad>: Abbrev Number: 1 (DW_TAG_member)
    <d78ae>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d78b2>   DW_AT_decl_file   : 6
    <d78b3>   DW_AT_decl_line   : 743
    <d78b5>   DW_AT_decl_column : 9
    <d78b6>   DW_AT_type        : <0xd6a18>
    <d78ba>   DW_AT_data_member_location: 40
 <2><d78bb>: Abbrev Number: 1 (DW_TAG_member)
    <d78bc>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <d78c0>   DW_AT_decl_file   : 6
    <d78c1>   DW_AT_decl_line   : 744
    <d78c3>   DW_AT_decl_column : 7
    <d78c4>   DW_AT_type        : <0xd6957>
    <d78c8>   DW_AT_data_member_location: 48
 <2><d78c9>: Abbrev Number: 0
 <1><d78ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <d78cb>   DW_AT_name        : (indirect string, offset: 0x7dc25): XMapEvent
    <d78cf>   DW_AT_decl_file   : 6
    <d78d0>   DW_AT_decl_line   : 745
    <d78d2>   DW_AT_decl_column : 3
    <d78d3>   DW_AT_type        : <0xd785f>
 <1><d78d7>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d78d8>   DW_AT_byte_size   : 48
    <d78d9>   DW_AT_decl_file   : 6
    <d78d9>   DW_AT_decl_line   : 747
    <d78db>   DW_AT_decl_column : 9
    <d78db>   DW_AT_sibling     : <0xd7934>
 <2><d78df>: Abbrev Number: 1 (DW_TAG_member)
    <d78e0>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d78e4>   DW_AT_decl_file   : 6
    <d78e5>   DW_AT_decl_line   : 748
    <d78e7>   DW_AT_decl_column : 6
    <d78e8>   DW_AT_type        : <0xd6957>
    <d78ec>   DW_AT_data_member_location: 0
 <2><d78ed>: Abbrev Number: 1 (DW_TAG_member)
    <d78ee>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d78f2>   DW_AT_decl_file   : 6
    <d78f3>   DW_AT_decl_line   : 749
    <d78f5>   DW_AT_decl_column : 16
    <d78f6>   DW_AT_type        : <0xd6973>
    <d78fa>   DW_AT_data_member_location: 8
 <2><d78fb>: Abbrev Number: 1 (DW_TAG_member)
    <d78fc>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d7900>   DW_AT_decl_file   : 6
    <d7901>   DW_AT_decl_line   : 750
    <d7903>   DW_AT_decl_column : 7
    <d7904>   DW_AT_type        : <0xd6957>
    <d7908>   DW_AT_data_member_location: 16
 <2><d7909>: Abbrev Number: 1 (DW_TAG_member)
    <d790a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d790e>   DW_AT_decl_file   : 6
    <d790f>   DW_AT_decl_line   : 751
    <d7911>   DW_AT_decl_column : 11
    <d7912>   DW_AT_type        : <0xd70cd>
    <d7916>   DW_AT_data_member_location: 24
 <2><d7917>: Abbrev Number: 1 (DW_TAG_member)
    <d7918>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <d791c>   DW_AT_decl_file   : 6
    <d791d>   DW_AT_decl_line   : 752
    <d791f>   DW_AT_decl_column : 9
    <d7920>   DW_AT_type        : <0xd6a18>
    <d7924>   DW_AT_data_member_location: 32
 <2><d7925>: Abbrev Number: 1 (DW_TAG_member)
    <d7926>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d792a>   DW_AT_decl_file   : 6
    <d792b>   DW_AT_decl_line   : 753
    <d792d>   DW_AT_decl_column : 9
    <d792e>   DW_AT_type        : <0xd6a18>
    <d7932>   DW_AT_data_member_location: 40
 <2><d7933>: Abbrev Number: 0
 <1><d7934>: Abbrev Number: 4 (DW_TAG_typedef)
    <d7935>   DW_AT_name        : (indirect string, offset: 0x5eac6): XMapRequestEvent
    <d7939>   DW_AT_decl_file   : 6
    <d793a>   DW_AT_decl_line   : 754
    <d793c>   DW_AT_decl_column : 3
    <d793d>   DW_AT_type        : <0xd78d7>
 <1><d7941>: Abbrev Number: 7 (DW_TAG_structure_type)
    <d7942>   DW_AT_byte_size   : 72
    <d7943>   DW_AT_decl_file   : 6
    <d7943>   DW_AT_decl_line   : 756
    <d7945>   DW_AT_decl_column : 9
    <d7945>   DW_AT_sibling     : <0xd79d2>
 <2><d7949>: Abbrev Number: 1 (DW_TAG_member)
    <d794a>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <d794e>   DW_AT_decl_file   : 6
    <d794f>   DW_AT_decl_line   : 757
    <d7951>   DW_AT_decl_column : 6
    <d7952>   DW_AT_type        : <0xd6957>
    <d7956>   DW_AT_data_member_location: 0
 <2><d7957>: Abbrev Number: 1 (DW_TAG_member)
    <d7958>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <d795c>   DW_AT_decl_file   : 6
    <d795d>   DW_AT_decl_line   : 758
    <d795f>   DW_AT_decl_column : 16
    <d7960>   DW_AT_type        : <0xd6973>
    <d7964>   DW_AT_data_member_location: 8
 <2><d7965>: Abbrev Number: 1 (DW_TAG_member)
    <d7966>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <d796a>   DW_AT_decl_file   : 6
    <d796b>   DW_AT_decl_line   : 759
    <d796d>   DW_AT_decl_column : 7
    <d796e>   DW_AT_type        : <0xd6957>
    <d7972>   DW_AT_data_member_location: 16
 <2><d7973>: Abbrev Number: 1 (DW_TAG_member)
    <d7974>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <d7978>   DW_AT_decl_file   : 6
    <d7979>   DW_AT_decl_line   : 760
    <d797b>   DW_AT_decl_column : 11
    <d797c>   DW_AT_type        : <0xd70cd>
    <d7980>   DW_AT_data_member_location: 24
 <2><d7981>: Abbrev Number: 1 (DW_TAG_member)
    <d7982>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <d7986>   DW_AT_decl_file   : 6
    <d7987>   DW_AT_decl_line   : 761
    <d7989>   DW_AT_decl_column : 9
    <d798a>   DW_AT_type        : <0xd6a18>
    <d798e>   DW_AT_data_member_location: 32
 <2><d798f>: Abbrev Number: 1 (DW_TAG_member)
    <d7990>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <d7994>   DW_AT_decl_file   : 6
    <d7995>   DW_AT_decl_line   : 762
    <d7997>   DW_AT_decl_column : 9
    <d7998>   DW_AT_type        : <0xd6a18>
    <d799c>   DW_AT_data_member_location: 40
 <2><d799d>: Abbrev Number: 1 (DW_TAG_member)
    <d799e>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <d79a2>   DW_AT_decl_file   : 6
    <d79a3>   DW_AT_decl_line   : 763
    <d79a5>   DW_AT_decl_column : 9
    <d79a6>   DW_AT_type        : <0xd6a18>
    <d79aa>   DW_AT_data_member_location: 48
 <2><d79ab>: Abbrev Number: 10 (DW_TAG_member)
    <d79ac>   DW_AT_name        : x
    <d79ae>   DW_AT_decl_file   : 6
    <d79af>   DW_AT_decl_line   : 764
    <d79b1>   DW_AT_decl_column : 6
    <d79b2>   DW_AT_type        : <0xd6957>
    <d79b6>   DW_AT_data_member_location: 56
 <2><d79b7>: Abbrev Number: 10 (DW_TAG_member)
    <d79b8>   DW_AT_name        : y
    <d79ba>   DW_AT_decl_file   : 6
    <d79bb>   DW_AT_decl_line   : 764
