    <ddd09>   DW_AT_name        : (indirect string, offset: 0x2d22d): long double
 <1><ddd0d>: Abbrev Number: 12 (DW_TAG_typedef)
    <ddd0e>   DW_AT_name        : (indirect string, offset: 0x7030a): XPointer
    <ddd12>   DW_AT_decl_file   : 6
    <ddd13>   DW_AT_decl_line   : 80
    <ddd14>   DW_AT_decl_column : 15
    <ddd15>   DW_AT_type        : <0xddc18>
 <1><ddd19>: Abbrev Number: 69 (DW_TAG_structure_type)
    <ddd1a>   DW_AT_name        : (indirect string, offset: 0x7fc01): _XExtData
    <ddd1e>   DW_AT_byte_size   : 32
    <ddd1f>   DW_AT_decl_file   : 6
    <ddd20>   DW_AT_decl_line   : 148
    <ddd21>   DW_AT_decl_column : 16
    <ddd22>   DW_AT_sibling     : <0xddd5b>
 <2><ddd26>: Abbrev Number: 6 (DW_TAG_member)
    <ddd27>   DW_AT_name        : (indirect string, offset: 0x8f519): number
    <ddd2b>   DW_AT_decl_file   : 6
    <ddd2c>   DW_AT_decl_line   : 149
    <ddd2d>   DW_AT_decl_column : 6
    <ddd2e>   DW_AT_type        : <0xddbdb>
    <ddd32>   DW_AT_data_member_location: 0
 <2><ddd33>: Abbrev Number: 6 (DW_TAG_member)
    <ddd34>   DW_AT_name        : (indirect string, offset: 0x7a099): next
    <ddd38>   DW_AT_decl_file   : 6
    <ddd39>   DW_AT_decl_line   : 150
    <ddd3a>   DW_AT_decl_column : 20
    <ddd3b>   DW_AT_type        : <0xddd5b>
    <ddd3f>   DW_AT_data_member_location: 8
 <2><ddd40>: Abbrev Number: 6 (DW_TAG_member)
    <ddd41>   DW_AT_name        : (indirect string, offset: 0x8b0b7): free_private
    <ddd45>   DW_AT_decl_file   : 6
    <ddd46>   DW_AT_decl_line   : 151
    <ddd47>   DW_AT_decl_column : 8
    <ddd48>   DW_AT_type        : <0xddd6f>
    <ddd4c>   DW_AT_data_member_location: 16
 <2><ddd4d>: Abbrev Number: 6 (DW_TAG_member)
    <ddd4e>   DW_AT_name        : (indirect string, offset: 0x6bca1): private_data
    <ddd52>   DW_AT_decl_file   : 6
    <ddd53>   DW_AT_decl_line   : 154
    <ddd54>   DW_AT_decl_column : 11
    <ddd55>   DW_AT_type        : <0xddd0d>
    <ddd59>   DW_AT_data_member_location: 24
 <2><ddd5a>: Abbrev Number: 0
 <1><ddd5b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ddd5c>   DW_AT_byte_size   : 8
    <ddd5c>   DW_AT_type        : <0xddd19>
 <1><ddd60>: Abbrev Number: 42 (DW_TAG_subroutine_type)
    <ddd61>   DW_AT_prototyped  : 1
    <ddd61>   DW_AT_type        : <0xddbdb>
    <ddd65>   DW_AT_sibling     : <0xddd6f>
 <2><ddd69>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <ddd6a>   DW_AT_type        : <0xddd5b>
 <2><ddd6e>: Abbrev Number: 0
 <1><ddd6f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ddd70>   DW_AT_byte_size   : 8
    <ddd70>   DW_AT_type        : <0xddd60>
 <1><ddd74>: Abbrev Number: 12 (DW_TAG_typedef)
    <ddd75>   DW_AT_name        : (indirect string, offset: 0x7fc02): XExtData
    <ddd79>   DW_AT_decl_file   : 6
    <ddd7a>   DW_AT_decl_line   : 155
    <ddd7b>   DW_AT_decl_column : 3
    <ddd7c>   DW_AT_type        : <0xddd19>
 <1><ddd80>: Abbrev Number: 57 (DW_TAG_typedef)
    <ddd81>   DW_AT_name        : GC
    <ddd84>   DW_AT_decl_file   : 6
    <ddd85>   DW_AT_decl_line   : 222
    <ddd86>   DW_AT_decl_column : 2
    <ddd87>   DW_AT_type        : <0xddd8b>
 <1><ddd8b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ddd8c>   DW_AT_byte_size   : 8
    <ddd8c>   DW_AT_type        : <0xddd90>
 <1><ddd90>: Abbrev Number: 34 (DW_TAG_structure_type)
    <ddd91>   DW_AT_name        : (indirect string, offset: 0x8e99c): _XGC
    <ddd95>   DW_AT_declaration : 1
 <1><ddd95>: Abbrev Number: 28 (DW_TAG_structure_type)
    <ddd96>   DW_AT_byte_size   : 56
    <ddd97>   DW_AT_decl_file   : 6
    <ddd98>   DW_AT_decl_line   : 227
    <ddd99>   DW_AT_decl_column : 9
    <ddd9a>   DW_AT_sibling     : <0xdde07>
 <2><ddd9e>: Abbrev Number: 6 (DW_TAG_member)
    <ddd9f>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <ddda3>   DW_AT_decl_file   : 6
    <ddda4>   DW_AT_decl_line   : 228
    <ddda5>   DW_AT_decl_column : 12
    <ddda6>   DW_AT_type        : <0xdde07>
    <dddaa>   DW_AT_data_member_location: 0
 <2><dddab>: Abbrev Number: 6 (DW_TAG_member)
    <dddac>   DW_AT_name        : (indirect string, offset: 0x6994f): visualid
    <dddb0>   DW_AT_decl_file   : 6
    <dddb1>   DW_AT_decl_line   : 229
    <dddb2>   DW_AT_decl_column : 11
    <dddb3>   DW_AT_type        : <0xddcb2>
    <dddb7>   DW_AT_data_member_location: 8
 <2><dddb8>: Abbrev Number: 6 (DW_TAG_member)
    <dddb9>   DW_AT_name        : (indirect string, offset: 0x7e4d3): class
    <dddbd>   DW_AT_decl_file   : 6
    <dddbe>   DW_AT_decl_line   : 233
    <dddbf>   DW_AT_decl_column : 6
    <dddc0>   DW_AT_type        : <0xddbdb>
    <dddc4>   DW_AT_data_member_location: 16
 <2><dddc5>: Abbrev Number: 6 (DW_TAG_member)
    <dddc6>   DW_AT_name        : (indirect string, offset: 0x86da8): red_mask
    <dddca>   DW_AT_decl_file   : 6
    <dddcb>   DW_AT_decl_line   : 235
    <dddcc>   DW_AT_decl_column : 16
    <dddcd>   DW_AT_type        : <0xddc08>
    <dddd1>   DW_AT_data_member_location: 24
 <2><dddd2>: Abbrev Number: 6 (DW_TAG_member)
    <dddd3>   DW_AT_name        : (indirect string, offset: 0x6943c): green_mask
    <dddd7>   DW_AT_decl_file   : 6
    <dddd8>   DW_AT_decl_line   : 235
    <dddd9>   DW_AT_decl_column : 26
    <dddda>   DW_AT_type        : <0xddc08>
    <dddde>   DW_AT_data_member_location: 32
 <2><ddddf>: Abbrev Number: 6 (DW_TAG_member)
    <ddde0>   DW_AT_name        : (indirect string, offset: 0x679ce): blue_mask
    <ddde4>   DW_AT_decl_file   : 6
    <ddde5>   DW_AT_decl_line   : 235
    <ddde6>   DW_AT_decl_column : 38
    <ddde7>   DW_AT_type        : <0xddc08>
    <dddeb>   DW_AT_data_member_location: 40
 <2><dddec>: Abbrev Number: 6 (DW_TAG_member)
    <ddded>   DW_AT_name        : (indirect string, offset: 0x88e77): bits_per_rgb
    <dddf1>   DW_AT_decl_file   : 6
    <dddf2>   DW_AT_decl_line   : 236
    <dddf3>   DW_AT_decl_column : 6
    <dddf4>   DW_AT_type        : <0xddbdb>
    <dddf8>   DW_AT_data_member_location: 48
 <2><dddf9>: Abbrev Number: 6 (DW_TAG_member)
    <dddfa>   DW_AT_name        : (indirect string, offset: 0x85773): map_entries
    <dddfe>   DW_AT_decl_file   : 6
    <dddff>   DW_AT_decl_line   : 237
    <dde00>   DW_AT_decl_column : 6
    <dde01>   DW_AT_type        : <0xddbdb>
    <dde05>   DW_AT_data_member_location: 52
 <2><dde06>: Abbrev Number: 0
 <1><dde07>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <dde08>   DW_AT_byte_size   : 8
    <dde08>   DW_AT_type        : <0xddd74>
 <1><dde0c>: Abbrev Number: 12 (DW_TAG_typedef)
    <dde0d>   DW_AT_name        : (indirect string, offset: 0x8721d): Visual
    <dde11>   DW_AT_decl_file   : 6
    <dde12>   DW_AT_decl_line   : 238
    <dde13>   DW_AT_decl_column : 3
    <dde14>   DW_AT_type        : <0xddd95>
 <1><dde18>: Abbrev Number: 28 (DW_TAG_structure_type)
    <dde19>   DW_AT_byte_size   : 16
    <dde1a>   DW_AT_decl_file   : 6
    <dde1b>   DW_AT_decl_line   : 243
    <dde1c>   DW_AT_decl_column : 9
    <dde1d>   DW_AT_sibling     : <0xdde49>
 <2><dde21>: Abbrev Number: 6 (DW_TAG_member)
    <dde22>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <dde26>   DW_AT_decl_file   : 6
    <dde27>   DW_AT_decl_line   : 244
    <dde28>   DW_AT_decl_column : 6
    <dde29>   DW_AT_type        : <0xddbdb>
    <dde2d>   DW_AT_data_member_location: 0
 <2><dde2e>: Abbrev Number: 6 (DW_TAG_member)
    <dde2f>   DW_AT_name        : (indirect string, offset: 0x8ee30): nvisuals
    <dde33>   DW_AT_decl_file   : 6
    <dde34>   DW_AT_decl_line   : 245
    <dde35>   DW_AT_decl_column : 6
    <dde36>   DW_AT_type        : <0xddbdb>
    <dde3a>   DW_AT_data_member_location: 4
 <2><dde3b>: Abbrev Number: 6 (DW_TAG_member)
    <dde3c>   DW_AT_name        : (indirect string, offset: 0x8ee31): visuals
    <dde40>   DW_AT_decl_file   : 6
    <dde41>   DW_AT_decl_line   : 246
    <dde42>   DW_AT_decl_column : 10
    <dde43>   DW_AT_type        : <0xdde49>
    <dde47>   DW_AT_data_member_location: 8
 <2><dde48>: Abbrev Number: 0
 <1><dde49>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <dde4a>   DW_AT_byte_size   : 8
    <dde4a>   DW_AT_type        : <0xdde0c>
 <1><dde4e>: Abbrev Number: 12 (DW_TAG_typedef)
    <dde4f>   DW_AT_name        : (indirect string, offset: 0x8e26c): Depth
    <dde53>   DW_AT_decl_file   : 6
    <dde54>   DW_AT_decl_line   : 247
    <dde55>   DW_AT_decl_column : 3
    <dde56>   DW_AT_type        : <0xdde18>
 <1><dde5a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dde5b>   DW_AT_byte_size   : 128
    <dde5c>   DW_AT_decl_file   : 6
    <dde5d>   DW_AT_decl_line   : 257
    <dde5f>   DW_AT_decl_column : 9
    <dde5f>   DW_AT_sibling     : <0xddf7c>
 <2><dde63>: Abbrev Number: 1 (DW_TAG_member)
    <dde64>   DW_AT_name        : (indirect string, offset: 0x6547b): ext_data
    <dde68>   DW_AT_decl_file   : 6
    <dde69>   DW_AT_decl_line   : 258
    <dde6b>   DW_AT_decl_column : 12
    <dde6c>   DW_AT_type        : <0xdde07>
    <dde70>   DW_AT_data_member_location: 0
 <2><dde71>: Abbrev Number: 1 (DW_TAG_member)
    <dde72>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <dde76>   DW_AT_decl_file   : 6
    <dde77>   DW_AT_decl_line   : 259
    <dde79>   DW_AT_decl_column : 20
    <dde7a>   DW_AT_type        : <0xddf81>
    <dde7e>   DW_AT_data_member_location: 8
 <2><dde7f>: Abbrev Number: 1 (DW_TAG_member)
    <dde80>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <dde84>   DW_AT_decl_file   : 6
    <dde85>   DW_AT_decl_line   : 260
    <dde87>   DW_AT_decl_column : 9
    <dde88>   DW_AT_type        : <0xddcca>
    <dde8c>   DW_AT_data_member_location: 16
 <2><dde8d>: Abbrev Number: 1 (DW_TAG_member)
    <dde8e>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <dde92>   DW_AT_decl_file   : 6
    <dde93>   DW_AT_decl_line   : 261
    <dde95>   DW_AT_decl_column : 6
    <dde96>   DW_AT_type        : <0xddbdb>
    <dde9a>   DW_AT_data_member_location: 24
 <2><dde9b>: Abbrev Number: 1 (DW_TAG_member)
    <dde9c>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <ddea0>   DW_AT_decl_file   : 6
    <ddea1>   DW_AT_decl_line   : 261
    <ddea3>   DW_AT_decl_column : 13
    <ddea4>   DW_AT_type        : <0xddbdb>
    <ddea8>   DW_AT_data_member_location: 28
 <2><ddea9>: Abbrev Number: 1 (DW_TAG_member)
    <ddeaa>   DW_AT_name        : (indirect string, offset: 0x8ef5b): mwidth
    <ddeae>   DW_AT_decl_file   : 6
    <ddeaf>   DW_AT_decl_line   : 262
    <ddeb1>   DW_AT_decl_column : 6
    <ddeb2>   DW_AT_type        : <0xddbdb>
    <ddeb6>   DW_AT_data_member_location: 32
 <2><ddeb7>: Abbrev Number: 1 (DW_TAG_member)
    <ddeb8>   DW_AT_name        : (indirect string, offset: 0x8ec40): mheight
    <ddebc>   DW_AT_decl_file   : 6
    <ddebd>   DW_AT_decl_line   : 262
    <ddebf>   DW_AT_decl_column : 14
    <ddec0>   DW_AT_type        : <0xddbdb>
    <ddec4>   DW_AT_data_member_location: 36
 <2><ddec5>: Abbrev Number: 1 (DW_TAG_member)
    <ddec6>   DW_AT_name        : (indirect string, offset: 0x8ed65): ndepths
    <ddeca>   DW_AT_decl_file   : 6
    <ddecb>   DW_AT_decl_line   : 263
    <ddecd>   DW_AT_decl_column : 6
    <ddece>   DW_AT_type        : <0xddbdb>
    <dded2>   DW_AT_data_member_location: 40
 <2><dded3>: Abbrev Number: 1 (DW_TAG_member)
    <dded4>   DW_AT_name        : (indirect string, offset: 0x8ed66): depths
    <dded8>   DW_AT_decl_file   : 6
    <dded9>   DW_AT_decl_line   : 264
    <ddedb>   DW_AT_decl_column : 9
    <ddedc>   DW_AT_type        : <0xddf86>
    <ddee0>   DW_AT_data_member_location: 48
 <2><ddee1>: Abbrev Number: 1 (DW_TAG_member)
    <ddee2>   DW_AT_name        : (indirect string, offset: 0x8ea6b): root_depth
    <ddee6>   DW_AT_decl_file   : 6
    <ddee7>   DW_AT_decl_line   : 265
    <ddee9>   DW_AT_decl_column : 6
    <ddeea>   DW_AT_type        : <0xddbdb>
    <ddeee>   DW_AT_data_member_location: 56
 <2><ddeef>: Abbrev Number: 1 (DW_TAG_member)
    <ddef0>   DW_AT_name        : (indirect string, offset: 0x8ebbe): root_visual
    <ddef4>   DW_AT_decl_file   : 6
    <ddef5>   DW_AT_decl_line   : 266
    <ddef7>   DW_AT_decl_column : 10
    <ddef8>   DW_AT_type        : <0xdde49>
    <ddefc>   DW_AT_data_member_location: 64
 <2><ddefd>: Abbrev Number: 1 (DW_TAG_member)
    <ddefe>   DW_AT_name        : (indirect string, offset: 0x8ed1a): default_gc
    <ddf02>   DW_AT_decl_file   : 6
    <ddf03>   DW_AT_decl_line   : 267
    <ddf05>   DW_AT_decl_column : 5
    <ddf06>   DW_AT_type        : <0xddd80>
    <ddf0a>   DW_AT_data_member_location: 72
 <2><ddf0b>: Abbrev Number: 1 (DW_TAG_member)
    <ddf0c>   DW_AT_name        : (indirect string, offset: 0x8ebf6): cmap
    <ddf10>   DW_AT_decl_file   : 6
    <ddf11>   DW_AT_decl_line   : 268
    <ddf13>   DW_AT_decl_column : 11
    <ddf14>   DW_AT_type        : <0xddcfa>
    <ddf18>   DW_AT_data_member_location: 80
 <2><ddf19>: Abbrev Number: 1 (DW_TAG_member)
    <ddf1a>   DW_AT_name        : (indirect string, offset: 0x8edfe): white_pixel
    <ddf1e>   DW_AT_decl_file   : 6
    <ddf1f>   DW_AT_decl_line   : 269
    <ddf21>   DW_AT_decl_column : 16
    <ddf22>   DW_AT_type        : <0xddc08>
    <ddf26>   DW_AT_data_member_location: 88
 <2><ddf27>: Abbrev Number: 1 (DW_TAG_member)
    <ddf28>   DW_AT_name        : (indirect string, offset: 0x8ae26): black_pixel
    <ddf2c>   DW_AT_decl_file   : 6
    <ddf2d>   DW_AT_decl_line   : 270
    <ddf2f>   DW_AT_decl_column : 16
    <ddf30>   DW_AT_type        : <0xddc08>
    <ddf34>   DW_AT_data_member_location: 96
 <2><ddf35>: Abbrev Number: 1 (DW_TAG_member)
    <ddf36>   DW_AT_name        : (indirect string, offset: 0x8ec81): max_maps
    <ddf3a>   DW_AT_decl_file   : 6
    <ddf3b>   DW_AT_decl_line   : 271
    <ddf3d>   DW_AT_decl_column : 6
    <ddf3e>   DW_AT_type        : <0xddbdb>
    <ddf42>   DW_AT_data_member_location: 104
 <2><ddf43>: Abbrev Number: 1 (DW_TAG_member)
    <ddf44>   DW_AT_name        : (indirect string, offset: 0x8ee27): min_maps
    <ddf48>   DW_AT_decl_file   : 6
    <ddf49>   DW_AT_decl_line   : 271
    <ddf4b>   DW_AT_decl_column : 16
    <ddf4c>   DW_AT_type        : <0xddbdb>
    <ddf50>   DW_AT_data_member_location: 108
 <2><ddf51>: Abbrev Number: 1 (DW_TAG_member)
    <ddf52>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <ddf56>   DW_AT_decl_file   : 6
    <ddf57>   DW_AT_decl_line   : 272
    <ddf59>   DW_AT_decl_column : 6
    <ddf5a>   DW_AT_type        : <0xddbdb>
    <ddf5e>   DW_AT_data_member_location: 112
 <2><ddf5f>: Abbrev Number: 1 (DW_TAG_member)
    <ddf60>   DW_AT_name        : (indirect string, offset: 0x8eb52): save_unders
    <ddf64>   DW_AT_decl_file   : 6
    <ddf65>   DW_AT_decl_line   : 273
    <ddf67>   DW_AT_decl_column : 7
    <ddf68>   DW_AT_type        : <0xddbdb>
    <ddf6c>   DW_AT_data_member_location: 116
 <2><ddf6d>: Abbrev Number: 1 (DW_TAG_member)
    <ddf6e>   DW_AT_name        : (indirect string, offset: 0x8ea5b): root_input_mask
    <ddf72>   DW_AT_decl_file   : 6
    <ddf73>   DW_AT_decl_line   : 274
    <ddf75>   DW_AT_decl_column : 7
    <ddf76>   DW_AT_type        : <0xddc0f>
    <ddf7a>   DW_AT_data_member_location: 120
 <2><ddf7b>: Abbrev Number: 0
 <1><ddf7c>: Abbrev Number: 34 (DW_TAG_structure_type)
    <ddf7d>   DW_AT_name        : (indirect string, offset: 0x8bb46): _XDisplay
    <ddf81>   DW_AT_declaration : 1
 <1><ddf81>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ddf82>   DW_AT_byte_size   : 8
    <ddf82>   DW_AT_type        : <0xddf7c>
 <1><ddf86>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <ddf87>   DW_AT_byte_size   : 8
    <ddf87>   DW_AT_type        : <0xdde4e>
 <1><ddf8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <ddf8c>   DW_AT_name        : (indirect string, offset: 0x8e8ef): Screen
    <ddf90>   DW_AT_decl_file   : 6
    <ddf91>   DW_AT_decl_line   : 275
    <ddf93>   DW_AT_decl_column : 3
    <ddf94>   DW_AT_type        : <0xdde5a>
 <1><ddf98>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ddf99>   DW_AT_byte_size   : 112
    <ddf9a>   DW_AT_decl_file   : 6
    <ddf9b>   DW_AT_decl_line   : 290
    <ddf9d>   DW_AT_decl_column : 9
    <ddf9d>   DW_AT_sibling     : <0xde074>
 <2><ddfa1>: Abbrev Number: 1 (DW_TAG_member)
    <ddfa2>   DW_AT_name        : (indirect string, offset: 0x90467): background_pixmap
    <ddfa6>   DW_AT_decl_file   : 6
    <ddfa7>   DW_AT_decl_line   : 291
    <ddfa9>   DW_AT_decl_column : 12
    <ddfaa>   DW_AT_type        : <0xddce2>
    <ddfae>   DW_AT_data_member_location: 0
 <2><ddfaf>: Abbrev Number: 1 (DW_TAG_member)
    <ddfb0>   DW_AT_name        : (indirect string, offset: 0x9058a): background_pixel
    <ddfb4>   DW_AT_decl_file   : 6
    <ddfb5>   DW_AT_decl_line   : 292
    <ddfb7>   DW_AT_decl_column : 19
    <ddfb8>   DW_AT_type        : <0xddc08>
    <ddfbc>   DW_AT_data_member_location: 8
 <2><ddfbd>: Abbrev Number: 1 (DW_TAG_member)
    <ddfbe>   DW_AT_name        : (indirect string, offset: 0x902d9): border_pixmap
    <ddfc2>   DW_AT_decl_file   : 6
    <ddfc3>   DW_AT_decl_line   : 293
    <ddfc5>   DW_AT_decl_column : 12
    <ddfc6>   DW_AT_type        : <0xddce2>
    <ddfca>   DW_AT_data_member_location: 16
 <2><ddfcb>: Abbrev Number: 1 (DW_TAG_member)
    <ddfcc>   DW_AT_name        : (indirect string, offset: 0x9023b): border_pixel
    <ddfd0>   DW_AT_decl_file   : 6
    <ddfd1>   DW_AT_decl_line   : 294
    <ddfd3>   DW_AT_decl_column : 19
    <ddfd4>   DW_AT_type        : <0xddc08>
    <ddfd8>   DW_AT_data_member_location: 24
 <2><ddfd9>: Abbrev Number: 1 (DW_TAG_member)
    <ddfda>   DW_AT_name        : (indirect string, offset: 0x8fed3): bit_gravity
    <ddfde>   DW_AT_decl_file   : 6
    <ddfdf>   DW_AT_decl_line   : 295
    <ddfe1>   DW_AT_decl_column : 9
    <ddfe2>   DW_AT_type        : <0xddbdb>
    <ddfe6>   DW_AT_data_member_location: 32
 <2><ddfe7>: Abbrev Number: 1 (DW_TAG_member)
    <ddfe8>   DW_AT_name        : (indirect string, offset: 0x8fe0b): win_gravity
    <ddfec>   DW_AT_decl_file   : 6
    <ddfed>   DW_AT_decl_line   : 296
    <ddfef>   DW_AT_decl_column : 9
    <ddff0>   DW_AT_type        : <0xddbdb>
    <ddff4>   DW_AT_data_member_location: 36
 <2><ddff5>: Abbrev Number: 1 (DW_TAG_member)
    <ddff6>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <ddffa>   DW_AT_decl_file   : 6
    <ddffb>   DW_AT_decl_line   : 297
    <ddffd>   DW_AT_decl_column : 9
    <ddffe>   DW_AT_type        : <0xddbdb>
    <de002>   DW_AT_data_member_location: 40
 <2><de003>: Abbrev Number: 1 (DW_TAG_member)
    <de004>   DW_AT_name        : (indirect string, offset: 0x8ff2a): backing_planes
    <de008>   DW_AT_decl_file   : 6
    <de009>   DW_AT_decl_line   : 298
    <de00b>   DW_AT_decl_column : 19
    <de00c>   DW_AT_type        : <0xddc08>
    <de010>   DW_AT_data_member_location: 48
 <2><de011>: Abbrev Number: 1 (DW_TAG_member)
    <de012>   DW_AT_name        : (indirect string, offset: 0x8ff7b): backing_pixel
    <de016>   DW_AT_decl_file   : 6
    <de017>   DW_AT_decl_line   : 299
    <de019>   DW_AT_decl_column : 19
    <de01a>   DW_AT_type        : <0xddc08>
    <de01e>   DW_AT_data_member_location: 56
 <2><de01f>: Abbrev Number: 1 (DW_TAG_member)
    <de020>   DW_AT_name        : (indirect string, offset: 0x8fdce): save_under
    <de024>   DW_AT_decl_file   : 6
    <de025>   DW_AT_decl_line   : 300
    <de027>   DW_AT_decl_column : 10
    <de028>   DW_AT_type        : <0xddbdb>
    <de02c>   DW_AT_data_member_location: 64
 <2><de02d>: Abbrev Number: 1 (DW_TAG_member)
    <de02e>   DW_AT_name        : (indirect string, offset: 0x8fe27): event_mask
    <de032>   DW_AT_decl_file   : 6
    <de033>   DW_AT_decl_line   : 301
    <de035>   DW_AT_decl_column : 10
    <de036>   DW_AT_type        : <0xddc0f>
    <de03a>   DW_AT_data_member_location: 72
 <2><de03b>: Abbrev Number: 1 (DW_TAG_member)
    <de03c>   DW_AT_name        : (indirect string, offset: 0x8fdb8): do_not_propagate_mask
    <de040>   DW_AT_decl_file   : 6
    <de041>   DW_AT_decl_line   : 302
    <de043>   DW_AT_decl_column : 10
    <de044>   DW_AT_type        : <0xddc0f>
    <de048>   DW_AT_data_member_location: 80
 <2><de049>: Abbrev Number: 1 (DW_TAG_member)
    <de04a>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <de04e>   DW_AT_decl_file   : 6
    <de04f>   DW_AT_decl_line   : 303
    <de051>   DW_AT_decl_column : 10
    <de052>   DW_AT_type        : <0xddbdb>
    <de056>   DW_AT_data_member_location: 88
 <2><de057>: Abbrev Number: 1 (DW_TAG_member)
    <de058>   DW_AT_name        : (indirect string, offset: 0x60b73): colormap
    <de05c>   DW_AT_decl_file   : 6
    <de05d>   DW_AT_decl_line   : 304
    <de05f>   DW_AT_decl_column : 14
    <de060>   DW_AT_type        : <0xddcfa>
    <de064>   DW_AT_data_member_location: 96
 <2><de065>: Abbrev Number: 1 (DW_TAG_member)
    <de066>   DW_AT_name        : (indirect string, offset: 0x7d4c3): cursor
    <de06a>   DW_AT_decl_file   : 6
    <de06b>   DW_AT_decl_line   : 305
    <de06d>   DW_AT_decl_column : 12
    <de06e>   DW_AT_type        : <0xddcee>
    <de072>   DW_AT_data_member_location: 104
 <2><de073>: Abbrev Number: 0
 <1><de074>: Abbrev Number: 5 (DW_TAG_typedef)
    <de075>   DW_AT_name        : (indirect string, offset: 0x9034c): XSetWindowAttributes
    <de079>   DW_AT_decl_file   : 6
    <de07a>   DW_AT_decl_line   : 306
    <de07c>   DW_AT_decl_column : 3
    <de07d>   DW_AT_type        : <0xddf98>
 <1><de081>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de082>   DW_AT_byte_size   : 136
    <de083>   DW_AT_decl_file   : 6
    <de084>   DW_AT_decl_line   : 308
    <de086>   DW_AT_decl_column : 9
    <de086>   DW_AT_sibling     : <0xde1c9>
 <2><de08a>: Abbrev Number: 11 (DW_TAG_member)
    <de08b>   DW_AT_name        : x
    <de08d>   DW_AT_decl_file   : 6
    <de08e>   DW_AT_decl_line   : 309
    <de090>   DW_AT_decl_column : 9
    <de091>   DW_AT_type        : <0xddbdb>
    <de095>   DW_AT_data_member_location: 0
 <2><de096>: Abbrev Number: 11 (DW_TAG_member)
    <de097>   DW_AT_name        : y
    <de099>   DW_AT_decl_file   : 6
    <de09a>   DW_AT_decl_line   : 309
    <de09c>   DW_AT_decl_column : 12
    <de09d>   DW_AT_type        : <0xddbdb>
    <de0a1>   DW_AT_data_member_location: 4
 <2><de0a2>: Abbrev Number: 1 (DW_TAG_member)
    <de0a3>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <de0a7>   DW_AT_decl_file   : 6
    <de0a8>   DW_AT_decl_line   : 310
    <de0aa>   DW_AT_decl_column : 9
    <de0ab>   DW_AT_type        : <0xddbdb>
    <de0af>   DW_AT_data_member_location: 8
 <2><de0b0>: Abbrev Number: 1 (DW_TAG_member)
    <de0b1>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <de0b5>   DW_AT_decl_file   : 6
    <de0b6>   DW_AT_decl_line   : 310
    <de0b8>   DW_AT_decl_column : 16
    <de0b9>   DW_AT_type        : <0xddbdb>
    <de0bd>   DW_AT_data_member_location: 12
 <2><de0be>: Abbrev Number: 1 (DW_TAG_member)
    <de0bf>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <de0c3>   DW_AT_decl_file   : 6
    <de0c4>   DW_AT_decl_line   : 311
    <de0c6>   DW_AT_decl_column : 9
    <de0c7>   DW_AT_type        : <0xddbdb>
    <de0cb>   DW_AT_data_member_location: 16
 <2><de0cc>: Abbrev Number: 1 (DW_TAG_member)
    <de0cd>   DW_AT_name        : (indirect string, offset: 0x8c81f): depth
    <de0d1>   DW_AT_decl_file   : 6
    <de0d2>   DW_AT_decl_line   : 312
    <de0d4>   DW_AT_decl_column : 9
    <de0d5>   DW_AT_type        : <0xddbdb>
    <de0d9>   DW_AT_data_member_location: 20
 <2><de0da>: Abbrev Number: 1 (DW_TAG_member)
    <de0db>   DW_AT_name        : (indirect string, offset: 0x8ebc3): visual
    <de0df>   DW_AT_decl_file   : 6
    <de0e0>   DW_AT_decl_line   : 313
    <de0e2>   DW_AT_decl_column : 13
    <de0e3>   DW_AT_type        : <0xdde49>
    <de0e7>   DW_AT_data_member_location: 24
 <2><de0e8>: Abbrev Number: 1 (DW_TAG_member)
    <de0e9>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <de0ed>   DW_AT_decl_file   : 6
    <de0ee>   DW_AT_decl_line   : 314
    <de0f0>   DW_AT_decl_column : 12
    <de0f1>   DW_AT_type        : <0xddcca>
    <de0f5>   DW_AT_data_member_location: 32
 <2><de0f6>: Abbrev Number: 1 (DW_TAG_member)
    <de0f7>   DW_AT_name        : (indirect string, offset: 0x7e4d3): class
    <de0fb>   DW_AT_decl_file   : 6
    <de0fc>   DW_AT_decl_line   : 318
    <de0fe>   DW_AT_decl_column : 9
    <de0ff>   DW_AT_type        : <0xddbdb>
    <de103>   DW_AT_data_member_location: 40
 <2><de104>: Abbrev Number: 1 (DW_TAG_member)
    <de105>   DW_AT_name        : (indirect string, offset: 0x8fed3): bit_gravity
    <de109>   DW_AT_decl_file   : 6
    <de10a>   DW_AT_decl_line   : 320
    <de10c>   DW_AT_decl_column : 9
    <de10d>   DW_AT_type        : <0xddbdb>
    <de111>   DW_AT_data_member_location: 44
 <2><de112>: Abbrev Number: 1 (DW_TAG_member)
    <de113>   DW_AT_name        : (indirect string, offset: 0x8fe0b): win_gravity
    <de117>   DW_AT_decl_file   : 6
    <de118>   DW_AT_decl_line   : 321
    <de11a>   DW_AT_decl_column : 9
    <de11b>   DW_AT_type        : <0xddbdb>
    <de11f>   DW_AT_data_member_location: 48
 <2><de120>: Abbrev Number: 1 (DW_TAG_member)
    <de121>   DW_AT_name        : (indirect string, offset: 0x8ec1b): backing_store
    <de125>   DW_AT_decl_file   : 6
    <de126>   DW_AT_decl_line   : 322
    <de128>   DW_AT_decl_column : 9
    <de129>   DW_AT_type        : <0xddbdb>
    <de12d>   DW_AT_data_member_location: 52
 <2><de12e>: Abbrev Number: 1 (DW_TAG_member)
    <de12f>   DW_AT_name        : (indirect string, offset: 0x8ff2a): backing_planes
    <de133>   DW_AT_decl_file   : 6
    <de134>   DW_AT_decl_line   : 323
    <de136>   DW_AT_decl_column : 19
    <de137>   DW_AT_type        : <0xddc08>
    <de13b>   DW_AT_data_member_location: 56
 <2><de13c>: Abbrev Number: 1 (DW_TAG_member)
    <de13d>   DW_AT_name        : (indirect string, offset: 0x8ff7b): backing_pixel
    <de141>   DW_AT_decl_file   : 6
    <de142>   DW_AT_decl_line   : 324
    <de144>   DW_AT_decl_column : 19
    <de145>   DW_AT_type        : <0xddc08>
    <de149>   DW_AT_data_member_location: 64
 <2><de14a>: Abbrev Number: 1 (DW_TAG_member)
    <de14b>   DW_AT_name        : (indirect string, offset: 0x8fdce): save_under
    <de14f>   DW_AT_decl_file   : 6
    <de150>   DW_AT_decl_line   : 325
    <de152>   DW_AT_decl_column : 10
    <de153>   DW_AT_type        : <0xddbdb>
    <de157>   DW_AT_data_member_location: 72
 <2><de158>: Abbrev Number: 1 (DW_TAG_member)
    <de159>   DW_AT_name        : (indirect string, offset: 0x60b73): colormap
    <de15d>   DW_AT_decl_file   : 6
    <de15e>   DW_AT_decl_line   : 326
    <de160>   DW_AT_decl_column : 14
    <de161>   DW_AT_type        : <0xddcfa>
    <de165>   DW_AT_data_member_location: 80
 <2><de166>: Abbrev Number: 1 (DW_TAG_member)
    <de167>   DW_AT_name        : (indirect string, offset: 0x8ff44): map_installed
    <de16b>   DW_AT_decl_file   : 6
    <de16c>   DW_AT_decl_line   : 327
    <de16e>   DW_AT_decl_column : 10
    <de16f>   DW_AT_type        : <0xddbdb>
    <de173>   DW_AT_data_member_location: 88
 <2><de174>: Abbrev Number: 1 (DW_TAG_member)
    <de175>   DW_AT_name        : (indirect string, offset: 0x8feae): map_state
    <de179>   DW_AT_decl_file   : 6
    <de17a>   DW_AT_decl_line   : 328
    <de17c>   DW_AT_decl_column : 9
    <de17d>   DW_AT_type        : <0xddbdb>
    <de181>   DW_AT_data_member_location: 92
 <2><de182>: Abbrev Number: 1 (DW_TAG_member)
    <de183>   DW_AT_name        : (indirect string, offset: 0x8fe80): all_event_masks
    <de187>   DW_AT_decl_file   : 6
    <de188>   DW_AT_decl_line   : 329
    <de18a>   DW_AT_decl_column : 10
    <de18b>   DW_AT_type        : <0xddc0f>
    <de18f>   DW_AT_data_member_location: 96
 <2><de190>: Abbrev Number: 1 (DW_TAG_member)
    <de191>   DW_AT_name        : (indirect string, offset: 0x8fe22): your_event_mask
    <de195>   DW_AT_decl_file   : 6
    <de196>   DW_AT_decl_line   : 330
    <de198>   DW_AT_decl_column : 10
    <de199>   DW_AT_type        : <0xddc0f>
    <de19d>   DW_AT_data_member_location: 104
 <2><de19e>: Abbrev Number: 1 (DW_TAG_member)
    <de19f>   DW_AT_name        : (indirect string, offset: 0x8fdb8): do_not_propagate_mask
    <de1a3>   DW_AT_decl_file   : 6
    <de1a4>   DW_AT_decl_line   : 331
    <de1a6>   DW_AT_decl_column : 10
    <de1a7>   DW_AT_type        : <0xddc0f>
    <de1ab>   DW_AT_data_member_location: 112
 <2><de1ac>: Abbrev Number: 1 (DW_TAG_member)
    <de1ad>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <de1b1>   DW_AT_decl_file   : 6
    <de1b2>   DW_AT_decl_line   : 332
    <de1b4>   DW_AT_decl_column : 10
    <de1b5>   DW_AT_type        : <0xddbdb>
    <de1b9>   DW_AT_data_member_location: 120
 <2><de1ba>: Abbrev Number: 1 (DW_TAG_member)
    <de1bb>   DW_AT_name        : (indirect string, offset: 0x4e7ec): screen
    <de1bf>   DW_AT_decl_file   : 6
    <de1c0>   DW_AT_decl_line   : 333
    <de1c2>   DW_AT_decl_column : 13
    <de1c3>   DW_AT_type        : <0xde1c9>
    <de1c7>   DW_AT_data_member_location: 128
 <2><de1c8>: Abbrev Number: 0
 <1><de1c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <de1ca>   DW_AT_byte_size   : 8
    <de1ca>   DW_AT_type        : <0xddf8b>
 <1><de1ce>: Abbrev Number: 5 (DW_TAG_typedef)
    <de1cf>   DW_AT_name        : (indirect string, offset: 0x8fde7): XWindowAttributes
    <de1d3>   DW_AT_decl_file   : 6
    <de1d4>   DW_AT_decl_line   : 334
    <de1d6>   DW_AT_decl_column : 3
    <de1d7>   DW_AT_type        : <0xde081>
 <1><de1db>: Abbrev Number: 5 (DW_TAG_typedef)
    <de1dc>   DW_AT_name        : (indirect string, offset: 0x8f3f5): Display
    <de1e0>   DW_AT_decl_file   : 6
    <de1e1>   DW_AT_decl_line   : 487
    <de1e3>   DW_AT_decl_column : 26
    <de1e4>   DW_AT_type        : <0xddf7c>
 <1><de1e8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de1e9>   DW_AT_byte_size   : 96
    <de1ea>   DW_AT_decl_file   : 6
    <de1eb>   DW_AT_decl_line   : 557
    <de1ed>   DW_AT_decl_column : 9
    <de1ed>   DW_AT_sibling     : <0xde2c0>
 <2><de1f1>: Abbrev Number: 1 (DW_TAG_member)
    <de1f2>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de1f6>   DW_AT_decl_file   : 6
    <de1f7>   DW_AT_decl_line   : 558
    <de1f9>   DW_AT_decl_column : 6
    <de1fa>   DW_AT_type        : <0xddbdb>
    <de1fe>   DW_AT_data_member_location: 0
 <2><de1ff>: Abbrev Number: 1 (DW_TAG_member)
    <de200>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de204>   DW_AT_decl_file   : 6
    <de205>   DW_AT_decl_line   : 559
    <de207>   DW_AT_decl_column : 16
    <de208>   DW_AT_type        : <0xddc08>
    <de20c>   DW_AT_data_member_location: 8
 <2><de20d>: Abbrev Number: 1 (DW_TAG_member)
    <de20e>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de212>   DW_AT_decl_file   : 6
    <de213>   DW_AT_decl_line   : 560
    <de215>   DW_AT_decl_column : 7
    <de216>   DW_AT_type        : <0xddbdb>
    <de21a>   DW_AT_data_member_location: 16
 <2><de21b>: Abbrev Number: 1 (DW_TAG_member)
    <de21c>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de220>   DW_AT_decl_file   : 6
    <de221>   DW_AT_decl_line   : 561
    <de223>   DW_AT_decl_column : 11
    <de224>   DW_AT_type        : <0xde2c0>
    <de228>   DW_AT_data_member_location: 24
 <2><de229>: Abbrev Number: 1 (DW_TAG_member)
    <de22a>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de22e>   DW_AT_decl_file   : 6
    <de22f>   DW_AT_decl_line   : 562
    <de231>   DW_AT_decl_column : 9
    <de232>   DW_AT_type        : <0xddcca>
    <de236>   DW_AT_data_member_location: 32
 <2><de237>: Abbrev Number: 1 (DW_TAG_member)
    <de238>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <de23c>   DW_AT_decl_file   : 6
    <de23d>   DW_AT_decl_line   : 563
    <de23f>   DW_AT_decl_column : 9
    <de240>   DW_AT_type        : <0xddcca>
    <de244>   DW_AT_data_member_location: 40
 <2><de245>: Abbrev Number: 1 (DW_TAG_member)
    <de246>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <de24a>   DW_AT_decl_file   : 6
    <de24b>   DW_AT_decl_line   : 564
    <de24d>   DW_AT_decl_column : 9
    <de24e>   DW_AT_type        : <0xddcca>
    <de252>   DW_AT_data_member_location: 48
 <2><de253>: Abbrev Number: 1 (DW_TAG_member)
    <de254>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <de258>   DW_AT_decl_file   : 6
    <de259>   DW_AT_decl_line   : 565
    <de25b>   DW_AT_decl_column : 7
    <de25c>   DW_AT_type        : <0xddcbe>
    <de260>   DW_AT_data_member_location: 56
 <2><de261>: Abbrev Number: 11 (DW_TAG_member)
    <de262>   DW_AT_name        : x
    <de264>   DW_AT_decl_file   : 6
    <de265>   DW_AT_decl_line   : 566
    <de267>   DW_AT_decl_column : 6
    <de268>   DW_AT_type        : <0xddbdb>
    <de26c>   DW_AT_data_member_location: 64
 <2><de26d>: Abbrev Number: 11 (DW_TAG_member)
    <de26e>   DW_AT_name        : y
    <de270>   DW_AT_decl_file   : 6
    <de271>   DW_AT_decl_line   : 566
    <de273>   DW_AT_decl_column : 9
    <de274>   DW_AT_type        : <0xddbdb>
    <de278>   DW_AT_data_member_location: 68
 <2><de279>: Abbrev Number: 1 (DW_TAG_member)
    <de27a>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <de27e>   DW_AT_decl_file   : 6
    <de27f>   DW_AT_decl_line   : 567
    <de281>   DW_AT_decl_column : 6
    <de282>   DW_AT_type        : <0xddbdb>
    <de286>   DW_AT_data_member_location: 72
 <2><de287>: Abbrev Number: 1 (DW_TAG_member)
    <de288>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <de28c>   DW_AT_decl_file   : 6
    <de28d>   DW_AT_decl_line   : 567
    <de28f>   DW_AT_decl_column : 14
    <de290>   DW_AT_type        : <0xddbdb>
    <de294>   DW_AT_data_member_location: 76
 <2><de295>: Abbrev Number: 1 (DW_TAG_member)
    <de296>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <de29a>   DW_AT_decl_file   : 6
    <de29b>   DW_AT_decl_line   : 568
    <de29d>   DW_AT_decl_column : 15
    <de29e>   DW_AT_type        : <0xddba7>
    <de2a2>   DW_AT_data_member_location: 80
 <2><de2a3>: Abbrev Number: 1 (DW_TAG_member)
    <de2a4>   DW_AT_name        : (indirect string, offset: 0x8eb7f): keycode
    <de2a8>   DW_AT_decl_file   : 6
    <de2a9>   DW_AT_decl_line   : 569
    <de2ab>   DW_AT_decl_column : 15
    <de2ac>   DW_AT_type        : <0xddba7>
    <de2b0>   DW_AT_data_member_location: 84
 <2><de2b1>: Abbrev Number: 1 (DW_TAG_member)
    <de2b2>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <de2b6>   DW_AT_decl_file   : 6
    <de2b7>   DW_AT_decl_line   : 570
    <de2b9>   DW_AT_decl_column : 7
    <de2ba>   DW_AT_type        : <0xddbdb>
    <de2be>   DW_AT_data_member_location: 88
 <2><de2bf>: Abbrev Number: 0
 <1><de2c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <de2c1>   DW_AT_byte_size   : 8
    <de2c1>   DW_AT_type        : <0xde1db>
 <1><de2c5>: Abbrev Number: 5 (DW_TAG_typedef)
    <de2c6>   DW_AT_name        : (indirect string, offset: 0x6d211): XKeyEvent
    <de2ca>   DW_AT_decl_file   : 6
    <de2cb>   DW_AT_decl_line   : 571
    <de2cd>   DW_AT_decl_column : 3
    <de2ce>   DW_AT_type        : <0xde1e8>
 <1><de2d2>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de2d3>   DW_AT_byte_size   : 96
    <de2d4>   DW_AT_decl_file   : 6
    <de2d5>   DW_AT_decl_line   : 575
    <de2d7>   DW_AT_decl_column : 9
    <de2d7>   DW_AT_sibling     : <0xde3aa>
 <2><de2db>: Abbrev Number: 1 (DW_TAG_member)
    <de2dc>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de2e0>   DW_AT_decl_file   : 6
    <de2e1>   DW_AT_decl_line   : 576
    <de2e3>   DW_AT_decl_column : 6
    <de2e4>   DW_AT_type        : <0xddbdb>
    <de2e8>   DW_AT_data_member_location: 0
 <2><de2e9>: Abbrev Number: 1 (DW_TAG_member)
    <de2ea>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de2ee>   DW_AT_decl_file   : 6
    <de2ef>   DW_AT_decl_line   : 577
    <de2f1>   DW_AT_decl_column : 16
    <de2f2>   DW_AT_type        : <0xddc08>
    <de2f6>   DW_AT_data_member_location: 8
 <2><de2f7>: Abbrev Number: 1 (DW_TAG_member)
    <de2f8>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de2fc>   DW_AT_decl_file   : 6
    <de2fd>   DW_AT_decl_line   : 578
    <de2ff>   DW_AT_decl_column : 7
    <de300>   DW_AT_type        : <0xddbdb>
    <de304>   DW_AT_data_member_location: 16
 <2><de305>: Abbrev Number: 1 (DW_TAG_member)
    <de306>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de30a>   DW_AT_decl_file   : 6
    <de30b>   DW_AT_decl_line   : 579
    <de30d>   DW_AT_decl_column : 11
    <de30e>   DW_AT_type        : <0xde2c0>
    <de312>   DW_AT_data_member_location: 24
 <2><de313>: Abbrev Number: 1 (DW_TAG_member)
    <de314>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de318>   DW_AT_decl_file   : 6
    <de319>   DW_AT_decl_line   : 580
    <de31b>   DW_AT_decl_column : 9
    <de31c>   DW_AT_type        : <0xddcca>
    <de320>   DW_AT_data_member_location: 32
 <2><de321>: Abbrev Number: 1 (DW_TAG_member)
    <de322>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <de326>   DW_AT_decl_file   : 6
    <de327>   DW_AT_decl_line   : 581
    <de329>   DW_AT_decl_column : 9
    <de32a>   DW_AT_type        : <0xddcca>
    <de32e>   DW_AT_data_member_location: 40
 <2><de32f>: Abbrev Number: 1 (DW_TAG_member)
    <de330>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <de334>   DW_AT_decl_file   : 6
    <de335>   DW_AT_decl_line   : 582
    <de337>   DW_AT_decl_column : 9
    <de338>   DW_AT_type        : <0xddcca>
    <de33c>   DW_AT_data_member_location: 48
 <2><de33d>: Abbrev Number: 1 (DW_TAG_member)
    <de33e>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <de342>   DW_AT_decl_file   : 6
    <de343>   DW_AT_decl_line   : 583
    <de345>   DW_AT_decl_column : 7
    <de346>   DW_AT_type        : <0xddcbe>
    <de34a>   DW_AT_data_member_location: 56
 <2><de34b>: Abbrev Number: 11 (DW_TAG_member)
    <de34c>   DW_AT_name        : x
    <de34e>   DW_AT_decl_file   : 6
    <de34f>   DW_AT_decl_line   : 584
    <de351>   DW_AT_decl_column : 6
    <de352>   DW_AT_type        : <0xddbdb>
    <de356>   DW_AT_data_member_location: 64
 <2><de357>: Abbrev Number: 11 (DW_TAG_member)
    <de358>   DW_AT_name        : y
    <de35a>   DW_AT_decl_file   : 6
    <de35b>   DW_AT_decl_line   : 584
    <de35d>   DW_AT_decl_column : 9
    <de35e>   DW_AT_type        : <0xddbdb>
    <de362>   DW_AT_data_member_location: 68
 <2><de363>: Abbrev Number: 1 (DW_TAG_member)
    <de364>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <de368>   DW_AT_decl_file   : 6
    <de369>   DW_AT_decl_line   : 585
    <de36b>   DW_AT_decl_column : 6
    <de36c>   DW_AT_type        : <0xddbdb>
    <de370>   DW_AT_data_member_location: 72
 <2><de371>: Abbrev Number: 1 (DW_TAG_member)
    <de372>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <de376>   DW_AT_decl_file   : 6
    <de377>   DW_AT_decl_line   : 585
    <de379>   DW_AT_decl_column : 14
    <de37a>   DW_AT_type        : <0xddbdb>
    <de37e>   DW_AT_data_member_location: 76
 <2><de37f>: Abbrev Number: 1 (DW_TAG_member)
    <de380>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <de384>   DW_AT_decl_file   : 6
    <de385>   DW_AT_decl_line   : 586
    <de387>   DW_AT_decl_column : 15
    <de388>   DW_AT_type        : <0xddba7>
    <de38c>   DW_AT_data_member_location: 80
 <2><de38d>: Abbrev Number: 1 (DW_TAG_member)
    <de38e>   DW_AT_name        : (indirect string, offset: 0x48b67): button
    <de392>   DW_AT_decl_file   : 6
    <de393>   DW_AT_decl_line   : 587
    <de395>   DW_AT_decl_column : 15
    <de396>   DW_AT_type        : <0xddba7>
    <de39a>   DW_AT_data_member_location: 84
 <2><de39b>: Abbrev Number: 1 (DW_TAG_member)
    <de39c>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <de3a0>   DW_AT_decl_file   : 6
    <de3a1>   DW_AT_decl_line   : 588
    <de3a3>   DW_AT_decl_column : 7
    <de3a4>   DW_AT_type        : <0xddbdb>
    <de3a8>   DW_AT_data_member_location: 88
 <2><de3a9>: Abbrev Number: 0
 <1><de3aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <de3ab>   DW_AT_name        : (indirect string, offset: 0x84cdb): XButtonEvent
    <de3af>   DW_AT_decl_file   : 6
    <de3b0>   DW_AT_decl_line   : 589
    <de3b2>   DW_AT_decl_column : 3
    <de3b3>   DW_AT_type        : <0xde2d2>
 <1><de3b7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de3b8>   DW_AT_byte_size   : 96
    <de3b9>   DW_AT_decl_file   : 6
    <de3ba>   DW_AT_decl_line   : 593
    <de3bc>   DW_AT_decl_column : 9
    <de3bc>   DW_AT_sibling     : <0xde48f>
 <2><de3c0>: Abbrev Number: 1 (DW_TAG_member)
    <de3c1>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de3c5>   DW_AT_decl_file   : 6
    <de3c6>   DW_AT_decl_line   : 594
    <de3c8>   DW_AT_decl_column : 6
    <de3c9>   DW_AT_type        : <0xddbdb>
    <de3cd>   DW_AT_data_member_location: 0
 <2><de3ce>: Abbrev Number: 1 (DW_TAG_member)
    <de3cf>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de3d3>   DW_AT_decl_file   : 6
    <de3d4>   DW_AT_decl_line   : 595
    <de3d6>   DW_AT_decl_column : 16
    <de3d7>   DW_AT_type        : <0xddc08>
    <de3db>   DW_AT_data_member_location: 8
 <2><de3dc>: Abbrev Number: 1 (DW_TAG_member)
    <de3dd>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de3e1>   DW_AT_decl_file   : 6
    <de3e2>   DW_AT_decl_line   : 596
    <de3e4>   DW_AT_decl_column : 7
    <de3e5>   DW_AT_type        : <0xddbdb>
    <de3e9>   DW_AT_data_member_location: 16
 <2><de3ea>: Abbrev Number: 1 (DW_TAG_member)
    <de3eb>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de3ef>   DW_AT_decl_file   : 6
    <de3f0>   DW_AT_decl_line   : 597
    <de3f2>   DW_AT_decl_column : 11
    <de3f3>   DW_AT_type        : <0xde2c0>
    <de3f7>   DW_AT_data_member_location: 24
 <2><de3f8>: Abbrev Number: 1 (DW_TAG_member)
    <de3f9>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de3fd>   DW_AT_decl_file   : 6
    <de3fe>   DW_AT_decl_line   : 598
    <de400>   DW_AT_decl_column : 9
    <de401>   DW_AT_type        : <0xddcca>
    <de405>   DW_AT_data_member_location: 32
 <2><de406>: Abbrev Number: 1 (DW_TAG_member)
    <de407>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <de40b>   DW_AT_decl_file   : 6
    <de40c>   DW_AT_decl_line   : 599
    <de40e>   DW_AT_decl_column : 9
    <de40f>   DW_AT_type        : <0xddcca>
    <de413>   DW_AT_data_member_location: 40
 <2><de414>: Abbrev Number: 1 (DW_TAG_member)
    <de415>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <de419>   DW_AT_decl_file   : 6
    <de41a>   DW_AT_decl_line   : 600
    <de41c>   DW_AT_decl_column : 9
    <de41d>   DW_AT_type        : <0xddcca>
    <de421>   DW_AT_data_member_location: 48
 <2><de422>: Abbrev Number: 1 (DW_TAG_member)
    <de423>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <de427>   DW_AT_decl_file   : 6
    <de428>   DW_AT_decl_line   : 601
    <de42a>   DW_AT_decl_column : 7
    <de42b>   DW_AT_type        : <0xddcbe>
    <de42f>   DW_AT_data_member_location: 56
 <2><de430>: Abbrev Number: 11 (DW_TAG_member)
    <de431>   DW_AT_name        : x
    <de433>   DW_AT_decl_file   : 6
    <de434>   DW_AT_decl_line   : 602
    <de436>   DW_AT_decl_column : 6
    <de437>   DW_AT_type        : <0xddbdb>
    <de43b>   DW_AT_data_member_location: 64
 <2><de43c>: Abbrev Number: 11 (DW_TAG_member)
    <de43d>   DW_AT_name        : y
    <de43f>   DW_AT_decl_file   : 6
    <de440>   DW_AT_decl_line   : 602
    <de442>   DW_AT_decl_column : 9
    <de443>   DW_AT_type        : <0xddbdb>
    <de447>   DW_AT_data_member_location: 68
 <2><de448>: Abbrev Number: 1 (DW_TAG_member)
    <de449>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <de44d>   DW_AT_decl_file   : 6
    <de44e>   DW_AT_decl_line   : 603
    <de450>   DW_AT_decl_column : 6
    <de451>   DW_AT_type        : <0xddbdb>
    <de455>   DW_AT_data_member_location: 72
 <2><de456>: Abbrev Number: 1 (DW_TAG_member)
    <de457>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <de45b>   DW_AT_decl_file   : 6
    <de45c>   DW_AT_decl_line   : 603
    <de45e>   DW_AT_decl_column : 14
    <de45f>   DW_AT_type        : <0xddbdb>
    <de463>   DW_AT_data_member_location: 76
 <2><de464>: Abbrev Number: 1 (DW_TAG_member)
    <de465>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <de469>   DW_AT_decl_file   : 6
    <de46a>   DW_AT_decl_line   : 604
    <de46c>   DW_AT_decl_column : 15
    <de46d>   DW_AT_type        : <0xddba7>
    <de471>   DW_AT_data_member_location: 80
 <2><de472>: Abbrev Number: 1 (DW_TAG_member)
    <de473>   DW_AT_name        : (indirect string, offset: 0x5e6a8): is_hint
    <de477>   DW_AT_decl_file   : 6
    <de478>   DW_AT_decl_line   : 605
    <de47a>   DW_AT_decl_column : 7
    <de47b>   DW_AT_type        : <0xddc1d>
    <de47f>   DW_AT_data_member_location: 84
 <2><de480>: Abbrev Number: 1 (DW_TAG_member)
    <de481>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <de485>   DW_AT_decl_file   : 6
    <de486>   DW_AT_decl_line   : 606
    <de488>   DW_AT_decl_column : 7
    <de489>   DW_AT_type        : <0xddbdb>
    <de48d>   DW_AT_data_member_location: 88
 <2><de48e>: Abbrev Number: 0
 <1><de48f>: Abbrev Number: 5 (DW_TAG_typedef)
    <de490>   DW_AT_name        : (indirect string, offset: 0x6223d): XMotionEvent
    <de494>   DW_AT_decl_file   : 6
    <de495>   DW_AT_decl_line   : 607
    <de497>   DW_AT_decl_column : 3
    <de498>   DW_AT_type        : <0xde3b7>
 <1><de49c>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de49d>   DW_AT_byte_size   : 104
    <de49e>   DW_AT_decl_file   : 6
    <de49f>   DW_AT_decl_line   : 610
    <de4a1>   DW_AT_decl_column : 9
    <de4a1>   DW_AT_sibling     : <0xde590>
 <2><de4a5>: Abbrev Number: 1 (DW_TAG_member)
    <de4a6>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de4aa>   DW_AT_decl_file   : 6
    <de4ab>   DW_AT_decl_line   : 611
    <de4ad>   DW_AT_decl_column : 6
    <de4ae>   DW_AT_type        : <0xddbdb>
    <de4b2>   DW_AT_data_member_location: 0
 <2><de4b3>: Abbrev Number: 1 (DW_TAG_member)
    <de4b4>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de4b8>   DW_AT_decl_file   : 6
    <de4b9>   DW_AT_decl_line   : 612
    <de4bb>   DW_AT_decl_column : 16
    <de4bc>   DW_AT_type        : <0xddc08>
    <de4c0>   DW_AT_data_member_location: 8
 <2><de4c1>: Abbrev Number: 1 (DW_TAG_member)
    <de4c2>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de4c6>   DW_AT_decl_file   : 6
    <de4c7>   DW_AT_decl_line   : 613
    <de4c9>   DW_AT_decl_column : 7
    <de4ca>   DW_AT_type        : <0xddbdb>
    <de4ce>   DW_AT_data_member_location: 16
 <2><de4cf>: Abbrev Number: 1 (DW_TAG_member)
    <de4d0>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de4d4>   DW_AT_decl_file   : 6
    <de4d5>   DW_AT_decl_line   : 614
    <de4d7>   DW_AT_decl_column : 11
    <de4d8>   DW_AT_type        : <0xde2c0>
    <de4dc>   DW_AT_data_member_location: 24
 <2><de4dd>: Abbrev Number: 1 (DW_TAG_member)
    <de4de>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de4e2>   DW_AT_decl_file   : 6
    <de4e3>   DW_AT_decl_line   : 615
    <de4e5>   DW_AT_decl_column : 9
    <de4e6>   DW_AT_type        : <0xddcca>
    <de4ea>   DW_AT_data_member_location: 32
 <2><de4eb>: Abbrev Number: 1 (DW_TAG_member)
    <de4ec>   DW_AT_name        : (indirect string, offset: 0x687c5): root
    <de4f0>   DW_AT_decl_file   : 6
    <de4f1>   DW_AT_decl_line   : 616
    <de4f3>   DW_AT_decl_column : 9
    <de4f4>   DW_AT_type        : <0xddcca>
    <de4f8>   DW_AT_data_member_location: 40
 <2><de4f9>: Abbrev Number: 1 (DW_TAG_member)
    <de4fa>   DW_AT_name        : (indirect string, offset: 0x8c377): subwindow
    <de4fe>   DW_AT_decl_file   : 6
    <de4ff>   DW_AT_decl_line   : 617
    <de501>   DW_AT_decl_column : 9
    <de502>   DW_AT_type        : <0xddcca>
    <de506>   DW_AT_data_member_location: 48
 <2><de507>: Abbrev Number: 1 (DW_TAG_member)
    <de508>   DW_AT_name        : (indirect string, offset: 0x826ce): time
    <de50c>   DW_AT_decl_file   : 6
    <de50d>   DW_AT_decl_line   : 618
    <de50f>   DW_AT_decl_column : 7
    <de510>   DW_AT_type        : <0xddcbe>
    <de514>   DW_AT_data_member_location: 56
 <2><de515>: Abbrev Number: 11 (DW_TAG_member)
    <de516>   DW_AT_name        : x
    <de518>   DW_AT_decl_file   : 6
    <de519>   DW_AT_decl_line   : 619
    <de51b>   DW_AT_decl_column : 6
    <de51c>   DW_AT_type        : <0xddbdb>
    <de520>   DW_AT_data_member_location: 64
 <2><de521>: Abbrev Number: 11 (DW_TAG_member)
    <de522>   DW_AT_name        : y
    <de524>   DW_AT_decl_file   : 6
    <de525>   DW_AT_decl_line   : 619
    <de527>   DW_AT_decl_column : 9
    <de528>   DW_AT_type        : <0xddbdb>
    <de52c>   DW_AT_data_member_location: 68
 <2><de52d>: Abbrev Number: 1 (DW_TAG_member)
    <de52e>   DW_AT_name        : (indirect string, offset: 0x687c3): x_root
    <de532>   DW_AT_decl_file   : 6
    <de533>   DW_AT_decl_line   : 620
    <de535>   DW_AT_decl_column : 6
    <de536>   DW_AT_type        : <0xddbdb>
    <de53a>   DW_AT_data_member_location: 72
 <2><de53b>: Abbrev Number: 1 (DW_TAG_member)
    <de53c>   DW_AT_name        : (indirect string, offset: 0x7e339): y_root
    <de540>   DW_AT_decl_file   : 6
    <de541>   DW_AT_decl_line   : 620
    <de543>   DW_AT_decl_column : 14
    <de544>   DW_AT_type        : <0xddbdb>
    <de548>   DW_AT_data_member_location: 76
 <2><de549>: Abbrev Number: 1 (DW_TAG_member)
    <de54a>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <de54e>   DW_AT_decl_file   : 6
    <de54f>   DW_AT_decl_line   : 621
    <de551>   DW_AT_decl_column : 6
    <de552>   DW_AT_type        : <0xddbdb>
    <de556>   DW_AT_data_member_location: 80
 <2><de557>: Abbrev Number: 1 (DW_TAG_member)
    <de558>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <de55c>   DW_AT_decl_file   : 6
    <de55d>   DW_AT_decl_line   : 622
    <de55f>   DW_AT_decl_column : 6
    <de560>   DW_AT_type        : <0xddbdb>
    <de564>   DW_AT_data_member_location: 84
 <2><de565>: Abbrev Number: 1 (DW_TAG_member)
    <de566>   DW_AT_name        : (indirect string, offset: 0x834ae): same_screen
    <de56a>   DW_AT_decl_file   : 6
    <de56b>   DW_AT_decl_line   : 627
    <de56d>   DW_AT_decl_column : 7
    <de56e>   DW_AT_type        : <0xddbdb>
    <de572>   DW_AT_data_member_location: 88
 <2><de573>: Abbrev Number: 1 (DW_TAG_member)
    <de574>   DW_AT_name        : (indirect string, offset: 0x5a0d9): focus
    <de578>   DW_AT_decl_file   : 6
    <de579>   DW_AT_decl_line   : 628
    <de57b>   DW_AT_decl_column : 7
    <de57c>   DW_AT_type        : <0xddbdb>
    <de580>   DW_AT_data_member_location: 92
 <2><de581>: Abbrev Number: 1 (DW_TAG_member)
    <de582>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <de586>   DW_AT_decl_file   : 6
    <de587>   DW_AT_decl_line   : 629
    <de589>   DW_AT_decl_column : 15
    <de58a>   DW_AT_type        : <0xddba7>
    <de58e>   DW_AT_data_member_location: 96
 <2><de58f>: Abbrev Number: 0
 <1><de590>: Abbrev Number: 5 (DW_TAG_typedef)
    <de591>   DW_AT_name        : (indirect string, offset: 0x735e4): XCrossingEvent
    <de595>   DW_AT_decl_file   : 6
    <de596>   DW_AT_decl_line   : 630
    <de598>   DW_AT_decl_column : 3
    <de599>   DW_AT_type        : <0xde49c>
 <1><de59d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de59e>   DW_AT_byte_size   : 48
    <de59f>   DW_AT_decl_file   : 6
    <de5a0>   DW_AT_decl_line   : 634
    <de5a2>   DW_AT_decl_column : 9
    <de5a2>   DW_AT_sibling     : <0xde609>
 <2><de5a6>: Abbrev Number: 1 (DW_TAG_member)
    <de5a7>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de5ab>   DW_AT_decl_file   : 6
    <de5ac>   DW_AT_decl_line   : 635
    <de5ae>   DW_AT_decl_column : 6
    <de5af>   DW_AT_type        : <0xddbdb>
    <de5b3>   DW_AT_data_member_location: 0
 <2><de5b4>: Abbrev Number: 1 (DW_TAG_member)
    <de5b5>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de5b9>   DW_AT_decl_file   : 6
    <de5ba>   DW_AT_decl_line   : 636
    <de5bc>   DW_AT_decl_column : 16
    <de5bd>   DW_AT_type        : <0xddc08>
    <de5c1>   DW_AT_data_member_location: 8
 <2><de5c2>: Abbrev Number: 1 (DW_TAG_member)
    <de5c3>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de5c7>   DW_AT_decl_file   : 6
    <de5c8>   DW_AT_decl_line   : 637
    <de5ca>   DW_AT_decl_column : 7
    <de5cb>   DW_AT_type        : <0xddbdb>
    <de5cf>   DW_AT_data_member_location: 16
 <2><de5d0>: Abbrev Number: 1 (DW_TAG_member)
    <de5d1>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de5d5>   DW_AT_decl_file   : 6
    <de5d6>   DW_AT_decl_line   : 638
    <de5d8>   DW_AT_decl_column : 11
    <de5d9>   DW_AT_type        : <0xde2c0>
    <de5dd>   DW_AT_data_member_location: 24
 <2><de5de>: Abbrev Number: 1 (DW_TAG_member)
    <de5df>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de5e3>   DW_AT_decl_file   : 6
    <de5e4>   DW_AT_decl_line   : 639
    <de5e6>   DW_AT_decl_column : 9
    <de5e7>   DW_AT_type        : <0xddcca>
    <de5eb>   DW_AT_data_member_location: 32
 <2><de5ec>: Abbrev Number: 1 (DW_TAG_member)
    <de5ed>   DW_AT_name        : (indirect string, offset: 0x7e618): mode
    <de5f1>   DW_AT_decl_file   : 6
    <de5f2>   DW_AT_decl_line   : 640
    <de5f4>   DW_AT_decl_column : 6
    <de5f5>   DW_AT_type        : <0xddbdb>
    <de5f9>   DW_AT_data_member_location: 40
 <2><de5fa>: Abbrev Number: 1 (DW_TAG_member)
    <de5fb>   DW_AT_name        : (indirect string, offset: 0x2bf58): detail
    <de5ff>   DW_AT_decl_file   : 6
    <de600>   DW_AT_decl_line   : 642
    <de602>   DW_AT_decl_column : 6
    <de603>   DW_AT_type        : <0xddbdb>
    <de607>   DW_AT_data_member_location: 44
 <2><de608>: Abbrev Number: 0
 <1><de609>: Abbrev Number: 5 (DW_TAG_typedef)
    <de60a>   DW_AT_name        : (indirect string, offset: 0x7178a): XFocusChangeEvent
    <de60e>   DW_AT_decl_file   : 6
    <de60f>   DW_AT_decl_line   : 648
    <de611>   DW_AT_decl_column : 3
    <de612>   DW_AT_type        : <0xde59d>
 <1><de616>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de617>   DW_AT_byte_size   : 72
    <de618>   DW_AT_decl_file   : 6
    <de619>   DW_AT_decl_line   : 653
    <de61b>   DW_AT_decl_column : 9
    <de61b>   DW_AT_sibling     : <0xde674>
 <2><de61f>: Abbrev Number: 1 (DW_TAG_member)
    <de620>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de624>   DW_AT_decl_file   : 6
    <de625>   DW_AT_decl_line   : 654
    <de627>   DW_AT_decl_column : 6
    <de628>   DW_AT_type        : <0xddbdb>
    <de62c>   DW_AT_data_member_location: 0
 <2><de62d>: Abbrev Number: 1 (DW_TAG_member)
    <de62e>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de632>   DW_AT_decl_file   : 6
    <de633>   DW_AT_decl_line   : 655
    <de635>   DW_AT_decl_column : 16
    <de636>   DW_AT_type        : <0xddc08>
    <de63a>   DW_AT_data_member_location: 8
 <2><de63b>: Abbrev Number: 1 (DW_TAG_member)
    <de63c>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de640>   DW_AT_decl_file   : 6
    <de641>   DW_AT_decl_line   : 656
    <de643>   DW_AT_decl_column : 7
    <de644>   DW_AT_type        : <0xddbdb>
    <de648>   DW_AT_data_member_location: 16
 <2><de649>: Abbrev Number: 1 (DW_TAG_member)
    <de64a>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de64e>   DW_AT_decl_file   : 6
    <de64f>   DW_AT_decl_line   : 657
    <de651>   DW_AT_decl_column : 11
    <de652>   DW_AT_type        : <0xde2c0>
    <de656>   DW_AT_data_member_location: 24
 <2><de657>: Abbrev Number: 1 (DW_TAG_member)
    <de658>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de65c>   DW_AT_decl_file   : 6
    <de65d>   DW_AT_decl_line   : 658
    <de65f>   DW_AT_decl_column : 9
    <de660>   DW_AT_type        : <0xddcca>
    <de664>   DW_AT_data_member_location: 32
 <2><de665>: Abbrev Number: 1 (DW_TAG_member)
    <de666>   DW_AT_name        : (indirect string, offset: 0x70daa): key_vector
    <de66a>   DW_AT_decl_file   : 6
    <de66b>   DW_AT_decl_line   : 659
    <de66d>   DW_AT_decl_column : 7
    <de66e>   DW_AT_type        : <0xddc49>
    <de672>   DW_AT_data_member_location: 40
 <2><de673>: Abbrev Number: 0
 <1><de674>: Abbrev Number: 5 (DW_TAG_typedef)
    <de675>   DW_AT_name        : (indirect string, offset: 0x6b358): XKeymapEvent
    <de679>   DW_AT_decl_file   : 6
    <de67a>   DW_AT_decl_line   : 660
    <de67c>   DW_AT_decl_column : 3
    <de67d>   DW_AT_type        : <0xde616>
 <1><de681>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de682>   DW_AT_byte_size   : 64
    <de683>   DW_AT_decl_file   : 6
    <de684>   DW_AT_decl_line   : 662
    <de686>   DW_AT_decl_column : 9
    <de686>   DW_AT_sibling     : <0xde713>
 <2><de68a>: Abbrev Number: 1 (DW_TAG_member)
    <de68b>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de68f>   DW_AT_decl_file   : 6
    <de690>   DW_AT_decl_line   : 663
    <de692>   DW_AT_decl_column : 6
    <de693>   DW_AT_type        : <0xddbdb>
    <de697>   DW_AT_data_member_location: 0
 <2><de698>: Abbrev Number: 1 (DW_TAG_member)
    <de699>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de69d>   DW_AT_decl_file   : 6
    <de69e>   DW_AT_decl_line   : 664
    <de6a0>   DW_AT_decl_column : 16
    <de6a1>   DW_AT_type        : <0xddc08>
    <de6a5>   DW_AT_data_member_location: 8
 <2><de6a6>: Abbrev Number: 1 (DW_TAG_member)
    <de6a7>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de6ab>   DW_AT_decl_file   : 6
    <de6ac>   DW_AT_decl_line   : 665
    <de6ae>   DW_AT_decl_column : 7
    <de6af>   DW_AT_type        : <0xddbdb>
    <de6b3>   DW_AT_data_member_location: 16
 <2><de6b4>: Abbrev Number: 1 (DW_TAG_member)
    <de6b5>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de6b9>   DW_AT_decl_file   : 6
    <de6ba>   DW_AT_decl_line   : 666
    <de6bc>   DW_AT_decl_column : 11
    <de6bd>   DW_AT_type        : <0xde2c0>
    <de6c1>   DW_AT_data_member_location: 24
 <2><de6c2>: Abbrev Number: 1 (DW_TAG_member)
    <de6c3>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de6c7>   DW_AT_decl_file   : 6
    <de6c8>   DW_AT_decl_line   : 667
    <de6ca>   DW_AT_decl_column : 9
    <de6cb>   DW_AT_type        : <0xddcca>
    <de6cf>   DW_AT_data_member_location: 32
 <2><de6d0>: Abbrev Number: 11 (DW_TAG_member)
    <de6d1>   DW_AT_name        : x
    <de6d3>   DW_AT_decl_file   : 6
    <de6d4>   DW_AT_decl_line   : 668
    <de6d6>   DW_AT_decl_column : 6
    <de6d7>   DW_AT_type        : <0xddbdb>
    <de6db>   DW_AT_data_member_location: 40
 <2><de6dc>: Abbrev Number: 11 (DW_TAG_member)
    <de6dd>   DW_AT_name        : y
    <de6df>   DW_AT_decl_file   : 6
    <de6e0>   DW_AT_decl_line   : 668
    <de6e2>   DW_AT_decl_column : 9
    <de6e3>   DW_AT_type        : <0xddbdb>
    <de6e7>   DW_AT_data_member_location: 44
 <2><de6e8>: Abbrev Number: 1 (DW_TAG_member)
    <de6e9>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <de6ed>   DW_AT_decl_file   : 6
    <de6ee>   DW_AT_decl_line   : 669
    <de6f0>   DW_AT_decl_column : 6
    <de6f1>   DW_AT_type        : <0xddbdb>
    <de6f5>   DW_AT_data_member_location: 48
 <2><de6f6>: Abbrev Number: 1 (DW_TAG_member)
    <de6f7>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <de6fb>   DW_AT_decl_file   : 6
    <de6fc>   DW_AT_decl_line   : 669
    <de6fe>   DW_AT_decl_column : 13
    <de6ff>   DW_AT_type        : <0xddbdb>
    <de703>   DW_AT_data_member_location: 52
 <2><de704>: Abbrev Number: 1 (DW_TAG_member)
    <de705>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <de709>   DW_AT_decl_file   : 6
    <de70a>   DW_AT_decl_line   : 670
    <de70c>   DW_AT_decl_column : 6
    <de70d>   DW_AT_type        : <0xddbdb>
    <de711>   DW_AT_data_member_location: 56
 <2><de712>: Abbrev Number: 0
 <1><de713>: Abbrev Number: 5 (DW_TAG_typedef)
    <de714>   DW_AT_name        : (indirect string, offset: 0x834d6): XExposeEvent
    <de718>   DW_AT_decl_file   : 6
    <de719>   DW_AT_decl_line   : 671
    <de71b>   DW_AT_decl_column : 3
    <de71c>   DW_AT_type        : <0xde681>
 <1><de720>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de721>   DW_AT_byte_size   : 72
    <de722>   DW_AT_decl_file   : 6
    <de723>   DW_AT_decl_line   : 673
    <de725>   DW_AT_decl_column : 9
    <de725>   DW_AT_sibling     : <0xde7ce>
 <2><de729>: Abbrev Number: 1 (DW_TAG_member)
    <de72a>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de72e>   DW_AT_decl_file   : 6
    <de72f>   DW_AT_decl_line   : 674
    <de731>   DW_AT_decl_column : 6
    <de732>   DW_AT_type        : <0xddbdb>
    <de736>   DW_AT_data_member_location: 0
 <2><de737>: Abbrev Number: 1 (DW_TAG_member)
    <de738>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de73c>   DW_AT_decl_file   : 6
    <de73d>   DW_AT_decl_line   : 675
    <de73f>   DW_AT_decl_column : 16
    <de740>   DW_AT_type        : <0xddc08>
    <de744>   DW_AT_data_member_location: 8
 <2><de745>: Abbrev Number: 1 (DW_TAG_member)
    <de746>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de74a>   DW_AT_decl_file   : 6
    <de74b>   DW_AT_decl_line   : 676
    <de74d>   DW_AT_decl_column : 7
    <de74e>   DW_AT_type        : <0xddbdb>
    <de752>   DW_AT_data_member_location: 16
 <2><de753>: Abbrev Number: 1 (DW_TAG_member)
    <de754>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de758>   DW_AT_decl_file   : 6
    <de759>   DW_AT_decl_line   : 677
    <de75b>   DW_AT_decl_column : 11
    <de75c>   DW_AT_type        : <0xde2c0>
    <de760>   DW_AT_data_member_location: 24
 <2><de761>: Abbrev Number: 1 (DW_TAG_member)
    <de762>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <de766>   DW_AT_decl_file   : 6
    <de767>   DW_AT_decl_line   : 678
    <de769>   DW_AT_decl_column : 11
    <de76a>   DW_AT_type        : <0xddcd6>
    <de76e>   DW_AT_data_member_location: 32
 <2><de76f>: Abbrev Number: 11 (DW_TAG_member)
    <de770>   DW_AT_name        : x
    <de772>   DW_AT_decl_file   : 6
    <de773>   DW_AT_decl_line   : 679
    <de775>   DW_AT_decl_column : 6
    <de776>   DW_AT_type        : <0xddbdb>
    <de77a>   DW_AT_data_member_location: 40
 <2><de77b>: Abbrev Number: 11 (DW_TAG_member)
    <de77c>   DW_AT_name        : y
    <de77e>   DW_AT_decl_file   : 6
    <de77f>   DW_AT_decl_line   : 679
    <de781>   DW_AT_decl_column : 9
    <de782>   DW_AT_type        : <0xddbdb>
    <de786>   DW_AT_data_member_location: 44
 <2><de787>: Abbrev Number: 1 (DW_TAG_member)
    <de788>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <de78c>   DW_AT_decl_file   : 6
    <de78d>   DW_AT_decl_line   : 680
    <de78f>   DW_AT_decl_column : 6
    <de790>   DW_AT_type        : <0xddbdb>
    <de794>   DW_AT_data_member_location: 48
 <2><de795>: Abbrev Number: 1 (DW_TAG_member)
    <de796>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <de79a>   DW_AT_decl_file   : 6
    <de79b>   DW_AT_decl_line   : 680
    <de79d>   DW_AT_decl_column : 13
    <de79e>   DW_AT_type        : <0xddbdb>
    <de7a2>   DW_AT_data_member_location: 52
 <2><de7a3>: Abbrev Number: 1 (DW_TAG_member)
    <de7a4>   DW_AT_name        : (indirect string, offset: 0x17224): count
    <de7a8>   DW_AT_decl_file   : 6
    <de7a9>   DW_AT_decl_line   : 681
    <de7ab>   DW_AT_decl_column : 6
    <de7ac>   DW_AT_type        : <0xddbdb>
    <de7b0>   DW_AT_data_member_location: 56
 <2><de7b1>: Abbrev Number: 1 (DW_TAG_member)
    <de7b2>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <de7b6>   DW_AT_decl_file   : 6
    <de7b7>   DW_AT_decl_line   : 682
    <de7b9>   DW_AT_decl_column : 6
    <de7ba>   DW_AT_type        : <0xddbdb>
    <de7be>   DW_AT_data_member_location: 60
 <2><de7bf>: Abbrev Number: 1 (DW_TAG_member)
    <de7c0>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <de7c4>   DW_AT_decl_file   : 6
    <de7c5>   DW_AT_decl_line   : 683
    <de7c7>   DW_AT_decl_column : 6
    <de7c8>   DW_AT_type        : <0xddbdb>
    <de7cc>   DW_AT_data_member_location: 64
 <2><de7cd>: Abbrev Number: 0
 <1><de7ce>: Abbrev Number: 5 (DW_TAG_typedef)
    <de7cf>   DW_AT_name        : (indirect string, offset: 0x8beb5): XGraphicsExposeEvent
    <de7d3>   DW_AT_decl_file   : 6
    <de7d4>   DW_AT_decl_line   : 684
    <de7d6>   DW_AT_decl_column : 3
    <de7d7>   DW_AT_type        : <0xde720>
 <1><de7db>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de7dc>   DW_AT_byte_size   : 48
    <de7dd>   DW_AT_decl_file   : 6
    <de7de>   DW_AT_decl_line   : 686
    <de7e0>   DW_AT_decl_column : 9
    <de7e0>   DW_AT_sibling     : <0xde847>
 <2><de7e4>: Abbrev Number: 1 (DW_TAG_member)
    <de7e5>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de7e9>   DW_AT_decl_file   : 6
    <de7ea>   DW_AT_decl_line   : 687
    <de7ec>   DW_AT_decl_column : 6
    <de7ed>   DW_AT_type        : <0xddbdb>
    <de7f1>   DW_AT_data_member_location: 0
 <2><de7f2>: Abbrev Number: 1 (DW_TAG_member)
    <de7f3>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de7f7>   DW_AT_decl_file   : 6
    <de7f8>   DW_AT_decl_line   : 688
    <de7fa>   DW_AT_decl_column : 16
    <de7fb>   DW_AT_type        : <0xddc08>
    <de7ff>   DW_AT_data_member_location: 8
 <2><de800>: Abbrev Number: 1 (DW_TAG_member)
    <de801>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de805>   DW_AT_decl_file   : 6
    <de806>   DW_AT_decl_line   : 689
    <de808>   DW_AT_decl_column : 7
    <de809>   DW_AT_type        : <0xddbdb>
    <de80d>   DW_AT_data_member_location: 16
 <2><de80e>: Abbrev Number: 1 (DW_TAG_member)
    <de80f>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de813>   DW_AT_decl_file   : 6
    <de814>   DW_AT_decl_line   : 690
    <de816>   DW_AT_decl_column : 11
    <de817>   DW_AT_type        : <0xde2c0>
    <de81b>   DW_AT_data_member_location: 24
 <2><de81c>: Abbrev Number: 1 (DW_TAG_member)
    <de81d>   DW_AT_name        : (indirect string, offset: 0x78bdf): drawable
    <de821>   DW_AT_decl_file   : 6
    <de822>   DW_AT_decl_line   : 691
    <de824>   DW_AT_decl_column : 11
    <de825>   DW_AT_type        : <0xddcd6>
    <de829>   DW_AT_data_member_location: 32
 <2><de82a>: Abbrev Number: 1 (DW_TAG_member)
    <de82b>   DW_AT_name        : (indirect string, offset: 0x84537): major_code
    <de82f>   DW_AT_decl_file   : 6
    <de830>   DW_AT_decl_line   : 692
    <de832>   DW_AT_decl_column : 6
    <de833>   DW_AT_type        : <0xddbdb>
    <de837>   DW_AT_data_member_location: 40
 <2><de838>: Abbrev Number: 1 (DW_TAG_member)
    <de839>   DW_AT_name        : (indirect string, offset: 0x89a34): minor_code
    <de83d>   DW_AT_decl_file   : 6
    <de83e>   DW_AT_decl_line   : 693
    <de840>   DW_AT_decl_column : 6
    <de841>   DW_AT_type        : <0xddbdb>
    <de845>   DW_AT_data_member_location: 44
 <2><de846>: Abbrev Number: 0
 <1><de847>: Abbrev Number: 5 (DW_TAG_typedef)
    <de848>   DW_AT_name        : (indirect string, offset: 0x70fba): XNoExposeEvent
    <de84c>   DW_AT_decl_file   : 6
    <de84d>   DW_AT_decl_line   : 694
    <de84f>   DW_AT_decl_column : 3
    <de850>   DW_AT_type        : <0xde7db>
 <1><de854>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de855>   DW_AT_byte_size   : 48
    <de856>   DW_AT_decl_file   : 6
    <de857>   DW_AT_decl_line   : 696
    <de859>   DW_AT_decl_column : 9
    <de859>   DW_AT_sibling     : <0xde8b2>
 <2><de85d>: Abbrev Number: 1 (DW_TAG_member)
    <de85e>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de862>   DW_AT_decl_file   : 6
    <de863>   DW_AT_decl_line   : 697
    <de865>   DW_AT_decl_column : 6
    <de866>   DW_AT_type        : <0xddbdb>
    <de86a>   DW_AT_data_member_location: 0
 <2><de86b>: Abbrev Number: 1 (DW_TAG_member)
    <de86c>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de870>   DW_AT_decl_file   : 6
    <de871>   DW_AT_decl_line   : 698
    <de873>   DW_AT_decl_column : 16
    <de874>   DW_AT_type        : <0xddc08>
    <de878>   DW_AT_data_member_location: 8
 <2><de879>: Abbrev Number: 1 (DW_TAG_member)
    <de87a>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de87e>   DW_AT_decl_file   : 6
    <de87f>   DW_AT_decl_line   : 699
    <de881>   DW_AT_decl_column : 7
    <de882>   DW_AT_type        : <0xddbdb>
    <de886>   DW_AT_data_member_location: 16
 <2><de887>: Abbrev Number: 1 (DW_TAG_member)
    <de888>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de88c>   DW_AT_decl_file   : 6
    <de88d>   DW_AT_decl_line   : 700
    <de88f>   DW_AT_decl_column : 11
    <de890>   DW_AT_type        : <0xde2c0>
    <de894>   DW_AT_data_member_location: 24
 <2><de895>: Abbrev Number: 1 (DW_TAG_member)
    <de896>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de89a>   DW_AT_decl_file   : 6
    <de89b>   DW_AT_decl_line   : 701
    <de89d>   DW_AT_decl_column : 9
    <de89e>   DW_AT_type        : <0xddcca>
    <de8a2>   DW_AT_data_member_location: 32
 <2><de8a3>: Abbrev Number: 1 (DW_TAG_member)
    <de8a4>   DW_AT_name        : (indirect string, offset: 0x72dda): state
    <de8a8>   DW_AT_decl_file   : 6
    <de8a9>   DW_AT_decl_line   : 702
    <de8ab>   DW_AT_decl_column : 6
    <de8ac>   DW_AT_type        : <0xddbdb>
    <de8b0>   DW_AT_data_member_location: 40
 <2><de8b1>: Abbrev Number: 0
 <1><de8b2>: Abbrev Number: 5 (DW_TAG_typedef)
    <de8b3>   DW_AT_name        : (indirect string, offset: 0x62f5c): XVisibilityEvent
    <de8b7>   DW_AT_decl_file   : 6
    <de8b8>   DW_AT_decl_line   : 703
    <de8ba>   DW_AT_decl_column : 3
    <de8bb>   DW_AT_type        : <0xde854>
 <1><de8bf>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de8c0>   DW_AT_byte_size   : 72
    <de8c1>   DW_AT_decl_file   : 6
    <de8c2>   DW_AT_decl_line   : 705
    <de8c4>   DW_AT_decl_column : 9
    <de8c4>   DW_AT_sibling     : <0xde96d>
 <2><de8c8>: Abbrev Number: 1 (DW_TAG_member)
    <de8c9>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de8cd>   DW_AT_decl_file   : 6
    <de8ce>   DW_AT_decl_line   : 706
    <de8d0>   DW_AT_decl_column : 6
    <de8d1>   DW_AT_type        : <0xddbdb>
    <de8d5>   DW_AT_data_member_location: 0
 <2><de8d6>: Abbrev Number: 1 (DW_TAG_member)
    <de8d7>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de8db>   DW_AT_decl_file   : 6
    <de8dc>   DW_AT_decl_line   : 707
    <de8de>   DW_AT_decl_column : 16
    <de8df>   DW_AT_type        : <0xddc08>
    <de8e3>   DW_AT_data_member_location: 8
 <2><de8e4>: Abbrev Number: 1 (DW_TAG_member)
    <de8e5>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de8e9>   DW_AT_decl_file   : 6
    <de8ea>   DW_AT_decl_line   : 708
    <de8ec>   DW_AT_decl_column : 7
    <de8ed>   DW_AT_type        : <0xddbdb>
    <de8f1>   DW_AT_data_member_location: 16
 <2><de8f2>: Abbrev Number: 1 (DW_TAG_member)
    <de8f3>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de8f7>   DW_AT_decl_file   : 6
    <de8f8>   DW_AT_decl_line   : 709
    <de8fa>   DW_AT_decl_column : 11
    <de8fb>   DW_AT_type        : <0xde2c0>
    <de8ff>   DW_AT_data_member_location: 24
 <2><de900>: Abbrev Number: 1 (DW_TAG_member)
    <de901>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <de905>   DW_AT_decl_file   : 6
    <de906>   DW_AT_decl_line   : 710
    <de908>   DW_AT_decl_column : 9
    <de909>   DW_AT_type        : <0xddcca>
    <de90d>   DW_AT_data_member_location: 32
 <2><de90e>: Abbrev Number: 1 (DW_TAG_member)
    <de90f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de913>   DW_AT_decl_file   : 6
    <de914>   DW_AT_decl_line   : 711
    <de916>   DW_AT_decl_column : 9
    <de917>   DW_AT_type        : <0xddcca>
    <de91b>   DW_AT_data_member_location: 40
 <2><de91c>: Abbrev Number: 11 (DW_TAG_member)
    <de91d>   DW_AT_name        : x
    <de91f>   DW_AT_decl_file   : 6
    <de920>   DW_AT_decl_line   : 712
    <de922>   DW_AT_decl_column : 6
    <de923>   DW_AT_type        : <0xddbdb>
    <de927>   DW_AT_data_member_location: 48
 <2><de928>: Abbrev Number: 11 (DW_TAG_member)
    <de929>   DW_AT_name        : y
    <de92b>   DW_AT_decl_file   : 6
    <de92c>   DW_AT_decl_line   : 712
    <de92e>   DW_AT_decl_column : 9
    <de92f>   DW_AT_type        : <0xddbdb>
    <de933>   DW_AT_data_member_location: 52
 <2><de934>: Abbrev Number: 1 (DW_TAG_member)
    <de935>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <de939>   DW_AT_decl_file   : 6
    <de93a>   DW_AT_decl_line   : 713
    <de93c>   DW_AT_decl_column : 6
    <de93d>   DW_AT_type        : <0xddbdb>
    <de941>   DW_AT_data_member_location: 56
 <2><de942>: Abbrev Number: 1 (DW_TAG_member)
    <de943>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <de947>   DW_AT_decl_file   : 6
    <de948>   DW_AT_decl_line   : 713
    <de94a>   DW_AT_decl_column : 13
    <de94b>   DW_AT_type        : <0xddbdb>
    <de94f>   DW_AT_data_member_location: 60
 <2><de950>: Abbrev Number: 1 (DW_TAG_member)
    <de951>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <de955>   DW_AT_decl_file   : 6
    <de956>   DW_AT_decl_line   : 714
    <de958>   DW_AT_decl_column : 6
    <de959>   DW_AT_type        : <0xddbdb>
    <de95d>   DW_AT_data_member_location: 64
 <2><de95e>: Abbrev Number: 1 (DW_TAG_member)
    <de95f>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <de963>   DW_AT_decl_file   : 6
    <de964>   DW_AT_decl_line   : 715
    <de966>   DW_AT_decl_column : 7
    <de967>   DW_AT_type        : <0xddbdb>
    <de96b>   DW_AT_data_member_location: 68
 <2><de96c>: Abbrev Number: 0
 <1><de96d>: Abbrev Number: 5 (DW_TAG_typedef)
    <de96e>   DW_AT_name        : (indirect string, offset: 0x88215): XCreateWindowEvent
    <de972>   DW_AT_decl_file   : 6
    <de973>   DW_AT_decl_line   : 716
    <de975>   DW_AT_decl_column : 3
    <de976>   DW_AT_type        : <0xde8bf>
 <1><de97a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de97b>   DW_AT_byte_size   : 48
    <de97c>   DW_AT_decl_file   : 6
    <de97d>   DW_AT_decl_line   : 718
    <de97f>   DW_AT_decl_column : 9
    <de97f>   DW_AT_sibling     : <0xde9d8>
 <2><de983>: Abbrev Number: 1 (DW_TAG_member)
    <de984>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de988>   DW_AT_decl_file   : 6
    <de989>   DW_AT_decl_line   : 719
    <de98b>   DW_AT_decl_column : 6
    <de98c>   DW_AT_type        : <0xddbdb>
    <de990>   DW_AT_data_member_location: 0
 <2><de991>: Abbrev Number: 1 (DW_TAG_member)
    <de992>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <de996>   DW_AT_decl_file   : 6
    <de997>   DW_AT_decl_line   : 720
    <de999>   DW_AT_decl_column : 16
    <de99a>   DW_AT_type        : <0xddc08>
    <de99e>   DW_AT_data_member_location: 8
 <2><de99f>: Abbrev Number: 1 (DW_TAG_member)
    <de9a0>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <de9a4>   DW_AT_decl_file   : 6
    <de9a5>   DW_AT_decl_line   : 721
    <de9a7>   DW_AT_decl_column : 7
    <de9a8>   DW_AT_type        : <0xddbdb>
    <de9ac>   DW_AT_data_member_location: 16
 <2><de9ad>: Abbrev Number: 1 (DW_TAG_member)
    <de9ae>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <de9b2>   DW_AT_decl_file   : 6
    <de9b3>   DW_AT_decl_line   : 722
    <de9b5>   DW_AT_decl_column : 11
    <de9b6>   DW_AT_type        : <0xde2c0>
    <de9ba>   DW_AT_data_member_location: 24
 <2><de9bb>: Abbrev Number: 1 (DW_TAG_member)
    <de9bc>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <de9c0>   DW_AT_decl_file   : 6
    <de9c1>   DW_AT_decl_line   : 723
    <de9c3>   DW_AT_decl_column : 9
    <de9c4>   DW_AT_type        : <0xddcca>
    <de9c8>   DW_AT_data_member_location: 32
 <2><de9c9>: Abbrev Number: 1 (DW_TAG_member)
    <de9ca>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <de9ce>   DW_AT_decl_file   : 6
    <de9cf>   DW_AT_decl_line   : 724
    <de9d1>   DW_AT_decl_column : 9
    <de9d2>   DW_AT_type        : <0xddcca>
    <de9d6>   DW_AT_data_member_location: 40
 <2><de9d7>: Abbrev Number: 0
 <1><de9d8>: Abbrev Number: 5 (DW_TAG_typedef)
    <de9d9>   DW_AT_name        : (indirect string, offset: 0x7994b): XDestroyWindowEvent
    <de9dd>   DW_AT_decl_file   : 6
    <de9de>   DW_AT_decl_line   : 725
    <de9e0>   DW_AT_decl_column : 3
    <de9e1>   DW_AT_type        : <0xde97a>
 <1><de9e5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <de9e6>   DW_AT_byte_size   : 56
    <de9e7>   DW_AT_decl_file   : 6
    <de9e8>   DW_AT_decl_line   : 727
    <de9ea>   DW_AT_decl_column : 9
    <de9ea>   DW_AT_sibling     : <0xdea51>
 <2><de9ee>: Abbrev Number: 1 (DW_TAG_member)
    <de9ef>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <de9f3>   DW_AT_decl_file   : 6
    <de9f4>   DW_AT_decl_line   : 728
    <de9f6>   DW_AT_decl_column : 6
    <de9f7>   DW_AT_type        : <0xddbdb>
    <de9fb>   DW_AT_data_member_location: 0
 <2><de9fc>: Abbrev Number: 1 (DW_TAG_member)
    <de9fd>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <dea01>   DW_AT_decl_file   : 6
    <dea02>   DW_AT_decl_line   : 729
    <dea04>   DW_AT_decl_column : 16
    <dea05>   DW_AT_type        : <0xddc08>
    <dea09>   DW_AT_data_member_location: 8
 <2><dea0a>: Abbrev Number: 1 (DW_TAG_member)
    <dea0b>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <dea0f>   DW_AT_decl_file   : 6
    <dea10>   DW_AT_decl_line   : 730
    <dea12>   DW_AT_decl_column : 7
    <dea13>   DW_AT_type        : <0xddbdb>
    <dea17>   DW_AT_data_member_location: 16
 <2><dea18>: Abbrev Number: 1 (DW_TAG_member)
    <dea19>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <dea1d>   DW_AT_decl_file   : 6
    <dea1e>   DW_AT_decl_line   : 731
    <dea20>   DW_AT_decl_column : 11
    <dea21>   DW_AT_type        : <0xde2c0>
    <dea25>   DW_AT_data_member_location: 24
 <2><dea26>: Abbrev Number: 1 (DW_TAG_member)
    <dea27>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <dea2b>   DW_AT_decl_file   : 6
    <dea2c>   DW_AT_decl_line   : 732
    <dea2e>   DW_AT_decl_column : 9
    <dea2f>   DW_AT_type        : <0xddcca>
    <dea33>   DW_AT_data_member_location: 32
 <2><dea34>: Abbrev Number: 1 (DW_TAG_member)
    <dea35>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dea39>   DW_AT_decl_file   : 6
    <dea3a>   DW_AT_decl_line   : 733
    <dea3c>   DW_AT_decl_column : 9
    <dea3d>   DW_AT_type        : <0xddcca>
    <dea41>   DW_AT_data_member_location: 40
 <2><dea42>: Abbrev Number: 1 (DW_TAG_member)
    <dea43>   DW_AT_name        : (indirect string, offset: 0x6ee8a): from_configure
    <dea47>   DW_AT_decl_file   : 6
    <dea48>   DW_AT_decl_line   : 734
    <dea4a>   DW_AT_decl_column : 7
    <dea4b>   DW_AT_type        : <0xddbdb>
    <dea4f>   DW_AT_data_member_location: 48
 <2><dea50>: Abbrev Number: 0
 <1><dea51>: Abbrev Number: 5 (DW_TAG_typedef)
    <dea52>   DW_AT_name        : (indirect string, offset: 0x6fb44): XUnmapEvent
    <dea56>   DW_AT_decl_file   : 6
    <dea57>   DW_AT_decl_line   : 735
    <dea59>   DW_AT_decl_column : 3
    <dea5a>   DW_AT_type        : <0xde9e5>
 <1><dea5e>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dea5f>   DW_AT_byte_size   : 56
    <dea60>   DW_AT_decl_file   : 6
    <dea61>   DW_AT_decl_line   : 737
    <dea63>   DW_AT_decl_column : 9
    <dea63>   DW_AT_sibling     : <0xdeaca>
 <2><dea67>: Abbrev Number: 1 (DW_TAG_member)
    <dea68>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <dea6c>   DW_AT_decl_file   : 6
    <dea6d>   DW_AT_decl_line   : 738
    <dea6f>   DW_AT_decl_column : 6
    <dea70>   DW_AT_type        : <0xddbdb>
    <dea74>   DW_AT_data_member_location: 0
 <2><dea75>: Abbrev Number: 1 (DW_TAG_member)
    <dea76>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <dea7a>   DW_AT_decl_file   : 6
    <dea7b>   DW_AT_decl_line   : 739
    <dea7d>   DW_AT_decl_column : 16
    <dea7e>   DW_AT_type        : <0xddc08>
    <dea82>   DW_AT_data_member_location: 8
 <2><dea83>: Abbrev Number: 1 (DW_TAG_member)
    <dea84>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <dea88>   DW_AT_decl_file   : 6
    <dea89>   DW_AT_decl_line   : 740
    <dea8b>   DW_AT_decl_column : 7
    <dea8c>   DW_AT_type        : <0xddbdb>
    <dea90>   DW_AT_data_member_location: 16
 <2><dea91>: Abbrev Number: 1 (DW_TAG_member)
    <dea92>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <dea96>   DW_AT_decl_file   : 6
    <dea97>   DW_AT_decl_line   : 741
    <dea99>   DW_AT_decl_column : 11
    <dea9a>   DW_AT_type        : <0xde2c0>
    <dea9e>   DW_AT_data_member_location: 24
 <2><dea9f>: Abbrev Number: 1 (DW_TAG_member)
    <deaa0>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <deaa4>   DW_AT_decl_file   : 6
    <deaa5>   DW_AT_decl_line   : 742
    <deaa7>   DW_AT_decl_column : 9
    <deaa8>   DW_AT_type        : <0xddcca>
    <deaac>   DW_AT_data_member_location: 32
 <2><deaad>: Abbrev Number: 1 (DW_TAG_member)
    <deaae>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <deab2>   DW_AT_decl_file   : 6
    <deab3>   DW_AT_decl_line   : 743
    <deab5>   DW_AT_decl_column : 9
    <deab6>   DW_AT_type        : <0xddcca>
    <deaba>   DW_AT_data_member_location: 40
 <2><deabb>: Abbrev Number: 1 (DW_TAG_member)
    <deabc>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <deac0>   DW_AT_decl_file   : 6
    <deac1>   DW_AT_decl_line   : 744
    <deac3>   DW_AT_decl_column : 7
    <deac4>   DW_AT_type        : <0xddbdb>
    <deac8>   DW_AT_data_member_location: 48
 <2><deac9>: Abbrev Number: 0
 <1><deaca>: Abbrev Number: 5 (DW_TAG_typedef)
    <deacb>   DW_AT_name        : (indirect string, offset: 0x7dc25): XMapEvent
    <deacf>   DW_AT_decl_file   : 6
    <dead0>   DW_AT_decl_line   : 745
    <dead2>   DW_AT_decl_column : 3
    <dead3>   DW_AT_type        : <0xdea5e>
 <1><dead7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <dead8>   DW_AT_byte_size   : 48
    <dead9>   DW_AT_decl_file   : 6
    <deada>   DW_AT_decl_line   : 747
    <deadc>   DW_AT_decl_column : 9
    <deadc>   DW_AT_sibling     : <0xdeb35>
 <2><deae0>: Abbrev Number: 1 (DW_TAG_member)
    <deae1>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <deae5>   DW_AT_decl_file   : 6
    <deae6>   DW_AT_decl_line   : 748
    <deae8>   DW_AT_decl_column : 6
    <deae9>   DW_AT_type        : <0xddbdb>
    <deaed>   DW_AT_data_member_location: 0
 <2><deaee>: Abbrev Number: 1 (DW_TAG_member)
    <deaef>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <deaf3>   DW_AT_decl_file   : 6
    <deaf4>   DW_AT_decl_line   : 749
    <deaf6>   DW_AT_decl_column : 16
    <deaf7>   DW_AT_type        : <0xddc08>
    <deafb>   DW_AT_data_member_location: 8
 <2><deafc>: Abbrev Number: 1 (DW_TAG_member)
    <deafd>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <deb01>   DW_AT_decl_file   : 6
    <deb02>   DW_AT_decl_line   : 750
    <deb04>   DW_AT_decl_column : 7
    <deb05>   DW_AT_type        : <0xddbdb>
    <deb09>   DW_AT_data_member_location: 16
 <2><deb0a>: Abbrev Number: 1 (DW_TAG_member)
    <deb0b>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <deb0f>   DW_AT_decl_file   : 6
    <deb10>   DW_AT_decl_line   : 751
    <deb12>   DW_AT_decl_column : 11
    <deb13>   DW_AT_type        : <0xde2c0>
    <deb17>   DW_AT_data_member_location: 24
 <2><deb18>: Abbrev Number: 1 (DW_TAG_member)
    <deb19>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <deb1d>   DW_AT_decl_file   : 6
    <deb1e>   DW_AT_decl_line   : 752
    <deb20>   DW_AT_decl_column : 9
    <deb21>   DW_AT_type        : <0xddcca>
    <deb25>   DW_AT_data_member_location: 32
 <2><deb26>: Abbrev Number: 1 (DW_TAG_member)
    <deb27>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <deb2b>   DW_AT_decl_file   : 6
    <deb2c>   DW_AT_decl_line   : 753
    <deb2e>   DW_AT_decl_column : 9
    <deb2f>   DW_AT_type        : <0xddcca>
    <deb33>   DW_AT_data_member_location: 40
 <2><deb34>: Abbrev Number: 0
 <1><deb35>: Abbrev Number: 5 (DW_TAG_typedef)
    <deb36>   DW_AT_name        : (indirect string, offset: 0x5eac6): XMapRequestEvent
    <deb3a>   DW_AT_decl_file   : 6
    <deb3b>   DW_AT_decl_line   : 754
    <deb3d>   DW_AT_decl_column : 3
    <deb3e>   DW_AT_type        : <0xdead7>
 <1><deb42>: Abbrev Number: 8 (DW_TAG_structure_type)
    <deb43>   DW_AT_byte_size   : 72
    <deb44>   DW_AT_decl_file   : 6
    <deb45>   DW_AT_decl_line   : 756
    <deb47>   DW_AT_decl_column : 9
    <deb47>   DW_AT_sibling     : <0xdebd4>
 <2><deb4b>: Abbrev Number: 1 (DW_TAG_member)
    <deb4c>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <deb50>   DW_AT_decl_file   : 6
    <deb51>   DW_AT_decl_line   : 757
    <deb53>   DW_AT_decl_column : 6
    <deb54>   DW_AT_type        : <0xddbdb>
    <deb58>   DW_AT_data_member_location: 0
 <2><deb59>: Abbrev Number: 1 (DW_TAG_member)
    <deb5a>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <deb5e>   DW_AT_decl_file   : 6
    <deb5f>   DW_AT_decl_line   : 758
    <deb61>   DW_AT_decl_column : 16
    <deb62>   DW_AT_type        : <0xddc08>
    <deb66>   DW_AT_data_member_location: 8
 <2><deb67>: Abbrev Number: 1 (DW_TAG_member)
    <deb68>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <deb6c>   DW_AT_decl_file   : 6
    <deb6d>   DW_AT_decl_line   : 759
    <deb6f>   DW_AT_decl_column : 7
    <deb70>   DW_AT_type        : <0xddbdb>
    <deb74>   DW_AT_data_member_location: 16
 <2><deb75>: Abbrev Number: 1 (DW_TAG_member)
    <deb76>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <deb7a>   DW_AT_decl_file   : 6
    <deb7b>   DW_AT_decl_line   : 760
    <deb7d>   DW_AT_decl_column : 11
    <deb7e>   DW_AT_type        : <0xde2c0>
    <deb82>   DW_AT_data_member_location: 24
 <2><deb83>: Abbrev Number: 1 (DW_TAG_member)
    <deb84>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <deb88>   DW_AT_decl_file   : 6
    <deb89>   DW_AT_decl_line   : 761
    <deb8b>   DW_AT_decl_column : 9
    <deb8c>   DW_AT_type        : <0xddcca>
    <deb90>   DW_AT_data_member_location: 32
 <2><deb91>: Abbrev Number: 1 (DW_TAG_member)
    <deb92>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <deb96>   DW_AT_decl_file   : 6
    <deb97>   DW_AT_decl_line   : 762
    <deb99>   DW_AT_decl_column : 9
    <deb9a>   DW_AT_type        : <0xddcca>
    <deb9e>   DW_AT_data_member_location: 40
 <2><deb9f>: Abbrev Number: 1 (DW_TAG_member)
    <deba0>   DW_AT_name        : (indirect string, offset: 0x71d44): parent
    <deba4>   DW_AT_decl_file   : 6
    <deba5>   DW_AT_decl_line   : 763
    <deba7>   DW_AT_decl_column : 9
    <deba8>   DW_AT_type        : <0xddcca>
    <debac>   DW_AT_data_member_location: 48
 <2><debad>: Abbrev Number: 11 (DW_TAG_member)
    <debae>   DW_AT_name        : x
    <debb0>   DW_AT_decl_file   : 6
    <debb1>   DW_AT_decl_line   : 764
    <debb3>   DW_AT_decl_column : 6
    <debb4>   DW_AT_type        : <0xddbdb>
    <debb8>   DW_AT_data_member_location: 56
 <2><debb9>: Abbrev Number: 11 (DW_TAG_member)
    <debba>   DW_AT_name        : y
    <debbc>   DW_AT_decl_file   : 6
    <debbd>   DW_AT_decl_line   : 764
    <debbf>   DW_AT_decl_column : 9
    <debc0>   DW_AT_type        : <0xddbdb>
    <debc4>   DW_AT_data_member_location: 60
 <2><debc5>: Abbrev Number: 1 (DW_TAG_member)
    <debc6>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <debca>   DW_AT_decl_file   : 6
    <debcb>   DW_AT_decl_line   : 765
    <debcd>   DW_AT_decl_column : 7
    <debce>   DW_AT_type        : <0xddbdb>
    <debd2>   DW_AT_data_member_location: 64
 <2><debd3>: Abbrev Number: 0
 <1><debd4>: Abbrev Number: 5 (DW_TAG_typedef)
    <debd5>   DW_AT_name        : (indirect string, offset: 0x77bd7): XReparentEvent
    <debd9>   DW_AT_decl_file   : 6
    <debda>   DW_AT_decl_line   : 766
    <debdc>   DW_AT_decl_column : 3
    <debdd>   DW_AT_type        : <0xdeb42>
 <1><debe1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <debe2>   DW_AT_byte_size   : 88
    <debe3>   DW_AT_decl_file   : 6
    <debe4>   DW_AT_decl_line   : 768
    <debe6>   DW_AT_decl_column : 9
    <debe6>   DW_AT_sibling     : <0xdec9d>
 <2><debea>: Abbrev Number: 1 (DW_TAG_member)
    <debeb>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <debef>   DW_AT_decl_file   : 6
    <debf0>   DW_AT_decl_line   : 769
    <debf2>   DW_AT_decl_column : 6
    <debf3>   DW_AT_type        : <0xddbdb>
    <debf7>   DW_AT_data_member_location: 0
 <2><debf8>: Abbrev Number: 1 (DW_TAG_member)
    <debf9>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <debfd>   DW_AT_decl_file   : 6
    <debfe>   DW_AT_decl_line   : 770
    <dec00>   DW_AT_decl_column : 16
    <dec01>   DW_AT_type        : <0xddc08>
    <dec05>   DW_AT_data_member_location: 8
 <2><dec06>: Abbrev Number: 1 (DW_TAG_member)
    <dec07>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <dec0b>   DW_AT_decl_file   : 6
    <dec0c>   DW_AT_decl_line   : 771
    <dec0e>   DW_AT_decl_column : 7
    <dec0f>   DW_AT_type        : <0xddbdb>
    <dec13>   DW_AT_data_member_location: 16
 <2><dec14>: Abbrev Number: 1 (DW_TAG_member)
    <dec15>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <dec19>   DW_AT_decl_file   : 6
    <dec1a>   DW_AT_decl_line   : 772
    <dec1c>   DW_AT_decl_column : 11
    <dec1d>   DW_AT_type        : <0xde2c0>
    <dec21>   DW_AT_data_member_location: 24
 <2><dec22>: Abbrev Number: 1 (DW_TAG_member)
    <dec23>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <dec27>   DW_AT_decl_file   : 6
    <dec28>   DW_AT_decl_line   : 773
    <dec2a>   DW_AT_decl_column : 9
    <dec2b>   DW_AT_type        : <0xddcca>
    <dec2f>   DW_AT_data_member_location: 32
 <2><dec30>: Abbrev Number: 1 (DW_TAG_member)
    <dec31>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <dec35>   DW_AT_decl_file   : 6
    <dec36>   DW_AT_decl_line   : 774
    <dec38>   DW_AT_decl_column : 9
    <dec39>   DW_AT_type        : <0xddcca>
    <dec3d>   DW_AT_data_member_location: 40
 <2><dec3e>: Abbrev Number: 11 (DW_TAG_member)
    <dec3f>   DW_AT_name        : x
    <dec41>   DW_AT_decl_file   : 6
    <dec42>   DW_AT_decl_line   : 775
    <dec44>   DW_AT_decl_column : 6
    <dec45>   DW_AT_type        : <0xddbdb>
    <dec49>   DW_AT_data_member_location: 48
 <2><dec4a>: Abbrev Number: 11 (DW_TAG_member)
    <dec4b>   DW_AT_name        : y
    <dec4d>   DW_AT_decl_file   : 6
    <dec4e>   DW_AT_decl_line   : 775
    <dec50>   DW_AT_decl_column : 9
    <dec51>   DW_AT_type        : <0xddbdb>
    <dec55>   DW_AT_data_member_location: 52
 <2><dec56>: Abbrev Number: 1 (DW_TAG_member)
    <dec57>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <dec5b>   DW_AT_decl_file   : 6
    <dec5c>   DW_AT_decl_line   : 776
    <dec5e>   DW_AT_decl_column : 6
    <dec5f>   DW_AT_type        : <0xddbdb>
    <dec63>   DW_AT_data_member_location: 56
 <2><dec64>: Abbrev Number: 1 (DW_TAG_member)
    <dec65>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <dec69>   DW_AT_decl_file   : 6
    <dec6a>   DW_AT_decl_line   : 776
    <dec6c>   DW_AT_decl_column : 13
    <dec6d>   DW_AT_type        : <0xddbdb>
    <dec71>   DW_AT_data_member_location: 60
 <2><dec72>: Abbrev Number: 1 (DW_TAG_member)
    <dec73>   DW_AT_name        : (indirect string, offset: 0x7ce41): border_width
    <dec77>   DW_AT_decl_file   : 6
    <dec78>   DW_AT_decl_line   : 777
    <dec7a>   DW_AT_decl_column : 6
    <dec7b>   DW_AT_type        : <0xddbdb>
    <dec7f>   DW_AT_data_member_location: 64
 <2><dec80>: Abbrev Number: 1 (DW_TAG_member)
    <dec81>   DW_AT_name        : (indirect string, offset: 0x88ee2): above
    <dec85>   DW_AT_decl_file   : 6
    <dec86>   DW_AT_decl_line   : 778
    <dec88>   DW_AT_decl_column : 9
    <dec89>   DW_AT_type        : <0xddcca>
    <dec8d>   DW_AT_data_member_location: 72
 <2><dec8e>: Abbrev Number: 1 (DW_TAG_member)
    <dec8f>   DW_AT_name        : (indirect string, offset: 0x79eb3): override_redirect
    <dec93>   DW_AT_decl_file   : 6
    <dec94>   DW_AT_decl_line   : 779
    <dec96>   DW_AT_decl_column : 7
    <dec97>   DW_AT_type        : <0xddbdb>
    <dec9b>   DW_AT_data_member_location: 80
 <2><dec9c>: Abbrev Number: 0
 <1><dec9d>: Abbrev Number: 5 (DW_TAG_typedef)
    <dec9e>   DW_AT_name        : (indirect string, offset: 0x67353): XConfigureEvent
    <deca2>   DW_AT_decl_file   : 6
    <deca3>   DW_AT_decl_line   : 780
    <deca5>   DW_AT_decl_column : 3
    <deca6>   DW_AT_type        : <0xdebe1>
 <1><decaa>: Abbrev Number: 8 (DW_TAG_structure_type)
    <decab>   DW_AT_byte_size   : 56
    <decac>   DW_AT_decl_file   : 6
    <decad>   DW_AT_decl_line   : 782
    <decaf>   DW_AT_decl_column : 9
    <decaf>   DW_AT_sibling     : <0xded20>
 <2><decb3>: Abbrev Number: 1 (DW_TAG_member)
    <decb4>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <decb8>   DW_AT_decl_file   : 6
    <decb9>   DW_AT_decl_line   : 783
    <decbb>   DW_AT_decl_column : 6
    <decbc>   DW_AT_type        : <0xddbdb>
    <decc0>   DW_AT_data_member_location: 0
 <2><decc1>: Abbrev Number: 1 (DW_TAG_member)
    <decc2>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <decc6>   DW_AT_decl_file   : 6
    <decc7>   DW_AT_decl_line   : 784
    <decc9>   DW_AT_decl_column : 16
    <decca>   DW_AT_type        : <0xddc08>
    <decce>   DW_AT_data_member_location: 8
 <2><deccf>: Abbrev Number: 1 (DW_TAG_member)
    <decd0>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <decd4>   DW_AT_decl_file   : 6
    <decd5>   DW_AT_decl_line   : 785
    <decd7>   DW_AT_decl_column : 7
    <decd8>   DW_AT_type        : <0xddbdb>
    <decdc>   DW_AT_data_member_location: 16
 <2><decdd>: Abbrev Number: 1 (DW_TAG_member)
    <decde>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <dece2>   DW_AT_decl_file   : 6
    <dece3>   DW_AT_decl_line   : 786
    <dece5>   DW_AT_decl_column : 11
    <dece6>   DW_AT_type        : <0xde2c0>
    <decea>   DW_AT_data_member_location: 24
 <2><deceb>: Abbrev Number: 1 (DW_TAG_member)
    <decec>   DW_AT_name        : (indirect string, offset: 0x75e45): event
    <decf0>   DW_AT_decl_file   : 6
    <decf1>   DW_AT_decl_line   : 787
    <decf3>   DW_AT_decl_column : 9
    <decf4>   DW_AT_type        : <0xddcca>
    <decf8>   DW_AT_data_member_location: 32
 <2><decf9>: Abbrev Number: 1 (DW_TAG_member)
    <decfa>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <decfe>   DW_AT_decl_file   : 6
    <decff>   DW_AT_decl_line   : 788
    <ded01>   DW_AT_decl_column : 9
    <ded02>   DW_AT_type        : <0xddcca>
    <ded06>   DW_AT_data_member_location: 40
 <2><ded07>: Abbrev Number: 11 (DW_TAG_member)
    <ded08>   DW_AT_name        : x
    <ded0a>   DW_AT_decl_file   : 6
    <ded0b>   DW_AT_decl_line   : 789
    <ded0d>   DW_AT_decl_column : 6
    <ded0e>   DW_AT_type        : <0xddbdb>
    <ded12>   DW_AT_data_member_location: 48
 <2><ded13>: Abbrev Number: 11 (DW_TAG_member)
    <ded14>   DW_AT_name        : y
    <ded16>   DW_AT_decl_file   : 6
    <ded17>   DW_AT_decl_line   : 789
    <ded19>   DW_AT_decl_column : 9
    <ded1a>   DW_AT_type        : <0xddbdb>
    <ded1e>   DW_AT_data_member_location: 52
 <2><ded1f>: Abbrev Number: 0
 <1><ded20>: Abbrev Number: 5 (DW_TAG_typedef)
    <ded21>   DW_AT_name        : (indirect string, offset: 0x738f2): XGravityEvent
    <ded25>   DW_AT_decl_file   : 6
    <ded26>   DW_AT_decl_line   : 790
    <ded28>   DW_AT_decl_column : 3
    <ded29>   DW_AT_type        : <0xdecaa>
 <1><ded2d>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ded2e>   DW_AT_byte_size   : 48
    <ded2f>   DW_AT_decl_file   : 6
    <ded30>   DW_AT_decl_line   : 792
    <ded32>   DW_AT_decl_column : 9
    <ded32>   DW_AT_sibling     : <0xded99>
 <2><ded36>: Abbrev Number: 1 (DW_TAG_member)
    <ded37>   DW_AT_name        : (indirect string, offset: 0x5ffa9): type
    <ded3b>   DW_AT_decl_file   : 6
    <ded3c>   DW_AT_decl_line   : 793
    <ded3e>   DW_AT_decl_column : 6
    <ded3f>   DW_AT_type        : <0xddbdb>
    <ded43>   DW_AT_data_member_location: 0
 <2><ded44>: Abbrev Number: 1 (DW_TAG_member)
    <ded45>   DW_AT_name        : (indirect string, offset: 0x633ef): serial
    <ded49>   DW_AT_decl_file   : 6
    <ded4a>   DW_AT_decl_line   : 794
    <ded4c>   DW_AT_decl_column : 16
    <ded4d>   DW_AT_type        : <0xddc08>
    <ded51>   DW_AT_data_member_location: 8
 <2><ded52>: Abbrev Number: 1 (DW_TAG_member)
    <ded53>   DW_AT_name        : (indirect string, offset: 0x85f36): send_event
    <ded57>   DW_AT_decl_file   : 6
    <ded58>   DW_AT_decl_line   : 795
    <ded5a>   DW_AT_decl_column : 7
    <ded5b>   DW_AT_type        : <0xddbdb>
    <ded5f>   DW_AT_data_member_location: 16
 <2><ded60>: Abbrev Number: 1 (DW_TAG_member)
    <ded61>   DW_AT_name        : (indirect string, offset: 0x85d2c): display
    <ded65>   DW_AT_decl_file   : 6
    <ded66>   DW_AT_decl_line   : 796
    <ded68>   DW_AT_decl_column : 11
    <ded69>   DW_AT_type        : <0xde2c0>
    <ded6d>   DW_AT_data_member_location: 24
 <2><ded6e>: Abbrev Number: 1 (DW_TAG_member)
    <ded6f>   DW_AT_name        : (indirect string, offset: 0x6dac6): window
    <ded73>   DW_AT_decl_file   : 6
    <ded74>   DW_AT_decl_line   : 797
    <ded76>   DW_AT_decl_column : 9
    <ded77>   DW_AT_type        : <0xddcca>
    <ded7b>   DW_AT_data_member_location: 32
 <2><ded7c>: Abbrev Number: 1 (DW_TAG_member)
    <ded7d>   DW_AT_name        : (indirect string, offset: 0x4478d): width
    <ded81>   DW_AT_decl_file   : 6
    <ded82>   DW_AT_decl_line   : 798
    <ded84>   DW_AT_decl_column : 6
    <ded85>   DW_AT_type        : <0xddbdb>
    <ded89>   DW_AT_data_member_location: 40
 <2><ded8a>: Abbrev Number: 1 (DW_TAG_member)
    <ded8b>   DW_AT_name        : (indirect string, offset: 0x2dcef): height
    <ded8f>   DW_AT_decl_file   : 6
    <ded90>   DW_AT_decl_line   : 798
    <ded92>   DW_AT_decl_column : 13
    <ded93>   DW_AT_type        : <0xddbdb>
    <ded97>   DW_AT_data_member_location: 44
 <2><ded98>: Abbrev Number: 0
 <1><ded99>: Abbrev Number: 5 (DW_TAG_typedef)
    <ded9a>   DW_AT_name        : (indirect string, offset: 0x5e744): XResizeRequestEvent
    <ded9e>   DW_AT_decl_file   : 6
    <ded9f>   DW_AT_decl_line   : 799
    <deda1>   DW_AT_decl_column : 3
    <deda2>   DW_AT_type        : <0xded2d>
 <1><deda6>: Abbrev Number: 8 (DW_TAG_structure_type)
    <deda7>   DW_AT_byte_size   : 96
    <deda8>   DW_AT_decl_file   : 6
    <deda9>   DW_AT_decl_line   : 801
